Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/** @addtogroup Peripheral_registers_structures
 * @{
 */

/**
 * @brief Analog to Digital Converter
 */

typedef struct
{
  __IO uint32_t ISR;      /*!< ADC Interrupt and Status Register,                          Address offset: 0x00 */
  __IO uint32_t IER;      /*!< ADC Interrupt Enable Register,                              Address offset: 0x04 */
  __IO uint32_t CR;       /*!< ADC control register,                                       Address offset: 0x08 */
  __IO uint32_t CFGR;     /*!< ADC Configuration register,                                 Address offset: 0x0C */
  __IO uint32_t CFGR2;    /*!< ADC Configuration register 2,                               Address offset: 0x10 */
  __IO uint32_t SMPR1;    /*!< ADC sample time register 1,                                 Address offset: 0x14 */
  __IO uint32_t SMPR2;    /*!< ADC sample time register 2,                                 Address offset: 0x18 */
  __IO uint32_t PCSEL;    /*!< ADC pre-channel selection,                                  Address offset: 0x1C */
  __IO uint32_t LTR1;     /*!< ADC watchdog Lower threshold register 1,                    Address offset: 0x20 */
  __IO uint32_t HTR1;     /*!< ADC watchdog higher threshold register 1,                   Address offset: 0x24 */
  uint32_t RESERVED1;     /*!< Reserved, 0x028                                                                  */
  uint32_t RESERVED2;     /*!< Reserved, 0x02C                                                                  */
  __IO uint32_t SQR1;     /*!< ADC regular sequence register 1,                            Address offset: 0x30 */
  __IO uint32_t SQR2;     /*!< ADC regular sequence register 2,                            Address offset: 0x34 */
  __IO uint32_t SQR3;     /*!< ADC regular sequence register 3,                            Address offset: 0x38 */
  __IO uint32_t SQR4;     /*!< ADC regular sequence register 4,                            Address offset: 0x3C */
  __IO uint32_t DR;       /*!< ADC regular data register,                                  Address offset: 0x40 */
  uint32_t RESERVED3;     /*!< Reserved, 0x044                                                                  */
  uint32_t RESERVED4;     /*!< Reserved, 0x048                                                                  */
  __IO uint32_t JSQR;     /*!< ADC injected sequence register,                             Address offset: 0x4C */
  uint32_t RESERVED5[4];  /*!< Reserved, 0x050 - 0x05C                                                          */
  __IO uint32_t OFR1;     /*!< ADC offset register 1,                                      Address offset: 0x60 */
  __IO uint32_t OFR2;     /*!< ADC offset register 2,                                      Address offset: 0x64 */
  __IO uint32_t OFR3;     /*!< ADC offset register 3,                                      Address offset: 0x68 */
  __IO uint32_t OFR4;     /*!< ADC offset register 4,                                      Address offset: 0x6C */
  uint32_t RESERVED6[4];  /*!< Reserved, 0x070 - 0x07C                                                          */
  __IO uint32_t JDR1;     /*!< ADC injected data register 1,                               Address offset: 0x80 */
  __IO uint32_t JDR2;     /*!< ADC injected data register 2,                               Address offset: 0x84 */
  __IO uint32_t JDR3;     /*!< ADC injected data register 3,                               Address offset: 0x88 */
  __IO uint32_t JDR4;     /*!< ADC injected data register 4,                               Address offset: 0x8C */
  uint32_t RESERVED7[4];  /*!< Reserved, 0x090 - 0x09C                                                          */
  __IO uint32_t AWD2CR;   /*!< ADC  Analog Watchdog 2 Configuration Register,              Address offset: 0xA0 */
  __IO uint32_t AWD3CR;   /*!< ADC  Analog Watchdog 3 Configuration Register,              Address offset: 0xA4 */
  uint32_t RESERVED8;     /*!< Reserved, 0x0A8                                                                  */
  uint32_t RESERVED9;     /*!< Reserved, 0x0AC                                                                  */
  __IO uint32_t LTR2;     /*!< ADC watchdog Lower threshold register 2,                    Address offset: 0xB0 */
  __IO uint32_t HTR2;     /*!< ADC watchdog Higher threshold register 2,                   Address offset: 0xB4 */
  __IO uint32_t LTR3;     /*!< ADC watchdog Lower threshold register 3,                    Address offset: 0xB8 */
  __IO uint32_t HTR3;     /*!< ADC watchdog Higher threshold register 3,                   Address offset: 0xBC */
  __IO uint32_t DIFSEL;   /*!< ADC  Differential Mode Selection Register,                  Address offset: 0xC0 */
  __IO uint32_t CALFACT;  /*!< ADC  Calibration Factors,                                   Address offset: 0xC4 */
  __IO uint32_t CALFACT2; /*!< ADC  Linearity Calibration Factors,                         Address offset: 0xC8 */
} ADC_TypeDef;

typedef struct
{
  __IO uint32_t CSR; /*!< ADC Common status register, Address offset: ADC1/3 base address + 0x300 */
  uint32_t RESERVED; /*!< Reserved, ADC1/3 base address + 0x304 */
  __IO uint32_t CCR; /*!< ADC common control register, Address offset: ADC1/3 base address + 0x308 */
  __IO uint32_t CDR; /*!< ADC common regular data register for dual Address offset: ADC1/3 base address + 0x30C */
  __IO uint32_t
    CDR2; /*!< ADC common regular data register for 32-bit dual mode Address offset: ADC1/3 base address + 0x310 */

} ADC_Common_TypeDef;

/**
 * @brief VREFBUF
 */

typedef struct
{
  __IO uint32_t CSR; /*!< VREFBUF control and status register,         Address offset: 0x00 */
  __IO uint32_t CCR; /*!< VREFBUF calibration and control register,    Address offset: 0x04 */
} VREFBUF_TypeDef;

/**
 * @brief FD Controller Area Network
 */

typedef struct
{
  __IO uint32_t CREL; /*!< FDCAN Core Release register,                                     Address offset: 0x000 */
  __IO uint32_t ENDN; /*!< FDCAN Endian register,                                           Address offset: 0x004 */
  __IO uint32_t
    RESERVED1;        /*!< Reserved,                                                                        0x008 */
  __IO uint32_t DBTP; /*!< FDCAN Data Bit Timing & Prescaler register,                      Address offset: 0x00C */
  __IO uint32_t TEST; /*!< FDCAN Test register,                                             Address offset: 0x010 */
  __IO uint32_t RWD;  /*!< FDCAN RAM Watchdog register,                                     Address offset: 0x014 */
  __IO uint32_t CCCR; /*!< FDCAN CC Control register,                                       Address offset: 0x018 */
  __IO uint32_t NBTP; /*!< FDCAN Nominal Bit Timing & Prescaler register,                   Address offset: 0x01C */
  __IO uint32_t TSCC; /*!< FDCAN Timestamp Counter Configuration register,                  Address offset: 0x020 */
  __IO uint32_t TSCV; /*!< FDCAN Timestamp Counter Value register,                          Address offset: 0x024 */
  __IO uint32_t TOCC; /*!< FDCAN Timeout Counter Configuration register,                    Address offset: 0x028 */
  __IO uint32_t TOCV; /*!< FDCAN Timeout Counter Value register,                            Address offset: 0x02C */
  __IO uint32_t
    RESERVED2[4];     /*!< Reserved,                                                                0x030 - 0x03C */
  __IO uint32_t ECR;  /*!< FDCAN Error Counter register,                                    Address offset: 0x040 */
  __IO uint32_t PSR;  /*!< FDCAN Protocol Status register,                                  Address offset: 0x044 */
  __IO uint32_t TDCR; /*!< FDCAN Transmitter Delay Compensation register,                   Address offset: 0x048 */
  __IO uint32_t
    RESERVED3;       /*!< Reserved,                                                                        0x04C */
  __IO uint32_t IR;  /*!< FDCAN Interrupt register,                                        Address offset: 0x050 */
  __IO uint32_t IE;  /*!< FDCAN Interrupt Enable register,                                 Address offset: 0x054 */
  __IO uint32_t ILS; /*!< FDCAN Interrupt Line Select register,                            Address offset: 0x058 */
  __IO uint32_t ILE; /*!< FDCAN Interrupt Line Enable register,                            Address offset: 0x05C */
  __IO uint32_t
    RESERVED4[8];      /*!< Reserved,                                                                0x060 - 0x07C */
  __IO uint32_t GFC;   /*!< FDCAN Global Filter Configuration register,                      Address offset: 0x080 */
  __IO uint32_t SIDFC; /*!< FDCAN Standard ID Filter Configuration register,                 Address offset: 0x084 */
  __IO uint32_t XIDFC; /*!< FDCAN Extended ID Filter Configuration register,                 Address offset: 0x088 */
  __IO uint32_t
    RESERVED5;          /*!< Reserved,                                                                        0x08C */
  __IO uint32_t XIDAM;  /*!< FDCAN Extended ID AND Mask register,                             Address offset: 0x090 */
  __IO uint32_t HPMS;   /*!< FDCAN High Priority Message Status register,                     Address offset: 0x094 */
  __IO uint32_t NDAT1;  /*!< FDCAN New Data 1 register,                                       Address offset: 0x098 */
  __IO uint32_t NDAT2;  /*!< FDCAN New Data 2 register,                                       Address offset: 0x09C */
  __IO uint32_t RXF0C;  /*!< FDCAN Rx FIFO 0 Configuration register,                          Address offset: 0x0A0 */
  __IO uint32_t RXF0S;  /*!< FDCAN Rx FIFO 0 Status register,                                 Address offset: 0x0A4 */
  __IO uint32_t RXF0A;  /*!< FDCAN Rx FIFO 0 Acknowledge register,                            Address offset: 0x0A8 */
  __IO uint32_t RXBC;   /*!< FDCAN Rx Buffer Configuration register,                          Address offset: 0x0AC */
  __IO uint32_t RXF1C;  /*!< FDCAN Rx FIFO 1 Configuration register,                          Address offset: 0x0B0 */
  __IO uint32_t RXF1S;  /*!< FDCAN Rx FIFO 1 Status register,                                 Address offset: 0x0B4 */
  __IO uint32_t RXF1A;  /*!< FDCAN Rx FIFO 1 Acknowledge register,                            Address offset: 0x0B8 */
  __IO uint32_t RXESC;  /*!< FDCAN Rx Buffer/FIFO Element Size Configuration register,        Address offset: 0x0BC */
  __IO uint32_t TXBC;   /*!< FDCAN Tx Buffer Configuration register,                          Address offset: 0x0C0 */
  __IO uint32_t TXFQS;  /*!< FDCAN Tx FIFO/Queue Status register,                             Address offset: 0x0C4 */
  __IO uint32_t TXESC;  /*!< FDCAN Tx Buffer Element Size Configuration register,             Address offset: 0x0C8 */
  __IO uint32_t TXBRP;  /*!< FDCAN Tx Buffer Request Pending register,                        Address offset: 0x0CC */
  __IO uint32_t TXBAR;  /*!< FDCAN Tx Buffer Add Request register,                            Address offset: 0x0D0 */
  __IO uint32_t TXBCR;  /*!< FDCAN Tx Buffer Cancellation Request register,                   Address offset: 0x0D4 */
  __IO uint32_t TXBTO;  /*!< FDCAN Tx Buffer Transmission Occurred register,                  Address offset: 0x0D8 */
  __IO uint32_t TXBCF;  /*!< FDCAN Tx Buffer Cancellation Finished register,                  Address offset: 0x0DC */
  __IO uint32_t TXBTIE; /*!< FDCAN Tx Buffer Transmission Interrupt Enable register,          Address offset: 0x0E0 */
  __IO uint32_t TXBCIE; /*!< FDCAN Tx Buffer Cancellation Finished Interrupt Enable register, Address offset: 0x0E4 */
  __IO uint32_t
    RESERVED6[2];      /*!< Reserved,                                                                0x0E8 - 0x0EC */
  __IO uint32_t TXEFC; /*!< FDCAN Tx Event FIFO Configuration register,                      Address offset: 0x0F0 */
  __IO uint32_t TXEFS; /*!< FDCAN Tx Event FIFO Status register,                             Address offset: 0x0F4 */
  __IO uint32_t TXEFA; /*!< FDCAN Tx Event FIFO Acknowledge register,                        Address offset: 0x0F8 */
  __IO uint32_t
    RESERVED7; /*!< Reserved,                                                                        0x0FC */
} FDCAN_GlobalTypeDef;

/**
 * @brief TTFD Controller Area Network
 */

typedef struct
{
  __IO uint32_t TTTMC;          /*!< TT Trigger Memory Configuration register,    Address offset: 0x100 */
  __IO uint32_t TTRMC;          /*!< TT Reference Message Configuration register, Address offset: 0x104 */
  __IO uint32_t TTOCF;          /*!< TT Operation Configuration register,         Address offset: 0x108 */
  __IO uint32_t TTMLM;          /*!< TT Matrix Limits register,                   Address offset: 0x10C */
  __IO uint32_t TURCF;          /*!< TUR Configuration register,                  Address offset: 0x110 */
  __IO uint32_t TTOCN;          /*!< TT Operation Control register,               Address offset: 0x114 */
  __IO uint32_t TTGTP;          /*!< TT Global Time Preset register,              Address offset: 0x118 */
  __IO uint32_t TTTMK;          /*!< TT Time Mark register,                       Address offset: 0x11C */
  __IO uint32_t TTIR;           /*!< TT Interrupt register,                       Address offset: 0x120 */
  __IO uint32_t TTIE;           /*!< TT Interrupt Enable register,                Address offset: 0x124 */
  __IO uint32_t TTILS;          /*!< TT Interrupt Line Select register,           Address offset: 0x128 */
  __IO uint32_t TTOST;          /*!< TT Operation Status register,                Address offset: 0x12C */
  __IO uint32_t TURNA;          /*!< TT TUR Numerator Actual register,            Address offset: 0x130 */
  __IO uint32_t TTLGT;          /*!< TT Local and Global Time register,           Address offset: 0x134 */
  __IO uint32_t TTCTC;          /*!< TT Cycle Time and Count register,            Address offset: 0x138 */
  __IO uint32_t TTCPT;          /*!< TT Capture Time register,                    Address offset: 0x13C */
  __IO uint32_t TTCSM;          /*!< TT Cycle Sync Mark register,                 Address offset: 0x140 */
  __IO uint32_t RESERVED1[111]; /*!< Reserved,                                            0x144 - 0x2FC */
  __IO uint32_t TTTS;           /*!< TT Trigger Select register,                  Address offset: 0x300 */
} TTCAN_TypeDef;

/**
 * @brief FD Controller Area Network
 */

typedef struct
{
  __IO uint32_t CREL;  /*!< Clock Calibration Unit Core Release register, Address offset: 0x00 */
  __IO uint32_t CCFG;  /*!< Calibration Configuration register,           Address offset: 0x04 */
  __IO uint32_t CSTAT; /*!< Calibration Status register,                  Address offset: 0x08 */
  __IO uint32_t CWD;   /*!< Calibration Watchdog register,                Address offset: 0x0C */
  __IO uint32_t IR;    /*!< CCU Interrupt register,                       Address offset: 0x10 */
  __IO uint32_t IE;    /*!< CCU Interrupt Enable register,                Address offset: 0x14 */
} FDCAN_ClockCalibrationUnit_TypeDef;

/**
 * @brief Consumer Electronics Control
 */

typedef struct
{
  __IO uint32_t CR;   /*!< CEC control register,              Address offset:0x00 */
  __IO uint32_t CFGR; /*!< CEC configuration register,        Address offset:0x04 */
  __IO uint32_t TXDR; /*!< CEC Tx data register ,             Address offset:0x08 */
  __IO uint32_t RXDR; /*!< CEC Rx Data Register,              Address offset:0x0C */
  __IO uint32_t ISR;  /*!< CEC Interrupt and Status Register, Address offset:0x10 */
  __IO uint32_t IER;  /*!< CEC interrupt enable register,     Address offset:0x14 */
} CEC_TypeDef;

/**
 * @brief CRC calculation unit
 */

typedef struct
{
  __IO uint32_t DR;   /*!< CRC Data register,                           Address offset: 0x00 */
  __IO uint32_t IDR;  /*!< CRC Independent data register,               Address offset: 0x04 */
  __IO uint32_t CR;   /*!< CRC Control register,                        Address offset: 0x08 */
  uint32_t RESERVED2; /*!< Reserved,                                                    0x0C */
  __IO uint32_t INIT; /*!< Initial CRC value register,                  Address offset: 0x10 */
  __IO uint32_t POL;  /*!< CRC polynomial register,                     Address offset: 0x14 */
} CRC_TypeDef;

/**
 * @brief Clock Recovery System
 */
typedef struct
{
  __IO uint32_t CR;   /*!< CRS ccontrol register,              Address offset: 0x00 */
  __IO uint32_t CFGR; /*!< CRS configuration register,         Address offset: 0x04 */
  __IO uint32_t ISR;  /*!< CRS interrupt and status register,  Address offset: 0x08 */
  __IO uint32_t ICR;  /*!< CRS interrupt flag clear register,  Address offset: 0x0C */
} CRS_TypeDef;

/**
 * @brief Digital to Analog Converter
 */

typedef struct
{
  __IO uint32_t CR;      /*!< DAC control register,                                    Address offset: 0x00 */
  __IO uint32_t SWTRIGR; /*!< DAC software trigger register,                           Address offset: 0x04 */
  __IO uint32_t DHR12R1; /*!< DAC channel1 12-bit right-aligned data holding register, Address offset: 0x08 */
  __IO uint32_t DHR12L1; /*!< DAC channel1 12-bit left aligned data holding register,  Address offset: 0x0C */
  __IO uint32_t DHR8R1;  /*!< DAC channel1 8-bit right aligned data holding register,  Address offset: 0x10 */
  __IO uint32_t DHR12R2; /*!< DAC channel2 12-bit right aligned data holding register, Address offset: 0x14 */
  __IO uint32_t DHR12L2; /*!< DAC channel2 12-bit left aligned data holding register,  Address offset: 0x18 */
  __IO uint32_t DHR8R2;  /*!< DAC channel2 8-bit right-aligned data holding register,  Address offset: 0x1C */
  __IO uint32_t DHR12RD; /*!< Dual DAC 12-bit right-aligned data holding register,     Address offset: 0x20 */
  __IO uint32_t DHR12LD; /*!< DUAL DAC 12-bit left aligned data holding register,      Address offset: 0x24 */
  __IO uint32_t DHR8RD;  /*!< DUAL DAC 8-bit right aligned data holding register,      Address offset: 0x28 */
  __IO uint32_t DOR1;    /*!< DAC channel1 data output register,                       Address offset: 0x2C */
  __IO uint32_t DOR2;    /*!< DAC channel2 data output register,                       Address offset: 0x30 */
  __IO uint32_t SR;      /*!< DAC status register,                                     Address offset: 0x34 */
  __IO uint32_t CCR;     /*!< DAC calibration control register,                        Address offset: 0x38 */
  __IO uint32_t MCR;     /*!< DAC mode control register,                               Address offset: 0x3C */
  __IO uint32_t SHSR1;   /*!< DAC Sample and Hold sample time register 1,              Address offset: 0x40 */
  __IO uint32_t SHSR2;   /*!< DAC Sample and Hold sample time register 2,              Address offset: 0x44 */
  __IO uint32_t SHHR;    /*!< DAC Sample and Hold hold time register,                  Address offset: 0x48 */
  __IO uint32_t SHRR;    /*!< DAC Sample and Hold refresh time register,               Address offset: 0x4C */
} DAC_TypeDef;

/**
 * @brief DFSDM module registers
 */
typedef struct
{
  __IO uint32_t FLTCR1;     /*!< DFSDM control register1,                          Address offset: 0x100 */
  __IO uint32_t FLTCR2;     /*!< DFSDM control register2,                          Address offset: 0x104 */
  __IO uint32_t FLTISR;     /*!< DFSDM interrupt and status register,              Address offset: 0x108 */
  __IO uint32_t FLTICR;     /*!< DFSDM interrupt flag clear register,              Address offset: 0x10C */
  __IO uint32_t FLTJCHGR;   /*!< DFSDM injected channel group selection register,  Address offset: 0x110 */
  __IO uint32_t FLTFCR;     /*!< DFSDM filter control register,                    Address offset: 0x114 */
  __IO uint32_t FLTJDATAR;  /*!< DFSDM data register for injected group,           Address offset: 0x118 */
  __IO uint32_t FLTRDATAR;  /*!< DFSDM data register for regular group,            Address offset: 0x11C */
  __IO uint32_t FLTAWHTR;   /*!< DFSDM analog watchdog high threshold register,    Address offset: 0x120 */
  __IO uint32_t FLTAWLTR;   /*!< DFSDM analog watchdog low threshold register,     Address offset: 0x124 */
  __IO uint32_t FLTAWSR;    /*!< DFSDM analog watchdog status register             Address offset: 0x128 */
  __IO uint32_t FLTAWCFR;   /*!< DFSDM analog watchdog clear flag register         Address offset: 0x12C */
  __IO uint32_t FLTEXMAX;   /*!< DFSDM extreme detector maximum register,          Address offset: 0x130 */
  __IO uint32_t FLTEXMIN;   /*!< DFSDM extreme detector minimum register           Address offset: 0x134 */
  __IO uint32_t FLTCNVTIMR; /*!< DFSDM conversion timer,                           Address offset: 0x138 */
} DFSDM_Filter_TypeDef;

/**
 * @brief DFSDM channel configuration registers
 */
typedef struct
{
  __IO uint32_t CHCFGR1;  /*!< DFSDM channel configuration register1,            Address offset: 0x00 */
  __IO uint32_t CHCFGR2;  /*!< DFSDM channel configuration register2,            Address offset: 0x04 */
  __IO uint32_t CHAWSCDR; /*!< DFSDM channel analog watchdog and
                               short circuit detector register,                  Address offset: 0x08 */
  __IO uint32_t CHWDATAR; /*!< DFSDM channel watchdog filter data register,      Address offset: 0x0C */
  __IO uint32_t CHDATINR; /*!< DFSDM channel data input register,                Address offset: 0x10 */
  __IO uint32_t CHDLYR;   /*!< DFSDM channel delay register,                     Address offset: 0x14 */
} DFSDM_Channel_TypeDef;

/**
 * @brief Debug MCU
 */
typedef struct
{
  __IO uint32_t IDCODE;   /*!< MCU device ID code,                     Address offset: 0x00 */
  __IO uint32_t CR;       /*!< Debug MCU configuration register,       Address offset: 0x04 */
  uint32_t RESERVED4[11]; /*!< Reserved,                             Address offset: 0x08 */
  __IO uint32_t APB3FZ1;  /*!< Debug MCU APB3FZ1 freeze register,    Address offset: 0x34 */
  uint32_t RESERVED5;     /*!< Reserved,                             Address offset: 0x38 */
  __IO uint32_t APB1LFZ1; /*!< Debug MCU APB1LFZ1 freeze register,   Address offset: 0x3C */
  uint32_t RESERVED6;     /*!< Reserved,                             Address offset: 0x40 */
  __IO uint32_t APB1HFZ1; /*!< Debug MCU APB1LFZ1 freeze register,   Address offset: 0x44 */
  uint32_t RESERVED7;     /*!< Reserved,                             Address offset: 0x48 */
  __IO uint32_t APB2FZ1;  /*!< Debug MCU APB2FZ1 freeze register,    Address offset: 0x4C */
  uint32_t RESERVED8;     /*!< Reserved,                             Address offset: 0x50 */
  __IO uint32_t APB4FZ1;  /*!< Debug MCU APB4FZ1 freeze register,    Address offset: 0x54 */
} DBGMCU_TypeDef;

/**
 * @brief DCMI
 */

typedef struct
{
  __IO uint32_t CR;      /*!< DCMI control register 1,                       Address offset: 0x00 */
  __IO uint32_t SR;      /*!< DCMI status register,                          Address offset: 0x04 */
  __IO uint32_t RISR;    /*!< DCMI raw interrupt status register,            Address offset: 0x08 */
  __IO uint32_t IER;     /*!< DCMI interrupt enable register,                Address offset: 0x0C */
  __IO uint32_t MISR;    /*!< DCMI masked interrupt status register,         Address offset: 0x10 */
  __IO uint32_t ICR;     /*!< DCMI interrupt clear register,                 Address offset: 0x14 */
  __IO uint32_t ESCR;    /*!< DCMI embedded synchronization code register,   Address offset: 0x18 */
  __IO uint32_t ESUR;    /*!< DCMI embedded synchronization unmask register, Address offset: 0x1C */
  __IO uint32_t CWSTRTR; /*!< DCMI crop window start,                        Address offset: 0x20 */
  __IO uint32_t CWSIZER; /*!< DCMI crop window size,                         Address offset: 0x24 */
  __IO uint32_t DR;      /*!< DCMI data register,                            Address offset: 0x28 */
} DCMI_TypeDef;

/**
 * @brief PSSI
 */

