Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
typedef struct
{
  __IO uint32_t CR;             /*!< PSSI control register 1,               Address offset: 0x000 */
  __IO uint32_t SR;             /*!< PSSI status register,                  Address offset: 0x004 */
  __IO uint32_t RIS;            /*!< PSSI raw interrupt status register,    Address offset: 0x008 */
  __IO uint32_t IER;            /*!< PSSI interrupt enable register,        Address offset: 0x00C */
  __IO uint32_t MIS;            /*!< PSSI masked interrupt status register, Address offset: 0x010 */
  __IO uint32_t ICR;            /*!< PSSI interrupt clear register,         Address offset: 0x014 */
  __IO uint32_t RESERVED1[4];   /*!< Reserved,                                      0x018 - 0x024 */
  __IO uint32_t DR;             /*!< PSSI data register,                    Address offset: 0x028 */
  __IO uint32_t RESERVED2[241]; /*!< Reserved,                                      0x02C - 0x3EC */
  __IO uint32_t HWCFGR;         /*!< PSSI IP HW configuration register,     Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< PSSI IP version register,              Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< PSSI IP ID register,                   Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< PSSI SIZE ID register,                 Address offset: 0x3FC */
} PSSI_TypeDef;

/**
 * @brief DMA Controller
 */

typedef struct
{
  __IO uint32_t CR;   /*!< DMA stream x configuration register      */
  __IO uint32_t NDTR; /*!< DMA stream x number of data register     */
  __IO uint32_t PAR;  /*!< DMA stream x peripheral address register */
  __IO uint32_t M0AR; /*!< DMA stream x memory 0 address register   */
  __IO uint32_t M1AR; /*!< DMA stream x memory 1 address register   */
  __IO uint32_t FCR;  /*!< DMA stream x FIFO control register       */
} DMA_Stream_TypeDef;

typedef struct
{
  __IO uint32_t LISR;  /*!< DMA low interrupt status register,      Address offset: 0x00 */
  __IO uint32_t HISR;  /*!< DMA high interrupt status register,     Address offset: 0x04 */
  __IO uint32_t LIFCR; /*!< DMA low interrupt flag clear register,  Address offset: 0x08 */
  __IO uint32_t HIFCR; /*!< DMA high interrupt flag clear register, Address offset: 0x0C */
} DMA_TypeDef;

typedef struct
{
  __IO uint32_t CCR;   /*!< DMA channel x configuration register          */
  __IO uint32_t CNDTR; /*!< DMA channel x number of data register         */
  __IO uint32_t CPAR;  /*!< DMA channel x peripheral address register     */
  __IO uint32_t CM0AR; /*!< DMA channel x memory 0 address register       */
  __IO uint32_t CM1AR; /*!< DMA channel x memory 1 address register       */
} BDMA_Channel_TypeDef;

typedef struct
{
  __IO uint32_t ISR;  /*!< DMA interrupt status register,               Address offset: 0x00 */
  __IO uint32_t IFCR; /*!< DMA interrupt flag clear register,           Address offset: 0x04 */
} BDMA_TypeDef;

typedef struct
{
  __IO uint32_t CCR; /*!< DMA Multiplexer Channel x Control Register   */
} DMAMUX_Channel_TypeDef;

typedef struct
{
  __IO uint32_t CSR; /*!< DMA Channel Status Register     */
  __IO uint32_t CFR; /*!< DMA Channel Clear Flag Register */
} DMAMUX_ChannelStatus_TypeDef;

typedef struct
{
  __IO uint32_t RGCR; /*!< DMA Request Generator x Control Register   */
} DMAMUX_RequestGen_TypeDef;

typedef struct
{
  __IO uint32_t RGSR;  /*!< DMA Request Generator Status Register       */
  __IO uint32_t RGCFR; /*!< DMA Request Generator Clear Flag Register   */
} DMAMUX_RequestGenStatus_TypeDef;

/**
 * @brief MDMA Controller
 */
typedef struct
{
  __IO uint32_t GISR0; /*!< MDMA Global Interrupt/Status Register 0,          Address offset: 0x00 */
} MDMA_TypeDef;

typedef struct
{
  __IO uint32_t CISR;   /*!< MDMA channel x interrupt/status register,             Address offset: 0x40 */
  __IO uint32_t CIFCR;  /*!< MDMA channel x interrupt flag clear register,         Address offset: 0x44 */
  __IO uint32_t CESR;   /*!< MDMA Channel x error status register,                 Address offset: 0x48 */
  __IO uint32_t CCR;    /*!< MDMA channel x control register,                      Address offset: 0x4C */
  __IO uint32_t CTCR;   /*!< MDMA channel x Transfer Configuration register,       Address offset: 0x50 */
  __IO uint32_t CBNDTR; /*!< MDMA Channel x block number of data register,         Address offset: 0x54 */
  __IO uint32_t CSAR;   /*!< MDMA channel x source address register,               Address offset: 0x58 */
  __IO uint32_t CDAR;   /*!< MDMA channel x destination address register,          Address offset: 0x5C */
  __IO uint32_t CBRUR;  /*!< MDMA channel x Block Repeat address Update register,  Address offset: 0x60 */
  __IO uint32_t CLAR;   /*!< MDMA channel x Link Address register,                 Address offset: 0x64 */
  __IO uint32_t CTBR;   /*!< MDMA channel x Trigger and Bus selection Register,    Address offset: 0x68 */
  uint32_t RESERVED0;   /*!< Reserved, 0x6C                                                             */
  __IO uint32_t CMAR;   /*!< MDMA channel x Mask address register,                 Address offset: 0x70 */
  __IO uint32_t CMDR;   /*!< MDMA channel x Mask Data register,                    Address offset: 0x74 */
} MDMA_Channel_TypeDef;

/**
 * @brief DMA2D Controller
 */

typedef struct
{
  __IO uint32_t CR;          /*!< DMA2D Control Register,                         Address offset: 0x00 */
  __IO uint32_t ISR;         /*!< DMA2D Interrupt Status Register,                Address offset: 0x04 */
  __IO uint32_t IFCR;        /*!< DMA2D Interrupt Flag Clear Register,            Address offset: 0x08 */
  __IO uint32_t FGMAR;       /*!< DMA2D Foreground Memory Address Register,       Address offset: 0x0C */
  __IO uint32_t FGOR;        /*!< DMA2D Foreground Offset Register,               Address offset: 0x10 */
  __IO uint32_t BGMAR;       /*!< DMA2D Background Memory Address Register,       Address offset: 0x14 */
  __IO uint32_t BGOR;        /*!< DMA2D Background Offset Register,               Address offset: 0x18 */
  __IO uint32_t FGPFCCR;     /*!< DMA2D Foreground PFC Control Register,          Address offset: 0x1C */
  __IO uint32_t FGCOLR;      /*!< DMA2D Foreground Color Register,                Address offset: 0x20 */
  __IO uint32_t BGPFCCR;     /*!< DMA2D Background PFC Control Register,          Address offset: 0x24 */
  __IO uint32_t BGCOLR;      /*!< DMA2D Background Color Register,                Address offset: 0x28 */
  __IO uint32_t FGCMAR;      /*!< DMA2D Foreground CLUT Memory Address Register,  Address offset: 0x2C */
  __IO uint32_t BGCMAR;      /*!< DMA2D Background CLUT Memory Address Register,  Address offset: 0x30 */
  __IO uint32_t OPFCCR;      /*!< DMA2D Output PFC Control Register,              Address offset: 0x34 */
  __IO uint32_t OCOLR;       /*!< DMA2D Output Color Register,                    Address offset: 0x38 */
  __IO uint32_t OMAR;        /*!< DMA2D Output Memory Address Register,           Address offset: 0x3C */
  __IO uint32_t OOR;         /*!< DMA2D Output Offset Register,                   Address offset: 0x40 */
  __IO uint32_t NLR;         /*!< DMA2D Number of Line Register,                  Address offset: 0x44 */
  __IO uint32_t LWR;         /*!< DMA2D Line Watermark Register,                  Address offset: 0x48 */
  __IO uint32_t AMTCR;       /*!< DMA2D AHB Master Timer Configuration Register,  Address offset: 0x4C */
  uint32_t RESERVED[236];    /*!< Reserved, 0x50-0x3FF */
  __IO uint32_t FGCLUT[256]; /*!< DMA2D Foreground CLUT,                          Address offset:400-7FF */
  __IO uint32_t BGCLUT[256]; /*!< DMA2D Background CLUT,                          Address offset:800-BFF */
} DMA2D_TypeDef;

/**
 * @brief External Interrupt/Event Controller
 */

typedef struct
{
  __IO uint32_t RTSR1;  /*!< EXTI Rising trigger selection register,          Address offset: 0x00 */
  __IO uint32_t FTSR1;  /*!< EXTI Falling trigger selection register,         Address offset: 0x04 */
  __IO uint32_t SWIER1; /*!< EXTI Software interrupt event register,          Address offset: 0x08 */
  __IO uint32_t D3PMR1; /*!< EXTI D3 Pending mask register, (same register as to SRDPMR1) Address offset: 0x0C */
  __IO uint32_t
    D3PCR1L; /*!< EXTI D3 Pending clear selection register low, (same register as to SRDPCR1L)     Address offset: 0x10 */
  __IO uint32_t
    D3PCR1H; /*!< EXTI D3 Pending clear selection register High, (same register as to SRDPCR1H)   Address offset: 0x14 */
  uint32_t RESERVED1[2]; /*!< Reserved,                                        0x18 to 0x1C         */
  __IO uint32_t RTSR2;   /*!< EXTI Rising trigger selection register,          Address offset: 0x20 */
  __IO uint32_t FTSR2;   /*!< EXTI Falling trigger selection register,         Address offset: 0x24 */
  __IO uint32_t SWIER2;  /*!< EXTI Software interrupt event register,          Address offset: 0x28 */
  __IO uint32_t D3PMR2;  /*!< EXTI D3 Pending mask register, (same register as to SRDPMR2) Address offset: 0x2C */
  __IO uint32_t
    D3PCR2L; /*!< EXTI D3 Pending clear selection register low, (same register as to SRDPCR2L)  Address offset: 0x30 */
  __IO uint32_t
    D3PCR2H; /*!< EXTI D3 Pending clear selection register High, (same register as to SRDPCR2H) Address offset: 0x34 */
  uint32_t RESERVED2[2]; /*!< Reserved,                                        0x38 to 0x3C         */
  __IO uint32_t RTSR3;   /*!< EXTI Rising trigger selection register,          Address offset: 0x40 */
  __IO uint32_t FTSR3;   /*!< EXTI Falling trigger selection register,         Address offset: 0x44 */
  __IO uint32_t SWIER3;  /*!< EXTI Software interrupt event register,          Address offset: 0x48 */
  __IO uint32_t D3PMR3;  /*!< EXTI D3 Pending mask register, (same register as to SRDPMR3) Address offset: 0x4C */
  __IO uint32_t
    D3PCR3L; /*!< EXTI D3 Pending clear selection register low, (same register as to SRDPCR3L) Address offset: 0x50 */
  __IO uint32_t
    D3PCR3H; /*!< EXTI D3 Pending clear selection register High, (same register as to SRDPCR3H) Address offset: 0x54 */
  uint32_t RESERVED3[10]; /*!< Reserved,                                        0x58 to 0x7C         */
  __IO uint32_t IMR1;     /*!< EXTI Interrupt mask register,                    Address offset: 0x80 */
  __IO uint32_t EMR1;     /*!< EXTI Event mask register,                        Address offset: 0x84 */
  __IO uint32_t PR1;      /*!< EXTI Pending register,                           Address offset: 0x88 */
  uint32_t RESERVED4;     /*!< Reserved,                                        0x8C                 */
  __IO uint32_t IMR2;     /*!< EXTI Interrupt mask register,                    Address offset: 0x90 */
  __IO uint32_t EMR2;     /*!< EXTI Event mask register,                        Address offset: 0x94 */
  __IO uint32_t PR2;      /*!< EXTI Pending register,                           Address offset: 0x98 */
  uint32_t RESERVED5;     /*!< Reserved,                                        0x9C                 */
  __IO uint32_t IMR3;     /*!< EXTI Interrupt mask register,                    Address offset: 0xA0 */
  __IO uint32_t EMR3;     /*!< EXTI Event mask register,                        Address offset: 0xA4 */
  __IO uint32_t PR3;      /*!< EXTI Pending register,                           Address offset: 0xA8 */
} EXTI_TypeDef;

/**
 * @brief This structure registers corresponds to EXTI_Typdef CPU1/CPU2 registers subset (IMRx, EMRx and PRx), allowing
 * to define EXTI_D1/EXTI_D2 with rapid/common access to these IMRx, EMRx, PRx registers for CPU1 and CPU2. Note that
 * EXTI_D1 and EXTI_D2 bases addresses are calculated to point to CPUx first register: IMR1   in case of EXTI_D1 that is
 * addressing CPU1 (Cortex-M7) C2IMR1 in case of EXTI_D2 that is addressing CPU2 (Cortex-M4) Note: EXTI_D2 and
 * corresponding C2IMRx, C2EMRx and C2PRx registers are available for Dual Core devices only
 */

typedef struct
{
  __IO uint32_t IMR1; /*!< EXTI Interrupt mask register,                Address offset: 0x00 */
  __IO uint32_t EMR1; /*!< EXTI Event mask register,                    Address offset: 0x04 */
  __IO uint32_t PR1;  /*!< EXTI Pending register,                       Address offset: 0x08 */
  uint32_t RESERVED1; /*!< Reserved, 0x0C                                                    */
  __IO uint32_t IMR2; /*!< EXTI Interrupt mask register,                Address offset: 0x10 */
  __IO uint32_t EMR2; /*!< EXTI Event mask register,                    Address offset: 0x14 */
  __IO uint32_t PR2;  /*!< EXTI Pending register,                       Address offset: 0x18 */
  uint32_t RESERVED2; /*!< Reserved, 0x1C                                                    */
  __IO uint32_t IMR3; /*!< EXTI Interrupt mask register,                Address offset: 0x20 */
  __IO uint32_t EMR3; /*!< EXTI Event mask register,                    Address offset: 0x24 */
  __IO uint32_t PR3;  /*!< EXTI Pending register,                       Address offset: 0x28 */
} EXTI_Core_TypeDef;

/**
 * @brief FLASH Registers
 */

typedef struct
{
  __IO uint32_t ACR;       /*!< FLASH access control register,                            Address offset: 0x00  */
  __IO uint32_t KEYR1;     /*!< Flash Key Register for bank1,                             Address offset: 0x04  */
  __IO uint32_t OPTKEYR;   /*!< Flash Option Key Register,                                Address offset: 0x08  */
  __IO uint32_t CR1;       /*!< Flash Control Register for bank1,                         Address offset: 0x0C  */
  __IO uint32_t SR1;       /*!< Flash Status Register for bank1,                          Address offset: 0x10  */
  __IO uint32_t CCR1;      /*!< Flash Control Register for bank1,                         Address offset: 0x14  */
  __IO uint32_t OPTCR;     /*!< Flash Option Control Register,                            Address offset: 0x18  */
  __IO uint32_t OPTSR_CUR; /*!< Flash Option Status Current Register,                     Address offset: 0x1C  */
  __IO uint32_t OPTSR_PRG; /*!< Flash Option Status to Program Register,                  Address offset: 0x20  */
  __IO uint32_t OPTCCR;    /*!< Flash Option Clear Control Register,                      Address offset: 0x24  */
  __IO uint32_t PRAR_CUR1; /*!< Flash Current Protection Address Register for bank1,      Address offset: 0x28  */
  __IO uint32_t PRAR_PRG1; /*!< Flash Protection Address to Program Register for bank1,   Address offset: 0x2C  */
  __IO uint32_t SCAR_CUR1; /*!< Flash Current Secure Address Register for bank1,          Address offset: 0x30  */
  __IO uint32_t SCAR_PRG1; /*!< Flash Secure Address to Program Register for bank1,       Address offset: 0x34  */
  __IO uint32_t WPSN_CUR1; /*!< Flash Current Write Protection Register on bank1,         Address offset: 0x38  */
  __IO uint32_t WPSN_PRG1; /*!< Flash Write Protection to Program Register on bank1,      Address offset: 0x3C  */
  __IO uint32_t BOOT_CUR;  /*!< Flash Current Boot Address for Pelican Core Register,     Address offset: 0x40  */
  __IO uint32_t BOOT_PRG;  /*!< Flash Boot Address to Program for Pelican Core Register,  Address offset: 0x44  */
  uint32_t RESERVED0[2];   /*!< Reserved, 0x48 to 0x4C                                                          */
  __IO uint32_t CRCCR1;    /*!< Flash CRC Control register For Bank1 Register ,           Address offset: 0x50  */
  __IO uint32_t CRCSADD1;  /*!< Flash CRC Start Address Register for Bank1 ,              Address offset: 0x54  */
  __IO uint32_t CRCEADD1;  /*!< Flash CRC End Address Register for Bank1 ,                Address offset: 0x58  */
  __IO uint32_t CRCDATA;   /*!< Flash CRC Data Register for Bank1 ,                       Address offset: 0x5C  */
  __IO uint32_t ECC_FA1;   /*!< Flash ECC Fail Address For Bank1 Register ,               Address offset: 0x60  */
  uint32_t RESERVED;       /*!< Reserved, 0x64                                                                  */
  __IO uint32_t OTPBL_CUR; /*!< Flash Current OTP Block Lock Register,                    Address offset: 0x68  */
  __IO uint32_t OTPBL_PRG; /*!< Flash OTP Block Lock to Program Register,                 Address offset: 0x6C  */
  uint32_t RESERVED1[37];  /*!< Reserved, 0x70 to 0x100                                                         */
  __IO uint32_t KEYR2;     /*!< Flash Key Register for bank2,                             Address offset: 0x104 */
  uint32_t RESERVED2;      /*!< Reserved, 0x108                                                                 */
  __IO uint32_t CR2;       /*!< Flash Control Register for bank2,                         Address offset: 0x10C */
  __IO uint32_t SR2;       /*!< Flash Status Register for bank2,                          Address offset: 0x110 */
  __IO uint32_t CCR2;      /*!< Flash Status Register for bank2,                          Address offset: 0x114 */
  uint32_t RESERVED3[4];   /*!< Reserved, 0x118 to 0x124                                                        */
  __IO uint32_t PRAR_CUR2; /*!< Flash Current Protection Address Register for bank2,      Address offset: 0x128 */
  __IO uint32_t PRAR_PRG2; /*!< Flash Protection Address to Program Register for bank2,   Address offset: 0x12C */
  __IO uint32_t SCAR_CUR2; /*!< Flash Current Secure Address Register for bank2,          Address offset: 0x130 */
  __IO uint32_t SCAR_PRG2; /*!< Flash Secure Address Register for bank2,                  Address offset: 0x134 */
  __IO uint32_t WPSN_CUR2; /*!< Flash Current Write Protection Register on bank2,         Address offset: 0x138 */
  __IO uint32_t WPSN_PRG2; /*!< Flash Write Protection to Program Register on bank2,      Address offset: 0x13C */
  uint32_t RESERVED4[4];   /*!< Reserved, 0x140 to 0x14C                                                        */
  __IO uint32_t CRCCR2;    /*!< Flash CRC Control register For Bank2 Register ,           Address offset: 0x150 */
  __IO uint32_t CRCSADD2;  /*!< Flash CRC Start Address Register for Bank2 ,              Address offset: 0x154 */
  __IO uint32_t CRCEADD2;  /*!< Flash CRC End Address Register for Bank2 ,                Address offset: 0x158 */
  __IO uint32_t CRCDATA2;  /*!< Flash CRC Data Register for Bank2 ,                       Address offset: 0x15C */
  __IO uint32_t ECC_FA2;   /*!< Flash ECC Fail Address For Bank2 Register ,               Address offset: 0x160 */
} FLASH_TypeDef;

/**
 * @brief Flexible Memory Controller
 */

typedef struct
{
  __IO uint32_t BTCR
    [8]; /*!< NOR/PSRAM chip-select control register(BCR) and chip-select timing register(BTR), Address offset: 0x00-1C */
} FMC_Bank1_TypeDef;

/**
 * @brief Flexible Memory Controller Bank1E
 */

typedef struct
{
  __IO uint32_t BWTR[7]; /*!< NOR/PSRAM write timing registers, Address offset: 0x104-0x11C */
} FMC_Bank1E_TypeDef;

/**
 * @brief Flexible Memory Controller Bank2
 */

typedef struct
{
  __IO uint32_t PCR2;  /*!< NAND Flash control register 2,                       Address offset: 0x60 */
  __IO uint32_t SR2;   /*!< NAND Flash FIFO status and interrupt register 2,     Address offset: 0x64 */
  __IO uint32_t PMEM2; /*!< NAND Flash Common memory space timing register 2,    Address offset: 0x68 */
  __IO uint32_t PATT2; /*!< NAND Flash Attribute memory space timing register 2, Address offset: 0x6C */
  uint32_t RESERVED0;  /*!< Reserved, 0x70                                                            */
  __IO uint32_t ECCR2; /*!< NAND Flash ECC result registers 2,                   Address offset: 0x74 */
} FMC_Bank2_TypeDef;

/**
 * @brief Flexible Memory Controller Bank3
 */

typedef struct
{
  __IO uint32_t PCR;  /*!< NAND Flash control register 3,                       Address offset: 0x80 */
  __IO uint32_t SR;   /*!< NAND Flash FIFO status and interrupt register 3,     Address offset: 0x84 */
  __IO uint32_t PMEM; /*!< NAND Flash Common memory space timing register 3,    Address offset: 0x88 */
  __IO uint32_t PATT; /*!< NAND Flash Attribute memory space timing register 3, Address offset: 0x8C */
  uint32_t RESERVED;  /*!< Reserved, 0x90                                                            */
  __IO uint32_t ECCR; /*!< NAND Flash ECC result registers 3,                   Address offset: 0x94 */
} FMC_Bank3_TypeDef;

/**
 * @brief Flexible Memory Controller Bank5 and 6
 */

typedef struct
{
  __IO uint32_t SDCR[2]; /*!< SDRAM Control registers ,      Address offset: 0x140-0x144  */
  __IO uint32_t SDTR[2]; /*!< SDRAM Timing registers ,       Address offset: 0x148-0x14C  */
  __IO uint32_t SDCMR;   /*!< SDRAM Command Mode register,    Address offset: 0x150  */
  __IO uint32_t SDRTR;   /*!< SDRAM Refresh Timer register,   Address offset: 0x154  */
  __IO uint32_t SDSR;    /*!< SDRAM Status register,          Address offset: 0x158  */
} FMC_Bank5_6_TypeDef;

/**
 * @brief GFXMMU registers
 */

typedef struct
{
  __IO uint32_t CR;         /*!< GFXMMU configuration register,                     Address offset: 0x00 */
  __IO uint32_t SR;         /*!< GFXMMU status register,                            Address offset: 0x04 */
  __IO uint32_t FCR;        /*!< GFXMMU flag clear register,                        Address offset: 0x08 */
  __IO uint32_t CCR;        /*!< GFXMMU Cache Control Register,                     Address offset: 0x0C */
  __IO uint32_t DVR;        /*!< GFXMMU default value register,                     Address offset: 0x10 */
  uint32_t RESERVED1[3];    /*!< Reserved1,                                         Address offset: 0x14 to 0x1C */
  __IO uint32_t B0CR;       /*!< GFXMMU buffer 0 configuration register,            Address offset: 0x20 */
  __IO uint32_t B1CR;       /*!< GFXMMU buffer 1 configuration register,            Address offset: 0x24 */
  __IO uint32_t B2CR;       /*!< GFXMMU buffer 2 configuration register,            Address offset: 0x28 */
  __IO uint32_t B3CR;       /*!< GFXMMU buffer 3 configuration register,            Address offset: 0x2C */
  uint32_t RESERVED2[1012]; /*!< Reserved2,                                         Address offset: 0x30 to 0xFFC */
  __IO uint32_t LUT[2048];  /*!< GFXMMU LUT registers,                              Address offset: 0x1000 to 0x2FFC
                                 For LUT line i, LUTiL = LUT[2*i] and LUTiH = LUT[(2*i)+1] */
} GFXMMU_TypeDef;

/**
 * @brief General Purpose I/O
 */

typedef struct
{
  __IO uint32_t MODER;   /*!< GPIO port mode register,               Address offset: 0x00      */
  __IO uint32_t OTYPER;  /*!< GPIO port output type register,        Address offset: 0x04      */
  __IO uint32_t OSPEEDR; /*!< GPIO port output speed register,       Address offset: 0x08      */
  __IO uint32_t PUPDR;   /*!< GPIO port pull-up/pull-down register,  Address offset: 0x0C      */
  __IO uint32_t IDR;     /*!< GPIO port input data register,         Address offset: 0x10      */
  __IO uint32_t ODR;     /*!< GPIO port output data register,        Address offset: 0x14      */
  __IO uint32_t BSRR;    /*!< GPIO port bit set/reset,               Address offset: 0x18      */
  __IO uint32_t LCKR;    /*!< GPIO port configuration lock register, Address offset: 0x1C      */
  __IO uint32_t AFR[2];  /*!< GPIO alternate function registers,     Address offset: 0x20-0x24 */
} GPIO_TypeDef;

/**
 * @brief Operational Amplifier (OPAMP)
 */

typedef struct
{
  __IO uint32_t CSR;   /*!< OPAMP control/status register,                      Address offset: 0x00 */
  __IO uint32_t OTR;   /*!< OPAMP offset trimming register for normal mode,     Address offset: 0x04 */
  __IO uint32_t HSOTR; /*!< OPAMP offset trimming register for high speed mode, Address offset: 0x08 */
} OPAMP_TypeDef;

/**
 * @brief System configuration controller
 */

