Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
typedef struct
{
  uint32_t RESERVED1;      /*!< Reserved,                                           Address offset: 0x00        */
  __IO uint32_t PMCR;      /*!< SYSCFG peripheral mode configuration register,      Address offset: 0x04        */
  __IO uint32_t EXTICR[4]; /*!< SYSCFG external interrupt configuration registers,  Address offset: 0x08-0x14   */
  __IO uint32_t CFGR;      /*!< SYSCFG configuration registers,                     Address offset: 0x18        */
  uint32_t RESERVED2;      /*!< Reserved,                                           Address offset: 0x1C        */
  __IO uint32_t CCCSR;     /*!< SYSCFG compensation cell control/status register,   Address offset: 0x20        */
  __IO uint32_t CCVR;      /*!< SYSCFG compensation cell value register,            Address offset: 0x24        */
  __IO uint32_t CCCR;      /*!< SYSCFG compensation cell code register,             Address offset: 0x28        */

} SYSCFG_TypeDef;

/**
 * @brief Inter-integrated Circuit Interface
 */

typedef struct
{
  __IO uint32_t CR1;      /*!< I2C Control register 1,            Address offset: 0x00 */
  __IO uint32_t CR2;      /*!< I2C Control register 2,            Address offset: 0x04 */
  __IO uint32_t OAR1;     /*!< I2C Own address 1 register,        Address offset: 0x08 */
  __IO uint32_t OAR2;     /*!< I2C Own address 2 register,        Address offset: 0x0C */
  __IO uint32_t TIMINGR;  /*!< I2C Timing register,               Address offset: 0x10 */
  __IO uint32_t TIMEOUTR; /*!< I2C Timeout register,              Address offset: 0x14 */
  __IO uint32_t ISR;      /*!< I2C Interrupt and status register, Address offset: 0x18 */
  __IO uint32_t ICR;      /*!< I2C Interrupt clear register,      Address offset: 0x1C */
  __IO uint32_t PECR;     /*!< I2C PEC register,                  Address offset: 0x20 */
  __IO uint32_t RXDR;     /*!< I2C Receive data register,         Address offset: 0x24 */
  __IO uint32_t TXDR;     /*!< I2C Transmit data register,        Address offset: 0x28 */
} I2C_TypeDef;

/**
 * @brief Independent WATCHDOG
 */

typedef struct
{
  __IO uint32_t KR;   /*!< IWDG Key register,       Address offset: 0x00 */
  __IO uint32_t PR;   /*!< IWDG Prescaler register, Address offset: 0x04 */
  __IO uint32_t RLR;  /*!< IWDG Reload register,    Address offset: 0x08 */
  __IO uint32_t SR;   /*!< IWDG Status register,    Address offset: 0x0C */
  __IO uint32_t WINR; /*!< IWDG Window register,    Address offset: 0x10 */
} IWDG_TypeDef;

/**
 * @brief JPEG Codec
 */
typedef struct
{
  __IO uint32_t CONFR0;          /*!< JPEG Codec Control Register (JPEG_CONFR0),        Address offset: 00h       */
  __IO uint32_t CONFR1;          /*!< JPEG Codec Control Register (JPEG_CONFR1),        Address offset: 04h       */
  __IO uint32_t CONFR2;          /*!< JPEG Codec Control Register (JPEG_CONFR2),        Address offset: 08h       */
  __IO uint32_t CONFR3;          /*!< JPEG Codec Control Register (JPEG_CONFR3),        Address offset: 0Ch       */
  __IO uint32_t CONFR4;          /*!< JPEG Codec Control Register (JPEG_CONFR4),        Address offset: 10h       */
  __IO uint32_t CONFR5;          /*!< JPEG Codec Control Register (JPEG_CONFR5),        Address offset: 14h       */
  __IO uint32_t CONFR6;          /*!< JPEG Codec Control Register (JPEG_CONFR6),        Address offset: 18h       */
  __IO uint32_t CONFR7;          /*!< JPEG Codec Control Register (JPEG_CONFR7),        Address offset: 1Ch       */
  uint32_t Reserved20[4];        /* Reserved                                            Address offset: 20h-2Ch   */
  __IO uint32_t CR;              /*!< JPEG Control Register (JPEG_CR),                  Address offset: 30h       */
  __IO uint32_t SR;              /*!< JPEG Status Register (JPEG_SR),                   Address offset: 34h       */
  __IO uint32_t CFR;             /*!< JPEG Clear Flag Register (JPEG_CFR),              Address offset: 38h       */
  uint32_t Reserved3c;           /* Reserved                                            Address offset: 3Ch       */
  __IO uint32_t DIR;             /*!< JPEG Data Input Register (JPEG_DIR),              Address offset: 40h       */
  __IO uint32_t DOR;             /*!< JPEG Data Output Register (JPEG_DOR),             Address offset: 44h       */
  uint32_t Reserved48[2];        /* Reserved                                            Address offset: 48h-4Ch   */
  __IO uint32_t QMEM0[16];       /*!< JPEG quantization tables 0,                       Address offset: 50h-8Ch   */
  __IO uint32_t QMEM1[16];       /*!< JPEG quantization tables 1,                       Address offset: 90h-CCh   */
  __IO uint32_t QMEM2[16];       /*!< JPEG quantization tables 2,                       Address offset: D0h-10Ch  */
  __IO uint32_t QMEM3[16];       /*!< JPEG quantization tables 3,                       Address offset: 110h-14Ch */
  __IO uint32_t HUFFMIN[16];     /*!< JPEG HuffMin tables,                              Address offset: 150h-18Ch */
  __IO uint32_t HUFFBASE[32];    /*!< JPEG HuffSymb tables,                             Address offset: 190h-20Ch */
  __IO uint32_t HUFFSYMB[84];    /*!< JPEG HUFFSYMB tables,                             Address offset: 210h-35Ch */
  __IO uint32_t DHTMEM[103];     /*!< JPEG DHTMem tables,                               Address offset: 360h-4F8h */
  uint32_t Reserved4FC;          /* Reserved                                            Address offset: 4FCh      */
  __IO uint32_t HUFFENC_AC0[88]; /*!< JPEG encodor, AC Huffman table 0,                 Address offset: 500h-65Ch */
  __IO uint32_t HUFFENC_AC1[88]; /*!< JPEG encodor, AC Huffman table 1,                 Address offset: 660h-7BCh */
  __IO uint32_t HUFFENC_DC0[8];  /*!< JPEG encodor, DC Huffman table 0,                 Address offset: 7C0h-7DCh */
  __IO uint32_t HUFFENC_DC1[8];  /*!< JPEG encodor, DC Huffman table 1,                 Address offset: 7E0h-7FCh */

} JPEG_TypeDef;

/**
 * @brief LCD-TFT Display Controller
 */

typedef struct
{
  uint32_t RESERVED0[2]; /*!< Reserved, 0x00-0x04                                                       */
  __IO uint32_t SSCR;    /*!< LTDC Synchronization Size Configuration Register,    Address offset: 0x08 */
  __IO uint32_t BPCR;    /*!< LTDC Back Porch Configuration Register,              Address offset: 0x0C */
  __IO uint32_t AWCR;    /*!< LTDC Active Width Configuration Register,            Address offset: 0x10 */
  __IO uint32_t TWCR;    /*!< LTDC Total Width Configuration Register,             Address offset: 0x14 */
  __IO uint32_t GCR;     /*!< LTDC Global Control Register,                        Address offset: 0x18 */
  uint32_t RESERVED1[2]; /*!< Reserved, 0x1C-0x20                                                       */
  __IO uint32_t SRCR;    /*!< LTDC Shadow Reload Configuration Register,           Address offset: 0x24 */
  uint32_t RESERVED2[1]; /*!< Reserved, 0x28                                                            */
  __IO uint32_t BCCR;    /*!< LTDC Background Color Configuration Register,        Address offset: 0x2C */
  uint32_t RESERVED3[1]; /*!< Reserved, 0x30                                                            */
  __IO uint32_t IER;     /*!< LTDC Interrupt Enable Register,                      Address offset: 0x34 */
  __IO uint32_t ISR;     /*!< LTDC Interrupt Status Register,                      Address offset: 0x38 */
  __IO uint32_t ICR;     /*!< LTDC Interrupt Clear Register,                       Address offset: 0x3C */
  __IO uint32_t LIPCR;   /*!< LTDC Line Interrupt Position Configuration Register, Address offset: 0x40 */
  __IO uint32_t CPSR;    /*!< LTDC Current Position Status Register,               Address offset: 0x44 */
  __IO uint32_t CDSR;    /*!< LTDC Current Display Status Register,                 Address offset: 0x48 */
} LTDC_TypeDef;

/**
 * @brief LCD-TFT Display layer x Controller
 */

typedef struct
{
  __IO uint32_t CR;      /*!< LTDC Layerx Control Register                                  Address offset: 0x84 */
  __IO uint32_t WHPCR;   /*!< LTDC Layerx Window Horizontal Position Configuration Register Address offset: 0x88 */
  __IO uint32_t WVPCR;   /*!< LTDC Layerx Window Vertical Position Configuration Register   Address offset: 0x8C */
  __IO uint32_t CKCR;    /*!< LTDC Layerx Color Keying Configuration Register               Address offset: 0x90 */
  __IO uint32_t PFCR;    /*!< LTDC Layerx Pixel Format Configuration Register               Address offset: 0x94 */
  __IO uint32_t CACR;    /*!< LTDC Layerx Constant Alpha Configuration Register             Address offset: 0x98 */
  __IO uint32_t DCCR;    /*!< LTDC Layerx Default Color Configuration Register              Address offset: 0x9C */
  __IO uint32_t BFCR;    /*!< LTDC Layerx Blending Factors Configuration Register           Address offset: 0xA0 */
  uint32_t RESERVED0[2]; /*!< Reserved */
  __IO uint32_t CFBAR;   /*!< LTDC Layerx Color Frame Buffer Address Register               Address offset: 0xAC */
  __IO uint32_t CFBLR;   /*!< LTDC Layerx Color Frame Buffer Length Register                Address offset: 0xB0 */
  __IO uint32_t CFBLNR;  /*!< LTDC Layerx ColorFrame Buffer Line Number Register            Address offset: 0xB4 */
  uint32_t RESERVED1[3]; /*!< Reserved */
  __IO uint32_t CLUTWR;  /*!< LTDC Layerx CLUT Write Register                               Address offset: 0x144 */

} LTDC_Layer_TypeDef;

/**
 * @brief Power Control
 */

typedef struct
{
  __IO uint32_t CR1;     /*!< PWR power control register 1,            Address offset: 0x00 */
  __IO uint32_t CSR1;    /*!< PWR power control status register 1,     Address offset: 0x04 */
  __IO uint32_t CR2;     /*!< PWR power control register 2,            Address offset: 0x08 */
  __IO uint32_t CR3;     /*!< PWR power control register 3,            Address offset: 0x0C */
  __IO uint32_t CPUCR;   /*!< PWR CPU control register,                Address offset: 0x10 */
  uint32_t RESERVED0;    /*!< Reserved,                                Address offset: 0x14 */
  __IO uint32_t SRDCR;   /*!< PWR SRD domain control register,         Address offset: 0x18 */
  uint32_t RESERVED1;    /*!< Reserved,                                Address offset: 0x1C */
  __IO uint32_t WKUPCR;  /*!< PWR wakeup clear register,               Address offset: 0x20 */
  __IO uint32_t WKUPFR;  /*!< PWR wakeup flag register,                Address offset: 0x24 */
  __IO uint32_t WKUPEPR; /*!< PWR wakeup enable and polarity register, Address offset: 0x28 */
} PWR_TypeDef;

/**
 * @brief Reset and Clock Control
 */

typedef struct
{
  __IO uint32_t
    CR; /*!< RCC clock control register,                                              Address offset: 0x00  */
  __IO uint32_t
    HSICFGR; /*!< HSI Clock Calibration Register,                                          Address offset: 0x04  */
  __IO uint32_t
    CRRCR; /*!< Clock Recovery RC  Register,                                             Address offset: 0x08  */
  __IO uint32_t
    CSICFGR; /*!< CSI Clock Calibration Register,                                          Address offset: 0x0C  */
  __IO uint32_t
    CFGR; /*!< RCC clock configuration register,                                        Address offset: 0x10  */
  uint32_t
    RESERVED1; /*!< Reserved,                                                                Address offset: 0x14  */
  __IO uint32_t
    CDCFGR1; /*!< RCC Domain 1 configuration register,                                    Address offset: 0x18  */
  __IO uint32_t
    CDCFGR2; /*!< RCC Domain 2 configuration register,                                    Address offset: 0x1C  */
  __IO uint32_t
    SRDCFGR; /*!< RCC Domain 3 configuration register,                                    Address offset: 0x20  */
  uint32_t
    RESERVED2; /*!< Reserved,                                                                Address offset: 0x24  */
  __IO uint32_t
    PLLCKSELR; /*!< RCC PLLs Clock Source Selection Register,                                Address offset: 0x28  */
  __IO uint32_t
    PLLCFGR; /*!< RCC PLLs  Configuration Register,                                        Address offset: 0x2C  */
  __IO uint32_t
    PLL1DIVR; /*!< RCC PLL1 Dividers Configuration Register,                                Address offset: 0x30  */
  __IO uint32_t
    PLL1FRACR; /*!< RCC PLL1 Fractional Divider Configuration Register,                      Address offset: 0x34  */
  __IO uint32_t
    PLL2DIVR; /*!< RCC PLL2 Dividers Configuration Register,                                Address offset: 0x38  */
  __IO uint32_t
    PLL2FRACR; /*!< RCC PLL2 Fractional Divider Configuration Register,                      Address offset: 0x3C  */
  __IO uint32_t
    PLL3DIVR; /*!< RCC PLL3 Dividers Configuration Register,                                Address offset: 0x40  */
  __IO uint32_t
    PLL3FRACR; /*!< RCC PLL3 Fractional Divider Configuration Register,                      Address offset: 0x44  */
  uint32_t
    RESERVED3; /*!< Reserved,                                                                Address offset: 0x48  */
  __IO uint32_t
    CDCCIPR; /*!< RCC Domain 1 Kernel Clock Configuration Register                         Address offset: 0x4C  */
  __IO uint32_t
    CDCCIP1R; /*!< RCC Domain 2 Kernel Clock Configuration Register                         Address offset: 0x50  */
  __IO uint32_t
    CDCCIP2R; /*!< RCC Domain 2 Kernel Clock Configuration Register                         Address offset: 0x54  */
  __IO uint32_t
    SRDCCIPR; /*!< RCC Domain 3 Kernel Clock Configuration Register                         Address offset: 0x58  */
  uint32_t
    RESERVED4; /*!< Reserved,                                                                Address offset: 0x5C  */
  __IO uint32_t
    CIER; /*!< RCC Clock Source Interrupt Enable Register                               Address offset: 0x60  */
  __IO uint32_t
    CIFR; /*!< RCC Clock Source Interrupt Flag Register                                 Address offset: 0x64  */
  __IO uint32_t
    CICR; /*!< RCC Clock Source Interrupt Clear Register                                Address offset: 0x68  */
  uint32_t
    RESERVED5; /*!< Reserved,                                                                Address offset: 0x6C  */
  __IO uint32_t
    BDCR; /*!< RCC Vswitch Backup Domain Control Register,                              Address offset: 0x70  */
  __IO uint32_t
    CSR; /*!< RCC clock control & status register,                                     Address offset: 0x74  */
  uint32_t
    RESERVED6; /*!< Reserved,                                                                Address offset: 0x78  */
  __IO uint32_t
    AHB3RSTR; /*!< RCC AHB3 peripheral reset register,                                      Address offset: 0x7C  */
  __IO uint32_t
    AHB1RSTR; /*!< RCC AHB1 peripheral reset register,                                      Address offset: 0x80  */
  __IO uint32_t
    AHB2RSTR; /*!< RCC AHB2 peripheral reset register,                                      Address offset: 0x84  */
  __IO uint32_t
    AHB4RSTR; /*!< RCC AHB4 peripheral reset register,                                      Address offset: 0x88  */
  __IO uint32_t
    APB3RSTR; /*!< RCC APB3 peripheral reset register,                                      Address offset: 0x8C  */
  __IO uint32_t
    APB1LRSTR; /*!< RCC APB1 peripheral reset Low Word register,                             Address offset: 0x90  */
  __IO uint32_t
    APB1HRSTR; /*!< RCC APB1 peripheral reset High Word register,                            Address offset: 0x94  */
  __IO uint32_t
    APB2RSTR; /*!< RCC APB2 peripheral reset register,                                      Address offset: 0x98  */
  __IO uint32_t
    APB4RSTR; /*!< RCC APB4 peripheral reset register,                                      Address offset: 0x9C  */
  uint32_t
    RESERVED7; /*!< Reserved,                                                                Address offset: 0xA0  */
  uint32_t
    RESERVED8; /*!< Reserved,                                                                Address offset: 0xA4  */
  __IO uint32_t
    SRDAMR; /*!< RCC Domain 3 Autonomous Mode Register,                                   Address offset: 0xA8  */
  uint32_t
    RESERVED9; /*!< Reserved, 0xAC-0xAF                                                      Address offset: 0xAC  */
  __IO uint32_t
    CKGAENR; /*!< AXI Clocks Gating Enable Register,                                       Address offset: 0xB0  */
  uint32_t
    RESERVED10[31]; /*!< Reserved, 0xAC-0xAF                                                    Address offset: 0xAC  */
  __IO uint32_t
    RSR; /*!< RCC Reset status register,                                               Address offset: 0xD0  */
  __IO uint32_t
    AHB3ENR; /*!< RCC AHB3 peripheral clock  register,                                     Address offset: 0xD4  */
  __IO uint32_t
    AHB1ENR; /*!< RCC AHB1 peripheral clock  register,                                     Address offset: 0xD8  */
  __IO uint32_t
    AHB2ENR; /*!< RCC AHB2 peripheral clock  register,                                     Address offset: 0xDC  */
  __IO uint32_t
    AHB4ENR; /*!< RCC AHB4 peripheral clock  register,                                     Address offset: 0xE0  */
  __IO uint32_t
    APB3ENR; /*!< RCC APB3 peripheral clock  register,                                     Address offset: 0xE4  */
  __IO uint32_t
    APB1LENR; /*!< RCC APB1 peripheral clock  Low Word register,                            Address offset: 0xE8  */
  __IO uint32_t
    APB1HENR; /*!< RCC APB1 peripheral clock  High Word register,                           Address offset: 0xEC  */
  __IO uint32_t
    APB2ENR; /*!< RCC APB2 peripheral clock  register,                                     Address offset: 0xF0  */
  __IO uint32_t
    APB4ENR; /*!< RCC APB4 peripheral clock  register,                                     Address offset: 0xF4  */
  uint32_t
    RESERVED12; /*!< Reserved,                                                                Address offset: 0xF8  */
  __IO uint32_t
    AHB3LPENR; /*!< RCC AHB3 peripheral sleep clock  register,                               Address offset: 0xFC  */
  __IO uint32_t
    AHB1LPENR; /*!< RCC AHB1 peripheral sleep clock  register,                               Address offset: 0x100 */
  __IO uint32_t
    AHB2LPENR; /*!< RCC AHB2 peripheral sleep clock  register,                               Address offset: 0x104 */
  __IO uint32_t
    AHB4LPENR; /*!< RCC AHB4 peripheral sleep clock  register,                               Address offset: 0x108 */
  __IO uint32_t
    APB3LPENR; /*!< RCC APB3 peripheral sleep clock  register,                               Address offset: 0x10C */
  __IO uint32_t
    APB1LLPENR; /*!< RCC APB1 peripheral sleep clock  Low Word register,                      Address offset: 0x110 */
  __IO uint32_t
    APB1HLPENR; /*!< RCC APB1 peripheral sleep clock  High Word register,                     Address offset: 0x114 */
  __IO uint32_t
    APB2LPENR; /*!< RCC APB2 peripheral sleep clock  register,                               Address offset: 0x118 */
  __IO uint32_t
    APB4LPENR; /*!< RCC APB4 peripheral sleep clock  register,                               Address offset: 0x11C */
  uint32_t RESERVED13
    [4]; /*!< Reserved, 0x120-0x12C                                                    Address offset: 0x120 */

} RCC_TypeDef;

/**
 * @brief Real-Time Clock
 */
typedef struct
{
  __IO uint32_t TR;       /*!< RTC time register,                              Address offset: 0x00 */
  __IO uint32_t DR;       /*!< RTC date register,                              Address offset: 0x04 */
  __IO uint32_t SSR;      /*!< RTC sub second register,                        Address offset: 0x08 */
  __IO uint32_t ICSR;     /*!< RTC initialization control and status register, Address offset: 0x0C */
  __IO uint32_t PRER;     /*!< RTC prescaler register,                         Address offset: 0x10 */
  __IO uint32_t WUTR;     /*!< RTC wakeup timer register,                      Address offset: 0x14 */
  __IO uint32_t CR;       /*!< RTC control register,                           Address offset: 0x18 */
  uint32_t RESERVED0;     /*!< Reserved,                                       Address offset: 0x1C */
  uint32_t RESERVED1;     /*!< Reserved,                                       Address offset: 0x20 */
  __IO uint32_t WPR;      /*!< RTC write protection register,                  Address offset: 0x24 */
  __IO uint32_t CALR;     /*!< RTC calibration register,                       Address offset: 0x28 */
  __IO uint32_t SHIFTR;   /*!< RTC shift control register,                     Address offset: 0x2C */
  __IO uint32_t TSTR;     /*!< RTC time stamp time register,                   Address offset: 0x30 */
  __IO uint32_t TSDR;     /*!< RTC time stamp date register,                   Address offset: 0x34 */
  __IO uint32_t TSSSR;    /*!< RTC time-stamp sub second register,             Address offset: 0x38 */
  uint32_t RESERVED2;     /*!< Reserved,                                       Address offset: 0x3C */
  __IO uint32_t ALRMAR;   /*!< RTC alarm A register,                           Address offset: 0x40 */
  __IO uint32_t ALRMASSR; /*!< RTC alarm A sub second register,                Address offset: 0x44 */
  __IO uint32_t ALRMBR;   /*!< RTC alarm B register,                           Address offset: 0x48 */
  __IO uint32_t ALRMBSSR; /*!< RTC alarm B sub second register,                Address offset: 0x4C */
  __IO uint32_t SR;       /*!< RTC Status register,                            Address offset: 0x50 */
  __IO uint32_t MISR;     /*!< RTC masked interrupt status register,           Address offset: 0x54 */
  uint32_t RESERVED3;     /*!< Reserved,                                       Address offset: 0x58 */
  __IO uint32_t SCR;      /*!< RTC status Clear register,                      Address offset: 0x5C */
  __IO uint32_t CFGR;     /*!< RTC configuration register,                     Address offset: 0x60 */
} RTC_TypeDef;

