Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/**
 * @brief Tamper and backup registers
 */
typedef struct
{
  __IO uint32_t CR1;      /*!< TAMP configuration register 1,            Address offset: 0x00 */
  __IO uint32_t CR2;      /*!< TAMP configuration register 2,            Address offset: 0x04 */
  uint32_t RESERVED0;     /*!< Reserved,                                 Address offset: 0x08 */
  __IO uint32_t FLTCR;    /*!< TAMP filter control register,             Address offset: 0x0C */
  __IO uint32_t ATCR1;    /*!< TAMP active tamper control register,      Address offset: 0x10 */
  __IO uint32_t ATSEEDR;  /*!< TAMP active tamper seed register,         Address offset: 0x14 */
  __IO uint32_t ATOR;     /*!< TAMP active tamper output register,       Address offset: 0x18 */
  uint32_t RESERVED1[4];  /*!< Reserved,                                 Address offset: 0x1C -- 0x28 */
  __IO uint32_t IER;      /*!< TAMP interrupt enable register,           Address offset: 0x2C */
  __IO uint32_t SR;       /*!< TAMP status register,                     Address offset: 0x30 */
  __IO uint32_t MISR;     /*!< TAMP masked interrupt status register,    Address offset: 0x34 */
  uint32_t RESERVED2;     /*!< Reserved,                                 Address offset: 0x38 */
  __IO uint32_t SCR;      /*!< TAMP status clear register,               Address offset: 0x3C */
  __IO uint32_t COUNTR;   /*!< TAMP monotonic counter register,          Address offset: 0x40 */
  uint32_t RESERVED3[3];  /*!< Reserved,                                 Address offset: 0x44 -- 0x4C */
  __IO uint32_t CFGR;     /*!< TAMP configuration register,              Address offset: 0x50 */
  uint32_t RESERVED4[43]; /*!< Reserved,                                 Address offset: 0x54 -- 0xFC */
  __IO uint32_t BKP0R;    /*!< TAMP backup register 0,                   Address offset: 0x100 */
  __IO uint32_t BKP1R;    /*!< TAMP backup register 1,                   Address offset: 0x104 */
  __IO uint32_t BKP2R;    /*!< TAMP backup register 2,                   Address offset: 0x108 */
  __IO uint32_t BKP3R;    /*!< TAMP backup register 3,                   Address offset: 0x10C */
  __IO uint32_t BKP4R;    /*!< TAMP backup register 4,                   Address offset: 0x110 */
  __IO uint32_t BKP5R;    /*!< TAMP backup register 5,                   Address offset: 0x114 */
  __IO uint32_t BKP6R;    /*!< TAMP backup register 6,                   Address offset: 0x118 */
  __IO uint32_t BKP7R;    /*!< TAMP backup register 7,                   Address offset: 0x11C */
  __IO uint32_t BKP8R;    /*!< TAMP backup register 8,                   Address offset: 0x120 */
  __IO uint32_t BKP9R;    /*!< TAMP backup register 9,                   Address offset: 0x124 */
  __IO uint32_t BKP10R;   /*!< TAMP backup register 10,                  Address offset: 0x128 */
  __IO uint32_t BKP11R;   /*!< TAMP backup register 11,                  Address offset: 0x12C */
  __IO uint32_t BKP12R;   /*!< TAMP backup register 12,                  Address offset: 0x130 */
  __IO uint32_t BKP13R;   /*!< TAMP backup register 13,                  Address offset: 0x134 */
  __IO uint32_t BKP14R;   /*!< TAMP backup register 14,                  Address offset: 0x138 */
  __IO uint32_t BKP15R;   /*!< TAMP backup register 15,                  Address offset: 0x13C */
  __IO uint32_t BKP16R;   /*!< TAMP backup register 16,                  Address offset: 0x140 */
  __IO uint32_t BKP17R;   /*!< TAMP backup register 17,                  Address offset: 0x144 */
  __IO uint32_t BKP18R;   /*!< TAMP backup register 18,                  Address offset: 0x148 */
  __IO uint32_t BKP19R;   /*!< TAMP backup register 19,                  Address offset: 0x14C */
  __IO uint32_t BKP20R;   /*!< TAMP backup register 20,                  Address offset: 0x150 */
  __IO uint32_t BKP21R;   /*!< TAMP backup register 21,                  Address offset: 0x154 */
  __IO uint32_t BKP22R;   /*!< TAMP backup register 22,                  Address offset: 0x158 */
  __IO uint32_t BKP23R;   /*!< TAMP backup register 23,                  Address offset: 0x15C */
  __IO uint32_t BKP24R;   /*!< TAMP backup register 24,                  Address offset: 0x160 */
  __IO uint32_t BKP25R;   /*!< TAMP backup register 25,                  Address offset: 0x164 */
  __IO uint32_t BKP26R;   /*!< TAMP backup register 26,                  Address offset: 0x168 */
  __IO uint32_t BKP27R;   /*!< TAMP backup register 27,                  Address offset: 0x16C */
  __IO uint32_t BKP28R;   /*!< TAMP backup register 28,                  Address offset: 0x170 */
  __IO uint32_t BKP29R;   /*!< TAMP backup register 29,                  Address offset: 0x174 */
  __IO uint32_t BKP30R;   /*!< TAMP backup register 30,                  Address offset: 0x178 */
  __IO uint32_t BKP31R;   /*!< TAMP backup register 31,                  Address offset: 0x17C */
} TAMP_TypeDef;

/**
 * @brief Serial Audio Interface
 */

typedef struct
{
  __IO uint32_t GCR;      /*!< SAI global configuration register, Address offset: 0x00 */
  uint32_t RESERVED0[16]; /*!< Reserved, 0x04 - 0x43                                   */
  __IO uint32_t PDMCR;    /*!< SAI PDM control register,          Address offset: 0x44 */
  __IO uint32_t PDMDLY;   /*!< SAI PDM delay register,            Address offset: 0x48 */
} SAI_TypeDef;

typedef struct
{
  __IO uint32_t CR1;   /*!< SAI block x configuration register 1,     Address offset: 0x04 */
  __IO uint32_t CR2;   /*!< SAI block x configuration register 2,     Address offset: 0x08 */
  __IO uint32_t FRCR;  /*!< SAI block x frame configuration register, Address offset: 0x0C */
  __IO uint32_t SLOTR; /*!< SAI block x slot register,                Address offset: 0x10 */
  __IO uint32_t IMR;   /*!< SAI block x interrupt mask register,      Address offset: 0x14 */
  __IO uint32_t SR;    /*!< SAI block x status register,              Address offset: 0x18 */
  __IO uint32_t CLRFR; /*!< SAI block x clear flag register,          Address offset: 0x1C */
  __IO uint32_t DR;    /*!< SAI block x data register,                Address offset: 0x20 */
} SAI_Block_TypeDef;

/**
 * @brief SPDIF-RX Interface
 */

typedef struct
{
  __IO uint32_t CR;   /*!< Control register,                   Address offset: 0x00 */
  __IO uint32_t IMR;  /*!< Interrupt mask register,            Address offset: 0x04 */
  __IO uint32_t SR;   /*!< Status register,                    Address offset: 0x08 */
  __IO uint32_t IFCR; /*!< Interrupt Flag Clear register,      Address offset: 0x0C */
  __IO uint32_t DR;   /*!< Data input register,                Address offset: 0x10 */
  __IO uint32_t CSR;  /*!< Channel Status register,            Address offset: 0x14 */
  __IO uint32_t DIR;  /*!< Debug Information register,         Address offset: 0x18 */
  uint32_t RESERVED2; /*!< Reserved,  0x1A                                          */
} SPDIFRX_TypeDef;

/**
 * @brief Secure digital input/output Interface
 */

typedef struct
{
  __IO uint32_t POWER;     /*!< SDMMC power control register,             Address offset: 0x00  */
  __IO uint32_t CLKCR;     /*!< SDMMC clock control register,             Address offset: 0x04  */
  __IO uint32_t ARG;       /*!< SDMMC argument register,                  Address offset: 0x08  */
  __IO uint32_t CMD;       /*!< SDMMC command register,                   Address offset: 0x0C  */
  __I uint32_t RESPCMD;    /*!< SDMMC command response register,          Address offset: 0x10  */
  __I uint32_t RESP1;      /*!< SDMMC response 1 register,                Address offset: 0x14  */
  __I uint32_t RESP2;      /*!< SDMMC response 2 register,                Address offset: 0x18  */
  __I uint32_t RESP3;      /*!< SDMMC response 3 register,                Address offset: 0x1C  */
  __I uint32_t RESP4;      /*!< SDMMC response 4 register,                Address offset: 0x20  */
  __IO uint32_t DTIMER;    /*!< SDMMC data timer register,                Address offset: 0x24  */
  __IO uint32_t DLEN;      /*!< SDMMC data length register,               Address offset: 0x28  */
  __IO uint32_t DCTRL;     /*!< SDMMC data control register,              Address offset: 0x2C  */
  __I uint32_t DCOUNT;     /*!< SDMMC data counter register,              Address offset: 0x30  */
  __I uint32_t STA;        /*!< SDMMC status register,                    Address offset: 0x34  */
  __IO uint32_t ICR;       /*!< SDMMC interrupt clear register,           Address offset: 0x38  */
  __IO uint32_t MASK;      /*!< SDMMC mask register,                      Address offset: 0x3C  */
  __IO uint32_t ACKTIME;   /*!< SDMMC Acknowledgement timer register,     Address offset: 0x40  */
  uint32_t RESERVED0[3];   /*!< Reserved, 0x44 - 0x4C - 0x4C                                    */
  __IO uint32_t IDMACTRL;  /*!< SDMMC DMA control register,               Address offset: 0x50  */
  __IO uint32_t IDMABSIZE; /*!< SDMMC DMA buffer size register,           Address offset: 0x54  */
  __IO uint32_t IDMABASE0; /*!< SDMMC DMA buffer 0 base address register, Address offset: 0x58  */
  __IO uint32_t IDMABASE1; /*!< SDMMC DMA buffer 1 base address register, Address offset: 0x5C  */
  uint32_t RESERVED1[8];   /*!< Reserved, 0x60-0x7C                                             */
  __IO uint32_t FIFO;      /*!< SDMMC data FIFO register,                 Address offset: 0x80  */
  uint32_t RESERVED2[222]; /*!< Reserved, 0x84-0x3F8                                            */
  __IO uint32_t IPVR;      /*!< SDMMC data FIFO register,                 Address offset: 0x3FC */
} SDMMC_TypeDef;

/**
 * @brief Delay Block DLYB
 */

typedef struct
{
  __IO uint32_t CR;   /*!< DELAY BLOCK control register,  Address offset: 0x00 */
  __IO uint32_t CFGR; /*!< DELAY BLOCK configuration register,  Address offset: 0x04 */
} DLYB_TypeDef;

/**
 * @brief HW Semaphore HSEM
 */

typedef struct
{
  __IO uint32_t R[32];   /*!< 2-step write lock and read back registers,     Address offset: 00h-7Ch  */
  __IO uint32_t RLR[32]; /*!< 1-step read lock registers,                    Address offset: 80h-FCh  */
  __IO uint32_t C1IER;   /*!< HSEM Interrupt enable register ,             Address offset: 100h     */
  __IO uint32_t C1ICR;   /*!< HSEM Interrupt clear register ,              Address offset: 104h     */
  __IO uint32_t C1ISR;   /*!< HSEM Interrupt Status register ,             Address offset: 108h     */
  __IO uint32_t C1MISR;  /*!< HSEM Interrupt Masked Status register ,      Address offset: 10Ch     */
  uint32_t Reserved[12]; /* Reserved                                       Address offset: 110h-13Ch  */
  __IO uint32_t CR;      /*!< HSEM Semaphore clear register ,                Address offset: 140h      */
  __IO uint32_t KEYR;    /*!< HSEM Semaphore clear key register ,            Address offset: 144h      */

} HSEM_TypeDef;

typedef struct
{
  __IO uint32_t IER;  /*!< HSEM interrupt enable register ,                Address offset:   0h     */
  __IO uint32_t ICR;  /*!< HSEM interrupt clear register ,                 Address offset:   4h     */
  __IO uint32_t ISR;  /*!< HSEM interrupt status register ,                Address offset:   8h     */
  __IO uint32_t MISR; /*!< HSEM masked interrupt status register ,         Address offset:   Ch     */
} HSEM_Common_TypeDef;

/**
 * @brief Serial Peripheral Interface
 */

typedef struct
{
  __IO uint32_t CR1;     /*!< SPI/I2S Control register 1,                      Address offset: 0x00 */
  __IO uint32_t CR2;     /*!< SPI Control register 2,                          Address offset: 0x04 */
  __IO uint32_t CFG1;    /*!< SPI Configuration register 1,                    Address offset: 0x08 */
  __IO uint32_t CFG2;    /*!< SPI Configuration register 2,                    Address offset: 0x0C */
  __IO uint32_t IER;     /*!< SPI/I2S Interrupt Enable register,               Address offset: 0x10 */
  __IO uint32_t SR;      /*!< SPI/I2S Status register,                         Address offset: 0x14 */
  __IO uint32_t IFCR;    /*!< SPI/I2S Interrupt/Status flags clear register,   Address offset: 0x18 */
  uint32_t RESERVED0;    /*!< Reserved, 0x1C                                                        */
  __IO uint32_t TXDR;    /*!< SPI/I2S Transmit data register,                  Address offset: 0x20 */
  uint32_t RESERVED1[3]; /*!< Reserved, 0x24-0x2C                                                   */
  __IO uint32_t RXDR;    /*!< SPI/I2S Receive data register,                   Address offset: 0x30 */
  uint32_t RESERVED2[3]; /*!< Reserved, 0x34-0x3C                                                   */
  __IO uint32_t CRCPOLY; /*!< SPI CRC Polynomial register,                     Address offset: 0x40 */
  __IO uint32_t TXCRC;   /*!< SPI Transmitter CRC register,                    Address offset: 0x44 */
  __IO uint32_t RXCRC;   /*!< SPI Receiver CRC register,                       Address offset: 0x48 */
  __IO uint32_t UDRDR;   /*!< SPI Underrun data register,                      Address offset: 0x4C */
  __IO uint32_t I2SCFGR; /*!< I2S Configuration register,                      Address offset: 0x50 */

} SPI_TypeDef;

/**
 * @brief DTS
 */
typedef struct
{
  __IO uint32_t CFGR1;    /*!< DTS configuration register,                Address offset: 0x00 */
  uint32_t RESERVED0;     /*!< Reserved,                                  Address offset: 0x04 */
  __IO uint32_t T0VALR1;  /*!< DTS T0 Value register,                     Address offset: 0x08 */
  uint32_t RESERVED1;     /*!< Reserved,                                  Address offset: 0x0C */
  __IO uint32_t RAMPVALR; /*!< DTS Ramp value register,                   Address offset: 0x10 */
  __IO uint32_t ITR1;     /*!< DTS Interrupt threshold register,          Address offset: 0x14 */
  uint32_t RESERVED2;     /*!< Reserved,                                  Address offset: 0x18 */
  __IO uint32_t DR;       /*!< DTS data register,                         Address offset: 0x1C */
  __IO uint32_t SR;       /*!< DTS status register                        Address offset: 0x20 */
  __IO uint32_t ITENR;    /*!< DTS Interrupt enable register,             Address offset: 0x24 */
  __IO uint32_t ICIFR;    /*!< DTS Clear Interrupt flag register,         Address offset: 0x28 */
  __IO uint32_t OR;       /*!< DTS option register 1,                     Address offset: 0x2C */
} DTS_TypeDef;

/**
 * @brief TIM
 */

typedef struct
{
  __IO uint32_t CR1;   /*!< TIM control register 1,                   Address offset: 0x00 */
  __IO uint32_t CR2;   /*!< TIM control register 2,                   Address offset: 0x04 */
  __IO uint32_t SMCR;  /*!< TIM slave mode control register,          Address offset: 0x08 */
  __IO uint32_t DIER;  /*!< TIM DMA/interrupt enable register,        Address offset: 0x0C */
  __IO uint32_t SR;    /*!< TIM status register,                      Address offset: 0x10 */
  __IO uint32_t EGR;   /*!< TIM event generation register,            Address offset: 0x14 */
  __IO uint32_t CCMR1; /*!< TIM capture/compare mode register 1,      Address offset: 0x18 */
  __IO uint32_t CCMR2; /*!< TIM capture/compare mode register 2,      Address offset: 0x1C */
  __IO uint32_t CCER;  /*!< TIM capture/compare enable register,      Address offset: 0x20 */
  __IO uint32_t CNT;   /*!< TIM counter register,                     Address offset: 0x24 */
  __IO uint32_t PSC;   /*!< TIM prescaler,                            Address offset: 0x28 */
  __IO uint32_t ARR;   /*!< TIM auto-reload register,                 Address offset: 0x2C */
  __IO uint32_t RCR;   /*!< TIM repetition counter register,          Address offset: 0x30 */
  __IO uint32_t CCR1;  /*!< TIM capture/compare register 1,           Address offset: 0x34 */
  __IO uint32_t CCR2;  /*!< TIM capture/compare register 2,           Address offset: 0x38 */
  __IO uint32_t CCR3;  /*!< TIM capture/compare register 3,           Address offset: 0x3C */
  __IO uint32_t CCR4;  /*!< TIM capture/compare register 4,           Address offset: 0x40 */
  __IO uint32_t BDTR;  /*!< TIM break and dead-time register,         Address offset: 0x44 */
  __IO uint32_t DCR;   /*!< TIM DMA control register,                 Address offset: 0x48 */
  __IO uint32_t DMAR;  /*!< TIM DMA address for full transfer,        Address offset: 0x4C */
  uint32_t RESERVED1;  /*!< Reserved, 0x50                                                 */
  __IO uint32_t CCMR3; /*!< TIM capture/compare mode register 3,      Address offset: 0x54 */
  __IO uint32_t CCR5;  /*!< TIM capture/compare register5,            Address offset: 0x58 */
  __IO uint32_t CCR6;  /*!< TIM capture/compare register6,            Address offset: 0x5C */
  __IO uint32_t AF1;   /*!< TIM alternate function option register 1, Address offset: 0x60 */
  __IO uint32_t AF2;   /*!< TIM alternate function option register 2, Address offset: 0x64 */
  __IO uint32_t TISEL; /*!< TIM Input Selection register,             Address offset: 0x68 */
} TIM_TypeDef;

/**
 * @brief LPTIMIMER
 */
typedef struct
{
  __IO uint32_t ISR;   /*!< LPTIM Interrupt and Status register,         Address offset: 0x00 */
  __IO uint32_t ICR;   /*!< LPTIM Interrupt Clear register,              Address offset: 0x04 */
  __IO uint32_t IER;   /*!< LPTIM Interrupt Enable register,             Address offset: 0x08 */
  __IO uint32_t CFGR;  /*!< LPTIM Configuration register,                Address offset: 0x0C */
  __IO uint32_t CR;    /*!< LPTIM Control register,                      Address offset: 0x10 */
  __IO uint32_t CMP;   /*!< LPTIM Compare register,                      Address offset: 0x14 */
  __IO uint32_t ARR;   /*!< LPTIM Autoreload register,                   Address offset: 0x18 */
  __IO uint32_t CNT;   /*!< LPTIM Counter register,                      Address offset: 0x1C */
  uint32_t RESERVED1;  /*!< Reserved, 0x20                                                    */
  __IO uint32_t CFGR2; /*!< LPTIM Configuration register,                Address offset: 0x24 */
} LPTIM_TypeDef;

/**
 * @brief Comparator
 */
typedef struct
{
  __IO uint32_t SR;   /*!< Comparator status register,                    Address offset: 0x00 */
  __IO uint32_t ICFR; /*!< Comparator interrupt clear flag register,       Address offset: 0x04 */
  __IO uint32_t OR;   /*!< Comparator option register,                  Address offset: 0x08 */
} COMPOPT_TypeDef;

typedef struct
{
  __IO uint32_t CFGR; /*!< Comparator configuration register  ,           Address offset: 0x00 */
} COMP_TypeDef;

typedef struct
{
  __IO uint32_t
    CFGR; /*!< COMP control and status register, used for bits common to several COMP instances, Address offset: 0x00 */
} COMP_Common_TypeDef;

/**
 * @brief Universal Synchronous Asynchronous Receiver Transmitter
 */

typedef struct
{
  __IO uint32_t CR1;   /*!< USART Control register 1,                 Address offset: 0x00 */
  __IO uint32_t CR2;   /*!< USART Control register 2,                 Address offset: 0x04 */
  __IO uint32_t CR3;   /*!< USART Control register 3,                 Address offset: 0x08 */
  __IO uint32_t BRR;   /*!< USART Baud rate register,                 Address offset: 0x0C */
  __IO uint32_t GTPR;  /*!< USART Guard time and prescaler register,  Address offset: 0x10 */
  __IO uint32_t RTOR;  /*!< USART Receiver Time Out register,         Address offset: 0x14 */
  __IO uint32_t RQR;   /*!< USART Request register,                   Address offset: 0x18 */
  __IO uint32_t ISR;   /*!< USART Interrupt and status register,      Address offset: 0x1C */
  __IO uint32_t ICR;   /*!< USART Interrupt flag Clear register,      Address offset: 0x20 */
  __IO uint32_t RDR;   /*!< USART Receive Data register,              Address offset: 0x24 */
  __IO uint32_t TDR;   /*!< USART Transmit Data register,             Address offset: 0x28 */
  __IO uint32_t PRESC; /*!< USART clock Prescaler register,           Address offset: 0x2C */
} USART_TypeDef;

/**
 * @brief Single Wire Protocol Master Interface SPWMI
 */
typedef struct
{
  __IO uint32_t CR;   /*!< SWPMI Configuration/Control register,     Address offset: 0x00 */
  __IO uint32_t BRR;  /*!< SWPMI bitrate register,                   Address offset: 0x04 */
  uint32_t RESERVED1; /*!< Reserved, 0x08                                                 */
  __IO uint32_t ISR;  /*!< SWPMI Interrupt and Status register,      Address offset: 0x0C */
  __IO uint32_t ICR;  /*!< SWPMI Interrupt Flag Clear register,      Address offset: 0x10 */
  __IO uint32_t IER;  /*!< SWPMI Interrupt Enable register,          Address offset: 0x14 */
  __IO uint32_t RFL;  /*!< SWPMI Receive Frame Length register,      Address offset: 0x18 */
  __IO uint32_t TDR;  /*!< SWPMI Transmit data register,             Address offset: 0x1C */
  __IO uint32_t RDR;  /*!< SWPMI Receive data register,              Address offset: 0x20 */
  __IO uint32_t OR;   /*!< SWPMI Option register,                    Address offset: 0x24 */
} SWPMI_TypeDef;

/**
 * @brief Window WATCHDOG
 */

typedef struct
{
  __IO uint32_t CR;  /*!< WWDG Control register,       Address offset: 0x00 */
  __IO uint32_t CFR; /*!< WWDG Configuration register, Address offset: 0x04 */
  __IO uint32_t SR;  /*!< WWDG Status register,        Address offset: 0x08 */
} WWDG_TypeDef;

/**
 * @brief RAM_ECC_Specific_Registers
 */
typedef struct
{
  __IO uint32_t CR;   /*!< RAMECC monitor configuration register          */
  __IO uint32_t SR;   /*!< RAMECC monitor status register                 */
  __IO uint32_t FAR;  /*!< RAMECC monitor failing address register        */
  __IO uint32_t FDRL; /*!< RAMECC monitor failing data low register       */
  __IO uint32_t FDRH; /*!< RAMECC monitor failing data high register      */
  __IO uint32_t FECR; /*!< RAMECC monitor failing ECC error code register */
} RAMECC_MonitorTypeDef;

typedef struct
{
  __IO uint32_t IER; /*!< RAMECC interrupt enable register */
} RAMECC_TypeDef;

/**
 * @}
 */

/**
 * @brief RNG
 */

typedef struct
{
  __IO uint32_t CR; /*!< RNG control register, Address offset: 0x00 */
  __IO uint32_t SR; /*!< RNG status register,  Address offset: 0x04 */
  __IO uint32_t DR; /*!< RNG data register,    Address offset: 0x08 */
  uint32_t RESERVED;
  __IO uint32_t HTCR; /*!< RNG health test configuration register, Address offset: 0x10 */
} RNG_TypeDef;

/**
 * @brief MDIOS
 */

