Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t WRFR;
  __IO uint32_t CWRFR;
  __IO uint32_t RDFR;
  __IO uint32_t CRDFR;
  __IO uint32_t SR;
  __IO uint32_t CLRFR;
  uint32_t RESERVED[57];
  __IO uint32_t DINR0;
  __IO uint32_t DINR1;
  __IO uint32_t DINR2;
  __IO uint32_t DINR3;
  __IO uint32_t DINR4;
  __IO uint32_t DINR5;
  __IO uint32_t DINR6;
  __IO uint32_t DINR7;
  __IO uint32_t DINR8;
  __IO uint32_t DINR9;
  __IO uint32_t DINR10;
  __IO uint32_t DINR11;
  __IO uint32_t DINR12;
  __IO uint32_t DINR13;
  __IO uint32_t DINR14;
  __IO uint32_t DINR15;
  __IO uint32_t DINR16;
  __IO uint32_t DINR17;
  __IO uint32_t DINR18;
  __IO uint32_t DINR19;
  __IO uint32_t DINR20;
  __IO uint32_t DINR21;
  __IO uint32_t DINR22;
  __IO uint32_t DINR23;
  __IO uint32_t DINR24;
  __IO uint32_t DINR25;
  __IO uint32_t DINR26;
  __IO uint32_t DINR27;
  __IO uint32_t DINR28;
  __IO uint32_t DINR29;
  __IO uint32_t DINR30;
  __IO uint32_t DINR31;
  __IO uint32_t DOUTR0;
  __IO uint32_t DOUTR1;
  __IO uint32_t DOUTR2;
  __IO uint32_t DOUTR3;
  __IO uint32_t DOUTR4;
  __IO uint32_t DOUTR5;
  __IO uint32_t DOUTR6;
  __IO uint32_t DOUTR7;
  __IO uint32_t DOUTR8;
  __IO uint32_t DOUTR9;
  __IO uint32_t DOUTR10;
  __IO uint32_t DOUTR11;
  __IO uint32_t DOUTR12;
  __IO uint32_t DOUTR13;
  __IO uint32_t DOUTR14;
  __IO uint32_t DOUTR15;
  __IO uint32_t DOUTR16;
  __IO uint32_t DOUTR17;
  __IO uint32_t DOUTR18;
  __IO uint32_t DOUTR19;
  __IO uint32_t DOUTR20;
  __IO uint32_t DOUTR21;
  __IO uint32_t DOUTR22;
  __IO uint32_t DOUTR23;
  __IO uint32_t DOUTR24;
  __IO uint32_t DOUTR25;
  __IO uint32_t DOUTR26;
  __IO uint32_t DOUTR27;
  __IO uint32_t DOUTR28;
  __IO uint32_t DOUTR29;
  __IO uint32_t DOUTR30;
  __IO uint32_t DOUTR31;
} MDIOS_TypeDef;

/**
 * @brief USB_OTG_Core_Registers
 */
typedef struct
{
  __IO uint32_t GOTGCTL;            /*!< USB_OTG Control and Status Register          000h */
  __IO uint32_t GOTGINT;            /*!< USB_OTG Interrupt Register                   004h */
  __IO uint32_t GAHBCFG;            /*!< Core AHB Configuration Register              008h */
  __IO uint32_t GUSBCFG;            /*!< Core USB Configuration Register              00Ch */
  __IO uint32_t GRSTCTL;            /*!< Core Reset Register                          010h */
  __IO uint32_t GINTSTS;            /*!< Core Interrupt Register                      014h */
  __IO uint32_t GINTMSK;            /*!< Core Interrupt Mask Register                 018h */
  __IO uint32_t GRXSTSR;            /*!< Receive Sts Q Read Register                  01Ch */
  __IO uint32_t GRXSTSP;            /*!< Receive Sts Q Read & POP Register            020h */
  __IO uint32_t GRXFSIZ;            /*!< Receive FIFO Size Register                   024h */
  __IO uint32_t DIEPTXF0_HNPTXFSIZ; /*!< EP0 / Non Periodic Tx FIFO Size Register     028h */
  __IO uint32_t HNPTXSTS;           /*!< Non Periodic Tx FIFO/Queue Sts reg           02Ch */
  uint32_t Reserved30[2];           /*!< Reserved                                     030h */
  __IO uint32_t GCCFG;              /*!< General Purpose IO Register                  038h */
  __IO uint32_t CID;                /*!< User ID Register                             03Ch */
  __IO uint32_t GSNPSID;            /* USB_OTG core ID                                040h*/
  __IO uint32_t GHWCFG1;            /* User HW config1                                044h*/
  __IO uint32_t GHWCFG2;            /* User HW config2                                048h*/
  __IO uint32_t GHWCFG3;            /*!< User HW config3                              04Ch */
  uint32_t Reserved6;               /*!< Reserved                                     050h */
  __IO uint32_t GLPMCFG;            /*!< LPM Register                                 054h */
  __IO uint32_t GPWRDN;             /*!< Power Down Register                          058h */
  __IO uint32_t GDFIFOCFG;          /*!< DFIFO Software Config Register               05Ch */
  __IO uint32_t GADPCTL;            /*!< ADP Timer, Control and Status Register       60Ch */
  uint32_t Reserved43[39];          /*!< Reserved                                058h-0FFh */
  __IO uint32_t HPTXFSIZ;           /*!< Host Periodic Tx FIFO Size Reg               100h */
  __IO uint32_t DIEPTXF[0x0F];      /*!< dev Periodic Transmit FIFO */
} USB_OTG_GlobalTypeDef;

/**
 * @brief USB_OTG_device_Registers
 */
typedef struct
{
  __IO uint32_t DCFG;       /*!< dev Configuration Register   800h */
  __IO uint32_t DCTL;       /*!< dev Control Register         804h */
  __IO uint32_t DSTS;       /*!< dev Status Register (RO)     808h */
  uint32_t Reserved0C;      /*!< Reserved                     80Ch */
  __IO uint32_t DIEPMSK;    /*!< dev IN Endpoint Mask         810h */
  __IO uint32_t DOEPMSK;    /*!< dev OUT Endpoint Mask        814h */
  __IO uint32_t DAINT;      /*!< dev All Endpoints Itr Reg    818h */
  __IO uint32_t DAINTMSK;   /*!< dev All Endpoints Itr Mask   81Ch */
  uint32_t Reserved20;      /*!< Reserved                     820h */
  uint32_t Reserved9;       /*!< Reserved                     824h */
  __IO uint32_t DVBUSDIS;   /*!< dev VBUS discharge Register  828h */
  __IO uint32_t DVBUSPULSE; /*!< dev VBUS Pulse Register      82Ch */
  __IO uint32_t DTHRCTL;    /*!< dev threshold                830h */
  __IO uint32_t DIEPEMPMSK; /*!< dev empty msk                834h */
  __IO uint32_t DEACHINT;   /*!< dedicated EP interrupt       838h */
  __IO uint32_t DEACHMSK;   /*!< dedicated EP msk             83Ch */
  uint32_t Reserved40;      /*!< dedicated EP mask            840h */
  __IO uint32_t DINEP1MSK;  /*!< dedicated EP mask            844h */
  uint32_t Reserved44[15];  /*!< Reserved                 844-87Ch */
  __IO uint32_t DOUTEP1MSK; /*!< dedicated EP msk             884h */
} USB_OTG_DeviceTypeDef;

/**
 * @brief USB_OTG_IN_Endpoint-Specific_Register
 */
typedef struct
{
  __IO uint32_t DIEPCTL;  /*!< dev IN Endpoint Control Reg    900h + (ep_num * 20h) + 00h */
  uint32_t Reserved04;    /*!< Reserved                       900h + (ep_num * 20h) + 04h */
  __IO uint32_t DIEPINT;  /*!< dev IN Endpoint Itr Reg        900h + (ep_num * 20h) + 08h */
  uint32_t Reserved0C;    /*!< Reserved                       900h + (ep_num * 20h) + 0Ch */
  __IO uint32_t DIEPTSIZ; /*!< IN Endpoint Txfer Size         900h + (ep_num * 20h) + 10h */
  __IO uint32_t DIEPDMA;  /*!< IN Endpoint DMA Address Reg    900h + (ep_num * 20h) + 14h */
  __IO uint32_t DTXFSTS;  /*!< IN Endpoint Tx FIFO Status Reg 900h + (ep_num * 20h) + 18h */
  uint32_t Reserved18;    /*!< Reserved  900h+(ep_num*20h)+1Ch-900h+ (ep_num * 20h) + 1Ch */
} USB_OTG_INEndpointTypeDef;

/**
 * @brief USB_OTG_OUT_Endpoint-Specific_Registers
 */
typedef struct
{
  __IO uint32_t DOEPCTL;  /*!< dev OUT Endpoint Control Reg           B00h + (ep_num * 20h) + 00h */
  uint32_t Reserved04;    /*!< Reserved                               B00h + (ep_num * 20h) + 04h */
  __IO uint32_t DOEPINT;  /*!< dev OUT Endpoint Itr Reg               B00h + (ep_num * 20h) + 08h */
  uint32_t Reserved0C;    /*!< Reserved                               B00h + (ep_num * 20h) + 0Ch */
  __IO uint32_t DOEPTSIZ; /*!< dev OUT Endpoint Txfer Size            B00h + (ep_num * 20h) + 10h */
  __IO uint32_t DOEPDMA;  /*!< dev OUT Endpoint DMA Address           B00h + (ep_num * 20h) + 14h */
  uint32_t Reserved18[2]; /*!< Reserved B00h + (ep_num * 20h) + 18h - B00h + (ep_num * 20h) + 1Ch */
} USB_OTG_OUTEndpointTypeDef;

/**
 * @brief USB_OTG_Host_Mode_Register_Structures
 */
typedef struct
{
  __IO uint32_t HCFG;     /*!< Host Configuration Register          400h */
  __IO uint32_t HFIR;     /*!< Host Frame Interval Register         404h */
  __IO uint32_t HFNUM;    /*!< Host Frame Nbr/Frame Remaining       408h */
  uint32_t Reserved40C;   /*!< Reserved                             40Ch */
  __IO uint32_t HPTXSTS;  /*!< Host Periodic Tx FIFO/ Queue Status  410h */
  __IO uint32_t HAINT;    /*!< Host All Channels Interrupt Register 414h */
  __IO uint32_t HAINTMSK; /*!< Host All Channels Interrupt Mask     418h */
} USB_OTG_HostTypeDef;

/**
 * @brief USB_OTG_Host_Channel_Specific_Registers
 */
typedef struct
{
  __IO uint32_t HCCHAR;   /*!< Host Channel Characteristics Register    500h */
  __IO uint32_t HCSPLT;   /*!< Host Channel Split Control Register      504h */
  __IO uint32_t HCINT;    /*!< Host Channel Interrupt Register          508h */
  __IO uint32_t HCINTMSK; /*!< Host Channel Interrupt Mask Register     50Ch */
  __IO uint32_t HCTSIZ;   /*!< Host Channel Transfer Size Register      510h */
  __IO uint32_t HCDMA;    /*!< Host Channel DMA Address Register        514h */
  uint32_t Reserved[2];   /*!< Reserved                                      */
} USB_OTG_HostChannelTypeDef;

/**
 * @}
 */

/**
 * @brief OCTO Serial Peripheral Interface
 */

typedef struct
{
  __IO uint32_t CR;         /*!< OCTOSPI Control register,                           Address offset: 0x000 */
  uint32_t RESERVED;        /*!< Reserved,                                           Address offset: 0x004 */
  __IO uint32_t DCR1;       /*!< OCTOSPI Device Configuration register 1,            Address offset: 0x008 */
  __IO uint32_t DCR2;       /*!< OCTOSPI Device Configuration register 2,            Address offset: 0x00C */
  __IO uint32_t DCR3;       /*!< OCTOSPI Device Configuration register 3,            Address offset: 0x010 */
  __IO uint32_t DCR4;       /*!< OCTOSPI Device Configuration register 4,            Address offset: 0x014 */
  uint32_t RESERVED1[2];    /*!< Reserved,                                           Address offset: 0x018-0x01C */
  __IO uint32_t SR;         /*!< OCTOSPI Status register,                            Address offset: 0x020 */
  __IO uint32_t FCR;        /*!< OCTOSPI Flag Clear register,                        Address offset: 0x024 */
  uint32_t RESERVED2[6];    /*!< Reserved,                                           Address offset: 0x028-0x03C */
  __IO uint32_t DLR;        /*!< OCTOSPI Data Length register,                       Address offset: 0x040 */
  uint32_t RESERVED3;       /*!< Reserved,                                           Address offset: 0x044 */
  __IO uint32_t AR;         /*!< OCTOSPI Address register,                           Address offset: 0x048 */
  uint32_t RESERVED4;       /*!< Reserved,                                           Address offset: 0x04C */
  __IO uint32_t DR;         /*!< OCTOSPI Data register,                              Address offset: 0x050 */
  uint32_t RESERVED5[11];   /*!< Reserved,                                           Address offset: 0x054-0x07C */
  __IO uint32_t PSMKR;      /*!< OCTOSPI Polling Status Mask register,               Address offset: 0x080 */
  uint32_t RESERVED6;       /*!< Reserved,                                           Address offset: 0x084 */
  __IO uint32_t PSMAR;      /*!< OCTOSPI Polling Status Match register,              Address offset: 0x088 */
  uint32_t RESERVED7;       /*!< Reserved,                                           Address offset: 0x08C */
  __IO uint32_t PIR;        /*!< OCTOSPI Polling Interval register,                  Address offset: 0x090 */
  uint32_t RESERVED8[27];   /*!< Reserved,                                           Address offset: 0x094-0x0FC */
  __IO uint32_t CCR;        /*!< OCTOSPI Communication Configuration register,       Address offset: 0x100 */
  uint32_t RESERVED9;       /*!< Reserved,                                           Address offset: 0x104 */
  __IO uint32_t TCR;        /*!< OCTOSPI Timing Configuration register,              Address offset: 0x108 */
  uint32_t RESERVED10;      /*!< Reserved,                                           Address offset: 0x10C */
  __IO uint32_t IR;         /*!< OCTOSPI Instruction register,                       Address offset: 0x110 */
  uint32_t RESERVED11[3];   /*!< Reserved,                                           Address offset: 0x114-0x11C */
  __IO uint32_t ABR;        /*!< OCTOSPI Alternate Bytes register,                   Address offset: 0x120 */
  uint32_t RESERVED12[3];   /*!< Reserved,                                           Address offset: 0x124-0x12C */
  __IO uint32_t LPTR;       /*!< OCTOSPI Low Power Timeout register,                 Address offset: 0x130 */
  uint32_t RESERVED13[3];   /*!< Reserved,                                           Address offset: 0x134-0x13C */
  __IO uint32_t WPCCR;      /*!< OCTOSPI Wrap Communication Configuration register,  Address offset: 0x140 */
  uint32_t RESERVED14;      /*!< Reserved,                                           Address offset: 0x144 */
  __IO uint32_t WPTCR;      /*!< OCTOSPI Wrap Timing Configuration register,         Address offset: 0x148 */
  uint32_t RESERVED15;      /*!< Reserved,                                           Address offset: 0x14C */
  __IO uint32_t WPIR;       /*!< OCTOSPI Wrap Instruction register,                  Address offset: 0x150 */
  uint32_t RESERVED16[3];   /*!< Reserved,                                           Address offset: 0x154-0x15C */
  __IO uint32_t WPABR;      /*!< OCTOSPI Wrap Alternate Bytes register,              Address offset: 0x160 */
  uint32_t RESERVED17[7];   /*!< Reserved,                                           Address offset: 0x164-0x17C */
  __IO uint32_t WCCR;       /*!< OCTOSPI Write Communication Configuration register, Address offset: 0x180 */
  uint32_t RESERVED18;      /*!< Reserved,                                           Address offset: 0x184 */
  __IO uint32_t WTCR;       /*!< OCTOSPI Write Timing Configuration register,        Address offset: 0x188 */
  uint32_t RESERVED19;      /*!< Reserved,                                           Address offset: 0x18C */
  __IO uint32_t WIR;        /*!< OCTOSPI Write Instruction register,                 Address offset: 0x190 */
  uint32_t RESERVED20[3];   /*!< Reserved,                                           Address offset: 0x194-0x19C */
  __IO uint32_t WABR;       /*!< OCTOSPI Write Alternate Bytes register,             Address offset: 0x1A0 */
  uint32_t RESERVED21[23];  /*!< Reserved,                                           Address offset: 0x1A4-0x1FC */
  __IO uint32_t HLCR;       /*!< OCTOSPI Hyperbus Latency Configuration register,    Address offset: 0x200 */
  uint32_t RESERVED22[122]; /*!< Reserved,                                           Address offset: 0x204-0x3EC */
  __IO uint32_t HWCFGR;     /*!< OCTOSPI HW Configuration register,                  Address offset: 0x3F0 */
  __IO uint32_t VER;        /*!< OCTOSPI Version register,                           Address offset: 0x3F4 */
  __IO uint32_t ID;         /*!< OCTOSPI Identification register,                    Address offset: 0x3F8 */
  __IO uint32_t MID;        /*!< OCTOPSI HW Magic ID register,                       Address offset: 0x3FC */
} OCTOSPI_TypeDef;

/**
 * @}
 */
/**
 * @brief OCTO Serial Peripheral Interface IO Manager
 */

typedef struct
{
  __IO uint32_t CR;     /*!< OCTOSPI IO Manager Control register,                 Address offset: 0x00 */
  __IO uint32_t PCR[3]; /*!< OCTOSPI IO Manager Port[1:3] Configuration register, Address offset: 0x04-0x20 */
} OCTOSPIM_TypeDef;

/**
 * @}
 */

/**
 * @brief Global Programmer View
 */

