Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
typedef struct
{
  uint32_t RESERVED0[2036];      /*!< Reserved,      Address offset: 0x00-0x1FCC     */
  __IO uint32_t AXI_PERIPH_ID_4; /*!< AXI interconnect - peripheral ID4 register, Address offset: 0x1FD0          */
  uint32_t AXI_PERIPH_ID_5;      /*!< Reserved,      Address offset: 0x1FD4          */
  uint32_t AXI_PERIPH_ID_6;      /*!< Reserved,      Address offset: 0x1FD8          */
  uint32_t AXI_PERIPH_ID_7;      /*!< Reserved,      Address offset: 0x1FDC          */
  __IO uint32_t AXI_PERIPH_ID_0; /*!< AXI interconnect - peripheral ID0 register, Address offset: 0x1FE0          */
  __IO uint32_t AXI_PERIPH_ID_1; /*!< AXI interconnect - peripheral ID1 register, Address offset: 0x1FE4          */
  __IO uint32_t AXI_PERIPH_ID_2; /*!< AXI interconnect - peripheral ID2 register, Address offset: 0x1FE8          */
  __IO uint32_t AXI_PERIPH_ID_3; /*!< AXI interconnect - peripheral ID3 register, Address offset: 0x1FEC          */
  __IO uint32_t AXI_COMP_ID_0;   /*!< AXI interconnect - component ID0 register,   Address offset: 0x1FF0          */
  __IO uint32_t AXI_COMP_ID_1;   /*!< AXI interconnect - component ID1 register,   Address offset: 0x1FF4          */
  __IO uint32_t AXI_COMP_ID_2;   /*!< AXI interconnect - component ID2 register,   Address offset: 0x1FF8          */
  __IO uint32_t AXI_COMP_ID_3;   /*!< AXI interconnect - component ID3 register,   Address offset: 0x1FFC          */
  uint32_t RESERVED1[2];         /*!< Reserved,         Address offset: 0x2000-0x2004   */
  __IO uint32_t AXI_TARG1_FN_MOD_ISS_BM; /*!< AXI interconnect - TARG 1 bus matrix issuing functionality register,
                                            Address offset: 0x2008          */
  uint32_t RESERVED2[6];                 /*!< Reserved,                 Address offset: 0x200C-0x2020   */
  __IO uint32_t
    AXI_TARG1_FN_MOD2; /*!< AXI interconnect - TARG 1 bus matrix functionality 2 register, Address offset: 0x2024 */
  uint32_t RESERVED3;  /*!< Reserved,                                                                           Address
                          offset: 0x2028          */
  __IO uint32_t AXI_TARG1_FN_MOD_LB; /*!< AXI interconnect - TARG 1 long burst functionality modification register,
                                        Address offset: 0x202C          */
  uint32_t RESERVED4[54];            /*!< Reserved,            Address offset: 0x2030-0x2104   */
  __IO uint32_t AXI_TARG1_FN_MOD; /*!< AXI interconnect - TARG 1 issuing functionality modification register,    Address
                                     offset: 0x2108          */
  uint32_t RESERVED5[959];        /*!< Reserved,           Address offset: 0x210C-0x3004   */
  __IO uint32_t AXI_TARG2_FN_MOD_ISS_BM; /*!< AXI interconnect - TARG 2 bus matrix issuing functionality register,
                                            Address offset: 0x3008          */
  uint32_t RESERVED6[6];                 /*!< Reserved,                 Address offset: 0x300C-0x3020   */
  __IO uint32_t
    AXI_TARG2_FN_MOD2; /*!< AXI interconnect - TARG 2 bus matrix functionality 2 register, Address offset: 0x3024 */
  uint32_t RESERVED7;  /*!< Reserved,                                                                           Address
                          offset: 0x3028          */
  __IO uint32_t AXI_TARG2_FN_MOD_LB; /*!< AXI interconnect - TARG 2 long burst functionality modification register,
                                        Address offset: 0x302C          */
  uint32_t RESERVED8[54];            /*!< Reserved,            Address offset: 0x3030-0x3104   */
  __IO uint32_t AXI_TARG2_FN_MOD; /*!< AXI interconnect - TARG 2 issuing functionality modification register,    Address
                                     offset: 0x3108          */
  uint32_t RESERVED9[959];        /*!< Reserved,           Address offset: 0x310C-0x4004   */
  __IO uint32_t AXI_TARG3_FN_MOD_ISS_BM; /*!< AXI interconnect - TARG 3 bus matrix issuing functionality register,
                                            Address offset: 0x4008          */
  uint32_t RESERVED10[1023];             /*!< Reserved,             Address offset: 0x400C-0x5004   */
  __IO uint32_t AXI_TARG4_FN_MOD_ISS_BM; /*!< AXI interconnect - TARG 4 bus matrix issuing functionality register,
                                            Address offset: 0x5008          */
  uint32_t RESERVED11[1023];             /*!< Reserved,             Address offset: 0x500C-0x6004   */
  __IO uint32_t AXI_TARG5_FN_MOD_ISS_BM; /*!< AXI interconnect - TARG 5 bus matrix issuing functionality register,
                                            Address offset: 0x6008          */
  uint32_t RESERVED12[1023];             /*!< Reserved,             Address offset: 0x600C-0x7004   */
  __IO uint32_t AXI_TARG6_FN_MOD_ISS_BM; /*!< AXI interconnect - TARG 6 bus matrix issuing functionality register,
                                            Address offset: 0x7008          */
  uint32_t RESERVED13[1023];             /*!< Reserved,             Address offset: 0x700C-0x8004   */
  __IO uint32_t AXI_TARG7_FN_MOD_ISS_BM; /*!< AXI interconnect - TARG 7 bus matrix issuing functionality register,
                                            Address offset: 0x8008          */
  uint32_t RESERVED14[6];                /*!< Reserved,                Address offset: 0x800C-0x8020   */
  __IO uint32_t
    AXI_TARG7_FN_MOD2; /*!< AXI interconnect - TARG 7 bus matrix functionality 2 register, Address offset: 0x8024 */
  uint32_t RESERVED15; /*!< Reserved,                                                                           Address
                          offset: 0x8028          */
  __IO uint32_t AXI_TARG7_FN_MOD_LB; /*!< AXI interconnect - TARG 7 long burst functionality modification register,
                                        Address offset: 0x802C          */
  uint32_t RESERVED16[54];           /*!< Reserved,           Address offset: 0x8030-0x8104   */
  __IO uint32_t AXI_TARG7_FN_MOD; /*!< AXI interconnect - TARG 7 issuing functionality modification register,    Address
                                     offset: 0x8108          */
  uint32_t RESERVED17[959];       /*!< Reserved,          Address offset: 0x810C-0x9004   */
  __IO uint32_t AXI_TARG8_FN_MOD_ISS_BM; /*!< AXI interconnect - TARG 8 bus matrix issuing functionality register,
                                            Address offset: 0x9008          */
  uint32_t RESERVED117[6];               /*!< Reserved,               Address offset: 0x900C-0x9020   */
  __IO uint32_t
    AXI_TARG8_FN_MOD2; /*!< AXI interconnect - TARG 8 bus matrix functionality 2 register, Address offset: 0x9024 */
  uint32_t RESERVED118[56];       /*!< Reserved,       Address offset: 0x9028-0x9104   */
  __IO uint32_t AXI_TARG8_FN_MOD; /*!< AXI interconnect - TARG 8 issuing functionality modification register, Address
                                     offset: 0x9108          */
  uint32_t RESERVED119[959];      /*!< Reserved,      Address offset: 0x910C-0xA004   */
  __IO uint32_t AXI_TARG9_FN_MOD_ISS_BM; /*!< AXI interconnect - TARG 9 bus matrix issuing functionality register,
                                            Address offset: 0xA008          */
  uint32_t RESERVED120[6];               /*!< Reserved,               Address offset: 0xA00C-0xA020   */
  __IO uint32_t
    AXI_TARG9_FN_MOD2; /*!< AXI interconnect - TARG 9 bus matrix functionality 2 register, Address offset: 0xA024 */
  uint32_t RESERVED121[56];       /*!< Reserved,       Address offset: 0xA028-0xA104   */
  __IO uint32_t AXI_TARG9_FN_MOD; /*!< AXI interconnect - TARG 9 issuing functionality modification register, Address
                                     offset: 0xA108          */
  uint32_t RESERVED122[959];      /*!< Reserved,      Address offset: 0xA10C-0xB004   */
  __IO uint32_t AXI_TARG10_FN_MOD_ISS_BM; /*!< AXI interconnect - TARG 10 bus matrix issuing functionality register,
                                             Address offset: 0xB008          */
  uint32_t RESERVED123[6];                /*!< Reserved,                Address offset: 0xB00C-0xB020   */
  __IO uint32_t
    AXI_TARG10_FN_MOD2; /*!< AXI interconnect - TARG 10 bus matrix functionality 2 register, Address offset: 0xB024 */
  uint32_t RESERVED124[56];        /*!< Reserved,        Address offset: 0xB028-0xB104   */
  __IO uint32_t AXI_TARG10_FN_MOD; /*!< AXI interconnect - TARG 10 issuing functionality modification register, Address
                                      offset: 0xB108          */
  uint32_t RESERVED125[968];       /*!< Reserved,       Address offset: 0xB10C-0xC028   */
  __IO uint32_t AXI_TARG10_FN_MOD_LB; /*!< AXI interconnect - TARG 10 long burst functionality modification register,
                                         Address offset: 0xC02C          */
  uint32_t RESERVED126[55293];        /*!< Reserved,        Address offset: 0xC030-0xC104   */
  __IO uint32_t AXI_INI1_FN_MOD2; /*!< AXI interconnect - INI 1 functionality modification 2 register, Address offset:
                                     0x42024         */
  __IO uint32_t
    AXI_INI1_FN_MOD_AHB; /*!< AXI interconnect - INI 1 AHB functionality modification register, Address offset: 0x42028 */
  uint32_t RESERVED18[53];          /*!< Reserved,          Address offset: 0x4202C-0x420FC */
  __IO uint32_t AXI_INI1_READ_QOS;  /*!< AXI interconnect - INI 1 read QoS register,  Address offset: 0x42100         */
  __IO uint32_t AXI_INI1_WRITE_QOS; /*!< AXI interconnect - INI 1 write QoS register, Address offset: 0x42104         */
  __IO uint32_t AXI_INI1_FN_MOD;   /*!< AXI interconnect - INI 1 issuing functionality modification register,    Address
                                      offset: 0x42108         */
  uint32_t RESERVED19[1021];       /*!< Reserved,        Address offset: 0x4210C-0x430FC */
  __IO uint32_t AXI_INI2_READ_QOS; /*!< AXI interconnect - INI 2 read QoS register,  Address offset: 0x43100         */
  __IO uint32_t AXI_INI2_WRITE_QOS; /*!< AXI interconnect - INI 2 write QoS register, Address offset: 0x43104         */
  __IO uint32_t AXI_INI2_FN_MOD;  /*!< AXI interconnect - INI 2 issuing functionality modification register,    Address
                                     offset: 0x43108         */
  uint32_t RESERVED20[966];       /*!< Reserved,         Address offset: 0x4310C-0x44020 */
  __IO uint32_t AXI_INI3_FN_MOD2; /*!< AXI interconnect - INI 3 functionality modification 2 register,   Address offset:
                                     0x44024         */
  __IO uint32_t
    AXI_INI3_FN_MOD_AHB; /*!< AXI interconnect - INI 3 AHB functionality modification register, Address offset: 0x44028 */
  uint32_t RESERVED21[53];          /*!< Reserved,          Address offset: 0x4402C-0x440FC */
  __IO uint32_t AXI_INI3_READ_QOS;  /*!< AXI interconnect - INI 3 read QoS register,  Address offset: 0x44100         */
  __IO uint32_t AXI_INI3_WRITE_QOS; /*!< AXI interconnect - INI 3 write QoS register, Address offset: 0x44104         */
  __IO uint32_t AXI_INI3_FN_MOD;   /*!< AXI interconnect - INI 3 issuing functionality modification register,    Address
                                      offset: 0x44108         */
  uint32_t RESERVED22[1021];       /*!< Reserved,        Address offset: 0x4410C-0x450FC */
  __IO uint32_t AXI_INI4_READ_QOS; /*!< AXI interconnect - INI 4 read QoS register,  Address offset: 0x45100         */
  __IO uint32_t AXI_INI4_WRITE_QOS; /*!< AXI interconnect - INI 4 write QoS register, Address offset: 0x45104         */
  __IO uint32_t AXI_INI4_FN_MOD;   /*!< AXI interconnect - INI 4 issuing functionality modification register,    Address
                                      offset: 0x45108         */
  uint32_t RESERVED23[1021];       /*!< Reserved,        Address offset: 0x4510C-0x460FC */
  __IO uint32_t AXI_INI5_READ_QOS; /*!< AXI interconnect - INI 5 read QoS register,  Address offset: 0x46100         */
  __IO uint32_t AXI_INI5_WRITE_QOS; /*!< AXI interconnect - INI 5 write QoS register, Address offset: 0x46104         */
  __IO uint32_t AXI_INI5_FN_MOD;   /*!< AXI interconnect - INI 5 issuing functionality modification register,    Address
                                      offset: 0x46108         */
  uint32_t RESERVED24[1021];       /*!< Reserved,        Address offset: 0x4610C-0x470FC */
  __IO uint32_t AXI_INI6_READ_QOS; /*!< AXI interconnect - INI 6 read QoS register,  Address offset: 0x47100         */
  __IO uint32_t AXI_INI6_WRITE_QOS; /*!< AXI interconnect - INI 6 write QoS register, Address offset: 0x47104         */
  __IO uint32_t AXI_INI6_FN_MOD;  /*!< AXI interconnect - INI 6 issuing functionality modification register,    Address
                                     offset: 0x47108         */
  uint32_t RESERVED25[966];       /*!< Reserved,         Address offset: 0x4710C-0x48020 */
  __IO uint32_t AXI_INI7_FN_MOD2; /*!< AXI interconnect - INI 7 functionality modification 2 register,   Address offset:
                                     0x48024         */
  __IO uint32_t
    AXI_INI7_FN_MOD_AHB; /*!< AXI interconnect - INI 7 AHB functionality modification register, Address offset: 0x48028 */
  uint32_t RESERVED26[53];          /*!< Reserved,          Address offset: 0x4802C-0x480FC */
  __IO uint32_t AXI_INI7_READ_QOS;  /*!< AXI interconnect - INI 7 read QoS register,  Address offset: 0x48100         */
  __IO uint32_t AXI_INI7_WRITE_QOS; /*!< AXI interconnect - INI 7 write QoS register, Address offset: 0x48104         */
  __IO uint32_t AXI_INI7_FN_MOD; /*!< AXI interconnect - INI 7 issuing functionality modification register,    Address
                                    offset: 0x48108         */

} GPV_TypeDef;

/** @addtogroup Peripheral_memory_map
 * @{
 */
#define CD_ITCMRAM_BASE                                                                                                \
  (0x00000000UL) /*!< Base address of : 64KB RAM reserved for CPU execution/instruction accessible over ITCM  */
#define CD_DTCMRAM_BASE                                                                                                \
  (0x20000000UL) /*!< Base address of : 128KB (2x64KB) system data RAM accessible over DTCM                   */
#define CD_AXIFLASH_BASE                                                                                               \
  (0x08000000UL) /*!< Base address of : (up to 2 MB) embedded FLASH memory accessible over AXI                */

