Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define IWDG1                     ((IWDG_TypeDef*)IWDG1_BASE)
#define SPI2                      ((SPI_TypeDef*)SPI2_BASE)
#define SPI3                      ((SPI_TypeDef*)SPI3_BASE)
#define SPI4                      ((SPI_TypeDef*)SPI4_BASE)
#define SPI5                      ((SPI_TypeDef*)SPI5_BASE)
#define SPI6                      ((SPI_TypeDef*)SPI6_BASE)
#define USART2                    ((USART_TypeDef*)USART2_BASE)
#define USART3                    ((USART_TypeDef*)USART3_BASE)
#define USART6                    ((USART_TypeDef*)USART6_BASE)
#define USART10                   ((USART_TypeDef*)USART10_BASE)
#define UART7                     ((USART_TypeDef*)UART7_BASE)
#define UART8                     ((USART_TypeDef*)UART8_BASE)
#define UART9                     ((USART_TypeDef*)UART9_BASE)
#define CRS                       ((CRS_TypeDef*)CRS_BASE)
#define UART4                     ((USART_TypeDef*)UART4_BASE)
#define UART5                     ((USART_TypeDef*)UART5_BASE)
#define I2C1                      ((I2C_TypeDef*)I2C1_BASE)
#define I2C2                      ((I2C_TypeDef*)I2C2_BASE)
#define I2C3                      ((I2C_TypeDef*)I2C3_BASE)
#define I2C4                      ((I2C_TypeDef*)I2C4_BASE)
#define FDCAN1                    ((FDCAN_GlobalTypeDef*)FDCAN1_BASE)
#define FDCAN2                    ((FDCAN_GlobalTypeDef*)FDCAN2_BASE)
#define FDCAN_CCU                 ((FDCAN_ClockCalibrationUnit_TypeDef*)FDCAN_CCU_BASE)
#define CEC                       ((CEC_TypeDef*)CEC_BASE)
#define LPTIM1                    ((LPTIM_TypeDef*)LPTIM1_BASE)
#define PWR                       ((PWR_TypeDef*)PWR_BASE)
#define DAC1                      ((DAC_TypeDef*)DAC1_BASE)
#define LPUART1                   ((USART_TypeDef*)LPUART1_BASE)
#define SWPMI1                    ((SWPMI_TypeDef*)SWPMI1_BASE)
#define LPTIM2                    ((LPTIM_TypeDef*)LPTIM2_BASE)
#define LPTIM3                    ((LPTIM_TypeDef*)LPTIM3_BASE)
#define DTS                       ((DTS_TypeDef*)DTS_BASE)

#define SYSCFG                    ((SYSCFG_TypeDef*)SYSCFG_BASE)
#define COMP12                    ((COMPOPT_TypeDef*)COMP12_BASE)
#define COMP1                     ((COMP_TypeDef*)COMP1_BASE)
#define COMP2                     ((COMP_TypeDef*)COMP2_BASE)
#define COMP12_COMMON             ((COMP_Common_TypeDef*)COMP2_BASE)
#define OPAMP                     ((OPAMP_TypeDef*)OPAMP_BASE)
#define OPAMP1                    ((OPAMP_TypeDef*)OPAMP1_BASE)
#define OPAMP2                    ((OPAMP_TypeDef*)OPAMP2_BASE)

#define EXTI                      ((EXTI_TypeDef*)EXTI_BASE)
#define EXTI_D1                   ((EXTI_Core_TypeDef*)EXTI_D1_BASE)
#define TIM1                      ((TIM_TypeDef*)TIM1_BASE)
#define SPI1                      ((SPI_TypeDef*)SPI1_BASE)
#define TIM8                      ((TIM_TypeDef*)TIM8_BASE)
#define USART1                    ((USART_TypeDef*)USART1_BASE)
#define TIM12                     ((TIM_TypeDef*)TIM12_BASE)
#define TIM15                     ((TIM_TypeDef*)TIM15_BASE)
#define TIM16                     ((TIM_TypeDef*)TIM16_BASE)
#define TIM17                     ((TIM_TypeDef*)TIM17_BASE)
#define SAI1                      ((SAI_TypeDef*)SAI1_BASE)
#define SAI1_Block_A              ((SAI_Block_TypeDef*)SAI1_Block_A_BASE)
#define SAI1_Block_B              ((SAI_Block_TypeDef*)SAI1_Block_B_BASE)
#define SAI2                      ((SAI_TypeDef*)SAI2_BASE)
#define SAI2_Block_A              ((SAI_Block_TypeDef*)SAI2_Block_A_BASE)
#define SAI2_Block_B              ((SAI_Block_TypeDef*)SAI2_Block_B_BASE)

#define SPDIFRX                   ((SPDIFRX_TypeDef*)SPDIFRX_BASE)
#define DFSDM1_Channel0           ((DFSDM_Channel_TypeDef*)DFSDM1_Channel0_BASE)
#define DFSDM1_Channel1           ((DFSDM_Channel_TypeDef*)DFSDM1_Channel1_BASE)
#define DFSDM1_Channel2           ((DFSDM_Channel_TypeDef*)DFSDM1_Channel2_BASE)
#define DFSDM1_Channel3           ((DFSDM_Channel_TypeDef*)DFSDM1_Channel3_BASE)
#define DFSDM1_Channel4           ((DFSDM_Channel_TypeDef*)DFSDM1_Channel4_BASE)
#define DFSDM1_Channel5           ((DFSDM_Channel_TypeDef*)DFSDM1_Channel5_BASE)
#define DFSDM1_Channel6           ((DFSDM_Channel_TypeDef*)DFSDM1_Channel6_BASE)
#define DFSDM1_Channel7           ((DFSDM_Channel_TypeDef*)DFSDM1_Channel7_BASE)
#define DFSDM1_Filter0            ((DFSDM_Filter_TypeDef*)DFSDM1_Filter0_BASE)
#define DFSDM1_Filter1            ((DFSDM_Filter_TypeDef*)DFSDM1_Filter1_BASE)
#define DFSDM1_Filter2            ((DFSDM_Filter_TypeDef*)DFSDM1_Filter2_BASE)
#define DFSDM1_Filter3            ((DFSDM_Filter_TypeDef*)DFSDM1_Filter3_BASE)
#define DFSDM1_Filter4            ((DFSDM_Filter_TypeDef*)DFSDM1_Filter4_BASE)
#define DFSDM1_Filter5            ((DFSDM_Filter_TypeDef*)DFSDM1_Filter5_BASE)
#define DFSDM1_Filter6            ((DFSDM_Filter_TypeDef*)DFSDM1_Filter6_BASE)
#define DFSDM1_Filter7            ((DFSDM_Filter_TypeDef*)DFSDM1_Filter7_BASE)
#define DFSDM2_Channel0           ((DFSDM_Channel_TypeDef*)DFSDM2_Channel0_BASE)
#define DFSDM2_Channel1           ((DFSDM_Channel_TypeDef*)DFSDM2_Channel1_BASE)
#define DFSDM2_Filter0            ((DFSDM_Filter_TypeDef*)DFSDM2_FLT0_BASE)
#define DMA2D                     ((DMA2D_TypeDef*)DMA2D_BASE)
#define DCMI                      ((DCMI_TypeDef*)DCMI_BASE)
#define PSSI                      ((PSSI_TypeDef*)PSSI_BASE)
#define RCC                       ((RCC_TypeDef*)RCC_BASE)
#define FLASH                     ((FLASH_TypeDef*)FLASH_R_BASE)
#define CRC                       ((CRC_TypeDef*)CRC_BASE)

#define ADC1                      ((ADC_TypeDef*)ADC1_BASE)
#define ADC2                      ((ADC_TypeDef*)ADC2_BASE)
#define ADC12_COMMON              ((ADC_Common_TypeDef*)ADC12_COMMON_BASE)

#define RNG                       ((RNG_TypeDef*)RNG_BASE)
#define SDMMC2                    ((SDMMC_TypeDef*)SDMMC2_BASE)
#define DLYB_SDMMC2               ((DLYB_TypeDef*)DLYB_SDMMC2_BASE)

#define BDMA1                     ((BDMA_TypeDef*)BDMA1_BASE)
#define BDMA1_Channel0            ((BDMA_Channel_TypeDef*)BDMA1_Channel0_BASE)
#define BDMA1_Channel1            ((BDMA_Channel_TypeDef*)BDMA1_Channel1_BASE)
#define BDMA1_Channel2            ((BDMA_Channel_TypeDef*)BDMA1_Channel2_BASE)
#define BDMA1_Channel3            ((BDMA_Channel_TypeDef*)BDMA1_Channel3_BASE)
#define BDMA1_Channel4            ((BDMA_Channel_TypeDef*)BDMA1_Channel4_BASE)
#define BDMA1_Channel5            ((BDMA_Channel_TypeDef*)BDMA1_Channel5_BASE)
#define BDMA1_Channel6            ((BDMA_Channel_TypeDef*)BDMA1_Channel6_BASE)
#define BDMA1_Channel7            ((BDMA_Channel_TypeDef*)BDMA1_Channel7_BASE)

