Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define BDMA2                     ((BDMA_TypeDef*)BDMA2_BASE)
#define BDMA2_Channel0            ((BDMA_Channel_TypeDef*)BDMA2_Channel0_BASE)
#define BDMA2_Channel1            ((BDMA_Channel_TypeDef*)BDMA2_Channel1_BASE)
#define BDMA2_Channel2            ((BDMA_Channel_TypeDef*)BDMA2_Channel2_BASE)
#define BDMA2_Channel3            ((BDMA_Channel_TypeDef*)BDMA2_Channel3_BASE)
#define BDMA2_Channel4            ((BDMA_Channel_TypeDef*)BDMA2_Channel4_BASE)
#define BDMA2_Channel5            ((BDMA_Channel_TypeDef*)BDMA2_Channel5_BASE)
#define BDMA2_Channel6            ((BDMA_Channel_TypeDef*)BDMA2_Channel6_BASE)
#define BDMA2_Channel7            ((BDMA_Channel_TypeDef*)BDMA2_Channel7_BASE)

#define RAMECC                    ((RAMECC_TypeDef*)RAMECC_BASE)
#define RAMECC_Monitor1           ((RAMECC_MonitorTypeDef*)RAMECC_Monitor1_BASE)
#define RAMECC_Monitor2           ((RAMECC_MonitorTypeDef*)RAMECC_Monitor2_BASE)
#define RAMECC_Monitor3           ((RAMECC_MonitorTypeDef*)RAMECC_Monitor3_BASE)

#define DMAMUX2                   ((DMAMUX_Channel_TypeDef*)DMAMUX2_BASE)
#define DMAMUX2_Channel0          ((DMAMUX_Channel_TypeDef*)DMAMUX2_Channel0_BASE)
#define DMAMUX2_Channel1          ((DMAMUX_Channel_TypeDef*)DMAMUX2_Channel1_BASE)
#define DMAMUX2_Channel2          ((DMAMUX_Channel_TypeDef*)DMAMUX2_Channel2_BASE)
#define DMAMUX2_Channel3          ((DMAMUX_Channel_TypeDef*)DMAMUX2_Channel3_BASE)
#define DMAMUX2_Channel4          ((DMAMUX_Channel_TypeDef*)DMAMUX2_Channel4_BASE)
#define DMAMUX2_Channel5          ((DMAMUX_Channel_TypeDef*)DMAMUX2_Channel5_BASE)
#define DMAMUX2_Channel6          ((DMAMUX_Channel_TypeDef*)DMAMUX2_Channel6_BASE)
#define DMAMUX2_Channel7          ((DMAMUX_Channel_TypeDef*)DMAMUX2_Channel7_BASE)

#define DMAMUX2_RequestGenerator0 ((DMAMUX_RequestGen_TypeDef*)DMAMUX2_RequestGenerator0_BASE)
#define DMAMUX2_RequestGenerator1 ((DMAMUX_RequestGen_TypeDef*)DMAMUX2_RequestGenerator1_BASE)
#define DMAMUX2_RequestGenerator2 ((DMAMUX_RequestGen_TypeDef*)DMAMUX2_RequestGenerator2_BASE)
#define DMAMUX2_RequestGenerator3 ((DMAMUX_RequestGen_TypeDef*)DMAMUX2_RequestGenerator3_BASE)
#define DMAMUX2_RequestGenerator4 ((DMAMUX_RequestGen_TypeDef*)DMAMUX2_RequestGenerator4_BASE)
#define DMAMUX2_RequestGenerator5 ((DMAMUX_RequestGen_TypeDef*)DMAMUX2_RequestGenerator5_BASE)
#define DMAMUX2_RequestGenerator6 ((DMAMUX_RequestGen_TypeDef*)DMAMUX2_RequestGenerator6_BASE)
#define DMAMUX2_RequestGenerator7 ((DMAMUX_RequestGen_TypeDef*)DMAMUX2_RequestGenerator7_BASE)

#define DMAMUX2_ChannelStatus     ((DMAMUX_ChannelStatus_TypeDef*)DMAMUX2_ChannelStatus_BASE)
#define DMAMUX2_RequestGenStatus  ((DMAMUX_RequestGenStatus_TypeDef*)DMAMUX2_RequestGenStatus_BASE)

#define DMA2                      ((DMA_TypeDef*)DMA2_BASE)
#define DMA2_Stream0              ((DMA_Stream_TypeDef*)DMA2_Stream0_BASE)
#define DMA2_Stream1              ((DMA_Stream_TypeDef*)DMA2_Stream1_BASE)
#define DMA2_Stream2              ((DMA_Stream_TypeDef*)DMA2_Stream2_BASE)
#define DMA2_Stream3              ((DMA_Stream_TypeDef*)DMA2_Stream3_BASE)
#define DMA2_Stream4              ((DMA_Stream_TypeDef*)DMA2_Stream4_BASE)
#define DMA2_Stream5              ((DMA_Stream_TypeDef*)DMA2_Stream5_BASE)
#define DMA2_Stream6              ((DMA_Stream_TypeDef*)DMA2_Stream6_BASE)
#define DMA2_Stream7              ((DMA_Stream_TypeDef*)DMA2_Stream7_BASE)

#define DMA1                      ((DMA_TypeDef*)DMA1_BASE)
#define DMA1_Stream0              ((DMA_Stream_TypeDef*)DMA1_Stream0_BASE)
#define DMA1_Stream1              ((DMA_Stream_TypeDef*)DMA1_Stream1_BASE)
#define DMA1_Stream2              ((DMA_Stream_TypeDef*)DMA1_Stream2_BASE)
#define DMA1_Stream3              ((DMA_Stream_TypeDef*)DMA1_Stream3_BASE)
#define DMA1_Stream4              ((DMA_Stream_TypeDef*)DMA1_Stream4_BASE)
#define DMA1_Stream5              ((DMA_Stream_TypeDef*)DMA1_Stream5_BASE)
#define DMA1_Stream6              ((DMA_Stream_TypeDef*)DMA1_Stream6_BASE)
#define DMA1_Stream7              ((DMA_Stream_TypeDef*)DMA1_Stream7_BASE)

#define DMAMUX1                   ((DMAMUX_Channel_TypeDef*)DMAMUX1_BASE)
#define DMAMUX1_Channel0          ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel0_BASE)
#define DMAMUX1_Channel1          ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel1_BASE)
#define DMAMUX1_Channel2          ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel2_BASE)
#define DMAMUX1_Channel3          ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel3_BASE)
#define DMAMUX1_Channel4          ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel4_BASE)
#define DMAMUX1_Channel5          ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel5_BASE)
#define DMAMUX1_Channel6          ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel6_BASE)
#define DMAMUX1_Channel7          ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel7_BASE)
#define DMAMUX1_Channel8          ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel8_BASE)
#define DMAMUX1_Channel9          ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel9_BASE)
#define DMAMUX1_Channel10         ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel10_BASE)
#define DMAMUX1_Channel11         ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel11_BASE)
#define DMAMUX1_Channel12         ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel12_BASE)
#define DMAMUX1_Channel13         ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel13_BASE)
#define DMAMUX1_Channel14         ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel14_BASE)
#define DMAMUX1_Channel15         ((DMAMUX_Channel_TypeDef*)DMAMUX1_Channel15_BASE)

#define DMAMUX1_RequestGenerator0 ((DMAMUX_RequestGen_TypeDef*)DMAMUX1_RequestGenerator0_BASE)
#define DMAMUX1_RequestGenerator1 ((DMAMUX_RequestGen_TypeDef*)DMAMUX1_RequestGenerator1_BASE)
#define DMAMUX1_RequestGenerator2 ((DMAMUX_RequestGen_TypeDef*)DMAMUX1_RequestGenerator2_BASE)
#define DMAMUX1_RequestGenerator3 ((DMAMUX_RequestGen_TypeDef*)DMAMUX1_RequestGenerator3_BASE)
#define DMAMUX1_RequestGenerator4 ((DMAMUX_RequestGen_TypeDef*)DMAMUX1_RequestGenerator4_BASE)
#define DMAMUX1_RequestGenerator5 ((DMAMUX_RequestGen_TypeDef*)DMAMUX1_RequestGenerator5_BASE)
#define DMAMUX1_RequestGenerator6 ((DMAMUX_RequestGen_TypeDef*)DMAMUX1_RequestGenerator6_BASE)
#define DMAMUX1_RequestGenerator7 ((DMAMUX_RequestGen_TypeDef*)DMAMUX1_RequestGenerator7_BASE)

#define DMAMUX1_ChannelStatus     ((DMAMUX_ChannelStatus_TypeDef*)DMAMUX1_ChannelStatus_BASE)
#define DMAMUX1_RequestGenStatus  ((DMAMUX_RequestGenStatus_TypeDef*)DMAMUX1_RequestGenStatus_BASE)

#define FMC_Bank1_R               ((FMC_Bank1_TypeDef*)FMC_Bank1_R_BASE)
#define FMC_Bank1E_R              ((FMC_Bank1E_TypeDef*)FMC_Bank1E_R_BASE)
#define FMC_Bank2_R               ((FMC_Bank2_TypeDef*)FMC_Bank2_R_BASE)
#define FMC_Bank3_R               ((FMC_Bank3_TypeDef*)FMC_Bank3_R_BASE)
#define FMC_Bank5_6_R             ((FMC_Bank5_6_TypeDef*)FMC_Bank5_6_R_BASE)

#define DAC2                      ((DAC_TypeDef*)DAC2_BASE)
#define OCTOSPI1                  ((OCTOSPI_TypeDef*)OCTOSPI1_R_BASE)
#define DLYB_OCTOSPI1             ((DLYB_TypeDef*)DLYB_OCTOSPI1_BASE)
#define OCTOSPI2                  ((OCTOSPI_TypeDef*)OCTOSPI2_R_BASE)
#define DLYB_OCTOSPI2             ((DLYB_TypeDef*)DLYB_OCTOSPI2_BASE)
#define OCTOSPIM                  ((OCTOSPIM_TypeDef*)OCTOSPIM_BASE)
#define GFXMMU                    ((GFXMMU_TypeDef*)GFXMMU_BASE)

