Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define SDMMC1                    ((SDMMC_TypeDef*)SDMMC1_BASE)
#define DLYB_SDMMC1               ((DLYB_TypeDef*)DLYB_SDMMC1_BASE)

#define DBGMCU                    ((DBGMCU_TypeDef*)DBGMCU_BASE)

#define JPEG                      ((JPEG_TypeDef*)JPGDEC_BASE)
#define HSEM                      ((HSEM_TypeDef*)HSEM_BASE)
#define HSEM_COMMON               ((HSEM_Common_TypeDef*)(HSEM_BASE + 0x100UL))

#define LTDC                      ((LTDC_TypeDef*)LTDC_BASE)
#define LTDC_Layer1               ((LTDC_Layer_TypeDef*)LTDC_Layer1_BASE)
#define LTDC_Layer2               ((LTDC_Layer_TypeDef*)LTDC_Layer2_BASE)

#define MDIOS                     ((MDIOS_TypeDef*)MDIOS_BASE)

#define MDMA                      ((MDMA_TypeDef*)MDMA_BASE)
#define MDMA_Channel0             ((MDMA_Channel_TypeDef*)MDMA_Channel0_BASE)
#define MDMA_Channel1             ((MDMA_Channel_TypeDef*)MDMA_Channel1_BASE)
#define MDMA_Channel2             ((MDMA_Channel_TypeDef*)MDMA_Channel2_BASE)
#define MDMA_Channel3             ((MDMA_Channel_TypeDef*)MDMA_Channel3_BASE)
#define MDMA_Channel4             ((MDMA_Channel_TypeDef*)MDMA_Channel4_BASE)
#define MDMA_Channel5             ((MDMA_Channel_TypeDef*)MDMA_Channel5_BASE)
#define MDMA_Channel6             ((MDMA_Channel_TypeDef*)MDMA_Channel6_BASE)
#define MDMA_Channel7             ((MDMA_Channel_TypeDef*)MDMA_Channel7_BASE)
#define MDMA_Channel8             ((MDMA_Channel_TypeDef*)MDMA_Channel8_BASE)
#define MDMA_Channel9             ((MDMA_Channel_TypeDef*)MDMA_Channel9_BASE)
#define MDMA_Channel10            ((MDMA_Channel_TypeDef*)MDMA_Channel10_BASE)
#define MDMA_Channel11            ((MDMA_Channel_TypeDef*)MDMA_Channel11_BASE)
#define MDMA_Channel12            ((MDMA_Channel_TypeDef*)MDMA_Channel12_BASE)
#define MDMA_Channel13            ((MDMA_Channel_TypeDef*)MDMA_Channel13_BASE)
#define MDMA_Channel14            ((MDMA_Channel_TypeDef*)MDMA_Channel14_BASE)
#define MDMA_Channel15            ((MDMA_Channel_TypeDef*)MDMA_Channel15_BASE)

#define USB1_OTG_HS               ((USB_OTG_GlobalTypeDef*)USB1_OTG_HS_PERIPH_BASE)

/* Legacy defines */
#define USB_OTG_HS             USB1_OTG_HS
#define USB_OTG_HS_PERIPH_BASE USB1_OTG_HS_PERIPH_BASE

#define GPV                    ((GPV_TypeDef*)GPV_BASE)

/**
 * @}
 */

/** @addtogroup Exported_constants
 * @{
 */

/** @addtogroup Hardware_Constant_Definition
 * @{
 */
#define LSI_STARTUP_TIME 130U /*!< LSI Maximum startup time in us */

/**
 * @}
 */

/** @addtogroup Peripheral_Registers_Bits_Definition
 * @{
 */

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter                         */
/*                                                                            */
/******************************************************************************/
/*******************************  ADC VERSION  ********************************/
#define ADC_VER_V5_3
/********************  Bit definition for ADC_ISR register  ********************/
#define ADC_ISR_ADRDY_Pos  (0U)
#define ADC_ISR_ADRDY_Msk  (0x1UL << ADC_ISR_ADRDY_Pos) /*!< 0x00000001 */
#define ADC_ISR_ADRDY      ADC_ISR_ADRDY_Msk            /*!< ADC Ready (ADRDY) flag  */
#define ADC_ISR_EOSMP_Pos  (1U)
#define ADC_ISR_EOSMP_Msk  (0x1UL << ADC_ISR_EOSMP_Pos) /*!< 0x00000002 */
#define ADC_ISR_EOSMP      ADC_ISR_EOSMP_Msk            /*!< ADC End of Sampling flag */
#define ADC_ISR_EOC_Pos    (2U)
#define ADC_ISR_EOC_Msk    (0x1UL << ADC_ISR_EOC_Pos) /*!< 0x00000004 */
#define ADC_ISR_EOC        ADC_ISR_EOC_Msk            /*!< ADC End of Regular Conversion flag */
#define ADC_ISR_EOS_Pos    (3U)
#define ADC_ISR_EOS_Msk    (0x1UL << ADC_ISR_EOS_Pos) /*!< 0x00000008 */
#define ADC_ISR_EOS        ADC_ISR_EOS_Msk            /*!< ADC End of Regular sequence of Conversions flag */
#define ADC_ISR_OVR_Pos    (4U)
#define ADC_ISR_OVR_Msk    (0x1UL << ADC_ISR_OVR_Pos) /*!< 0x00000010 */
#define ADC_ISR_OVR        ADC_ISR_OVR_Msk            /*!< ADC overrun flag */
#define ADC_ISR_JEOC_Pos   (5U)
#define ADC_ISR_JEOC_Msk   (0x1UL << ADC_ISR_JEOC_Pos) /*!< 0x00000020 */
#define ADC_ISR_JEOC       ADC_ISR_JEOC_Msk            /*!< ADC End of Injected Conversion flag */
#define ADC_ISR_JEOS_Pos   (6U)
#define ADC_ISR_JEOS_Msk   (0x1UL << ADC_ISR_JEOS_Pos) /*!< 0x00000040 */
#define ADC_ISR_JEOS       ADC_ISR_JEOS_Msk            /*!< ADC End of Injected sequence of Conversions flag */
#define ADC_ISR_AWD1_Pos   (7U)
#define ADC_ISR_AWD1_Msk   (0x1UL << ADC_ISR_AWD1_Pos) /*!< 0x00000080 */
#define ADC_ISR_AWD1       ADC_ISR_AWD1_Msk            /*!< ADC Analog watchdog 1 flag */
#define ADC_ISR_AWD2_Pos   (8U)
#define ADC_ISR_AWD2_Msk   (0x1UL << ADC_ISR_AWD2_Pos) /*!< 0x00000100 */
#define ADC_ISR_AWD2       ADC_ISR_AWD2_Msk            /*!< ADC Analog watchdog 2 flag */
#define ADC_ISR_AWD3_Pos   (9U)
#define ADC_ISR_AWD3_Msk   (0x1UL << ADC_ISR_AWD3_Pos) /*!< 0x00000200 */
#define ADC_ISR_AWD3       ADC_ISR_AWD3_Msk            /*!< ADC Analog watchdog 3 flag */
#define ADC_ISR_JQOVF_Pos  (10U)
#define ADC_ISR_JQOVF_Msk  (0x1UL << ADC_ISR_JQOVF_Pos) /*!< 0x00000400 */
#define ADC_ISR_JQOVF      ADC_ISR_JQOVF_Msk            /*!< ADC Injected Context Queue Overflow flag */
#define ADC_ISR_LDORDY_Pos (12U)
#define ADC_ISR_LDORDY_Msk (0x1UL << ADC_ISR_LDORDY_Pos) /*!< 0x00001000 */
#define ADC_ISR_LDORDY     ADC_ISR_LDORDY_Msk            /*!< ADC LDO output voltage ready bit */

/********************  Bit definition for ADC_IER register  ********************/
#define ADC_IER_ADRDYIE_Pos (0U)
#define ADC_IER_ADRDYIE_Msk (0x1UL << ADC_IER_ADRDYIE_Pos) /*!< 0x00000001 */
#define ADC_IER_ADRDYIE     ADC_IER_ADRDYIE_Msk            /*!< ADC Ready (ADRDY) interrupt source */
#define ADC_IER_EOSMPIE_Pos (1U)
#define ADC_IER_EOSMPIE_Msk (0x1UL << ADC_IER_EOSMPIE_Pos) /*!< 0x00000002 */
#define ADC_IER_EOSMPIE     ADC_IER_EOSMPIE_Msk            /*!< ADC End of Sampling interrupt source */
#define ADC_IER_EOCIE_Pos   (2U)
#define ADC_IER_EOCIE_Msk   (0x1UL << ADC_IER_EOCIE_Pos) /*!< 0x00000004 */
#define ADC_IER_EOCIE       ADC_IER_EOCIE_Msk            /*!< ADC End of Regular Conversion interrupt source */
#define ADC_IER_EOSIE_Pos   (3U)
#define ADC_IER_EOSIE_Msk   (0x1UL << ADC_IER_EOSIE_Pos) /*!< 0x00000008 */
#define ADC_IER_EOSIE       ADC_IER_EOSIE_Msk /*!< ADC End of Regular sequence of Conversions interrupt source */
#define ADC_IER_OVRIE_Pos   (4U)
#define ADC_IER_OVRIE_Msk   (0x1UL << ADC_IER_OVRIE_Pos) /*!< 0x00000010 */
#define ADC_IER_OVRIE       ADC_IER_OVRIE_Msk            /*!< ADC overrun interrupt source */
#define ADC_IER_JEOCIE_Pos  (5U)
#define ADC_IER_JEOCIE_Msk  (0x1UL << ADC_IER_JEOCIE_Pos) /*!< 0x00000020 */
#define ADC_IER_JEOCIE      ADC_IER_JEOCIE_Msk            /*!< ADC End of Injected Conversion interrupt source */
#define ADC_IER_JEOSIE_Pos  (6U)
#define ADC_IER_JEOSIE_Msk  (0x1UL << ADC_IER_JEOSIE_Pos) /*!< 0x00000040 */
#define ADC_IER_JEOSIE      ADC_IER_JEOSIE_Msk /*!< ADC End of Injected sequence of Conversions interrupt source */
#define ADC_IER_AWD1IE_Pos  (7U)
#define ADC_IER_AWD1IE_Msk  (0x1UL << ADC_IER_AWD1IE_Pos) /*!< 0x00000080 */
#define ADC_IER_AWD1IE      ADC_IER_AWD1IE_Msk            /*!< ADC Analog watchdog 1 interrupt source */
#define ADC_IER_AWD2IE_Pos  (8U)
#define ADC_IER_AWD2IE_Msk  (0x1UL << ADC_IER_AWD2IE_Pos) /*!< 0x00000100 */
#define ADC_IER_AWD2IE      ADC_IER_AWD2IE_Msk            /*!< ADC Analog watchdog 2 interrupt source */
#define ADC_IER_AWD3IE_Pos  (9U)
#define ADC_IER_AWD3IE_Msk  (0x1UL << ADC_IER_AWD3IE_Pos) /*!< 0x00000200 */
#define ADC_IER_AWD3IE      ADC_IER_AWD3IE_Msk            /*!< ADC Analog watchdog 3 interrupt source */
#define ADC_IER_JQOVFIE_Pos (10U)
#define ADC_IER_JQOVFIE_Msk (0x1UL << ADC_IER_JQOVFIE_Pos) /*!< 0x00000400 */
#define ADC_IER_JQOVFIE     ADC_IER_JQOVFIE_Msk            /*!< ADC Injected Context Queue Overflow interrupt source */

/********************  Bit definition for ADC_CR register  ********************/
#define ADC_CR_ADEN_Pos        (0U)
#define ADC_CR_ADEN_Msk        (0x1UL << ADC_CR_ADEN_Pos) /*!< 0x00000001 */
#define ADC_CR_ADEN            ADC_CR_ADEN_Msk            /*!< ADC Enable control */
#define ADC_CR_ADDIS_Pos       (1U)
#define ADC_CR_ADDIS_Msk       (0x1UL << ADC_CR_ADDIS_Pos) /*!< 0x00000002 */
#define ADC_CR_ADDIS           ADC_CR_ADDIS_Msk            /*!< ADC Disable command */
#define ADC_CR_ADSTART_Pos     (2U)
#define ADC_CR_ADSTART_Msk     (0x1UL << ADC_CR_ADSTART_Pos) /*!< 0x00000004 */
#define ADC_CR_ADSTART         ADC_CR_ADSTART_Msk            /*!< ADC Start of Regular conversion */
#define ADC_CR_JADSTART_Pos    (3U)
#define ADC_CR_JADSTART_Msk    (0x1UL << ADC_CR_JADSTART_Pos) /*!< 0x00000008 */
#define ADC_CR_JADSTART        ADC_CR_JADSTART_Msk            /*!< ADC Start of injected conversion */
#define ADC_CR_ADSTP_Pos       (4U)
#define ADC_CR_ADSTP_Msk       (0x1UL << ADC_CR_ADSTP_Pos) /*!< 0x00000010 */
#define ADC_CR_ADSTP           ADC_CR_ADSTP_Msk            /*!< ADC Stop of Regular conversion */
#define ADC_CR_JADSTP_Pos      (5U)
#define ADC_CR_JADSTP_Msk      (0x1UL << ADC_CR_JADSTP_Pos) /*!< 0x00000020 */
#define ADC_CR_JADSTP          ADC_CR_JADSTP_Msk            /*!< ADC Stop of injected conversion */
#define ADC_CR_BOOST_Pos       (8U)
#define ADC_CR_BOOST_Msk       (0x3UL << ADC_CR_BOOST_Pos) /*!< 0x00000300 */
#define ADC_CR_BOOST           ADC_CR_BOOST_Msk            /*!< ADC Boost Mode configuration */
#define ADC_CR_BOOST_0         (0x1UL << ADC_CR_BOOST_Pos) /*!< 0x00000100 */
#define ADC_CR_BOOST_1         (0x2UL << ADC_CR_BOOST_Pos) /*!< 0x00000200 */
#define ADC_CR_ADCALLIN_Pos    (16U)
#define ADC_CR_ADCALLIN_Msk    (0x1UL << ADC_CR_ADCALLIN_Pos) /*!< 0x00010000 */
#define ADC_CR_ADCALLIN        ADC_CR_ADCALLIN_Msk            /*!< ADC Linearity calibration */
#define ADC_CR_LINCALRDYW1_Pos (22U)
#define ADC_CR_LINCALRDYW1_Msk (0x1UL << ADC_CR_LINCALRDYW1_Pos) /*!< 0x00400000 */
#define ADC_CR_LINCALRDYW1     ADC_CR_LINCALRDYW1_Msk            /*!< ADC Linearity calibration ready Word 1 */
#define ADC_CR_LINCALRDYW2_Pos (23U)
#define ADC_CR_LINCALRDYW2_Msk (0x1UL << ADC_CR_LINCALRDYW2_Pos) /*!< 0x00800000 */
#define ADC_CR_LINCALRDYW2     ADC_CR_LINCALRDYW2_Msk            /*!< ADC Linearity calibration ready Word 2 */
#define ADC_CR_LINCALRDYW3_Pos (24U)
#define ADC_CR_LINCALRDYW3_Msk (0x1UL << ADC_CR_LINCALRDYW3_Pos) /*!< 0x01000000 */
#define ADC_CR_LINCALRDYW3     ADC_CR_LINCALRDYW3_Msk            /*!< ADC Linearity calibration ready Word 3 */
#define ADC_CR_LINCALRDYW4_Pos (25U)
#define ADC_CR_LINCALRDYW4_Msk (0x1UL << ADC_CR_LINCALRDYW4_Pos) /*!< 0x02000000 */
#define ADC_CR_LINCALRDYW4     ADC_CR_LINCALRDYW4_Msk            /*!< ADC Linearity calibration ready Word 4 */
#define ADC_CR_LINCALRDYW5_Pos (26U)
#define ADC_CR_LINCALRDYW5_Msk (0x1UL << ADC_CR_LINCALRDYW5_Pos) /*!< 0x04000000 */
#define ADC_CR_LINCALRDYW5     ADC_CR_LINCALRDYW5_Msk            /*!< ADC Linearity calibration ready Word 5 */
#define ADC_CR_LINCALRDYW6_Pos (27U)
#define ADC_CR_LINCALRDYW6_Msk (0x1UL << ADC_CR_LINCALRDYW6_Pos) /*!< 0x08000000 */
#define ADC_CR_LINCALRDYW6     ADC_CR_LINCALRDYW6_Msk            /*!< ADC Linearity calibration ready Word 6 */
#define ADC_CR_ADVREGEN_Pos    (28U)
#define ADC_CR_ADVREGEN_Msk    (0x1UL << ADC_CR_ADVREGEN_Pos) /*!< 0x10000000 */
#define ADC_CR_ADVREGEN        ADC_CR_ADVREGEN_Msk            /*!< ADC Voltage regulator Enable */
#define ADC_CR_DEEPPWD_Pos     (29U)
#define ADC_CR_DEEPPWD_Msk     (0x1UL << ADC_CR_DEEPPWD_Pos) /*!< 0x20000000 */
#define ADC_CR_DEEPPWD         ADC_CR_DEEPPWD_Msk            /*!< ADC Deep power down Enable */
#define ADC_CR_ADCALDIF_Pos    (30U)
#define ADC_CR_ADCALDIF_Msk    (0x1UL << ADC_CR_ADCALDIF_Pos) /*!< 0x40000000 */
#define ADC_CR_ADCALDIF        ADC_CR_ADCALDIF_Msk            /*!< ADC Differential Mode for calibration */
#define ADC_CR_ADCAL_Pos       (31U)
#define ADC_CR_ADCAL_Msk       (0x1UL << ADC_CR_ADCAL_Pos) /*!< 0x80000000 */
#define ADC_CR_ADCAL           ADC_CR_ADCAL_Msk            /*!< ADC Calibration */

