Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bit definition for ADC_CFGR register  ********************/
#define ADC_CFGR_DMNGT_Pos  (0U)
#define ADC_CFGR_DMNGT_Msk  (0x3UL << ADC_CFGR_DMNGT_Pos) /*!< 0x00000003 */
#define ADC_CFGR_DMNGT      ADC_CFGR_DMNGT_Msk            /*!< ADC Data Management configuration */
#define ADC_CFGR_DMNGT_0    (0x1UL << ADC_CFGR_DMNGT_Pos) /*!< 0x00000001 */
#define ADC_CFGR_DMNGT_1    (0x2UL << ADC_CFGR_DMNGT_Pos) /*!< 0x00000002 */

#define ADC_CFGR_RES_Pos    (2U)
#define ADC_CFGR_RES_Msk    (0x7UL << ADC_CFGR_RES_Pos) /*!< 0x0000001C */
#define ADC_CFGR_RES        ADC_CFGR_RES_Msk            /*!< ADC Data resolution */
#define ADC_CFGR_RES_0      (0x1UL << ADC_CFGR_RES_Pos) /*!< 0x00000004 */
#define ADC_CFGR_RES_1      (0x2UL << ADC_CFGR_RES_Pos) /*!< 0x00000008 */
#define ADC_CFGR_RES_2      (0x4UL << ADC_CFGR_RES_Pos) /*!< 0x00000010 */

#define ADC_CFGR_EXTSEL_Pos (5U)
#define ADC_CFGR_EXTSEL_Msk (0x1FUL << ADC_CFGR_EXTSEL_Pos) /*!< 0x000003E0 */
#define ADC_CFGR_EXTSEL     ADC_CFGR_EXTSEL_Msk             /*!< ADC External trigger selection for regular group */
#define ADC_CFGR_EXTSEL_0   (0x01UL << ADC_CFGR_EXTSEL_Pos) /*!< 0x00000020 */
#define ADC_CFGR_EXTSEL_1   (0x02UL << ADC_CFGR_EXTSEL_Pos) /*!< 0x00000040 */
#define ADC_CFGR_EXTSEL_2   (0x04UL << ADC_CFGR_EXTSEL_Pos) /*!< 0x00000080 */
#define ADC_CFGR_EXTSEL_3   (0x08UL << ADC_CFGR_EXTSEL_Pos) /*!< 0x00000100 */
#define ADC_CFGR_EXTSEL_4   (0x10UL << ADC_CFGR_EXTSEL_Pos) /*!< 0x00000200 */

#define ADC_CFGR_EXTEN_Pos  (10U)
#define ADC_CFGR_EXTEN_Msk  (0x3UL << ADC_CFGR_EXTEN_Pos) /*!< 0x00000C00 */
#define ADC_CFGR_EXTEN                                                                                                 \
  ADC_CFGR_EXTEN_Msk /*!< ADC External trigger enable and polarity selection for regular channels */
#define ADC_CFGR_EXTEN_0     (0x1UL << ADC_CFGR_EXTEN_Pos) /*!< 0x00000400 */
#define ADC_CFGR_EXTEN_1     (0x2UL << ADC_CFGR_EXTEN_Pos) /*!< 0x00000800 */

#define ADC_CFGR_OVRMOD_Pos  (12U)
#define ADC_CFGR_OVRMOD_Msk  (0x1UL << ADC_CFGR_OVRMOD_Pos) /*!< 0x00001000 */
#define ADC_CFGR_OVRMOD      ADC_CFGR_OVRMOD_Msk            /*!< ADC overrun mode */
#define ADC_CFGR_CONT_Pos    (13U)
#define ADC_CFGR_CONT_Msk    (0x1UL << ADC_CFGR_CONT_Pos) /*!< 0x00002000 */
#define ADC_CFGR_CONT        ADC_CFGR_CONT_Msk /*!< ADC Single/continuous conversion mode for regular conversion */
#define ADC_CFGR_AUTDLY_Pos  (14U)
#define ADC_CFGR_AUTDLY_Msk  (0x1UL << ADC_CFGR_AUTDLY_Pos) /*!< 0x00004000 */
#define ADC_CFGR_AUTDLY      ADC_CFGR_AUTDLY_Msk            /*!< ADC Delayed conversion mode */

#define ADC_CFGR_DISCEN_Pos  (16U)
#define ADC_CFGR_DISCEN_Msk  (0x1UL << ADC_CFGR_DISCEN_Pos) /*!< 0x00010000 */
#define ADC_CFGR_DISCEN      ADC_CFGR_DISCEN_Msk            /*!< ADC Discontinuous mode for regular channels */

#define ADC_CFGR_DISCNUM_Pos (17U)
#define ADC_CFGR_DISCNUM_Msk (0x7UL << ADC_CFGR_DISCNUM_Pos) /*!< 0x000E0000 */
#define ADC_CFGR_DISCNUM     ADC_CFGR_DISCNUM_Msk            /*!< ADC Discontinuous mode channel count */
#define ADC_CFGR_DISCNUM_0   (0x1UL << ADC_CFGR_DISCNUM_Pos) /*!< 0x00020000 */
#define ADC_CFGR_DISCNUM_1   (0x2UL << ADC_CFGR_DISCNUM_Pos) /*!< 0x00040000 */
#define ADC_CFGR_DISCNUM_2   (0x4UL << ADC_CFGR_DISCNUM_Pos) /*!< 0x00080000 */

#define ADC_CFGR_JDISCEN_Pos (20U)
#define ADC_CFGR_JDISCEN_Msk (0x1UL << ADC_CFGR_JDISCEN_Pos) /*!< 0x00100000 */
#define ADC_CFGR_JDISCEN     ADC_CFGR_JDISCEN_Msk            /*!< ADC Discontinuous mode on injected channels */
#define ADC_CFGR_JQM_Pos     (21U)
#define ADC_CFGR_JQM_Msk     (0x1UL << ADC_CFGR_JQM_Pos) /*!< 0x00200000 */
#define ADC_CFGR_JQM         ADC_CFGR_JQM_Msk            /*!< ADC JSQR Queue mode */
#define ADC_CFGR_AWD1SGL_Pos (22U)
#define ADC_CFGR_AWD1SGL_Msk (0x1UL << ADC_CFGR_AWD1SGL_Pos) /*!< 0x00400000 */
#define ADC_CFGR_AWD1SGL     ADC_CFGR_AWD1SGL_Msk /*!< Enable the watchdog 1 on a single channel or on all channels */
#define ADC_CFGR_AWD1EN_Pos  (23U)
#define ADC_CFGR_AWD1EN_Msk  (0x1UL << ADC_CFGR_AWD1EN_Pos) /*!< 0x00800000 */
#define ADC_CFGR_AWD1EN      ADC_CFGR_AWD1EN_Msk            /*!< ADC Analog watchdog 1 enable on regular Channels */
#define ADC_CFGR_JAWD1EN_Pos (24U)
#define ADC_CFGR_JAWD1EN_Msk (0x1UL << ADC_CFGR_JAWD1EN_Pos) /*!< 0x01000000 */
#define ADC_CFGR_JAWD1EN     ADC_CFGR_JAWD1EN_Msk            /*!< ADC Analog watchdog 1 enable on injected Channels */
#define ADC_CFGR_JAUTO_Pos   (25U)
#define ADC_CFGR_JAUTO_Msk   (0x1UL << ADC_CFGR_JAUTO_Pos) /*!< 0x02000000 */
#define ADC_CFGR_JAUTO       ADC_CFGR_JAUTO_Msk            /*!< ADC Automatic injected group conversion */

#define ADC_CFGR_AWD1CH_Pos  (26U)
#define ADC_CFGR_AWD1CH_Msk  (0x1FUL << ADC_CFGR_AWD1CH_Pos) /*!< 0x7C000000 */
#define ADC_CFGR_AWD1CH      ADC_CFGR_AWD1CH_Msk             /*!< ADC Analog watchdog 1 Channel selection */
#define ADC_CFGR_AWD1CH_0    (0x01UL << ADC_CFGR_AWD1CH_Pos) /*!< 0x04000000 */
#define ADC_CFGR_AWD1CH_1    (0x02UL << ADC_CFGR_AWD1CH_Pos) /*!< 0x08000000 */
#define ADC_CFGR_AWD1CH_2    (0x04UL << ADC_CFGR_AWD1CH_Pos) /*!< 0x10000000 */
#define ADC_CFGR_AWD1CH_3    (0x08UL << ADC_CFGR_AWD1CH_Pos) /*!< 0x20000000 */
#define ADC_CFGR_AWD1CH_4    (0x10UL << ADC_CFGR_AWD1CH_Pos) /*!< 0x40000000 */

#define ADC_CFGR_JQDIS_Pos   (31U)
#define ADC_CFGR_JQDIS_Msk   (0x1UL << ADC_CFGR_JQDIS_Pos) /*!< 0x80000000 */
#define ADC_CFGR_JQDIS       ADC_CFGR_JQDIS_Msk            /*!< ADC Injected queue disable */

/********************  Bit definition for ADC_CFGR2 register  ********************/
#define ADC_CFGR2_ROVSE_Pos   (0U)
#define ADC_CFGR2_ROVSE_Msk   (0x1UL << ADC_CFGR2_ROVSE_Pos) /*!< 0x00000001 */
#define ADC_CFGR2_ROVSE       ADC_CFGR2_ROVSE_Msk            /*!< ADC Regular group oversampler enable */
#define ADC_CFGR2_JOVSE_Pos   (1U)
#define ADC_CFGR2_JOVSE_Msk   (0x1UL << ADC_CFGR2_JOVSE_Pos) /*!< 0x00000002 */
#define ADC_CFGR2_JOVSE       ADC_CFGR2_JOVSE_Msk            /*!< ADC Injected group oversampler enable */

#define ADC_CFGR2_OVSS_Pos    (5U)
#define ADC_CFGR2_OVSS_Msk    (0xFUL << ADC_CFGR2_OVSS_Pos) /*!< 0x000001E0 */
#define ADC_CFGR2_OVSS        ADC_CFGR2_OVSS_Msk            /*!< ADC Regular Oversampling shift */
#define ADC_CFGR2_OVSS_0      (0x1UL << ADC_CFGR2_OVSS_Pos) /*!< 0x00000020 */
#define ADC_CFGR2_OVSS_1      (0x2UL << ADC_CFGR2_OVSS_Pos) /*!< 0x00000040 */
#define ADC_CFGR2_OVSS_2      (0x4UL << ADC_CFGR2_OVSS_Pos) /*!< 0x00000080 */
#define ADC_CFGR2_OVSS_3      (0x8UL << ADC_CFGR2_OVSS_Pos) /*!< 0x00000100 */

#define ADC_CFGR2_TROVS_Pos   (9U)
#define ADC_CFGR2_TROVS_Msk   (0x1UL << ADC_CFGR2_TROVS_Pos) /*!< 0x00000200 */
#define ADC_CFGR2_TROVS       ADC_CFGR2_TROVS_Msk            /*!< ADC Triggered regular Oversampling */
#define ADC_CFGR2_ROVSM_Pos   (10U)
#define ADC_CFGR2_ROVSM_Msk   (0x1UL << ADC_CFGR2_ROVSM_Pos) /*!< 0x00000400 */
#define ADC_CFGR2_ROVSM       ADC_CFGR2_ROVSM_Msk            /*!< ADC Regular oversampling mode */

