Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define ADC_CFGR2_RSHIFT1_Pos (11U)
#define ADC_CFGR2_RSHIFT1_Msk (0x1UL << ADC_CFGR2_RSHIFT1_Pos) /*!< 0x00000800 */
#define ADC_CFGR2_RSHIFT1     ADC_CFGR2_RSHIFT1_Msk            /*!< ADC Right-shift data after Offset 1 correction */
#define ADC_CFGR2_RSHIFT2_Pos (12U)
#define ADC_CFGR2_RSHIFT2_Msk (0x1UL << ADC_CFGR2_RSHIFT2_Pos) /*!< 0x00001000 */
#define ADC_CFGR2_RSHIFT2     ADC_CFGR2_RSHIFT2_Msk            /*!< ADC Right-shift data after Offset 2 correction */
#define ADC_CFGR2_RSHIFT3_Pos (13U)
#define ADC_CFGR2_RSHIFT3_Msk (0x1UL << ADC_CFGR2_RSHIFT3_Pos) /*!< 0x00002000 */
#define ADC_CFGR2_RSHIFT3     ADC_CFGR2_RSHIFT3_Msk            /*!< ADC Right-shift data after Offset 3 correction */
#define ADC_CFGR2_RSHIFT4_Pos (14U)
#define ADC_CFGR2_RSHIFT4_Msk (0x1UL << ADC_CFGR2_RSHIFT4_Pos) /*!< 0x00004000 */
#define ADC_CFGR2_RSHIFT4     ADC_CFGR2_RSHIFT4_Msk            /*!< ADC Right-shift data after Offset 4 correction */

#define ADC_CFGR2_OVSR_Pos    (16U)
#define ADC_CFGR2_OVSR_Msk    (0x3FFUL << ADC_CFGR2_OVSR_Pos) /*!< 0x03FF0000 */
#define ADC_CFGR2_OVSR        ADC_CFGR2_OVSR_Msk              /*!< ADC oversampling Ratio */
#define ADC_CFGR2_OVSR_0      (0x001UL << ADC_CFGR2_OVSR_Pos) /*!< 0x00010000 */
#define ADC_CFGR2_OVSR_1      (0x002UL << ADC_CFGR2_OVSR_Pos) /*!< 0x00020000 */
#define ADC_CFGR2_OVSR_2      (0x004UL << ADC_CFGR2_OVSR_Pos) /*!< 0x00040000 */
#define ADC_CFGR2_OVSR_3      (0x008UL << ADC_CFGR2_OVSR_Pos) /*!< 0x00080000 */
#define ADC_CFGR2_OVSR_4      (0x010UL << ADC_CFGR2_OVSR_Pos) /*!< 0x00100000 */
#define ADC_CFGR2_OVSR_5      (0x020UL << ADC_CFGR2_OVSR_Pos) /*!< 0x00200000 */
#define ADC_CFGR2_OVSR_6      (0x040UL << ADC_CFGR2_OVSR_Pos) /*!< 0x00400000 */
#define ADC_CFGR2_OVSR_7      (0x080UL << ADC_CFGR2_OVSR_Pos) /*!< 0x00800000 */
#define ADC_CFGR2_OVSR_8      (0x100UL << ADC_CFGR2_OVSR_Pos) /*!< 0x01000000 */
#define ADC_CFGR2_OVSR_9      (0x200UL << ADC_CFGR2_OVSR_Pos) /*!< 0x02000000 */

#define ADC_CFGR2_LSHIFT_Pos  (28U)
#define ADC_CFGR2_LSHIFT_Msk  (0xFUL << ADC_CFGR2_LSHIFT_Pos) /*!< 0xF0000000 */
#define ADC_CFGR2_LSHIFT      ADC_CFGR2_LSHIFT_Msk            /*!< ADC Left shift factor */
#define ADC_CFGR2_LSHIFT_0    (0x1UL << ADC_CFGR2_LSHIFT_Pos) /*!< 0x10000000 */
#define ADC_CFGR2_LSHIFT_1    (0x2UL << ADC_CFGR2_LSHIFT_Pos) /*!< 0x20000000 */
#define ADC_CFGR2_LSHIFT_2    (0x4UL << ADC_CFGR2_LSHIFT_Pos) /*!< 0x40000000 */
#define ADC_CFGR2_LSHIFT_3    (0x8UL << ADC_CFGR2_LSHIFT_Pos) /*!< 0x80000000 */

/********************  Bit definition for ADC_SMPR1 register  ********************/
#define ADC_SMPR1_SMP0_Pos (0U)
#define ADC_SMPR1_SMP0_Msk (0x7UL << ADC_SMPR1_SMP0_Pos) /*!< 0x00000007 */
#define ADC_SMPR1_SMP0     ADC_SMPR1_SMP0_Msk            /*!< ADC Channel 0 Sampling time selection  */
#define ADC_SMPR1_SMP0_0   (0x1UL << ADC_SMPR1_SMP0_Pos) /*!< 0x00000001 */
#define ADC_SMPR1_SMP0_1   (0x2UL << ADC_SMPR1_SMP0_Pos) /*!< 0x00000002 */
#define ADC_SMPR1_SMP0_2   (0x4UL << ADC_SMPR1_SMP0_Pos) /*!< 0x00000004 */

#define ADC_SMPR1_SMP1_Pos (3U)
#define ADC_SMPR1_SMP1_Msk (0x7UL << ADC_SMPR1_SMP1_Pos) /*!< 0x00000038 */
#define ADC_SMPR1_SMP1     ADC_SMPR1_SMP1_Msk            /*!< ADC Channel 1 Sampling time selection  */
#define ADC_SMPR1_SMP1_0   (0x1UL << ADC_SMPR1_SMP1_Pos) /*!< 0x00000008 */
#define ADC_SMPR1_SMP1_1   (0x2UL << ADC_SMPR1_SMP1_Pos) /*!< 0x00000010 */
#define ADC_SMPR1_SMP1_2   (0x4UL << ADC_SMPR1_SMP1_Pos) /*!< 0x00000020 */

#define ADC_SMPR1_SMP2_Pos (6U)
#define ADC_SMPR1_SMP2_Msk (0x7UL << ADC_SMPR1_SMP2_Pos) /*!< 0x000001C0 */
#define ADC_SMPR1_SMP2     ADC_SMPR1_SMP2_Msk            /*!< ADC Channel 2 Sampling time selection  */
#define ADC_SMPR1_SMP2_0   (0x1UL << ADC_SMPR1_SMP2_Pos) /*!< 0x00000040 */
#define ADC_SMPR1_SMP2_1   (0x2UL << ADC_SMPR1_SMP2_Pos) /*!< 0x00000080 */
#define ADC_SMPR1_SMP2_2   (0x4UL << ADC_SMPR1_SMP2_Pos) /*!< 0x00000100 */

#define ADC_SMPR1_SMP3_Pos (9U)
#define ADC_SMPR1_SMP3_Msk (0x7UL << ADC_SMPR1_SMP3_Pos) /*!< 0x00000E00 */
#define ADC_SMPR1_SMP3     ADC_SMPR1_SMP3_Msk            /*!< ADC Channel 3 Sampling time selection  */
#define ADC_SMPR1_SMP3_0   (0x1UL << ADC_SMPR1_SMP3_Pos) /*!< 0x00000200 */
#define ADC_SMPR1_SMP3_1   (0x2UL << ADC_SMPR1_SMP3_Pos) /*!< 0x00000400 */
#define ADC_SMPR1_SMP3_2   (0x4UL << ADC_SMPR1_SMP3_Pos) /*!< 0x00000800 */

#define ADC_SMPR1_SMP4_Pos (12U)
#define ADC_SMPR1_SMP4_Msk (0x7UL << ADC_SMPR1_SMP4_Pos) /*!< 0x00007000 */
#define ADC_SMPR1_SMP4     ADC_SMPR1_SMP4_Msk            /*!< ADC Channel 4 Sampling time selection  */
#define ADC_SMPR1_SMP4_0   (0x1UL << ADC_SMPR1_SMP4_Pos) /*!< 0x00001000 */
#define ADC_SMPR1_SMP4_1   (0x2UL << ADC_SMPR1_SMP4_Pos) /*!< 0x00002000 */
#define ADC_SMPR1_SMP4_2   (0x4UL << ADC_SMPR1_SMP4_Pos) /*!< 0x00004000 */

#define ADC_SMPR1_SMP5_Pos (15U)
#define ADC_SMPR1_SMP5_Msk (0x7UL << ADC_SMPR1_SMP5_Pos) /*!< 0x00038000 */
#define ADC_SMPR1_SMP5     ADC_SMPR1_SMP5_Msk            /*!< ADC Channel 5 Sampling time selection  */
#define ADC_SMPR1_SMP5_0   (0x1UL << ADC_SMPR1_SMP5_Pos) /*!< 0x00008000 */
#define ADC_SMPR1_SMP5_1   (0x2UL << ADC_SMPR1_SMP5_Pos) /*!< 0x00010000 */
#define ADC_SMPR1_SMP5_2   (0x4UL << ADC_SMPR1_SMP5_Pos) /*!< 0x00020000 */

#define ADC_SMPR1_SMP6_Pos (18U)
#define ADC_SMPR1_SMP6_Msk (0x7UL << ADC_SMPR1_SMP6_Pos) /*!< 0x001C0000 */
#define ADC_SMPR1_SMP6     ADC_SMPR1_SMP6_Msk            /*!< ADC Channel 6 Sampling time selection  */
#define ADC_SMPR1_SMP6_0   (0x1UL << ADC_SMPR1_SMP6_Pos) /*!< 0x00040000 */
#define ADC_SMPR1_SMP6_1   (0x2UL << ADC_SMPR1_SMP6_Pos) /*!< 0x00080000 */
#define ADC_SMPR1_SMP6_2   (0x4UL << ADC_SMPR1_SMP6_Pos) /*!< 0x00100000 */

#define ADC_SMPR1_SMP7_Pos (21U)
#define ADC_SMPR1_SMP7_Msk (0x7UL << ADC_SMPR1_SMP7_Pos) /*!< 0x00E00000 */
#define ADC_SMPR1_SMP7     ADC_SMPR1_SMP7_Msk            /*!< ADC Channel 7 Sampling time selection  */
#define ADC_SMPR1_SMP7_0   (0x1UL << ADC_SMPR1_SMP7_Pos) /*!< 0x00200000 */
#define ADC_SMPR1_SMP7_1   (0x2UL << ADC_SMPR1_SMP7_Pos) /*!< 0x00400000 */
#define ADC_SMPR1_SMP7_2   (0x4UL << ADC_SMPR1_SMP7_Pos) /*!< 0x00800000 */

#define ADC_SMPR1_SMP8_Pos (24U)
#define ADC_SMPR1_SMP8_Msk (0x7UL << ADC_SMPR1_SMP8_Pos) /*!< 0x07000000 */
#define ADC_SMPR1_SMP8     ADC_SMPR1_SMP8_Msk            /*!< ADC Channel 8 Sampling time selection  */
#define ADC_SMPR1_SMP8_0   (0x1UL << ADC_SMPR1_SMP8_Pos) /*!< 0x01000000 */
#define ADC_SMPR1_SMP8_1   (0x2UL << ADC_SMPR1_SMP8_Pos) /*!< 0x02000000 */
#define ADC_SMPR1_SMP8_2   (0x4UL << ADC_SMPR1_SMP8_Pos) /*!< 0x04000000 */

#define ADC_SMPR1_SMP9_Pos (27U)
#define ADC_SMPR1_SMP9_Msk (0x7UL << ADC_SMPR1_SMP9_Pos) /*!< 0x38000000 */
#define ADC_SMPR1_SMP9     ADC_SMPR1_SMP9_Msk            /*!< ADC Channel 9 Sampling time selection  */
#define ADC_SMPR1_SMP9_0   (0x1UL << ADC_SMPR1_SMP9_Pos) /*!< 0x08000000 */
#define ADC_SMPR1_SMP9_1   (0x2UL << ADC_SMPR1_SMP9_Pos) /*!< 0x10000000 */
#define ADC_SMPR1_SMP9_2   (0x4UL << ADC_SMPR1_SMP9_Pos) /*!< 0x20000000 */

/********************  Bit definition for ADC_SMPR2 register  ********************/
#define ADC_SMPR2_SMP10_Pos (0U)
#define ADC_SMPR2_SMP10_Msk (0x7UL << ADC_SMPR2_SMP10_Pos) /*!< 0x00000007 */
#define ADC_SMPR2_SMP10     ADC_SMPR2_SMP10_Msk            /*!< ADC Channel 10 Sampling time selection  */
#define ADC_SMPR2_SMP10_0   (0x1UL << ADC_SMPR2_SMP10_Pos) /*!< 0x00000001 */
#define ADC_SMPR2_SMP10_1   (0x2UL << ADC_SMPR2_SMP10_Pos) /*!< 0x00000002 */
#define ADC_SMPR2_SMP10_2   (0x4UL << ADC_SMPR2_SMP10_Pos) /*!< 0x00000004 */

#define ADC_SMPR2_SMP11_Pos (3U)
#define ADC_SMPR2_SMP11_Msk (0x7UL << ADC_SMPR2_SMP11_Pos) /*!< 0x00000038 */
#define ADC_SMPR2_SMP11     ADC_SMPR2_SMP11_Msk            /*!< ADC Channel 11 Sampling time selection  */
#define ADC_SMPR2_SMP11_0   (0x1UL << ADC_SMPR2_SMP11_Pos) /*!< 0x00000008 */
#define ADC_SMPR2_SMP11_1   (0x2UL << ADC_SMPR2_SMP11_Pos) /*!< 0x00000010 */
#define ADC_SMPR2_SMP11_2   (0x4UL << ADC_SMPR2_SMP11_Pos) /*!< 0x00000020 */

#define ADC_SMPR2_SMP12_Pos (6U)
#define ADC_SMPR2_SMP12_Msk (0x7UL << ADC_SMPR2_SMP12_Pos) /*!< 0x000001C0 */
#define ADC_SMPR2_SMP12     ADC_SMPR2_SMP12_Msk            /*!< ADC Channel 12 Sampling time selection  */
#define ADC_SMPR2_SMP12_0   (0x1UL << ADC_SMPR2_SMP12_Pos) /*!< 0x00000040 */
#define ADC_SMPR2_SMP12_1   (0x2UL << ADC_SMPR2_SMP12_Pos) /*!< 0x00000080 */
#define ADC_SMPR2_SMP12_2   (0x4UL << ADC_SMPR2_SMP12_Pos) /*!< 0x00000100 */

