Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define ADC_CCR_VREFEN_Pos (22U)
#define ADC_CCR_VREFEN_Msk (0x1UL << ADC_CCR_VREFEN_Pos) /*!< 0x00400000 */
#define ADC_CCR_VREFEN     ADC_CCR_VREFEN_Msk            /*!< VREFINT enable */
#define ADC_CCR_TSEN_Pos   (23U)
#define ADC_CCR_TSEN_Msk   (0x1UL << ADC_CCR_TSEN_Pos) /*!< 0x00800000 */
#define ADC_CCR_TSEN       ADC_CCR_TSEN_Msk            /*!< Temperature sensor enable */
#define ADC_CCR_VBATEN_Pos (24U)
#define ADC_CCR_VBATEN_Msk (0x1UL << ADC_CCR_VBATEN_Pos) /*!< 0x01000000 */
#define ADC_CCR_VBATEN     ADC_CCR_VBATEN_Msk            /*!< VBAT enable */

/********************  Bit definition for ADC_CDR register  *******************/
#define ADC_CDR_RDATA_MST_Pos (0U)
#define ADC_CDR_RDATA_MST_Msk (0xFFFFUL << ADC_CDR_RDATA_MST_Pos) /*!< 0x0000FFFF */
#define ADC_CDR_RDATA_MST     ADC_CDR_RDATA_MST_Msk /*!< ADC multimode master group regular conversion data */

#define ADC_CDR_RDATA_SLV_Pos (16U)
#define ADC_CDR_RDATA_SLV_Msk (0xFFFFUL << ADC_CDR_RDATA_SLV_Pos) /*!< 0xFFFF0000 */
#define ADC_CDR_RDATA_SLV     ADC_CDR_RDATA_SLV_Msk /*!< ADC multimode slave group regular conversion data */

/********************  Bit definition for ADC_CDR2 register  ******************/
#define ADC_CDR2_RDATA_ALT_Pos (0U)
#define ADC_CDR2_RDATA_ALT_Msk (0xFFFFFFFFUL << ADC_CDR2_RDATA_ALT_Pos) /*!< 0xFFFFFFFF */
#define ADC_CDR2_RDATA_ALT     ADC_CDR2_RDATA_ALT_Msk /*!< Regular data of the master/slave alternated ADCs */

/******************************************************************************/
/*                                                                            */
/*                                   VREFBUF                                  */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for VREFBUF_CSR register  ****************/
#define VREFBUF_CSR_ENVR_Pos     (0U)
#define VREFBUF_CSR_ENVR_Msk     (0x1UL << VREFBUF_CSR_ENVR_Pos) /*!< 0x00000001 */
#define VREFBUF_CSR_ENVR         VREFBUF_CSR_ENVR_Msk            /*!<Voltage reference buffer enable */
#define VREFBUF_CSR_HIZ_Pos      (1U)
#define VREFBUF_CSR_HIZ_Msk      (0x1UL << VREFBUF_CSR_HIZ_Pos) /*!< 0x00000002 */
#define VREFBUF_CSR_HIZ          VREFBUF_CSR_HIZ_Msk            /*!<High impedance mode             */
#define VREFBUF_CSR_VRR_Pos      (3U)
#define VREFBUF_CSR_VRR_Msk      (0x1UL << VREFBUF_CSR_VRR_Pos) /*!< 0x00000008 */
#define VREFBUF_CSR_VRR          VREFBUF_CSR_VRR_Msk            /*!<Voltage reference buffer ready  */
#define VREFBUF_CSR_VRS_Pos      (4U)
#define VREFBUF_CSR_VRS_Msk      (0x7UL << VREFBUF_CSR_VRS_Pos) /*!< 0x00000070 */
#define VREFBUF_CSR_VRS          VREFBUF_CSR_VRS_Msk            /*!<Voltage reference scale         */

#define VREFBUF_CSR_VRS_OUT1     (0U) /*!<Voltage reference VREF_OUT1     */
#define VREFBUF_CSR_VRS_OUT2_Pos (4U)
#define VREFBUF_CSR_VRS_OUT2_Msk (0x1UL << VREFBUF_CSR_VRS_OUT2_Pos) /*!< 0x00000010 */
#define VREFBUF_CSR_VRS_OUT2     VREFBUF_CSR_VRS_OUT2_Msk            /*!<Voltage reference VREF_OUT2     */
#define VREFBUF_CSR_VRS_OUT3_Pos (5U)
#define VREFBUF_CSR_VRS_OUT3_Msk (0x1UL << VREFBUF_CSR_VRS_OUT3_Pos) /*!< 0x00000020 */
#define VREFBUF_CSR_VRS_OUT3     VREFBUF_CSR_VRS_OUT3_Msk            /*!<Voltage reference VREF_OUT3     */
#define VREFBUF_CSR_VRS_OUT4_Pos (4U)
#define VREFBUF_CSR_VRS_OUT4_Msk (0x3UL << VREFBUF_CSR_VRS_OUT4_Pos) /*!< 0x00000030 */
#define VREFBUF_CSR_VRS_OUT4     VREFBUF_CSR_VRS_OUT4_Msk            /*!<Voltage reference VREF_OUT4     */

/*******************  Bit definition for VREFBUF_CCR register  ****************/
#define VREFBUF_CCR_TRIM_Pos (0U)
#define VREFBUF_CCR_TRIM_Msk (0x3FUL << VREFBUF_CCR_TRIM_Pos) /*!< 0x0000003F */
#define VREFBUF_CCR_TRIM     VREFBUF_CCR_TRIM_Msk             /*!<TRIM[5:0] bits (Trimming code)  */

/******************************************************************************/
/*                                                                            */
/*                 Flexible Datarate Controller Area Network                  */
/*                                                                            */
/******************************************************************************/
/*!<FDCAN control and status registers */
/*****************  Bit definition for FDCAN_CREL register  *******************/
#define FDCAN_CREL_DAY_Pos     (0U)
#define FDCAN_CREL_DAY_Msk     (0xFFUL << FDCAN_CREL_DAY_Pos) /*!< 0x000000FF */
#define FDCAN_CREL_DAY         FDCAN_CREL_DAY_Msk             /*!<Timestamp Day                           */
#define FDCAN_CREL_MON_Pos     (8U)
#define FDCAN_CREL_MON_Msk     (0xFFUL << FDCAN_CREL_MON_Pos) /*!< 0x0000FF00 */
#define FDCAN_CREL_MON         FDCAN_CREL_MON_Msk             /*!<Timestamp Month                         */
#define FDCAN_CREL_YEAR_Pos    (16U)
#define FDCAN_CREL_YEAR_Msk    (0xFUL << FDCAN_CREL_YEAR_Pos) /*!< 0x000F0000 */
#define FDCAN_CREL_YEAR        FDCAN_CREL_YEAR_Msk            /*!<Timestamp Year                          */
#define FDCAN_CREL_SUBSTEP_Pos (20U)
#define FDCAN_CREL_SUBSTEP_Msk (0xFUL << FDCAN_CREL_SUBSTEP_Pos) /*!< 0x00F00000 */
#define FDCAN_CREL_SUBSTEP     FDCAN_CREL_SUBSTEP_Msk            /*!<Sub-step of Core release                */
#define FDCAN_CREL_STEP_Pos    (24U)
#define FDCAN_CREL_STEP_Msk    (0xFUL << FDCAN_CREL_STEP_Pos) /*!< 0x0F000000 */
#define FDCAN_CREL_STEP        FDCAN_CREL_STEP_Msk            /*!<Step of Core release                    */
#define FDCAN_CREL_REL_Pos     (28U)
#define FDCAN_CREL_REL_Msk     (0xFUL << FDCAN_CREL_REL_Pos) /*!< 0xF0000000 */
#define FDCAN_CREL_REL         FDCAN_CREL_REL_Msk            /*!<Core release                            */

/*****************  Bit definition for FDCAN_ENDN register  *******************/
#define FDCAN_ENDN_ETV_Pos (0U)
#define FDCAN_ENDN_ETV_Msk (0xFFFFFFFFUL << FDCAN_ENDN_ETV_Pos) /*!< 0xFFFFFFFF */
#define FDCAN_ENDN_ETV     FDCAN_ENDN_ETV_Msk                   /*!<Endianness Test Value                   */

/*****************  Bit definition for FDCAN_DBTP register  *******************/
#define FDCAN_DBTP_DSJW_Pos   (0U)
#define FDCAN_DBTP_DSJW_Msk   (0xFUL << FDCAN_DBTP_DSJW_Pos) /*!< 0x0000000F */
#define FDCAN_DBTP_DSJW       FDCAN_DBTP_DSJW_Msk            /*!<Synchronization Jump Width              */
#define FDCAN_DBTP_DTSEG2_Pos (4U)
#define FDCAN_DBTP_DTSEG2_Msk (0xFUL << FDCAN_DBTP_DTSEG2_Pos) /*!< 0x000000F0 */
#define FDCAN_DBTP_DTSEG2     FDCAN_DBTP_DTSEG2_Msk            /*!<Data time segment after sample point    */
#define FDCAN_DBTP_DTSEG1_Pos (8U)
#define FDCAN_DBTP_DTSEG1_Msk (0x1FUL << FDCAN_DBTP_DTSEG1_Pos) /*!< 0x00001F00 */
#define FDCAN_DBTP_DTSEG1     FDCAN_DBTP_DTSEG1_Msk             /*!<Data time segment before sample point   */
#define FDCAN_DBTP_DBRP_Pos   (16U)
#define FDCAN_DBTP_DBRP_Msk   (0x1FUL << FDCAN_DBTP_DBRP_Pos) /*!< 0x001F0000 */
#define FDCAN_DBTP_DBRP       FDCAN_DBTP_DBRP_Msk             /*!<Data BIt Rate Prescaler                 */
#define FDCAN_DBTP_TDC_Pos    (23U)
#define FDCAN_DBTP_TDC_Msk    (0x1UL << FDCAN_DBTP_TDC_Pos) /*!< 0x00800000 */
#define FDCAN_DBTP_TDC        FDCAN_DBTP_TDC_Msk            /*!<Transceiver Delay Compensation          */

