Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*****************  Bit definition for FDCAN_TEST register  *******************/
#define FDCAN_TEST_LBCK_Pos (4U)
#define FDCAN_TEST_LBCK_Msk (0x1UL << FDCAN_TEST_LBCK_Pos) /*!< 0x00000010 */
#define FDCAN_TEST_LBCK     FDCAN_TEST_LBCK_Msk            /*!<Loop Back mode                           */
#define FDCAN_TEST_TX_Pos   (5U)
#define FDCAN_TEST_TX_Msk   (0x3UL << FDCAN_TEST_TX_Pos) /*!< 0x00000060 */
#define FDCAN_TEST_TX       FDCAN_TEST_TX_Msk            /*!<Control of Transmit Pin                  */
#define FDCAN_TEST_RX_Pos   (7U)
#define FDCAN_TEST_RX_Msk   (0x1UL << FDCAN_TEST_RX_Pos) /*!< 0x00000080 */
#define FDCAN_TEST_RX       FDCAN_TEST_RX_Msk            /*!<Receive Pin                              */

/*****************  Bit definition for FDCAN_RWD register  ********************/
#define FDCAN_RWD_WDC_Pos (0U)
#define FDCAN_RWD_WDC_Msk (0xFFUL << FDCAN_RWD_WDC_Pos) /*!< 0x000000FF */
#define FDCAN_RWD_WDC     FDCAN_RWD_WDC_Msk             /*!<Watchdog configuration                   */
#define FDCAN_RWD_WDV_Pos (8U)
#define FDCAN_RWD_WDV_Msk (0xFFUL << FDCAN_RWD_WDV_Pos) /*!< 0x0000FF00 */
#define FDCAN_RWD_WDV     FDCAN_RWD_WDV_Msk             /*!<Watchdog value                           */

/*****************  Bit definition for FDCAN_CCCR register  ********************/
#define FDCAN_CCCR_INIT_Pos (0U)
#define FDCAN_CCCR_INIT_Msk (0x1UL << FDCAN_CCCR_INIT_Pos) /*!< 0x00000001 */
#define FDCAN_CCCR_INIT     FDCAN_CCCR_INIT_Msk            /*!<Initialization                           */
#define FDCAN_CCCR_CCE_Pos  (1U)
#define FDCAN_CCCR_CCE_Msk  (0x1UL << FDCAN_CCCR_CCE_Pos) /*!< 0x00000002 */
#define FDCAN_CCCR_CCE      FDCAN_CCCR_CCE_Msk            /*!<Configuration Change Enable              */
#define FDCAN_CCCR_ASM_Pos  (2U)
#define FDCAN_CCCR_ASM_Msk  (0x1UL << FDCAN_CCCR_ASM_Pos) /*!< 0x00000004 */
#define FDCAN_CCCR_ASM      FDCAN_CCCR_ASM_Msk            /*!<ASM Restricted Operation Mode            */
#define FDCAN_CCCR_CSA_Pos  (3U)
#define FDCAN_CCCR_CSA_Msk  (0x1UL << FDCAN_CCCR_CSA_Pos) /*!< 0x00000008 */
#define FDCAN_CCCR_CSA      FDCAN_CCCR_CSA_Msk            /*!<Clock Stop Acknowledge                   */
#define FDCAN_CCCR_CSR_Pos  (4U)
#define FDCAN_CCCR_CSR_Msk  (0x1UL << FDCAN_CCCR_CSR_Pos) /*!< 0x00000010 */
#define FDCAN_CCCR_CSR      FDCAN_CCCR_CSR_Msk            /*!<Clock Stop Request                       */
#define FDCAN_CCCR_MON_Pos  (5U)
#define FDCAN_CCCR_MON_Msk  (0x1UL << FDCAN_CCCR_MON_Pos) /*!< 0x00000020 */
#define FDCAN_CCCR_MON      FDCAN_CCCR_MON_Msk            /*!<Bus Monitoring Mode                      */
#define FDCAN_CCCR_DAR_Pos  (6U)
#define FDCAN_CCCR_DAR_Msk  (0x1UL << FDCAN_CCCR_DAR_Pos) /*!< 0x00000040 */
#define FDCAN_CCCR_DAR      FDCAN_CCCR_DAR_Msk            /*!<Disable Automatic Retransmission         */
#define FDCAN_CCCR_TEST_Pos (7U)
#define FDCAN_CCCR_TEST_Msk (0x1UL << FDCAN_CCCR_TEST_Pos) /*!< 0x00000080 */
#define FDCAN_CCCR_TEST     FDCAN_CCCR_TEST_Msk            /*!<Test Mode Enable                         */
#define FDCAN_CCCR_FDOE_Pos (8U)
#define FDCAN_CCCR_FDOE_Msk (0x1UL << FDCAN_CCCR_FDOE_Pos) /*!< 0x00000100 */
#define FDCAN_CCCR_FDOE     FDCAN_CCCR_FDOE_Msk            /*!<FD Operation Enable                      */
#define FDCAN_CCCR_BRSE_Pos (9U)
#define FDCAN_CCCR_BRSE_Msk (0x1UL << FDCAN_CCCR_BRSE_Pos) /*!< 0x00000200 */
#define FDCAN_CCCR_BRSE     FDCAN_CCCR_BRSE_Msk            /*!<FDCAN Bit Rate Switching                 */
#define FDCAN_CCCR_PXHD_Pos (12U)
#define FDCAN_CCCR_PXHD_Msk (0x1UL << FDCAN_CCCR_PXHD_Pos) /*!< 0x00001000 */
#define FDCAN_CCCR_PXHD     FDCAN_CCCR_PXHD_Msk            /*!<Protocol Exception Handling Disable      */
#define FDCAN_CCCR_EFBI_Pos (13U)
#define FDCAN_CCCR_EFBI_Msk (0x1UL << FDCAN_CCCR_EFBI_Pos) /*!< 0x00002000 */
#define FDCAN_CCCR_EFBI     FDCAN_CCCR_EFBI_Msk            /*!<Edge Filtering during Bus Integration    */
#define FDCAN_CCCR_TXP_Pos  (14U)
#define FDCAN_CCCR_TXP_Msk  (0x1UL << FDCAN_CCCR_TXP_Pos) /*!< 0x00004000 */
#define FDCAN_CCCR_TXP      FDCAN_CCCR_TXP_Msk            /*!<Two CAN bit times Pause                  */
#define FDCAN_CCCR_NISO_Pos (15U)
#define FDCAN_CCCR_NISO_Msk (0x1UL << FDCAN_CCCR_NISO_Pos) /*!< 0x00008000 */
#define FDCAN_CCCR_NISO     FDCAN_CCCR_NISO_Msk            /*!<Non ISO Operation                        */

/*****************  Bit definition for FDCAN_NBTP register  ********************/
#define FDCAN_NBTP_NTSEG2_Pos (0U)
#define FDCAN_NBTP_NTSEG2_Msk (0x7FUL << FDCAN_NBTP_NTSEG2_Pos) /*!< 0x0000007F */
#define FDCAN_NBTP_NTSEG2     FDCAN_NBTP_NTSEG2_Msk             /*!<Nominal Time segment after sample point  */
#define FDCAN_NBTP_NTSEG1_Pos (8U)
#define FDCAN_NBTP_NTSEG1_Msk (0xFFUL << FDCAN_NBTP_NTSEG1_Pos) /*!< 0x0000FF00 */
#define FDCAN_NBTP_NTSEG1     FDCAN_NBTP_NTSEG1_Msk             /*!<Nominal Time segment before sample point */
#define FDCAN_NBTP_NBRP_Pos   (16U)
#define FDCAN_NBTP_NBRP_Msk   (0x1FFUL << FDCAN_NBTP_NBRP_Pos) /*!< 0x01FF0000 */
#define FDCAN_NBTP_NBRP       FDCAN_NBTP_NBRP_Msk              /*!<Bit Rate Prescaler                       */
#define FDCAN_NBTP_NSJW_Pos   (25U)
#define FDCAN_NBTP_NSJW_Msk   (0x7FUL << FDCAN_NBTP_NSJW_Pos) /*!< 0xFE000000 */
#define FDCAN_NBTP_NSJW       FDCAN_NBTP_NSJW_Msk             /*!<Nominal (Re)Synchronization Jump Width   */

/*****************  Bit definition for FDCAN_TSCC register  ********************/
#define FDCAN_TSCC_TSS_Pos (0U)
#define FDCAN_TSCC_TSS_Msk (0x3UL << FDCAN_TSCC_TSS_Pos) /*!< 0x00000003 */
#define FDCAN_TSCC_TSS     FDCAN_TSCC_TSS_Msk            /*!<Timestamp Select                         */
#define FDCAN_TSCC_TCP_Pos (16U)
#define FDCAN_TSCC_TCP_Msk (0xFUL << FDCAN_TSCC_TCP_Pos) /*!< 0x000F0000 */
#define FDCAN_TSCC_TCP     FDCAN_TSCC_TCP_Msk            /*!<Timestamp Counter Prescaler              */

/*****************  Bit definition for FDCAN_TSCV register  ********************/
#define FDCAN_TSCV_TSC_Pos (0U)
#define FDCAN_TSCV_TSC_Msk (0xFFFFUL << FDCAN_TSCV_TSC_Pos) /*!< 0x0000FFFF */
#define FDCAN_TSCV_TSC     FDCAN_TSCV_TSC_Msk               /*!<Timestamp Counter                        */

/*****************  Bit definition for FDCAN_TOCC register  ********************/
#define FDCAN_TOCC_ETOC_Pos (0U)
#define FDCAN_TOCC_ETOC_Msk (0x1UL << FDCAN_TOCC_ETOC_Pos) /*!< 0x00000001 */
#define FDCAN_TOCC_ETOC     FDCAN_TOCC_ETOC_Msk            /*!<Enable Timeout Counter                   */
#define FDCAN_TOCC_TOS_Pos  (1U)
#define FDCAN_TOCC_TOS_Msk  (0x3UL << FDCAN_TOCC_TOS_Pos) /*!< 0x00000006 */
#define FDCAN_TOCC_TOS      FDCAN_TOCC_TOS_Msk            /*!<Timeout Select                           */
#define FDCAN_TOCC_TOP_Pos  (16U)
#define FDCAN_TOCC_TOP_Msk  (0xFFFFUL << FDCAN_TOCC_TOP_Pos) /*!< 0xFFFF0000 */
#define FDCAN_TOCC_TOP      FDCAN_TOCC_TOP_Msk               /*!<Timeout Period                           */

/*****************  Bit definition for FDCAN_TOCV register  ********************/
#define FDCAN_TOCV_TOC_Pos (0U)
#define FDCAN_TOCV_TOC_Msk (0xFFFFUL << FDCAN_TOCV_TOC_Pos) /*!< 0x0000FFFF */
#define FDCAN_TOCV_TOC     FDCAN_TOCV_TOC_Msk               /*!<Timeout Counter                          */

/*****************  Bit definition for FDCAN_ECR register  *********************/
#define FDCAN_ECR_TEC_Pos (0U)
#define FDCAN_ECR_TEC_Msk (0xFFUL << FDCAN_ECR_TEC_Pos) /*!< 0x000000FF */
#define FDCAN_ECR_TEC     FDCAN_ECR_TEC_Msk             /*!<Transmit Error Counter                   */
#define FDCAN_ECR_REC_Pos (8U)
#define FDCAN_ECR_REC_Msk (0x7FUL << FDCAN_ECR_REC_Pos) /*!< 0x00007F00 */
#define FDCAN_ECR_REC     FDCAN_ECR_REC_Msk             /*!<Receive Error Counter                    */
#define FDCAN_ECR_RP_Pos  (15U)
#define FDCAN_ECR_RP_Msk  (0x1UL << FDCAN_ECR_RP_Pos) /*!< 0x00008000 */
#define FDCAN_ECR_RP      FDCAN_ECR_RP_Msk            /*!<Receive Error Passive                    */
#define FDCAN_ECR_CEL_Pos (16U)
#define FDCAN_ECR_CEL_Msk (0xFFUL << FDCAN_ECR_CEL_Pos) /*!< 0x00FF0000 */
#define FDCAN_ECR_CEL     FDCAN_ECR_CEL_Msk             /*!<CAN Error Logging                        */

