Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*****************  Bit definition for FDCAN_PSR register  *********************/
#define FDCAN_PSR_LEC_Pos  (0U)
#define FDCAN_PSR_LEC_Msk  (0x7UL << FDCAN_PSR_LEC_Pos) /*!< 0x00000007 */
#define FDCAN_PSR_LEC      FDCAN_PSR_LEC_Msk            /*!<Last Error Code                          */
#define FDCAN_PSR_ACT_Pos  (3U)
#define FDCAN_PSR_ACT_Msk  (0x3UL << FDCAN_PSR_ACT_Pos) /*!< 0x00000018 */
#define FDCAN_PSR_ACT      FDCAN_PSR_ACT_Msk            /*!<Activity                                 */
#define FDCAN_PSR_EP_Pos   (5U)
#define FDCAN_PSR_EP_Msk   (0x1UL << FDCAN_PSR_EP_Pos) /*!< 0x00000020 */
#define FDCAN_PSR_EP       FDCAN_PSR_EP_Msk            /*!<Error Passive                            */
#define FDCAN_PSR_EW_Pos   (6U)
#define FDCAN_PSR_EW_Msk   (0x1UL << FDCAN_PSR_EW_Pos) /*!< 0x00000040 */
#define FDCAN_PSR_EW       FDCAN_PSR_EW_Msk            /*!<Warning Status                           */
#define FDCAN_PSR_BO_Pos   (7U)
#define FDCAN_PSR_BO_Msk   (0x1UL << FDCAN_PSR_BO_Pos) /*!< 0x00000080 */
#define FDCAN_PSR_BO       FDCAN_PSR_BO_Msk            /*!<Bus_Off Status                           */
#define FDCAN_PSR_DLEC_Pos (8U)
#define FDCAN_PSR_DLEC_Msk (0x7UL << FDCAN_PSR_DLEC_Pos) /*!< 0x00000700 */
#define FDCAN_PSR_DLEC     FDCAN_PSR_DLEC_Msk            /*!<Data Last Error Code                     */
#define FDCAN_PSR_RESI_Pos (11U)
#define FDCAN_PSR_RESI_Msk (0x1UL << FDCAN_PSR_RESI_Pos) /*!< 0x00000800 */
#define FDCAN_PSR_RESI     FDCAN_PSR_RESI_Msk            /*!<ESI flag of last received FDCAN Message  */
#define FDCAN_PSR_RBRS_Pos (12U)
#define FDCAN_PSR_RBRS_Msk (0x1UL << FDCAN_PSR_RBRS_Pos) /*!< 0x00001000 */
#define FDCAN_PSR_RBRS     FDCAN_PSR_RBRS_Msk            /*!<BRS flag of last received FDCAN Message  */
#define FDCAN_PSR_REDL_Pos (13U)
#define FDCAN_PSR_REDL_Msk (0x1UL << FDCAN_PSR_REDL_Pos) /*!< 0x00002000 */
#define FDCAN_PSR_REDL     FDCAN_PSR_REDL_Msk            /*!<Received FDCAN Message                   */
#define FDCAN_PSR_PXE_Pos  (14U)
#define FDCAN_PSR_PXE_Msk  (0x1UL << FDCAN_PSR_PXE_Pos) /*!< 0x00004000 */
#define FDCAN_PSR_PXE      FDCAN_PSR_PXE_Msk            /*!<Protocol Exception Event                 */
#define FDCAN_PSR_TDCV_Pos (16U)
#define FDCAN_PSR_TDCV_Msk (0x7FUL << FDCAN_PSR_TDCV_Pos) /*!< 0x007F0000 */
#define FDCAN_PSR_TDCV     FDCAN_PSR_TDCV_Msk             /*!<Transmitter Delay Compensation Value     */

/*****************  Bit definition for FDCAN_TDCR register  ********************/
#define FDCAN_TDCR_TDCF_Pos (0U)
#define FDCAN_TDCR_TDCF_Msk (0x7FUL << FDCAN_TDCR_TDCF_Pos) /*!< 0x0000007F */
#define FDCAN_TDCR_TDCF     FDCAN_TDCR_TDCF_Msk             /*!<Transmitter Delay Compensation Filter    */
#define FDCAN_TDCR_TDCO_Pos (8U)
#define FDCAN_TDCR_TDCO_Msk (0x7FUL << FDCAN_TDCR_TDCO_Pos) /*!< 0x00007F00 */
#define FDCAN_TDCR_TDCO     FDCAN_TDCR_TDCO_Msk             /*!<Transmitter Delay Compensation Offset    */

/*****************  Bit definition for FDCAN_IR register  **********************/
#define FDCAN_IR_RF0N_Pos (0U)
#define FDCAN_IR_RF0N_Msk (0x1UL << FDCAN_IR_RF0N_Pos) /*!< 0x00000001 */
#define FDCAN_IR_RF0N     FDCAN_IR_RF0N_Msk            /*!<Rx FIFO 0 New Message                    */
#define FDCAN_IR_RF0W_Pos (1U)
#define FDCAN_IR_RF0W_Msk (0x1UL << FDCAN_IR_RF0W_Pos) /*!< 0x00000002 */
#define FDCAN_IR_RF0W     FDCAN_IR_RF0W_Msk            /*!<Rx FIFO 0 Watermark Reached              */
#define FDCAN_IR_RF0F_Pos (2U)
#define FDCAN_IR_RF0F_Msk (0x1UL << FDCAN_IR_RF0F_Pos) /*!< 0x00000004 */
#define FDCAN_IR_RF0F     FDCAN_IR_RF0F_Msk            /*!<Rx FIFO 0 Full                           */
#define FDCAN_IR_RF0L_Pos (3U)
#define FDCAN_IR_RF0L_Msk (0x1UL << FDCAN_IR_RF0L_Pos) /*!< 0x00000008 */
#define FDCAN_IR_RF0L     FDCAN_IR_RF0L_Msk            /*!<Rx FIFO 0 Message Lost                   */
#define FDCAN_IR_RF1N_Pos (4U)
#define FDCAN_IR_RF1N_Msk (0x1UL << FDCAN_IR_RF1N_Pos) /*!< 0x00000010 */
#define FDCAN_IR_RF1N     FDCAN_IR_RF1N_Msk            /*!<Rx FIFO 1 New Message                    */
#define FDCAN_IR_RF1W_Pos (5U)
#define FDCAN_IR_RF1W_Msk (0x1UL << FDCAN_IR_RF1W_Pos) /*!< 0x00000020 */
#define FDCAN_IR_RF1W     FDCAN_IR_RF1W_Msk            /*!<Rx FIFO 1 Watermark Reached              */
#define FDCAN_IR_RF1F_Pos (6U)
#define FDCAN_IR_RF1F_Msk (0x1UL << FDCAN_IR_RF1F_Pos) /*!< 0x00000040 */
#define FDCAN_IR_RF1F     FDCAN_IR_RF1F_Msk            /*!<Rx FIFO 1 Full                           */
#define FDCAN_IR_RF1L_Pos (7U)
#define FDCAN_IR_RF1L_Msk (0x1UL << FDCAN_IR_RF1L_Pos) /*!< 0x00000080 */
#define FDCAN_IR_RF1L     FDCAN_IR_RF1L_Msk            /*!<Rx FIFO 1 Message Lost                   */
#define FDCAN_IR_HPM_Pos  (8U)
#define FDCAN_IR_HPM_Msk  (0x1UL << FDCAN_IR_HPM_Pos) /*!< 0x00000100 */
#define FDCAN_IR_HPM      FDCAN_IR_HPM_Msk            /*!<High Priority Message                    */
#define FDCAN_IR_TC_Pos   (9U)
#define FDCAN_IR_TC_Msk   (0x1UL << FDCAN_IR_TC_Pos) /*!< 0x00000200 */
#define FDCAN_IR_TC       FDCAN_IR_TC_Msk            /*!<Transmission Completed                   */
#define FDCAN_IR_TCF_Pos  (10U)
#define FDCAN_IR_TCF_Msk  (0x1UL << FDCAN_IR_TCF_Pos) /*!< 0x00000400 */
#define FDCAN_IR_TCF      FDCAN_IR_TCF_Msk            /*!<Transmission Cancellation Finished       */
#define FDCAN_IR_TFE_Pos  (11U)
#define FDCAN_IR_TFE_Msk  (0x1UL << FDCAN_IR_TFE_Pos) /*!< 0x00000800 */
#define FDCAN_IR_TFE      FDCAN_IR_TFE_Msk            /*!<Tx FIFO Empty                            */
#define FDCAN_IR_TEFN_Pos (12U)
#define FDCAN_IR_TEFN_Msk (0x1UL << FDCAN_IR_TEFN_Pos) /*!< 0x00001000 */
#define FDCAN_IR_TEFN     FDCAN_IR_TEFN_Msk            /*!<Tx Event FIFO New Entry                  */
#define FDCAN_IR_TEFW_Pos (13U)
#define FDCAN_IR_TEFW_Msk (0x1UL << FDCAN_IR_TEFW_Pos) /*!< 0x00002000 */
#define FDCAN_IR_TEFW     FDCAN_IR_TEFW_Msk            /*!<Tx Event FIFO Watermark Reached          */
#define FDCAN_IR_TEFF_Pos (14U)
#define FDCAN_IR_TEFF_Msk (0x1UL << FDCAN_IR_TEFF_Pos) /*!< 0x00004000 */
#define FDCAN_IR_TEFF     FDCAN_IR_TEFF_Msk            /*!<Tx Event FIFO Full                       */
#define FDCAN_IR_TEFL_Pos (15U)
#define FDCAN_IR_TEFL_Msk (0x1UL << FDCAN_IR_TEFL_Pos) /*!< 0x00008000 */
#define FDCAN_IR_TEFL     FDCAN_IR_TEFL_Msk            /*!<Tx Event FIFO Element Lost               */
#define FDCAN_IR_TSW_Pos  (16U)
#define FDCAN_IR_TSW_Msk  (0x1UL << FDCAN_IR_TSW_Pos) /*!< 0x00010000 */
#define FDCAN_IR_TSW      FDCAN_IR_TSW_Msk            /*!<Timestamp Wraparound                     */
#define FDCAN_IR_MRAF_Pos (17U)
#define FDCAN_IR_MRAF_Msk (0x1UL << FDCAN_IR_MRAF_Pos) /*!< 0x00020000 */
#define FDCAN_IR_MRAF     FDCAN_IR_MRAF_Msk            /*!<Message RAM Access Failure               */
#define FDCAN_IR_TOO_Pos  (18U)
#define FDCAN_IR_TOO_Msk  (0x1UL << FDCAN_IR_TOO_Pos) /*!< 0x00040000 */
#define FDCAN_IR_TOO      FDCAN_IR_TOO_Msk            /*!<Timeout Occurred                         */
#define FDCAN_IR_DRX_Pos  (19U)
#define FDCAN_IR_DRX_Msk  (0x1UL << FDCAN_IR_DRX_Pos) /*!< 0x00080000 */
#define FDCAN_IR_DRX      FDCAN_IR_DRX_Msk            /*!<Message stored to Dedicated Rx Buffer    */
#define FDCAN_IR_ELO_Pos  (22U)
#define FDCAN_IR_ELO_Msk  (0x1UL << FDCAN_IR_ELO_Pos) /*!< 0x00400000 */
#define FDCAN_IR_ELO      FDCAN_IR_ELO_Msk            /*!<Error Logging Overflow                   */
#define FDCAN_IR_EP_Pos   (23U)
#define FDCAN_IR_EP_Msk   (0x1UL << FDCAN_IR_EP_Pos) /*!< 0x00800000 */
#define FDCAN_IR_EP       FDCAN_IR_EP_Msk            /*!<Error Passive                            */
#define FDCAN_IR_EW_Pos   (24U)
#define FDCAN_IR_EW_Msk   (0x1UL << FDCAN_IR_EW_Pos) /*!< 0x01000000 */
#define FDCAN_IR_EW       FDCAN_IR_EW_Msk            /*!<Warning Status                           */
#define FDCAN_IR_BO_Pos   (25U)
#define FDCAN_IR_BO_Msk   (0x1UL << FDCAN_IR_BO_Pos) /*!< 0x02000000 */
#define FDCAN_IR_BO       FDCAN_IR_BO_Msk            /*!<Bus_Off Status                           */
#define FDCAN_IR_WDI_Pos  (26U)
#define FDCAN_IR_WDI_Msk  (0x1UL << FDCAN_IR_WDI_Pos) /*!< 0x04000000 */
#define FDCAN_IR_WDI      FDCAN_IR_WDI_Msk            /*!<Watchdog Interrupt                       */
#define FDCAN_IR_PEA_Pos  (27U)
#define FDCAN_IR_PEA_Msk  (0x1UL << FDCAN_IR_PEA_Pos) /*!< 0x08000000 */
#define FDCAN_IR_PEA      FDCAN_IR_PEA_Msk            /*!<Protocol Error in Arbitration Phase      */
#define FDCAN_IR_PED_Pos  (28U)
#define FDCAN_IR_PED_Msk  (0x1UL << FDCAN_IR_PED_Pos) /*!< 0x10000000 */
#define FDCAN_IR_PED      FDCAN_IR_PED_Msk            /*!<Protocol Error in Data Phase             */
#define FDCAN_IR_ARA_Pos  (29U)
#define FDCAN_IR_ARA_Msk  (0x1UL << FDCAN_IR_ARA_Pos) /*!< 0x20000000 */
#define FDCAN_IR_ARA      FDCAN_IR_ARA_Msk            /*!<Access to Reserved Address               */

