Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*****************  Bit definition for FDCAN_IE register  **********************/
#define FDCAN_IE_RF0NE_Pos (0U)
#define FDCAN_IE_RF0NE_Msk (0x1UL << FDCAN_IE_RF0NE_Pos) /*!< 0x00000001 */
#define FDCAN_IE_RF0NE     FDCAN_IE_RF0NE_Msk            /*!<Rx FIFO 0 New Message Enable                 */
#define FDCAN_IE_RF0WE_Pos (1U)
#define FDCAN_IE_RF0WE_Msk (0x1UL << FDCAN_IE_RF0WE_Pos) /*!< 0x00000002 */
#define FDCAN_IE_RF0WE     FDCAN_IE_RF0WE_Msk            /*!<Rx FIFO 0 Watermark Reached Enable           */
#define FDCAN_IE_RF0FE_Pos (2U)
#define FDCAN_IE_RF0FE_Msk (0x1UL << FDCAN_IE_RF0FE_Pos) /*!< 0x00000004 */
#define FDCAN_IE_RF0FE     FDCAN_IE_RF0FE_Msk            /*!<Rx FIFO 0 Full Enable                        */
#define FDCAN_IE_RF0LE_Pos (3U)
#define FDCAN_IE_RF0LE_Msk (0x1UL << FDCAN_IE_RF0LE_Pos) /*!< 0x00000008 */
#define FDCAN_IE_RF0LE     FDCAN_IE_RF0LE_Msk            /*!<Rx FIFO 0 Message Lost Enable                */
#define FDCAN_IE_RF1NE_Pos (4U)
#define FDCAN_IE_RF1NE_Msk (0x1UL << FDCAN_IE_RF1NE_Pos) /*!< 0x00000010 */
#define FDCAN_IE_RF1NE     FDCAN_IE_RF1NE_Msk            /*!<Rx FIFO 1 New Message Enable                 */
#define FDCAN_IE_RF1WE_Pos (5U)
#define FDCAN_IE_RF1WE_Msk (0x1UL << FDCAN_IE_RF1WE_Pos) /*!< 0x00000020 */
#define FDCAN_IE_RF1WE     FDCAN_IE_RF1WE_Msk            /*!<Rx FIFO 1 Watermark Reached Enable           */
#define FDCAN_IE_RF1FE_Pos (6U)
#define FDCAN_IE_RF1FE_Msk (0x1UL << FDCAN_IE_RF1FE_Pos) /*!< 0x00000040 */
#define FDCAN_IE_RF1FE     FDCAN_IE_RF1FE_Msk            /*!<Rx FIFO 1 Full Enable                        */
#define FDCAN_IE_RF1LE_Pos (7U)
#define FDCAN_IE_RF1LE_Msk (0x1UL << FDCAN_IE_RF1LE_Pos) /*!< 0x00000080 */
#define FDCAN_IE_RF1LE     FDCAN_IE_RF1LE_Msk            /*!<Rx FIFO 1 Message Lost Enable                */
#define FDCAN_IE_HPME_Pos  (8U)
#define FDCAN_IE_HPME_Msk  (0x1UL << FDCAN_IE_HPME_Pos) /*!< 0x00000100 */
#define FDCAN_IE_HPME      FDCAN_IE_HPME_Msk            /*!<High Priority Message Enable                 */
#define FDCAN_IE_TCE_Pos   (9U)
#define FDCAN_IE_TCE_Msk   (0x1UL << FDCAN_IE_TCE_Pos) /*!< 0x00000200 */
#define FDCAN_IE_TCE       FDCAN_IE_TCE_Msk            /*!<Transmission Completed Enable                */
#define FDCAN_IE_TCFE_Pos  (10U)
#define FDCAN_IE_TCFE_Msk  (0x1UL << FDCAN_IE_TCFE_Pos) /*!< 0x00000400 */
#define FDCAN_IE_TCFE      FDCAN_IE_TCFE_Msk            /*!<Transmission Cancellation Finished Enable    */
#define FDCAN_IE_TFEE_Pos  (11U)
#define FDCAN_IE_TFEE_Msk  (0x1UL << FDCAN_IE_TFEE_Pos) /*!< 0x00000800 */
#define FDCAN_IE_TFEE      FDCAN_IE_TFEE_Msk            /*!<Tx FIFO Empty Enable                         */
#define FDCAN_IE_TEFNE_Pos (12U)
#define FDCAN_IE_TEFNE_Msk (0x1UL << FDCAN_IE_TEFNE_Pos) /*!< 0x00001000 */
#define FDCAN_IE_TEFNE     FDCAN_IE_TEFNE_Msk            /*!<Tx Event FIFO New Entry Enable               */
#define FDCAN_IE_TEFWE_Pos (13U)
#define FDCAN_IE_TEFWE_Msk (0x1UL << FDCAN_IE_TEFWE_Pos) /*!< 0x00002000 */
#define FDCAN_IE_TEFWE     FDCAN_IE_TEFWE_Msk            /*!<Tx Event FIFO Watermark Reached Enable       */
#define FDCAN_IE_TEFFE_Pos (14U)
#define FDCAN_IE_TEFFE_Msk (0x1UL << FDCAN_IE_TEFFE_Pos) /*!< 0x00004000 */
#define FDCAN_IE_TEFFE     FDCAN_IE_TEFFE_Msk            /*!<Tx Event FIFO Full Enable                    */
#define FDCAN_IE_TEFLE_Pos (15U)
#define FDCAN_IE_TEFLE_Msk (0x1UL << FDCAN_IE_TEFLE_Pos) /*!< 0x00008000 */
#define FDCAN_IE_TEFLE     FDCAN_IE_TEFLE_Msk            /*!<Tx Event FIFO Element Lost Enable            */
#define FDCAN_IE_TSWE_Pos  (16U)
#define FDCAN_IE_TSWE_Msk  (0x1UL << FDCAN_IE_TSWE_Pos) /*!< 0x00010000 */
#define FDCAN_IE_TSWE      FDCAN_IE_TSWE_Msk            /*!<Timestamp Wraparound Enable                  */
#define FDCAN_IE_MRAFE_Pos (17U)
#define FDCAN_IE_MRAFE_Msk (0x1UL << FDCAN_IE_MRAFE_Pos) /*!< 0x00020000 */
#define FDCAN_IE_MRAFE     FDCAN_IE_MRAFE_Msk            /*!<Message RAM Access Failure Enable            */
#define FDCAN_IE_TOOE_Pos  (18U)
#define FDCAN_IE_TOOE_Msk  (0x1UL << FDCAN_IE_TOOE_Pos) /*!< 0x00040000 */
#define FDCAN_IE_TOOE      FDCAN_IE_TOOE_Msk            /*!<Timeout Occurred Enable                      */
#define FDCAN_IE_DRXE_Pos  (19U)
#define FDCAN_IE_DRXE_Msk  (0x1UL << FDCAN_IE_DRXE_Pos) /*!< 0x00080000 */
#define FDCAN_IE_DRXE      FDCAN_IE_DRXE_Msk            /*!<Message stored to Dedicated Rx Buffer Enable */
#define FDCAN_IE_BECE_Pos  (20U)
#define FDCAN_IE_BECE_Msk  (0x1UL << FDCAN_IE_BECE_Pos) /*!< 0x00100000 */
#define FDCAN_IE_BECE      FDCAN_IE_BECE_Msk            /*!<Bit Error Corrected Interrupt Enable         */
#define FDCAN_IE_BEUE_Pos  (21U)
#define FDCAN_IE_BEUE_Msk  (0x1UL << FDCAN_IE_BEUE_Pos) /*!< 0x00200000 */
#define FDCAN_IE_BEUE      FDCAN_IE_BEUE_Msk            /*!<Bit Error Uncorrected Interrupt Enable       */
#define FDCAN_IE_ELOE_Pos  (22U)
#define FDCAN_IE_ELOE_Msk  (0x1UL << FDCAN_IE_ELOE_Pos) /*!< 0x00400000 */
#define FDCAN_IE_ELOE      FDCAN_IE_ELOE_Msk            /*!<Error Logging Overflow Enable                */
#define FDCAN_IE_EPE_Pos   (23U)
#define FDCAN_IE_EPE_Msk   (0x1UL << FDCAN_IE_EPE_Pos) /*!< 0x00800000 */
#define FDCAN_IE_EPE       FDCAN_IE_EPE_Msk            /*!<Error Passive Enable                         */
#define FDCAN_IE_EWE_Pos   (24U)
#define FDCAN_IE_EWE_Msk   (0x1UL << FDCAN_IE_EWE_Pos) /*!< 0x01000000 */
#define FDCAN_IE_EWE       FDCAN_IE_EWE_Msk            /*!<Warning Status Enable                        */
#define FDCAN_IE_BOE_Pos   (25U)
#define FDCAN_IE_BOE_Msk   (0x1UL << FDCAN_IE_BOE_Pos) /*!< 0x02000000 */
#define FDCAN_IE_BOE       FDCAN_IE_BOE_Msk            /*!<Bus_Off Status Enable                        */
#define FDCAN_IE_WDIE_Pos  (26U)
#define FDCAN_IE_WDIE_Msk  (0x1UL << FDCAN_IE_WDIE_Pos) /*!< 0x04000000 */
#define FDCAN_IE_WDIE      FDCAN_IE_WDIE_Msk            /*!<Watchdog Interrupt Enable                    */
#define FDCAN_IE_PEAE_Pos  (27U)
#define FDCAN_IE_PEAE_Msk  (0x1UL << FDCAN_IE_PEAE_Pos) /*!< 0x08000000 */
#define FDCAN_IE_PEAE      FDCAN_IE_PEAE_Msk            /*!<Protocol Error in Arbitration Phase Enable   */
#define FDCAN_IE_PEDE_Pos  (28U)
#define FDCAN_IE_PEDE_Msk  (0x1UL << FDCAN_IE_PEDE_Pos) /*!< 0x10000000 */
#define FDCAN_IE_PEDE      FDCAN_IE_PEDE_Msk            /*!<Protocol Error in Data Phase Enable          */
#define FDCAN_IE_ARAE_Pos  (29U)
#define FDCAN_IE_ARAE_Msk  (0x1UL << FDCAN_IE_ARAE_Pos) /*!< 0x20000000 */
#define FDCAN_IE_ARAE      FDCAN_IE_ARAE_Msk            /*!<Access to Reserved Address Enable            */

