Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*****************  Bit definition for FDCAN_ILS register  **********************/
#define FDCAN_ILS_RF0NL_Pos (0U)
#define FDCAN_ILS_RF0NL_Msk (0x1UL << FDCAN_ILS_RF0NL_Pos) /*!< 0x00000001 */
#define FDCAN_ILS_RF0NL     FDCAN_ILS_RF0NL_Msk            /*!<Rx FIFO 0 New Message Line                  */
#define FDCAN_ILS_RF0WL_Pos (1U)
#define FDCAN_ILS_RF0WL_Msk (0x1UL << FDCAN_ILS_RF0WL_Pos) /*!< 0x00000002 */
#define FDCAN_ILS_RF0WL     FDCAN_ILS_RF0WL_Msk            /*!<Rx FIFO 0 Watermark Reached Line            */
#define FDCAN_ILS_RF0FL_Pos (2U)
#define FDCAN_ILS_RF0FL_Msk (0x1UL << FDCAN_ILS_RF0FL_Pos) /*!< 0x00000004 */
#define FDCAN_ILS_RF0FL     FDCAN_ILS_RF0FL_Msk            /*!<Rx FIFO 0 Full Line                         */
#define FDCAN_ILS_RF0LL_Pos (3U)
#define FDCAN_ILS_RF0LL_Msk (0x1UL << FDCAN_ILS_RF0LL_Pos) /*!< 0x00000008 */
#define FDCAN_ILS_RF0LL     FDCAN_ILS_RF0LL_Msk            /*!<Rx FIFO 0 Message Lost Line                 */
#define FDCAN_ILS_RF1NL_Pos (4U)
#define FDCAN_ILS_RF1NL_Msk (0x1UL << FDCAN_ILS_RF1NL_Pos) /*!< 0x00000010 */
#define FDCAN_ILS_RF1NL     FDCAN_ILS_RF1NL_Msk            /*!<Rx FIFO 1 New Message Line                  */
#define FDCAN_ILS_RF1WL_Pos (5U)
#define FDCAN_ILS_RF1WL_Msk (0x1UL << FDCAN_ILS_RF1WL_Pos) /*!< 0x00000020 */
#define FDCAN_ILS_RF1WL     FDCAN_ILS_RF1WL_Msk            /*!<Rx FIFO 1 Watermark Reached Line            */
#define FDCAN_ILS_RF1FL_Pos (6U)
#define FDCAN_ILS_RF1FL_Msk (0x1UL << FDCAN_ILS_RF1FL_Pos) /*!< 0x00000040 */
#define FDCAN_ILS_RF1FL     FDCAN_ILS_RF1FL_Msk            /*!<Rx FIFO 1 Full Line                         */
#define FDCAN_ILS_RF1LL_Pos (7U)
#define FDCAN_ILS_RF1LL_Msk (0x1UL << FDCAN_ILS_RF1LL_Pos) /*!< 0x00000080 */
#define FDCAN_ILS_RF1LL     FDCAN_ILS_RF1LL_Msk            /*!<Rx FIFO 1 Message Lost Line                 */
#define FDCAN_ILS_HPML_Pos  (8U)
#define FDCAN_ILS_HPML_Msk  (0x1UL << FDCAN_ILS_HPML_Pos) /*!< 0x00000100 */
#define FDCAN_ILS_HPML      FDCAN_ILS_HPML_Msk            /*!<High Priority Message Line                  */
#define FDCAN_ILS_TCL_Pos   (9U)
#define FDCAN_ILS_TCL_Msk   (0x1UL << FDCAN_ILS_TCL_Pos) /*!< 0x00000200 */
#define FDCAN_ILS_TCL       FDCAN_ILS_TCL_Msk            /*!<Transmission Completed Line                 */
#define FDCAN_ILS_TCFL_Pos  (10U)
#define FDCAN_ILS_TCFL_Msk  (0x1UL << FDCAN_ILS_TCFL_Pos) /*!< 0x00000400 */
#define FDCAN_ILS_TCFL      FDCAN_ILS_TCFL_Msk            /*!<Transmission Cancellation Finished Line     */
#define FDCAN_ILS_TFEL_Pos  (11U)
#define FDCAN_ILS_TFEL_Msk  (0x1UL << FDCAN_ILS_TFEL_Pos) /*!< 0x00000800 */
#define FDCAN_ILS_TFEL      FDCAN_ILS_TFEL_Msk            /*!<Tx FIFO Empty Line                          */
#define FDCAN_ILS_TEFNL_Pos (12U)
#define FDCAN_ILS_TEFNL_Msk (0x1UL << FDCAN_ILS_TEFNL_Pos) /*!< 0x00001000 */
#define FDCAN_ILS_TEFNL     FDCAN_ILS_TEFNL_Msk            /*!<Tx Event FIFO New Entry Line                */
#define FDCAN_ILS_TEFWL_Pos (13U)
#define FDCAN_ILS_TEFWL_Msk (0x1UL << FDCAN_ILS_TEFWL_Pos) /*!< 0x00002000 */
#define FDCAN_ILS_TEFWL     FDCAN_ILS_TEFWL_Msk            /*!<Tx Event FIFO Watermark Reached Line        */
#define FDCAN_ILS_TEFFL_Pos (14U)
#define FDCAN_ILS_TEFFL_Msk (0x1UL << FDCAN_ILS_TEFFL_Pos) /*!< 0x00004000 */
#define FDCAN_ILS_TEFFL     FDCAN_ILS_TEFFL_Msk            /*!<Tx Event FIFO Full Line                     */
#define FDCAN_ILS_TEFLL_Pos (15U)
#define FDCAN_ILS_TEFLL_Msk (0x1UL << FDCAN_ILS_TEFLL_Pos) /*!< 0x00008000 */
#define FDCAN_ILS_TEFLL     FDCAN_ILS_TEFLL_Msk            /*!<Tx Event FIFO Element Lost Line             */
#define FDCAN_ILS_TSWL_Pos  (16U)
#define FDCAN_ILS_TSWL_Msk  (0x1UL << FDCAN_ILS_TSWL_Pos) /*!< 0x00010000 */
#define FDCAN_ILS_TSWL      FDCAN_ILS_TSWL_Msk            /*!<Timestamp Wraparound Line                   */
#define FDCAN_ILS_MRAFE_Pos (17U)
#define FDCAN_ILS_MRAFE_Msk (0x1UL << FDCAN_ILS_MRAFE_Pos) /*!< 0x00020000 */
#define FDCAN_ILS_MRAFE     FDCAN_ILS_MRAFE_Msk            /*!<Message RAM Access Failure Line             */
#define FDCAN_ILS_TOOE_Pos  (18U)
#define FDCAN_ILS_TOOE_Msk  (0x1UL << FDCAN_ILS_TOOE_Pos) /*!< 0x00040000 */
#define FDCAN_ILS_TOOE      FDCAN_ILS_TOOE_Msk            /*!<Timeout Occurred Line                       */
#define FDCAN_ILS_DRXE_Pos  (19U)
#define FDCAN_ILS_DRXE_Msk  (0x1UL << FDCAN_ILS_DRXE_Pos) /*!< 0x00080000 */
#define FDCAN_ILS_DRXE      FDCAN_ILS_DRXE_Msk            /*!<Message stored to Dedicated Rx Buffer Line  */
#define FDCAN_ILS_BECE_Pos  (20U)
#define FDCAN_ILS_BECE_Msk  (0x1UL << FDCAN_ILS_BECE_Pos) /*!< 0x00100000 */
#define FDCAN_ILS_BECE      FDCAN_ILS_BECE_Msk            /*!<Bit Error Corrected Interrupt Line          */
#define FDCAN_ILS_BEUE_Pos  (21U)
#define FDCAN_ILS_BEUE_Msk  (0x1UL << FDCAN_ILS_BEUE_Pos) /*!< 0x00200000 */
#define FDCAN_ILS_BEUE      FDCAN_ILS_BEUE_Msk            /*!<Bit Error Uncorrected Interrupt Line        */
#define FDCAN_ILS_ELOE_Pos  (22U)
#define FDCAN_ILS_ELOE_Msk  (0x1UL << FDCAN_ILS_ELOE_Pos) /*!< 0x00400000 */
#define FDCAN_ILS_ELOE      FDCAN_ILS_ELOE_Msk            /*!<Error Logging Overflow Line                 */
#define FDCAN_ILS_EPE_Pos   (23U)
#define FDCAN_ILS_EPE_Msk   (0x1UL << FDCAN_ILS_EPE_Pos) /*!< 0x00800000 */
#define FDCAN_ILS_EPE       FDCAN_ILS_EPE_Msk            /*!<Error Passive Line                          */
#define FDCAN_ILS_EWE_Pos   (24U)
#define FDCAN_ILS_EWE_Msk   (0x1UL << FDCAN_ILS_EWE_Pos) /*!< 0x01000000 */
#define FDCAN_ILS_EWE       FDCAN_ILS_EWE_Msk            /*!<Warning Status Line                         */
#define FDCAN_ILS_BOE_Pos   (25U)
#define FDCAN_ILS_BOE_Msk   (0x1UL << FDCAN_ILS_BOE_Pos) /*!< 0x02000000 */
#define FDCAN_ILS_BOE       FDCAN_ILS_BOE_Msk            /*!<Bus_Off Status Line                         */
#define FDCAN_ILS_WDIE_Pos  (26U)
#define FDCAN_ILS_WDIE_Msk  (0x1UL << FDCAN_ILS_WDIE_Pos) /*!< 0x04000000 */
#define FDCAN_ILS_WDIE      FDCAN_ILS_WDIE_Msk            /*!<Watchdog Interrupt Line                     */
#define FDCAN_ILS_PEAE_Pos  (27U)
#define FDCAN_ILS_PEAE_Msk  (0x1UL << FDCAN_ILS_PEAE_Pos) /*!< 0x08000000 */
#define FDCAN_ILS_PEAE      FDCAN_ILS_PEAE_Msk            /*!<Protocol Error in Arbitration Phase Line    */
#define FDCAN_ILS_PEDE_Pos  (28U)
#define FDCAN_ILS_PEDE_Msk  (0x1UL << FDCAN_ILS_PEDE_Pos) /*!< 0x10000000 */
#define FDCAN_ILS_PEDE      FDCAN_ILS_PEDE_Msk            /*!<Protocol Error in Data Phase Line           */
#define FDCAN_ILS_ARAE_Pos  (29U)
#define FDCAN_ILS_ARAE_Msk  (0x1UL << FDCAN_ILS_ARAE_Pos) /*!< 0x20000000 */
#define FDCAN_ILS_ARAE      FDCAN_ILS_ARAE_Msk            /*!<Access to Reserved Address Line             */

