Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*****************  Bit definition for FDCAN_ILE register  **********************/
#define FDCAN_ILE_EINT0_Pos (0U)
#define FDCAN_ILE_EINT0_Msk (0x1UL << FDCAN_ILE_EINT0_Pos) /*!< 0x00000001 */
#define FDCAN_ILE_EINT0     FDCAN_ILE_EINT0_Msk            /*!<Enable Interrupt Line 0                   */
#define FDCAN_ILE_EINT1_Pos (1U)
#define FDCAN_ILE_EINT1_Msk (0x1UL << FDCAN_ILE_EINT1_Pos) /*!< 0x00000002 */
#define FDCAN_ILE_EINT1     FDCAN_ILE_EINT1_Msk            /*!<Enable Interrupt Line 1                   */

/*****************  Bit definition for FDCAN_GFC register  **********************/
#define FDCAN_GFC_RRFE_Pos (0U)
#define FDCAN_GFC_RRFE_Msk (0x1UL << FDCAN_GFC_RRFE_Pos) /*!< 0x00000001 */
#define FDCAN_GFC_RRFE     FDCAN_GFC_RRFE_Msk            /*!<Reject Remote Frames Extended             */
#define FDCAN_GFC_RRFS_Pos (1U)
#define FDCAN_GFC_RRFS_Msk (0x1UL << FDCAN_GFC_RRFS_Pos) /*!< 0x00000002 */
#define FDCAN_GFC_RRFS     FDCAN_GFC_RRFS_Msk            /*!<Reject Remote Frames Standard             */
#define FDCAN_GFC_ANFE_Pos (2U)
#define FDCAN_GFC_ANFE_Msk (0x3UL << FDCAN_GFC_ANFE_Pos) /*!< 0x0000000C */
#define FDCAN_GFC_ANFE     FDCAN_GFC_ANFE_Msk            /*!<Accept Non-matching Frames Extended       */
#define FDCAN_GFC_ANFS_Pos (4U)
#define FDCAN_GFC_ANFS_Msk (0x3UL << FDCAN_GFC_ANFS_Pos) /*!< 0x00000030 */
#define FDCAN_GFC_ANFS     FDCAN_GFC_ANFS_Msk            /*!<Accept Non-matching Frames Standard       */

/*****************  Bit definition for FDCAN_SIDFC register  ********************/
#define FDCAN_SIDFC_FLSSA_Pos (2U)
#define FDCAN_SIDFC_FLSSA_Msk (0x3FFFUL << FDCAN_SIDFC_FLSSA_Pos) /*!< 0x0000FFFC */
#define FDCAN_SIDFC_FLSSA     FDCAN_SIDFC_FLSSA_Msk               /*!<Filter List Standard Start Address        */
#define FDCAN_SIDFC_LSS_Pos   (16U)
#define FDCAN_SIDFC_LSS_Msk   (0xFFUL << FDCAN_SIDFC_LSS_Pos) /*!< 0x00FF0000 */
#define FDCAN_SIDFC_LSS       FDCAN_SIDFC_LSS_Msk             /*!<List Size Standard                        */

/*****************  Bit definition for FDCAN_XIDFC register  ********************/
#define FDCAN_XIDFC_FLESA_Pos (2U)
#define FDCAN_XIDFC_FLESA_Msk (0x3FFFUL << FDCAN_XIDFC_FLESA_Pos) /*!< 0x0000FFFC */
#define FDCAN_XIDFC_FLESA     FDCAN_XIDFC_FLESA_Msk               /*!<Filter List Standard Start Address        */
#define FDCAN_XIDFC_LSE_Pos   (16U)
#define FDCAN_XIDFC_LSE_Msk   (0x7FUL << FDCAN_XIDFC_LSE_Pos) /*!< 0x007F0000 */
#define FDCAN_XIDFC_LSE       FDCAN_XIDFC_LSE_Msk             /*!<List Size Extended                        */

/*****************  Bit definition for FDCAN_XIDAM register  ********************/
#define FDCAN_XIDAM_EIDM_Pos (0U)
#define FDCAN_XIDAM_EIDM_Msk (0x1FFFFFFFUL << FDCAN_XIDAM_EIDM_Pos) /*!< 0x1FFFFFFF */
#define FDCAN_XIDAM_EIDM     FDCAN_XIDAM_EIDM_Msk                   /*!<Extended ID Mask                          */

/*****************  Bit definition for FDCAN_HPMS register  *********************/
#define FDCAN_HPMS_BIDX_Pos (0U)
#define FDCAN_HPMS_BIDX_Msk (0x3FUL << FDCAN_HPMS_BIDX_Pos) /*!< 0x0000003F */
#define FDCAN_HPMS_BIDX     FDCAN_HPMS_BIDX_Msk             /*!<Buffer Index                              */
#define FDCAN_HPMS_MSI_Pos  (6U)
#define FDCAN_HPMS_MSI_Msk  (0x3UL << FDCAN_HPMS_MSI_Pos) /*!< 0x000000C0 */
#define FDCAN_HPMS_MSI      FDCAN_HPMS_MSI_Msk            /*!<Message Storage Indicator                 */
#define FDCAN_HPMS_FIDX_Pos (8U)
#define FDCAN_HPMS_FIDX_Msk (0x7FUL << FDCAN_HPMS_FIDX_Pos) /*!< 0x00007F00 */
#define FDCAN_HPMS_FIDX     FDCAN_HPMS_FIDX_Msk             /*!<Filter Index                              */
#define FDCAN_HPMS_FLST_Pos (15U)
#define FDCAN_HPMS_FLST_Msk (0x1UL << FDCAN_HPMS_FLST_Pos) /*!< 0x00008000 */
#define FDCAN_HPMS_FLST     FDCAN_HPMS_FLST_Msk            /*!<Filter List                               */

/*****************  Bit definition for FDCAN_NDAT1 register  ********************/
#define FDCAN_NDAT1_ND0_Pos  (0U)
#define FDCAN_NDAT1_ND0_Msk  (0x1UL << FDCAN_NDAT1_ND0_Pos) /*!< 0x00000001 */
#define FDCAN_NDAT1_ND0      FDCAN_NDAT1_ND0_Msk            /*!<New Data flag of Rx Buffer 0              */
#define FDCAN_NDAT1_ND1_Pos  (1U)
#define FDCAN_NDAT1_ND1_Msk  (0x1UL << FDCAN_NDAT1_ND1_Pos) /*!< 0x00000002 */
#define FDCAN_NDAT1_ND1      FDCAN_NDAT1_ND1_Msk            /*!<New Data flag of Rx Buffer 1              */
#define FDCAN_NDAT1_ND2_Pos  (2U)
#define FDCAN_NDAT1_ND2_Msk  (0x1UL << FDCAN_NDAT1_ND2_Pos) /*!< 0x00000004 */
#define FDCAN_NDAT1_ND2      FDCAN_NDAT1_ND2_Msk            /*!<New Data flag of Rx Buffer 2              */
#define FDCAN_NDAT1_ND3_Pos  (3U)
#define FDCAN_NDAT1_ND3_Msk  (0x1UL << FDCAN_NDAT1_ND3_Pos) /*!< 0x00000008 */
#define FDCAN_NDAT1_ND3      FDCAN_NDAT1_ND3_Msk            /*!<New Data flag of Rx Buffer 3              */
#define FDCAN_NDAT1_ND4_Pos  (4U)
#define FDCAN_NDAT1_ND4_Msk  (0x1UL << FDCAN_NDAT1_ND4_Pos) /*!< 0x00000010 */
#define FDCAN_NDAT1_ND4      FDCAN_NDAT1_ND4_Msk            /*!<New Data flag of Rx Buffer 4              */
#define FDCAN_NDAT1_ND5_Pos  (5U)
#define FDCAN_NDAT1_ND5_Msk  (0x1UL << FDCAN_NDAT1_ND5_Pos) /*!< 0x00000020 */
#define FDCAN_NDAT1_ND5      FDCAN_NDAT1_ND5_Msk            /*!<New Data flag of Rx Buffer 5              */
#define FDCAN_NDAT1_ND6_Pos  (6U)
#define FDCAN_NDAT1_ND6_Msk  (0x1UL << FDCAN_NDAT1_ND6_Pos) /*!< 0x00000040 */
#define FDCAN_NDAT1_ND6      FDCAN_NDAT1_ND6_Msk            /*!<New Data flag of Rx Buffer 6              */
#define FDCAN_NDAT1_ND7_Pos  (7U)
#define FDCAN_NDAT1_ND7_Msk  (0x1UL << FDCAN_NDAT1_ND7_Pos) /*!< 0x00000080 */
#define FDCAN_NDAT1_ND7      FDCAN_NDAT1_ND7_Msk            /*!<New Data flag of Rx Buffer 7              */
#define FDCAN_NDAT1_ND8_Pos  (8U)
#define FDCAN_NDAT1_ND8_Msk  (0x1UL << FDCAN_NDAT1_ND8_Pos) /*!< 0x00000100 */
#define FDCAN_NDAT1_ND8      FDCAN_NDAT1_ND8_Msk            /*!<New Data flag of Rx Buffer 8              */
#define FDCAN_NDAT1_ND9_Pos  (9U)
#define FDCAN_NDAT1_ND9_Msk  (0x1UL << FDCAN_NDAT1_ND9_Pos) /*!< 0x00000200 */
#define FDCAN_NDAT1_ND9      FDCAN_NDAT1_ND9_Msk            /*!<New Data flag of Rx Buffer 9              */
#define FDCAN_NDAT1_ND10_Pos (10U)
#define FDCAN_NDAT1_ND10_Msk (0x1UL << FDCAN_NDAT1_ND10_Pos) /*!< 0x00000400 */
#define FDCAN_NDAT1_ND10     FDCAN_NDAT1_ND10_Msk            /*!<New Data flag of Rx Buffer 10             */
#define FDCAN_NDAT1_ND11_Pos (11U)
#define FDCAN_NDAT1_ND11_Msk (0x1UL << FDCAN_NDAT1_ND11_Pos) /*!< 0x00000800 */
#define FDCAN_NDAT1_ND11     FDCAN_NDAT1_ND11_Msk            /*!<New Data flag of Rx Buffer 11             */
#define FDCAN_NDAT1_ND12_Pos (12U)
#define FDCAN_NDAT1_ND12_Msk (0x1UL << FDCAN_NDAT1_ND12_Pos) /*!< 0x00001000 */
#define FDCAN_NDAT1_ND12     FDCAN_NDAT1_ND12_Msk            /*!<New Data flag of Rx Buffer 12             */
#define FDCAN_NDAT1_ND13_Pos (13U)
#define FDCAN_NDAT1_ND13_Msk (0x1UL << FDCAN_NDAT1_ND13_Pos) /*!< 0x00002000 */
#define FDCAN_NDAT1_ND13     FDCAN_NDAT1_ND13_Msk            /*!<New Data flag of Rx Buffer 13             */
#define FDCAN_NDAT1_ND14_Pos (14U)
#define FDCAN_NDAT1_ND14_Msk (0x1UL << FDCAN_NDAT1_ND14_Pos) /*!< 0x00004000 */
#define FDCAN_NDAT1_ND14     FDCAN_NDAT1_ND14_Msk            /*!<New Data flag of Rx Buffer 14             */
#define FDCAN_NDAT1_ND15_Pos (15U)
#define FDCAN_NDAT1_ND15_Msk (0x1UL << FDCAN_NDAT1_ND15_Pos) /*!< 0x00008000 */
#define FDCAN_NDAT1_ND15     FDCAN_NDAT1_ND15_Msk            /*!<New Data flag of Rx Buffer 15             */
#define FDCAN_NDAT1_ND16_Pos (16U)
#define FDCAN_NDAT1_ND16_Msk (0x1UL << FDCAN_NDAT1_ND16_Pos) /*!< 0x00010000 */
#define FDCAN_NDAT1_ND16     FDCAN_NDAT1_ND16_Msk            /*!<New Data flag of Rx Buffer 16             */
#define FDCAN_NDAT1_ND17_Pos (17U)
#define FDCAN_NDAT1_ND17_Msk (0x1UL << FDCAN_NDAT1_ND17_Pos) /*!< 0x00020000 */
#define FDCAN_NDAT1_ND17     FDCAN_NDAT1_ND17_Msk            /*!<New Data flag of Rx Buffer 17             */
#define FDCAN_NDAT1_ND18_Pos (18U)
#define FDCAN_NDAT1_ND18_Msk (0x1UL << FDCAN_NDAT1_ND18_Pos) /*!< 0x00040000 */
#define FDCAN_NDAT1_ND18     FDCAN_NDAT1_ND18_Msk            /*!<New Data flag of Rx Buffer 18             */
#define FDCAN_NDAT1_ND19_Pos (19U)
#define FDCAN_NDAT1_ND19_Msk (0x1UL << FDCAN_NDAT1_ND19_Pos) /*!< 0x00080000 */
#define FDCAN_NDAT1_ND19     FDCAN_NDAT1_ND19_Msk            /*!<New Data flag of Rx Buffer 19             */
#define FDCAN_NDAT1_ND20_Pos (20U)
#define FDCAN_NDAT1_ND20_Msk (0x1UL << FDCAN_NDAT1_ND20_Pos) /*!< 0x00100000 */
#define FDCAN_NDAT1_ND20     FDCAN_NDAT1_ND20_Msk            /*!<New Data flag of Rx Buffer 20             */
#define FDCAN_NDAT1_ND21_Pos (21U)
#define FDCAN_NDAT1_ND21_Msk (0x1UL << FDCAN_NDAT1_ND21_Pos) /*!< 0x00200000 */
#define FDCAN_NDAT1_ND21     FDCAN_NDAT1_ND21_Msk            /*!<New Data flag of Rx Buffer 21             */
#define FDCAN_NDAT1_ND22_Pos (22U)
#define FDCAN_NDAT1_ND22_Msk (0x1UL << FDCAN_NDAT1_ND22_Pos) /*!< 0x00400000 */
#define FDCAN_NDAT1_ND22     FDCAN_NDAT1_ND22_Msk            /*!<New Data flag of Rx Buffer 22             */
#define FDCAN_NDAT1_ND23_Pos (23U)
#define FDCAN_NDAT1_ND23_Msk (0x1UL << FDCAN_NDAT1_ND23_Pos) /*!< 0x00800000 */
#define FDCAN_NDAT1_ND23     FDCAN_NDAT1_ND23_Msk            /*!<New Data flag of Rx Buffer 23             */
#define FDCAN_NDAT1_ND24_Pos (24U)
#define FDCAN_NDAT1_ND24_Msk (0x1UL << FDCAN_NDAT1_ND24_Pos) /*!< 0x01000000 */
#define FDCAN_NDAT1_ND24     FDCAN_NDAT1_ND24_Msk            /*!<New Data flag of Rx Buffer 24             */
#define FDCAN_NDAT1_ND25_Pos (25U)
#define FDCAN_NDAT1_ND25_Msk (0x1UL << FDCAN_NDAT1_ND25_Pos) /*!< 0x02000000 */
#define FDCAN_NDAT1_ND25     FDCAN_NDAT1_ND25_Msk            /*!<New Data flag of Rx Buffer 25             */
#define FDCAN_NDAT1_ND26_Pos (26U)
#define FDCAN_NDAT1_ND26_Msk (0x1UL << FDCAN_NDAT1_ND26_Pos) /*!< 0x04000000 */
#define FDCAN_NDAT1_ND26     FDCAN_NDAT1_ND26_Msk            /*!<New Data flag of Rx Buffer 26             */
#define FDCAN_NDAT1_ND27_Pos (27U)
#define FDCAN_NDAT1_ND27_Msk (0x1UL << FDCAN_NDAT1_ND27_Pos) /*!< 0x08000000 */
#define FDCAN_NDAT1_ND27     FDCAN_NDAT1_ND27_Msk            /*!<New Data flag of Rx Buffer 27             */
#define FDCAN_NDAT1_ND28_Pos (28U)
#define FDCAN_NDAT1_ND28_Msk (0x1UL << FDCAN_NDAT1_ND28_Pos) /*!< 0x10000000 */
#define FDCAN_NDAT1_ND28     FDCAN_NDAT1_ND28_Msk            /*!<New Data flag of Rx Buffer 28             */
#define FDCAN_NDAT1_ND29_Pos (29U)
#define FDCAN_NDAT1_ND29_Msk (0x1UL << FDCAN_NDAT1_ND29_Pos) /*!< 0x20000000 */
#define FDCAN_NDAT1_ND29     FDCAN_NDAT1_ND29_Msk            /*!<New Data flag of Rx Buffer 29             */
#define FDCAN_NDAT1_ND30_Pos (30U)
#define FDCAN_NDAT1_ND30_Msk (0x1UL << FDCAN_NDAT1_ND30_Pos) /*!< 0x40000000 */
#define FDCAN_NDAT1_ND30     FDCAN_NDAT1_ND30_Msk            /*!<New Data flag of Rx Buffer 30             */
#define FDCAN_NDAT1_ND31_Pos (31U)
#define FDCAN_NDAT1_ND31_Msk (0x1UL << FDCAN_NDAT1_ND31_Pos) /*!< 0x80000000 */
#define FDCAN_NDAT1_ND31     FDCAN_NDAT1_ND31_Msk            /*!<New Data flag of Rx Buffer 31             */

/*****************  Bit definition for FDCAN_NDAT2 register  ********************/
#define FDCAN_NDAT2_ND32_Pos (0U)
#define FDCAN_NDAT2_ND32_Msk (0x1UL << FDCAN_NDAT2_ND32_Pos) /*!< 0x00000001 */
#define FDCAN_NDAT2_ND32     FDCAN_NDAT2_ND32_Msk            /*!<New Data flag of Rx Buffer 32             */
#define FDCAN_NDAT2_ND33_Pos (1U)
#define FDCAN_NDAT2_ND33_Msk (0x1UL << FDCAN_NDAT2_ND33_Pos) /*!< 0x00000002 */
#define FDCAN_NDAT2_ND33     FDCAN_NDAT2_ND33_Msk            /*!<New Data flag of Rx Buffer 33             */
#define FDCAN_NDAT2_ND34_Pos (2U)
#define FDCAN_NDAT2_ND34_Msk (0x1UL << FDCAN_NDAT2_ND34_Pos) /*!< 0x00000004 */
#define FDCAN_NDAT2_ND34     FDCAN_NDAT2_ND34_Msk            /*!<New Data flag of Rx Buffer 34             */
#define FDCAN_NDAT2_ND35_Pos (3U)
#define FDCAN_NDAT2_ND35_Msk (0x1UL << FDCAN_NDAT2_ND35_Pos) /*!< 0x00000008 */
#define FDCAN_NDAT2_ND35     FDCAN_NDAT2_ND35_Msk            /*!<New Data flag of Rx Buffer 35             */
#define FDCAN_NDAT2_ND36_Pos (4U)
#define FDCAN_NDAT2_ND36_Msk (0x1UL << FDCAN_NDAT2_ND36_Pos) /*!< 0x00000010 */
#define FDCAN_NDAT2_ND36     FDCAN_NDAT2_ND36_Msk            /*!<New Data flag of Rx Buffer 36             */
#define FDCAN_NDAT2_ND37_Pos (5U)
#define FDCAN_NDAT2_ND37_Msk (0x1UL << FDCAN_NDAT2_ND37_Pos) /*!< 0x00000020 */
#define FDCAN_NDAT2_ND37     FDCAN_NDAT2_ND37_Msk            /*!<New Data flag of Rx Buffer 37             */
#define FDCAN_NDAT2_ND38_Pos (6U)
#define FDCAN_NDAT2_ND38_Msk (0x1UL << FDCAN_NDAT2_ND38_Pos) /*!< 0x00000040 */
#define FDCAN_NDAT2_ND38     FDCAN_NDAT2_ND38_Msk            /*!<New Data flag of Rx Buffer 38             */
#define FDCAN_NDAT2_ND39_Pos (7U)
#define FDCAN_NDAT2_ND39_Msk (0x1UL << FDCAN_NDAT2_ND39_Pos) /*!< 0x00000080 */
#define FDCAN_NDAT2_ND39     FDCAN_NDAT2_ND39_Msk            /*!<New Data flag of Rx Buffer 39             */
#define FDCAN_NDAT2_ND40_Pos (8U)
#define FDCAN_NDAT2_ND40_Msk (0x1UL << FDCAN_NDAT2_ND40_Pos) /*!< 0x00000100 */
#define FDCAN_NDAT2_ND40     FDCAN_NDAT2_ND40_Msk            /*!<New Data flag of Rx Buffer 40             */
#define FDCAN_NDAT2_ND41_Pos (9U)
#define FDCAN_NDAT2_ND41_Msk (0x1UL << FDCAN_NDAT2_ND41_Pos) /*!< 0x00000200 */
#define FDCAN_NDAT2_ND41     FDCAN_NDAT2_ND41_Msk            /*!<New Data flag of Rx Buffer 41             */
#define FDCAN_NDAT2_ND42_Pos (10U)
#define FDCAN_NDAT2_ND42_Msk (0x1UL << FDCAN_NDAT2_ND42_Pos) /*!< 0x00000400 */
#define FDCAN_NDAT2_ND42     FDCAN_NDAT2_ND42_Msk            /*!<New Data flag of Rx Buffer 42             */
#define FDCAN_NDAT2_ND43_Pos (11U)
#define FDCAN_NDAT2_ND43_Msk (0x1UL << FDCAN_NDAT2_ND43_Pos) /*!< 0x00000800 */
#define FDCAN_NDAT2_ND43     FDCAN_NDAT2_ND43_Msk            /*!<New Data flag of Rx Buffer 43             */
#define FDCAN_NDAT2_ND44_Pos (12U)
#define FDCAN_NDAT2_ND44_Msk (0x1UL << FDCAN_NDAT2_ND44_Pos) /*!< 0x00001000 */
#define FDCAN_NDAT2_ND44     FDCAN_NDAT2_ND44_Msk            /*!<New Data flag of Rx Buffer 44             */
#define FDCAN_NDAT2_ND45_Pos (13U)
#define FDCAN_NDAT2_ND45_Msk (0x1UL << FDCAN_NDAT2_ND45_Pos) /*!< 0x00002000 */
#define FDCAN_NDAT2_ND45     FDCAN_NDAT2_ND45_Msk            /*!<New Data flag of Rx Buffer 45             */
#define FDCAN_NDAT2_ND46_Pos (14U)
#define FDCAN_NDAT2_ND46_Msk (0x1UL << FDCAN_NDAT2_ND46_Pos) /*!< 0x00004000 */
#define FDCAN_NDAT2_ND46     FDCAN_NDAT2_ND46_Msk            /*!<New Data flag of Rx Buffer 46             */
#define FDCAN_NDAT2_ND47_Pos (15U)
#define FDCAN_NDAT2_ND47_Msk (0x1UL << FDCAN_NDAT2_ND47_Pos) /*!< 0x00008000 */
#define FDCAN_NDAT2_ND47     FDCAN_NDAT2_ND47_Msk            /*!<New Data flag of Rx Buffer 47             */
#define FDCAN_NDAT2_ND48_Pos (16U)
#define FDCAN_NDAT2_ND48_Msk (0x1UL << FDCAN_NDAT2_ND48_Pos) /*!< 0x00010000 */
#define FDCAN_NDAT2_ND48     FDCAN_NDAT2_ND48_Msk            /*!<New Data flag of Rx Buffer 48             */
#define FDCAN_NDAT2_ND49_Pos (17U)
#define FDCAN_NDAT2_ND49_Msk (0x1UL << FDCAN_NDAT2_ND49_Pos) /*!< 0x00020000 */
#define FDCAN_NDAT2_ND49     FDCAN_NDAT2_ND49_Msk            /*!<New Data flag of Rx Buffer 49             */
#define FDCAN_NDAT2_ND50_Pos (18U)
#define FDCAN_NDAT2_ND50_Msk (0x1UL << FDCAN_NDAT2_ND50_Pos) /*!< 0x00040000 */
#define FDCAN_NDAT2_ND50     FDCAN_NDAT2_ND50_Msk            /*!<New Data flag of Rx Buffer 50             */
#define FDCAN_NDAT2_ND51_Pos (19U)
#define FDCAN_NDAT2_ND51_Msk (0x1UL << FDCAN_NDAT2_ND51_Pos) /*!< 0x00080000 */
#define FDCAN_NDAT2_ND51     FDCAN_NDAT2_ND51_Msk            /*!<New Data flag of Rx Buffer 51             */
#define FDCAN_NDAT2_ND52_Pos (20U)
#define FDCAN_NDAT2_ND52_Msk (0x1UL << FDCAN_NDAT2_ND52_Pos) /*!< 0x00100000 */
#define FDCAN_NDAT2_ND52     FDCAN_NDAT2_ND52_Msk            /*!<New Data flag of Rx Buffer 52             */
#define FDCAN_NDAT2_ND53_Pos (21U)
#define FDCAN_NDAT2_ND53_Msk (0x1UL << FDCAN_NDAT2_ND53_Pos) /*!< 0x00200000 */
#define FDCAN_NDAT2_ND53     FDCAN_NDAT2_ND53_Msk            /*!<New Data flag of Rx Buffer 53             */
#define FDCAN_NDAT2_ND54_Pos (22U)
#define FDCAN_NDAT2_ND54_Msk (0x1UL << FDCAN_NDAT2_ND54_Pos) /*!< 0x00400000 */
#define FDCAN_NDAT2_ND54     FDCAN_NDAT2_ND54_Msk            /*!<New Data flag of Rx Buffer 54             */
#define FDCAN_NDAT2_ND55_Pos (23U)
#define FDCAN_NDAT2_ND55_Msk (0x1UL << FDCAN_NDAT2_ND55_Pos) /*!< 0x00800000 */
#define FDCAN_NDAT2_ND55     FDCAN_NDAT2_ND55_Msk            /*!<New Data flag of Rx Buffer 55             */
#define FDCAN_NDAT2_ND56_Pos (24U)
#define FDCAN_NDAT2_ND56_Msk (0x1UL << FDCAN_NDAT2_ND56_Pos) /*!< 0x01000000 */
#define FDCAN_NDAT2_ND56     FDCAN_NDAT2_ND56_Msk            /*!<New Data flag of Rx Buffer 56             */
#define FDCAN_NDAT2_ND57_Pos (25U)
#define FDCAN_NDAT2_ND57_Msk (0x1UL << FDCAN_NDAT2_ND57_Pos) /*!< 0x02000000 */
#define FDCAN_NDAT2_ND57     FDCAN_NDAT2_ND57_Msk            /*!<New Data flag of Rx Buffer 57             */
#define FDCAN_NDAT2_ND58_Pos (26U)
#define FDCAN_NDAT2_ND58_Msk (0x1UL << FDCAN_NDAT2_ND58_Pos) /*!< 0x04000000 */
#define FDCAN_NDAT2_ND58     FDCAN_NDAT2_ND58_Msk            /*!<New Data flag of Rx Buffer 58             */
#define FDCAN_NDAT2_ND59_Pos (27U)
#define FDCAN_NDAT2_ND59_Msk (0x1UL << FDCAN_NDAT2_ND59_Pos) /*!< 0x08000000 */
#define FDCAN_NDAT2_ND59     FDCAN_NDAT2_ND59_Msk            /*!<New Data flag of Rx Buffer 59             */
#define FDCAN_NDAT2_ND60_Pos (28U)
#define FDCAN_NDAT2_ND60_Msk (0x1UL << FDCAN_NDAT2_ND60_Pos) /*!< 0x10000000 */
#define FDCAN_NDAT2_ND60     FDCAN_NDAT2_ND60_Msk            /*!<New Data flag of Rx Buffer 60             */
#define FDCAN_NDAT2_ND61_Pos (29U)
#define FDCAN_NDAT2_ND61_Msk (0x1UL << FDCAN_NDAT2_ND61_Pos) /*!< 0x20000000 */
#define FDCAN_NDAT2_ND61     FDCAN_NDAT2_ND61_Msk            /*!<New Data flag of Rx Buffer 61             */
#define FDCAN_NDAT2_ND62_Pos (30U)
#define FDCAN_NDAT2_ND62_Msk (0x1UL << FDCAN_NDAT2_ND62_Pos) /*!< 0x40000000 */
#define FDCAN_NDAT2_ND62     FDCAN_NDAT2_ND62_Msk            /*!<New Data flag of Rx Buffer 62             */
#define FDCAN_NDAT2_ND63_Pos (31U)
#define FDCAN_NDAT2_ND63_Msk (0x1UL << FDCAN_NDAT2_ND63_Pos) /*!< 0x80000000 */
#define FDCAN_NDAT2_ND63     FDCAN_NDAT2_ND63_Msk            /*!<New Data flag of Rx Buffer 63             */

