Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*****************  Bit definition for FDCAN_RXF0C register  ********************/
#define FDCAN_RXF0C_F0SA_Pos (2U)
#define FDCAN_RXF0C_F0SA_Msk (0x3FFFUL << FDCAN_RXF0C_F0SA_Pos) /*!< 0x0000FFFC */
#define FDCAN_RXF0C_F0SA     FDCAN_RXF0C_F0SA_Msk               /*!<Rx FIFO 0 Start Address                   */
#define FDCAN_RXF0C_F0S_Pos  (16U)
#define FDCAN_RXF0C_F0S_Msk  (0x7FUL << FDCAN_RXF0C_F0S_Pos) /*!< 0x007F0000 */
#define FDCAN_RXF0C_F0S      FDCAN_RXF0C_F0S_Msk             /*!<Number of Rx FIFO 0 elements              */
#define FDCAN_RXF0C_F0WM_Pos (24U)
#define FDCAN_RXF0C_F0WM_Msk (0x7FUL << FDCAN_RXF0C_F0WM_Pos) /*!< 0x7F000000 */
#define FDCAN_RXF0C_F0WM     FDCAN_RXF0C_F0WM_Msk             /*!<FIFO 0 Watermark                          */
#define FDCAN_RXF0C_F0OM_Pos (31U)
#define FDCAN_RXF0C_F0OM_Msk (0x1UL << FDCAN_RXF0C_F0OM_Pos) /*!< 0x80000000 */
#define FDCAN_RXF0C_F0OM     FDCAN_RXF0C_F0OM_Msk            /*!<FIFO 0 Operation Mode                     */

/*****************  Bit definition for FDCAN_RXF0S register  ********************/
#define FDCAN_RXF0S_F0FL_Pos (0U)
#define FDCAN_RXF0S_F0FL_Msk (0x7FUL << FDCAN_RXF0S_F0FL_Pos) /*!< 0x0000007F */
#define FDCAN_RXF0S_F0FL     FDCAN_RXF0S_F0FL_Msk             /*!<Rx FIFO 0 Fill Level                      */
#define FDCAN_RXF0S_F0GI_Pos (8U)
#define FDCAN_RXF0S_F0GI_Msk (0x3FUL << FDCAN_RXF0S_F0GI_Pos) /*!< 0x00003F00 */
#define FDCAN_RXF0S_F0GI     FDCAN_RXF0S_F0GI_Msk             /*!<Rx FIFO 0 Get Index                       */
#define FDCAN_RXF0S_F0PI_Pos (16U)
#define FDCAN_RXF0S_F0PI_Msk (0x3FUL << FDCAN_RXF0S_F0PI_Pos) /*!< 0x003F0000 */
#define FDCAN_RXF0S_F0PI     FDCAN_RXF0S_F0PI_Msk             /*!<Rx FIFO 0 Put Index                       */
#define FDCAN_RXF0S_F0F_Pos  (24U)
#define FDCAN_RXF0S_F0F_Msk  (0x1UL << FDCAN_RXF0S_F0F_Pos) /*!< 0x01000000 */
#define FDCAN_RXF0S_F0F      FDCAN_RXF0S_F0F_Msk            /*!<Rx FIFO 0 Full                            */
#define FDCAN_RXF0S_RF0L_Pos (25U)
#define FDCAN_RXF0S_RF0L_Msk (0x1UL << FDCAN_RXF0S_RF0L_Pos) /*!< 0x02000000 */
#define FDCAN_RXF0S_RF0L     FDCAN_RXF0S_RF0L_Msk            /*!<Rx FIFO 0 Message Lost                    */

/*****************  Bit definition for FDCAN_RXF0A register  ********************/
#define FDCAN_RXF0A_F0AI_Pos (0U)
#define FDCAN_RXF0A_F0AI_Msk (0x3FUL << FDCAN_RXF0A_F0AI_Pos) /*!< 0x0000003F */
#define FDCAN_RXF0A_F0AI     FDCAN_RXF0A_F0AI_Msk             /*!<Rx FIFO 0 Acknowledge Index               */

/*****************  Bit definition for FDCAN_RXBC register  ********************/
#define FDCAN_RXBC_RBSA_Pos (2U)
#define FDCAN_RXBC_RBSA_Msk (0x3FFFUL << FDCAN_RXBC_RBSA_Pos) /*!< 0x0000FFFC */
#define FDCAN_RXBC_RBSA     FDCAN_RXBC_RBSA_Msk               /*!<Rx Buffer Start Address                   */

/*****************  Bit definition for FDCAN_RXF1C register  ********************/
#define FDCAN_RXF1C_F1SA_Pos (2U)
#define FDCAN_RXF1C_F1SA_Msk (0x3FFFUL << FDCAN_RXF1C_F1SA_Pos) /*!< 0x0000FFFC */
#define FDCAN_RXF1C_F1SA     FDCAN_RXF1C_F1SA_Msk               /*!<Rx FIFO 1 Start Address                   */
#define FDCAN_RXF1C_F1S_Pos  (16U)
#define FDCAN_RXF1C_F1S_Msk  (0x7FUL << FDCAN_RXF1C_F1S_Pos) /*!< 0x007F0000 */
#define FDCAN_RXF1C_F1S      FDCAN_RXF1C_F1S_Msk             /*!<Number of Rx FIFO 1 elements              */
#define FDCAN_RXF1C_F1WM_Pos (24U)
#define FDCAN_RXF1C_F1WM_Msk (0x7FUL << FDCAN_RXF1C_F1WM_Pos) /*!< 0x7F000000 */
#define FDCAN_RXF1C_F1WM     FDCAN_RXF1C_F1WM_Msk             /*!<Rx FIFO 1 Watermark                       */
#define FDCAN_RXF1C_F1OM_Pos (31U)
#define FDCAN_RXF1C_F1OM_Msk (0x1UL << FDCAN_RXF1C_F1OM_Pos) /*!< 0x80000000 */
#define FDCAN_RXF1C_F1OM     FDCAN_RXF1C_F1OM_Msk            /*!<FIFO 1 Operation Mode                     */

/*****************  Bit definition for FDCAN_RXF1S register  ********************/
#define FDCAN_RXF1S_F1FL_Pos (0U)
#define FDCAN_RXF1S_F1FL_Msk (0x7FUL << FDCAN_RXF1S_F1FL_Pos) /*!< 0x0000007F */
#define FDCAN_RXF1S_F1FL     FDCAN_RXF1S_F1FL_Msk             /*!<Rx FIFO 1 Fill Level                      */
#define FDCAN_RXF1S_F1GI_Pos (8U)
#define FDCAN_RXF1S_F1GI_Msk (0x3FUL << FDCAN_RXF1S_F1GI_Pos) /*!< 0x00003F00 */
#define FDCAN_RXF1S_F1GI     FDCAN_RXF1S_F1GI_Msk             /*!<Rx FIFO 1 Get Index                       */
#define FDCAN_RXF1S_F1PI_Pos (16U)
#define FDCAN_RXF1S_F1PI_Msk (0x3FUL << FDCAN_RXF1S_F1PI_Pos) /*!< 0x003F0000 */
#define FDCAN_RXF1S_F1PI     FDCAN_RXF1S_F1PI_Msk             /*!<Rx FIFO 1 Put Index                       */
#define FDCAN_RXF1S_F1F_Pos  (24U)
#define FDCAN_RXF1S_F1F_Msk  (0x1UL << FDCAN_RXF1S_F1F_Pos) /*!< 0x01000000 */
#define FDCAN_RXF1S_F1F      FDCAN_RXF1S_F1F_Msk            /*!<Rx FIFO 1 Full                            */
#define FDCAN_RXF1S_RF1L_Pos (25U)
#define FDCAN_RXF1S_RF1L_Msk (0x1UL << FDCAN_RXF1S_RF1L_Pos) /*!< 0x02000000 */
#define FDCAN_RXF1S_RF1L     FDCAN_RXF1S_RF1L_Msk            /*!<Rx FIFO 1 Message Lost                    */

/*****************  Bit definition for FDCAN_RXF1A register  ********************/
#define FDCAN_RXF1A_F1AI_Pos (0U)
#define FDCAN_RXF1A_F1AI_Msk (0x3FUL << FDCAN_RXF1A_F1AI_Pos) /*!< 0x0000003F */
#define FDCAN_RXF1A_F1AI     FDCAN_RXF1A_F1AI_Msk             /*!<Rx FIFO 1 Acknowledge Index               */

/*****************  Bit definition for FDCAN_RXESC register  ********************/
#define FDCAN_RXESC_F0DS_Pos (0U)
#define FDCAN_RXESC_F0DS_Msk (0x7UL << FDCAN_RXESC_F0DS_Pos) /*!< 0x00000007 */
#define FDCAN_RXESC_F0DS     FDCAN_RXESC_F0DS_Msk            /*!<Rx FIFO 1 Data Field Size                 */
#define FDCAN_RXESC_F1DS_Pos (4U)
#define FDCAN_RXESC_F1DS_Msk (0x7UL << FDCAN_RXESC_F1DS_Pos) /*!< 0x00000070 */
#define FDCAN_RXESC_F1DS     FDCAN_RXESC_F1DS_Msk            /*!<Rx FIFO 0 Data Field Size                 */
#define FDCAN_RXESC_RBDS_Pos (8U)
#define FDCAN_RXESC_RBDS_Msk (0x7UL << FDCAN_RXESC_RBDS_Pos) /*!< 0x00000700 */
#define FDCAN_RXESC_RBDS     FDCAN_RXESC_RBDS_Msk            /*!<Rx Buffer Data Field Size                 */

/*****************  Bit definition for FDCAN_TXBC register  *********************/
#define FDCAN_TXBC_TBSA_Pos (2U)
#define FDCAN_TXBC_TBSA_Msk (0x3FFFUL << FDCAN_TXBC_TBSA_Pos) /*!< 0x0000FFFC */
#define FDCAN_TXBC_TBSA     FDCAN_TXBC_TBSA_Msk               /*!<Tx Buffers Start Address                  */
#define FDCAN_TXBC_NDTB_Pos (16U)
#define FDCAN_TXBC_NDTB_Msk (0x3FUL << FDCAN_TXBC_NDTB_Pos) /*!< 0x003F0000 */
#define FDCAN_TXBC_NDTB     FDCAN_TXBC_NDTB_Msk             /*!<Number of Dedicated Transmit Buffers      */
#define FDCAN_TXBC_TFQS_Pos (24U)
#define FDCAN_TXBC_TFQS_Msk (0x3FUL << FDCAN_TXBC_TFQS_Pos) /*!< 0x3F000000 */
#define FDCAN_TXBC_TFQS     FDCAN_TXBC_TFQS_Msk             /*!<Transmit FIFO/Queue Size                  */
#define FDCAN_TXBC_TFQM_Pos (30U)
#define FDCAN_TXBC_TFQM_Msk (0x1UL << FDCAN_TXBC_TFQM_Pos) /*!< 0x40000000 */
#define FDCAN_TXBC_TFQM     FDCAN_TXBC_TFQM_Msk            /*!<Tx FIFO/Queue Mode                        */

