Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*****************  Bit definition for FDCAN_TXFQS register  *********************/
#define FDCAN_TXFQS_TFFL_Pos  (0U)
#define FDCAN_TXFQS_TFFL_Msk  (0x3FUL << FDCAN_TXFQS_TFFL_Pos) /*!< 0x0000003F */
#define FDCAN_TXFQS_TFFL      FDCAN_TXFQS_TFFL_Msk             /*!<Tx FIFO Free Level                        */
#define FDCAN_TXFQS_TFGI_Pos  (8U)
#define FDCAN_TXFQS_TFGI_Msk  (0x1FUL << FDCAN_TXFQS_TFGI_Pos) /*!< 0x00001F00 */
#define FDCAN_TXFQS_TFGI      FDCAN_TXFQS_TFGI_Msk             /*!<Tx FIFO Get Index                         */
#define FDCAN_TXFQS_TFQPI_Pos (16U)
#define FDCAN_TXFQS_TFQPI_Msk (0x1FUL << FDCAN_TXFQS_TFQPI_Pos) /*!< 0x001F0000 */
#define FDCAN_TXFQS_TFQPI     FDCAN_TXFQS_TFQPI_Msk             /*!<Tx FIFO/Queue Put Index                   */
#define FDCAN_TXFQS_TFQF_Pos  (21U)
#define FDCAN_TXFQS_TFQF_Msk  (0x1UL << FDCAN_TXFQS_TFQF_Pos) /*!< 0x00200000 */
#define FDCAN_TXFQS_TFQF      FDCAN_TXFQS_TFQF_Msk            /*!<Tx FIFO/Queue Full                        */

/*****************  Bit definition for FDCAN_TXESC register  *********************/
#define FDCAN_TXESC_TBDS_Pos (0U)
#define FDCAN_TXESC_TBDS_Msk (0x7UL << FDCAN_TXESC_TBDS_Pos) /*!< 0x00000007 */
#define FDCAN_TXESC_TBDS     FDCAN_TXESC_TBDS_Msk            /*!<Tx Buffer Data Field Size                 */

/*****************  Bit definition for FDCAN_TXBRP register  *********************/
#define FDCAN_TXBRP_TRP_Pos (0U)
#define FDCAN_TXBRP_TRP_Msk (0xFFFFFFFFUL << FDCAN_TXBRP_TRP_Pos) /*!< 0xFFFFFFFF */
#define FDCAN_TXBRP_TRP     FDCAN_TXBRP_TRP_Msk                   /*!<Transmission Request Pending              */

/*****************  Bit definition for FDCAN_TXBAR register  *********************/
#define FDCAN_TXBAR_AR_Pos (0U)
#define FDCAN_TXBAR_AR_Msk (0xFFFFFFFFUL << FDCAN_TXBAR_AR_Pos) /*!< 0xFFFFFFFF */
#define FDCAN_TXBAR_AR     FDCAN_TXBAR_AR_Msk                   /*!<Add Request                               */

/*****************  Bit definition for FDCAN_TXBCR register  *********************/
#define FDCAN_TXBCR_CR_Pos (0U)
#define FDCAN_TXBCR_CR_Msk (0xFFFFFFFFUL << FDCAN_TXBCR_CR_Pos) /*!< 0xFFFFFFFF */
#define FDCAN_TXBCR_CR     FDCAN_TXBCR_CR_Msk                   /*!<Cancellation Request                      */

/*****************  Bit definition for FDCAN_TXBTO register  *********************/
#define FDCAN_TXBTO_TO_Pos (0U)
#define FDCAN_TXBTO_TO_Msk (0xFFFFFFFFUL << FDCAN_TXBTO_TO_Pos) /*!< 0xFFFFFFFF */
#define FDCAN_TXBTO_TO     FDCAN_TXBTO_TO_Msk                   /*!<Transmission Occurred                     */

/*****************  Bit definition for FDCAN_TXBCF register  *********************/
#define FDCAN_TXBCF_CF_Pos (0U)
#define FDCAN_TXBCF_CF_Msk (0xFFFFFFFFUL << FDCAN_TXBCF_CF_Pos) /*!< 0xFFFFFFFF */
#define FDCAN_TXBCF_CF     FDCAN_TXBCF_CF_Msk                   /*!<Cancellation Finished                     */

/*****************  Bit definition for FDCAN_TXBTIE register  ********************/
#define FDCAN_TXBTIE_TIE_Pos (0U)
#define FDCAN_TXBTIE_TIE_Msk (0xFFFFFFFFUL << FDCAN_TXBTIE_TIE_Pos) /*!< 0xFFFFFFFF */
#define FDCAN_TXBTIE_TIE     FDCAN_TXBTIE_TIE_Msk                   /*!<Transmission Interrupt Enable             */

/*****************  Bit definition for FDCAN_ TXBCIE register  *******************/
#define FDCAN_TXBCIE_CFIE_Pos (0U)
#define FDCAN_TXBCIE_CFIE_Msk (0xFFFFFFFFUL << FDCAN_TXBCIE_CFIE_Pos) /*!< 0xFFFFFFFF */
#define FDCAN_TXBCIE_CFIE     FDCAN_TXBCIE_CFIE_Msk                   /*!<Cancellation Finished Interrupt Enable    */

/*****************  Bit definition for FDCAN_TXEFC register  *********************/
#define FDCAN_TXEFC_EFSA_Pos (2U)
#define FDCAN_TXEFC_EFSA_Msk (0x3FFFUL << FDCAN_TXEFC_EFSA_Pos) /*!< 0x0000FFFC */
#define FDCAN_TXEFC_EFSA     FDCAN_TXEFC_EFSA_Msk               /*!<Event FIFO Start Address                  */
#define FDCAN_TXEFC_EFS_Pos  (16U)
#define FDCAN_TXEFC_EFS_Msk  (0x3FUL << FDCAN_TXEFC_EFS_Pos) /*!< 0x003F0000 */
#define FDCAN_TXEFC_EFS      FDCAN_TXEFC_EFS_Msk             /*!<Event FIFO Size                           */
#define FDCAN_TXEFC_EFWM_Pos (24U)
#define FDCAN_TXEFC_EFWM_Msk (0x3FUL << FDCAN_TXEFC_EFWM_Pos) /*!< 0x3F000000 */
#define FDCAN_TXEFC_EFWM     FDCAN_TXEFC_EFWM_Msk             /*!<Event FIFO Watermark                      */

/*****************  Bit definition for FDCAN_TXEFS register  *********************/
#define FDCAN_TXEFS_EFFL_Pos (0U)
#define FDCAN_TXEFS_EFFL_Msk (0x3FUL << FDCAN_TXEFS_EFFL_Pos) /*!< 0x0000003F */
#define FDCAN_TXEFS_EFFL     FDCAN_TXEFS_EFFL_Msk             /*!<Event FIFO Fill Level                     */
#define FDCAN_TXEFS_EFGI_Pos (8U)
#define FDCAN_TXEFS_EFGI_Msk (0x1FUL << FDCAN_TXEFS_EFGI_Pos) /*!< 0x00001F00 */
#define FDCAN_TXEFS_EFGI     FDCAN_TXEFS_EFGI_Msk             /*!<Event FIFO Get Index                      */
#define FDCAN_TXEFS_EFPI_Pos (16U)
#define FDCAN_TXEFS_EFPI_Msk (0x1FUL << FDCAN_TXEFS_EFPI_Pos) /*!< 0x001F0000 */
#define FDCAN_TXEFS_EFPI     FDCAN_TXEFS_EFPI_Msk             /*!<Event FIFO Put Index                      */
#define FDCAN_TXEFS_EFF_Pos  (24U)
#define FDCAN_TXEFS_EFF_Msk  (0x1UL << FDCAN_TXEFS_EFF_Pos) /*!< 0x01000000 */
#define FDCAN_TXEFS_EFF      FDCAN_TXEFS_EFF_Msk            /*!<Event FIFO Full                           */
#define FDCAN_TXEFS_TEFL_Pos (25U)
#define FDCAN_TXEFS_TEFL_Msk (0x1UL << FDCAN_TXEFS_TEFL_Pos) /*!< 0x02000000 */
#define FDCAN_TXEFS_TEFL     FDCAN_TXEFS_TEFL_Msk            /*!<Tx Event FIFO Element Lost                */

/*****************  Bit definition for FDCAN_TXEFA register  *********************/
#define FDCAN_TXEFA_EFAI_Pos (0U)
#define FDCAN_TXEFA_EFAI_Msk (0x1FUL << FDCAN_TXEFA_EFAI_Pos) /*!< 0x0000001F */
#define FDCAN_TXEFA_EFAI     FDCAN_TXEFA_EFAI_Msk             /*!<Event FIFO Acknowledge Index              */

/*****************  Bit definition for FDCAN_TTTMC register  *********************/
#define FDCAN_TTTMC_TMSA_Pos (2U)
#define FDCAN_TTTMC_TMSA_Msk (0x3FFFUL << FDCAN_TTTMC_TMSA_Pos) /*!< 0x0000FFFC */
#define FDCAN_TTTMC_TMSA     FDCAN_TTTMC_TMSA_Msk               /*!<Trigger Memory Start Address              */
#define FDCAN_TTTMC_TME_Pos  (16U)
#define FDCAN_TTTMC_TME_Msk  (0x7FUL << FDCAN_TTTMC_TME_Pos) /*!< 0x007F0000 */
#define FDCAN_TTTMC_TME      FDCAN_TTTMC_TME_Msk             /*!<Trigger Memory Elements                   */

/*****************  Bit definition for FDCAN_TTRMC register  *********************/
#define FDCAN_TTRMC_RID_Pos  (0U)
#define FDCAN_TTRMC_RID_Msk  (0x1FFFFFFFUL << FDCAN_TTRMC_RID_Pos) /*!< 0x1FFFFFFF */
#define FDCAN_TTRMC_RID      FDCAN_TTRMC_RID_Msk                   /*!<Reference Identifier                      */
#define FDCAN_TTRMC_XTD_Pos  (30U)
#define FDCAN_TTRMC_XTD_Msk  (0x1UL << FDCAN_TTRMC_XTD_Pos) /*!< 0x40000000 */
#define FDCAN_TTRMC_XTD      FDCAN_TTRMC_XTD_Msk            /*!< Extended Identifier                      */
#define FDCAN_TTRMC_RMPS_Pos (31U)
#define FDCAN_TTRMC_RMPS_Msk (0x1UL << FDCAN_TTRMC_RMPS_Pos) /*!< 0x80000000 */
#define FDCAN_TTRMC_RMPS     FDCAN_TTRMC_RMPS_Msk            /*!<Reference Message Payload Select          */

/*****************  Bit definition for FDCAN_TTOCF register  *********************/
#define FDCAN_TTOCF_OM_Pos    (0U)
#define FDCAN_TTOCF_OM_Msk    (0x3UL << FDCAN_TTOCF_OM_Pos) /*!< 0x00000003 */
#define FDCAN_TTOCF_OM        FDCAN_TTOCF_OM_Msk            /*!<Operation Mode                            */
#define FDCAN_TTOCF_GEN_Pos   (3U)
#define FDCAN_TTOCF_GEN_Msk   (0x1UL << FDCAN_TTOCF_GEN_Pos) /*!< 0x00000008 */
#define FDCAN_TTOCF_GEN       FDCAN_TTOCF_GEN_Msk            /*!<Gap Enable                                */
#define FDCAN_TTOCF_TM_Pos    (4U)
#define FDCAN_TTOCF_TM_Msk    (0x1UL << FDCAN_TTOCF_TM_Pos) /*!< 0x00000010 */
#define FDCAN_TTOCF_TM        FDCAN_TTOCF_TM_Msk            /*!<Time Master                               */
#define FDCAN_TTOCF_LDSDL_Pos (5U)
#define FDCAN_TTOCF_LDSDL_Msk (0x7UL << FDCAN_TTOCF_LDSDL_Pos) /*!< 0x000000E0 */
#define FDCAN_TTOCF_LDSDL     FDCAN_TTOCF_LDSDL_Msk            /*!<LD of Synchronization Deviation Limit     */
#define FDCAN_TTOCF_IRTO_Pos  (8U)
#define FDCAN_TTOCF_IRTO_Msk  (0x7FUL << FDCAN_TTOCF_IRTO_Pos) /*!< 0x00007F00 */
#define FDCAN_TTOCF_IRTO      FDCAN_TTOCF_IRTO_Msk             /*!<Initial Reference Trigger Offset          */
#define FDCAN_TTOCF_EECS_Pos  (15U)
#define FDCAN_TTOCF_EECS_Msk  (0x1UL << FDCAN_TTOCF_EECS_Pos) /*!< 0x00008000 */
#define FDCAN_TTOCF_EECS      FDCAN_TTOCF_EECS_Msk            /*!<Enable External Clock Synchronization     */
#define FDCAN_TTOCF_AWL_Pos   (16U)
#define FDCAN_TTOCF_AWL_Msk   (0xFFUL << FDCAN_TTOCF_AWL_Pos) /*!< 0x00FF0000 */
#define FDCAN_TTOCF_AWL       FDCAN_TTOCF_AWL_Msk             /*!<Application Watchdog Limit                */
#define FDCAN_TTOCF_EGTF_Pos  (24U)
#define FDCAN_TTOCF_EGTF_Msk  (0x1UL << FDCAN_TTOCF_EGTF_Pos) /*!< 0x01000000 */
#define FDCAN_TTOCF_EGTF      FDCAN_TTOCF_EGTF_Msk            /*!<Enable Global Time Filtering              */
#define FDCAN_TTOCF_ECC_Pos   (25U)
#define FDCAN_TTOCF_ECC_Msk   (0x1UL << FDCAN_TTOCF_ECC_Pos) /*!< 0x02000000 */
#define FDCAN_TTOCF_ECC       FDCAN_TTOCF_ECC_Msk            /*!<Enable Clock Calibration                  */
#define FDCAN_TTOCF_EVTP_Pos  (26U)
#define FDCAN_TTOCF_EVTP_Msk  (0x1UL << FDCAN_TTOCF_EVTP_Pos) /*!< 0x04000000 */
#define FDCAN_TTOCF_EVTP      FDCAN_TTOCF_EVTP_Msk            /*!<Event Trigger Polarity                    */

/*****************  Bit definition for FDCAN_TTMLM register  *********************/
#define FDCAN_TTMLM_CCM_Pos  (0U)
#define FDCAN_TTMLM_CCM_Msk  (0x3FUL << FDCAN_TTMLM_CCM_Pos) /*!< 0x0000003F */
#define FDCAN_TTMLM_CCM      FDCAN_TTMLM_CCM_Msk             /*!<Cycle Count Max                           */
#define FDCAN_TTMLM_CSS_Pos  (6U)
#define FDCAN_TTMLM_CSS_Msk  (0x3UL << FDCAN_TTMLM_CSS_Pos) /*!< 0x000000C0 */
#define FDCAN_TTMLM_CSS      FDCAN_TTMLM_CSS_Msk            /*!<Cycle Start Synchronization               */
#define FDCAN_TTMLM_TXEW_Pos (8U)
#define FDCAN_TTMLM_TXEW_Msk (0xFUL << FDCAN_TTMLM_TXEW_Pos) /*!< 0x00000F00 */
#define FDCAN_TTMLM_TXEW     FDCAN_TTMLM_TXEW_Msk            /*!<Tx Enable Window                          */
#define FDCAN_TTMLM_ENTT_Pos (16U)
#define FDCAN_TTMLM_ENTT_Msk (0xFFFUL << FDCAN_TTMLM_ENTT_Pos) /*!< 0x0FFF0000 */
#define FDCAN_TTMLM_ENTT     FDCAN_TTMLM_ENTT_Msk              /*!<Expected Number of Tx Triggers            */

/*****************  Bit definition for FDCAN_TURCF register  *********************/
#define FDCAN_TURCF_NCL_Pos (0U)
#define FDCAN_TURCF_NCL_Msk (0xFFFFUL << FDCAN_TURCF_NCL_Pos) /*!< 0x0000FFFF */
#define FDCAN_TURCF_NCL     FDCAN_TURCF_NCL_Msk               /*!<Numerator Configuration Low               */
#define FDCAN_TURCF_DC_Pos  (16U)
#define FDCAN_TURCF_DC_Msk  (0x3FFFUL << FDCAN_TURCF_DC_Pos) /*!< 0x3FFF0000 */
#define FDCAN_TURCF_DC      FDCAN_TURCF_DC_Msk               /*!<Denominator Configuration                 */
#define FDCAN_TURCF_ELT_Pos (31U)
#define FDCAN_TURCF_ELT_Msk (0x1UL << FDCAN_TURCF_ELT_Pos) /*!< 0x80000000 */
#define FDCAN_TURCF_ELT     FDCAN_TURCF_ELT_Msk            /*!<Enable Local Time                         */

/*****************  Bit definition for FDCAN_TTOCN register  ********************/
#define FDCAN_TTOCN_SGT_Pos  (0U)
#define FDCAN_TTOCN_SGT_Msk  (0x1UL << FDCAN_TTOCN_SGT_Pos) /*!< 0x00000001 */
#define FDCAN_TTOCN_SGT      FDCAN_TTOCN_SGT_Msk            /*!<Set Global time                           */
#define FDCAN_TTOCN_ECS_Pos  (1U)
#define FDCAN_TTOCN_ECS_Msk  (0x1UL << FDCAN_TTOCN_ECS_Pos) /*!< 0x00000002 */
#define FDCAN_TTOCN_ECS      FDCAN_TTOCN_ECS_Msk            /*!<External Clock Synchronization            */
#define FDCAN_TTOCN_SWP_Pos  (2U)
#define FDCAN_TTOCN_SWP_Msk  (0x1UL << FDCAN_TTOCN_SWP_Pos) /*!< 0x00000004 */
#define FDCAN_TTOCN_SWP      FDCAN_TTOCN_SWP_Msk            /*!<Stop Watch Polarity                       */
#define FDCAN_TTOCN_SWS_Pos  (3U)
#define FDCAN_TTOCN_SWS_Msk  (0x3UL << FDCAN_TTOCN_SWS_Pos) /*!< 0x00000018 */
#define FDCAN_TTOCN_SWS      FDCAN_TTOCN_SWS_Msk            /*!<Stop Watch Source                         */
#define FDCAN_TTOCN_RTIE_Pos (5U)
#define FDCAN_TTOCN_RTIE_Msk (0x1UL << FDCAN_TTOCN_RTIE_Pos) /*!< 0x00000020 */
#define FDCAN_TTOCN_RTIE     FDCAN_TTOCN_RTIE_Msk            /*!<Register Time Mark Interrupt Pulse Enable */
#define FDCAN_TTOCN_TMC_Pos  (6U)
#define FDCAN_TTOCN_TMC_Msk  (0x3UL << FDCAN_TTOCN_TMC_Pos) /*!< 0x000000C0 */
#define FDCAN_TTOCN_TMC      FDCAN_TTOCN_TMC_Msk            /*!<Register Time Mark Compare                */
#define FDCAN_TTOCN_TTIE_Pos (8U)
#define FDCAN_TTOCN_TTIE_Msk (0x1UL << FDCAN_TTOCN_TTIE_Pos) /*!< 0x00000100 */
#define FDCAN_TTOCN_TTIE     FDCAN_TTOCN_TTIE_Msk            /*!<Trigger Time Mark Interrupt Pulse Enable  */
#define FDCAN_TTOCN_GCS_Pos  (9U)
#define FDCAN_TTOCN_GCS_Msk  (0x1UL << FDCAN_TTOCN_GCS_Pos) /*!< 0x00000200 */
#define FDCAN_TTOCN_GCS      FDCAN_TTOCN_GCS_Msk            /*!<Gap Control Select                        */
#define FDCAN_TTOCN_FGP_Pos  (10U)
#define FDCAN_TTOCN_FGP_Msk  (0x1UL << FDCAN_TTOCN_FGP_Pos) /*!< 0x00000400 */
#define FDCAN_TTOCN_FGP      FDCAN_TTOCN_FGP_Msk            /*!<Finish Gap                                */
#define FDCAN_TTOCN_TMG_Pos  (11U)
#define FDCAN_TTOCN_TMG_Msk  (0x1UL << FDCAN_TTOCN_TMG_Pos) /*!< 0x00000800 */
#define FDCAN_TTOCN_TMG      FDCAN_TTOCN_TMG_Msk            /*!<Time Mark Gap                             */
#define FDCAN_TTOCN_NIG_Pos  (12U)
#define FDCAN_TTOCN_NIG_Msk  (0x1UL << FDCAN_TTOCN_NIG_Pos) /*!< 0x00001000 */
#define FDCAN_TTOCN_NIG      FDCAN_TTOCN_NIG_Msk            /*!<Next is Gap                               */
#define FDCAN_TTOCN_ESCN_Pos (13U)
#define FDCAN_TTOCN_ESCN_Msk (0x1UL << FDCAN_TTOCN_ESCN_Pos) /*!< 0x00002000 */
#define FDCAN_TTOCN_ESCN     FDCAN_TTOCN_ESCN_Msk            /*!<External Synchronization Control          */
#define FDCAN_TTOCN_LCKC_Pos (15U)
#define FDCAN_TTOCN_LCKC_Msk (0x1UL << FDCAN_TTOCN_LCKC_Pos) /*!< 0x00008000 */
#define FDCAN_TTOCN_LCKC     FDCAN_TTOCN_LCKC_Msk            /*!<TT Operation Control Register Locked      */

