Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*****************  Bit definition for FDCAN_TTGTP register  ********************/
#define FDCAN_TTGTP_TP_Pos  (0U)
#define FDCAN_TTGTP_TP_Msk  (0xFFFFUL << FDCAN_TTGTP_TP_Pos) /*!< 0x0000FFFF */
#define FDCAN_TTGTP_TP      FDCAN_TTGTP_TP_Msk               /*!<Time Preset                               */
#define FDCAN_TTGTP_CTP_Pos (16U)
#define FDCAN_TTGTP_CTP_Msk (0xFFFFUL << FDCAN_TTGTP_CTP_Pos) /*!< 0xFFFF0000 */
#define FDCAN_TTGTP_CTP     FDCAN_TTGTP_CTP_Msk               /*!<Cycle Time Target Phase                   */

/*****************  Bit definition for FDCAN_TTTMK register  ********************/
#define FDCAN_TTTMK_TM_Pos   (0U)
#define FDCAN_TTTMK_TM_Msk   (0xFFFFUL << FDCAN_TTTMK_TM_Pos) /*!< 0x0000FFFF */
#define FDCAN_TTTMK_TM       FDCAN_TTTMK_TM_Msk               /*!<Time Mark                                 */
#define FDCAN_TTTMK_TICC_Pos (16U)
#define FDCAN_TTTMK_TICC_Msk (0x7FUL << FDCAN_TTTMK_TICC_Pos) /*!< 0x007F0000 */
#define FDCAN_TTTMK_TICC     FDCAN_TTTMK_TICC_Msk             /*!<Time Mark Cycle Code                      */
#define FDCAN_TTTMK_LCKM_Pos (31U)
#define FDCAN_TTTMK_LCKM_Msk (0x1UL << FDCAN_TTTMK_LCKM_Pos) /*!< 0x80000000 */
#define FDCAN_TTTMK_LCKM     FDCAN_TTTMK_LCKM_Msk            /*!<TT Time Mark Register Locked              */

/*****************  Bit definition for FDCAN_TTIR register  ********************/
#define FDCAN_TTIR_SBC_Pos  (0U)
#define FDCAN_TTIR_SBC_Msk  (0x1UL << FDCAN_TTIR_SBC_Pos) /*!< 0x00000001 */
#define FDCAN_TTIR_SBC      FDCAN_TTIR_SBC_Msk            /*!<Start of Basic Cycle                      */
#define FDCAN_TTIR_SMC_Pos  (1U)
#define FDCAN_TTIR_SMC_Msk  (0x1UL << FDCAN_TTIR_SMC_Pos) /*!< 0x00000002 */
#define FDCAN_TTIR_SMC      FDCAN_TTIR_SMC_Msk            /*!<Start of Matrix Cycle                     */
#define FDCAN_TTIR_CSM_Pos  (2U)
#define FDCAN_TTIR_CSM_Msk  (0x1UL << FDCAN_TTIR_CSM_Pos) /*!< 0x00000004 */
#define FDCAN_TTIR_CSM      FDCAN_TTIR_CSM_Msk            /*!<Change of Synchronization Mode            */
#define FDCAN_TTIR_SOG_Pos  (3U)
#define FDCAN_TTIR_SOG_Msk  (0x1UL << FDCAN_TTIR_SOG_Pos) /*!< 0x00000008 */
#define FDCAN_TTIR_SOG      FDCAN_TTIR_SOG_Msk            /*!<Start of Gap                              */
#define FDCAN_TTIR_RTMI_Pos (4U)
#define FDCAN_TTIR_RTMI_Msk (0x1UL << FDCAN_TTIR_RTMI_Pos) /*!< 0x00000010 */
#define FDCAN_TTIR_RTMI     FDCAN_TTIR_RTMI_Msk            /*!<Register Time Mark Interrupt              */
#define FDCAN_TTIR_TTMI_Pos (5U)
#define FDCAN_TTIR_TTMI_Msk (0x1UL << FDCAN_TTIR_TTMI_Pos) /*!< 0x00000020 */
#define FDCAN_TTIR_TTMI     FDCAN_TTIR_TTMI_Msk            /*!<Trigger Time Mark Event Internal          */
#define FDCAN_TTIR_SWE_Pos  (6U)
#define FDCAN_TTIR_SWE_Msk  (0x1UL << FDCAN_TTIR_SWE_Pos) /*!< 0x00000040 */
#define FDCAN_TTIR_SWE      FDCAN_TTIR_SWE_Msk            /*!<Stop Watch Event                          */
#define FDCAN_TTIR_GTW_Pos  (7U)
#define FDCAN_TTIR_GTW_Msk  (0x1UL << FDCAN_TTIR_GTW_Pos) /*!< 0x00000080 */
#define FDCAN_TTIR_GTW      FDCAN_TTIR_GTW_Msk            /*!<Global Time Wrap                          */
#define FDCAN_TTIR_GTD_Pos  (8U)
#define FDCAN_TTIR_GTD_Msk  (0x1UL << FDCAN_TTIR_GTD_Pos) /*!< 0x00000100 */
#define FDCAN_TTIR_GTD      FDCAN_TTIR_GTD_Msk            /*!<Global Time Discontinuity                 */
#define FDCAN_TTIR_GTE_Pos  (9U)
#define FDCAN_TTIR_GTE_Msk  (0x1UL << FDCAN_TTIR_GTE_Pos) /*!< 0x00000200 */
#define FDCAN_TTIR_GTE      FDCAN_TTIR_GTE_Msk            /*!<Global Time Error                         */
#define FDCAN_TTIR_TXU_Pos  (10U)
#define FDCAN_TTIR_TXU_Msk  (0x1UL << FDCAN_TTIR_TXU_Pos) /*!< 0x00000400 */
#define FDCAN_TTIR_TXU      FDCAN_TTIR_TXU_Msk            /*!<Tx Count Underflow                        */
#define FDCAN_TTIR_TXO_Pos  (11U)
#define FDCAN_TTIR_TXO_Msk  (0x1UL << FDCAN_TTIR_TXO_Pos) /*!< 0x00000800 */
#define FDCAN_TTIR_TXO      FDCAN_TTIR_TXO_Msk            /*!<Tx Count Overflow                         */
#define FDCAN_TTIR_SE1_Pos  (12U)
#define FDCAN_TTIR_SE1_Msk  (0x1UL << FDCAN_TTIR_SE1_Pos) /*!< 0x00001000 */
#define FDCAN_TTIR_SE1      FDCAN_TTIR_SE1_Msk            /*!<Scheduling Error 1                        */
#define FDCAN_TTIR_SE2_Pos  (13U)
#define FDCAN_TTIR_SE2_Msk  (0x1UL << FDCAN_TTIR_SE2_Pos) /*!< 0x00002000 */
#define FDCAN_TTIR_SE2      FDCAN_TTIR_SE2_Msk            /*!<Scheduling Error 2                        */
#define FDCAN_TTIR_ELC_Pos  (14U)
#define FDCAN_TTIR_ELC_Msk  (0x1UL << FDCAN_TTIR_ELC_Pos) /*!< 0x00004000 */
#define FDCAN_TTIR_ELC      FDCAN_TTIR_ELC_Msk            /*!<Error Level Changed                       */
#define FDCAN_TTIR_IWT_Pos  (15U)
#define FDCAN_TTIR_IWT_Msk  (0x1UL << FDCAN_TTIR_IWT_Pos) /*!< 0x00008000 */
#define FDCAN_TTIR_IWT      FDCAN_TTIR_IWT_Msk            /*!<Initialization Watch Trigger              */
#define FDCAN_TTIR_WT_Pos   (16U)
#define FDCAN_TTIR_WT_Msk   (0x1UL << FDCAN_TTIR_WT_Pos) /*!< 0x00010000 */
#define FDCAN_TTIR_WT       FDCAN_TTIR_WT_Msk            /*!<Watch Trigger                             */
#define FDCAN_TTIR_AW_Pos   (17U)
#define FDCAN_TTIR_AW_Msk   (0x1UL << FDCAN_TTIR_AW_Pos) /*!< 0x00020000 */
#define FDCAN_TTIR_AW       FDCAN_TTIR_AW_Msk            /*!<Application Watchdog                      */
#define FDCAN_TTIR_CER_Pos  (18U)
#define FDCAN_TTIR_CER_Msk  (0x1UL << FDCAN_TTIR_CER_Pos) /*!< 0x00040000 */
#define FDCAN_TTIR_CER      FDCAN_TTIR_CER_Msk            /*!<Configuration Error                       */

/*****************  Bit definition for FDCAN_TTIE register  ********************/
#define FDCAN_TTIE_SBCE_Pos  (0U)
#define FDCAN_TTIE_SBCE_Msk  (0x1UL << FDCAN_TTIE_SBCE_Pos) /*!< 0x00000001 */
#define FDCAN_TTIE_SBCE      FDCAN_TTIE_SBCE_Msk            /*!<Start of Basic Cycle Interrupt Enable             */
#define FDCAN_TTIE_SMCE_Pos  (1U)
#define FDCAN_TTIE_SMCE_Msk  (0x1UL << FDCAN_TTIE_SMCE_Pos) /*!< 0x00000002 */
#define FDCAN_TTIE_SMCE      FDCAN_TTIE_SMCE_Msk            /*!<Start of Matrix Cycle Interrupt Enable            */
#define FDCAN_TTIE_CSME_Pos  (2U)
#define FDCAN_TTIE_CSME_Msk  (0x1UL << FDCAN_TTIE_CSME_Pos) /*!< 0x00000004 */
#define FDCAN_TTIE_CSME      FDCAN_TTIE_CSME_Msk            /*!<Change of Synchronization Mode Interrupt Enable   */
#define FDCAN_TTIE_SOGE_Pos  (3U)
#define FDCAN_TTIE_SOGE_Msk  (0x1UL << FDCAN_TTIE_SOGE_Pos) /*!< 0x00000008 */
#define FDCAN_TTIE_SOGE      FDCAN_TTIE_SOGE_Msk            /*!<Start of Gap Interrupt Enable                     */
#define FDCAN_TTIE_RTMIE_Pos (4U)
#define FDCAN_TTIE_RTMIE_Msk (0x1UL << FDCAN_TTIE_RTMIE_Pos) /*!< 0x00000010 */
#define FDCAN_TTIE_RTMIE     FDCAN_TTIE_RTMIE_Msk            /*!<Register Time Mark Interrupt Interrupt Enable     */
#define FDCAN_TTIE_TTMIE_Pos (5U)
#define FDCAN_TTIE_TTMIE_Msk (0x1UL << FDCAN_TTIE_TTMIE_Pos) /*!< 0x00000020 */
#define FDCAN_TTIE_TTMIE     FDCAN_TTIE_TTMIE_Msk            /*!<Trigger Time Mark Event Internal Interrupt Enable */
#define FDCAN_TTIE_SWEE_Pos  (6U)
#define FDCAN_TTIE_SWEE_Msk  (0x1UL << FDCAN_TTIE_SWEE_Pos) /*!< 0x00000040 */
#define FDCAN_TTIE_SWEE      FDCAN_TTIE_SWEE_Msk            /*!<Stop Watch Event Interrupt Enable                 */
#define FDCAN_TTIE_GTWE_Pos  (7U)
#define FDCAN_TTIE_GTWE_Msk  (0x1UL << FDCAN_TTIE_GTWE_Pos) /*!< 0x00000080 */
#define FDCAN_TTIE_GTWE      FDCAN_TTIE_GTWE_Msk            /*!<Global Time Wrap Interrupt Enable                 */
#define FDCAN_TTIE_GTDE_Pos  (8U)
#define FDCAN_TTIE_GTDE_Msk  (0x1UL << FDCAN_TTIE_GTDE_Pos) /*!< 0x00000100 */
#define FDCAN_TTIE_GTDE      FDCAN_TTIE_GTDE_Msk            /*!<Global Time Discontinuity Interrupt Enable        */
#define FDCAN_TTIE_GTEE_Pos  (9U)
#define FDCAN_TTIE_GTEE_Msk  (0x1UL << FDCAN_TTIE_GTEE_Pos) /*!< 0x00000200 */
#define FDCAN_TTIE_GTEE      FDCAN_TTIE_GTEE_Msk            /*!<Global Time Error Interrupt Enable                */
#define FDCAN_TTIE_TXUE_Pos  (10U)
#define FDCAN_TTIE_TXUE_Msk  (0x1UL << FDCAN_TTIE_TXUE_Pos) /*!< 0x00000400 */
#define FDCAN_TTIE_TXUE      FDCAN_TTIE_TXUE_Msk            /*!<Tx Count Underflow Interrupt Enable               */
#define FDCAN_TTIE_TXOE_Pos  (11U)
#define FDCAN_TTIE_TXOE_Msk  (0x1UL << FDCAN_TTIE_TXOE_Pos) /*!< 0x00000800 */
#define FDCAN_TTIE_TXOE      FDCAN_TTIE_TXOE_Msk            /*!<Tx Count Overflow Interrupt Enable                */
#define FDCAN_TTIE_SE1E_Pos  (12U)
#define FDCAN_TTIE_SE1E_Msk  (0x1UL << FDCAN_TTIE_SE1E_Pos) /*!< 0x00001000 */
#define FDCAN_TTIE_SE1E      FDCAN_TTIE_SE1E_Msk            /*!<Scheduling Error 1 Interrupt Enable               */
#define FDCAN_TTIE_SE2E_Pos  (13U)
#define FDCAN_TTIE_SE2E_Msk  (0x1UL << FDCAN_TTIE_SE2E_Pos) /*!< 0x00002000 */
#define FDCAN_TTIE_SE2E      FDCAN_TTIE_SE2E_Msk            /*!<Scheduling Error 2 Interrupt Enable               */
#define FDCAN_TTIE_ELCE_Pos  (14U)
#define FDCAN_TTIE_ELCE_Msk  (0x1UL << FDCAN_TTIE_ELCE_Pos) /*!< 0x00004000 */
#define FDCAN_TTIE_ELCE      FDCAN_TTIE_ELCE_Msk            /*!<Error Level Changed Interrupt Enable              */
#define FDCAN_TTIE_IWTE_Pos  (15U)
#define FDCAN_TTIE_IWTE_Msk  (0x1UL << FDCAN_TTIE_IWTE_Pos) /*!< 0x00008000 */
#define FDCAN_TTIE_IWTE      FDCAN_TTIE_IWTE_Msk            /*!<Initialization Watch Trigger Interrupt Enable     */
#define FDCAN_TTIE_WTE_Pos   (16U)
#define FDCAN_TTIE_WTE_Msk   (0x1UL << FDCAN_TTIE_WTE_Pos) /*!< 0x00010000 */
#define FDCAN_TTIE_WTE       FDCAN_TTIE_WTE_Msk            /*!<Watch Trigger Interrupt Enable                    */
#define FDCAN_TTIE_AWE_Pos   (17U)
#define FDCAN_TTIE_AWE_Msk   (0x1UL << FDCAN_TTIE_AWE_Pos) /*!< 0x00020000 */
#define FDCAN_TTIE_AWE       FDCAN_TTIE_AWE_Msk            /*!<Application Watchdog Interrupt Enable             */
#define FDCAN_TTIE_CERE_Pos  (18U)
#define FDCAN_TTIE_CERE_Msk  (0x1UL << FDCAN_TTIE_CERE_Pos) /*!< 0x00040000 */
#define FDCAN_TTIE_CERE      FDCAN_TTIE_CERE_Msk            /*!<Configuration Error Interrupt Enable              */

/*****************  Bit definition for FDCAN_TTILS register  ********************/
#define FDCAN_TTILS_SBCS_Pos  (0U)
#define FDCAN_TTILS_SBCS_Msk  (0x1UL << FDCAN_TTILS_SBCS_Pos) /*!< 0x00000001 */
#define FDCAN_TTILS_SBCS      FDCAN_TTILS_SBCS_Msk            /*!<Start of Basic Cycle Interrupt Line               */
#define FDCAN_TTILS_SMCS_Pos  (1U)
#define FDCAN_TTILS_SMCS_Msk  (0x1UL << FDCAN_TTILS_SMCS_Pos) /*!< 0x00000002 */
#define FDCAN_TTILS_SMCS      FDCAN_TTILS_SMCS_Msk            /*!<Start of Matrix Cycle Interrupt Line              */
#define FDCAN_TTILS_CSMS_Pos  (2U)
#define FDCAN_TTILS_CSMS_Msk  (0x1UL << FDCAN_TTILS_CSMS_Pos) /*!< 0x00000004 */
#define FDCAN_TTILS_CSMS      FDCAN_TTILS_CSMS_Msk            /*!<Change of Synchronization Mode Interrupt Line     */
#define FDCAN_TTILS_SOGS_Pos  (3U)
#define FDCAN_TTILS_SOGS_Msk  (0x1UL << FDCAN_TTILS_SOGS_Pos) /*!< 0x00000008 */
#define FDCAN_TTILS_SOGS      FDCAN_TTILS_SOGS_Msk            /*!<Start of Gap Interrupt Line                       */
#define FDCAN_TTILS_RTMIS_Pos (4U)
#define FDCAN_TTILS_RTMIS_Msk (0x1UL << FDCAN_TTILS_RTMIS_Pos) /*!< 0x00000010 */
#define FDCAN_TTILS_RTMIS     FDCAN_TTILS_RTMIS_Msk            /*!<Register Time Mark Interrupt Interrupt Line       */
#define FDCAN_TTILS_TTMIS_Pos (5U)
#define FDCAN_TTILS_TTMIS_Msk (0x1UL << FDCAN_TTILS_TTMIS_Pos) /*!< 0x00000020 */
#define FDCAN_TTILS_TTMIS     FDCAN_TTILS_TTMIS_Msk            /*!<Trigger Time Mark Event Internal Interrupt Line   */
#define FDCAN_TTILS_SWES_Pos  (6U)
#define FDCAN_TTILS_SWES_Msk  (0x1UL << FDCAN_TTILS_SWES_Pos) /*!< 0x00000040 */
#define FDCAN_TTILS_SWES      FDCAN_TTILS_SWES_Msk            /*!<Stop Watch Event Interrupt Line                   */
#define FDCAN_TTILS_GTWS_Pos  (7U)
#define FDCAN_TTILS_GTWS_Msk  (0x1UL << FDCAN_TTILS_GTWS_Pos) /*!< 0x00000080 */
#define FDCAN_TTILS_GTWS      FDCAN_TTILS_GTWS_Msk            /*!<Global Time Wrap Interrupt Line                   */
#define FDCAN_TTILS_GTDS_Pos  (8U)
#define FDCAN_TTILS_GTDS_Msk  (0x1UL << FDCAN_TTILS_GTDS_Pos) /*!< 0x00000100 */
#define FDCAN_TTILS_GTDS      FDCAN_TTILS_GTDS_Msk            /*!<Global Time Discontinuity Interrupt Line          */
#define FDCAN_TTILS_GTES_Pos  (9U)
#define FDCAN_TTILS_GTES_Msk  (0x1UL << FDCAN_TTILS_GTES_Pos) /*!< 0x00000200 */
#define FDCAN_TTILS_GTES      FDCAN_TTILS_GTES_Msk            /*!<Global Time Error Interrupt Line                  */
#define FDCAN_TTILS_TXUS_Pos  (10U)
#define FDCAN_TTILS_TXUS_Msk  (0x1UL << FDCAN_TTILS_TXUS_Pos) /*!< 0x00000400 */
#define FDCAN_TTILS_TXUS      FDCAN_TTILS_TXUS_Msk            /*!<Tx Count Underflow Interrupt Line                 */
#define FDCAN_TTILS_TXOS_Pos  (11U)
#define FDCAN_TTILS_TXOS_Msk  (0x1UL << FDCAN_TTILS_TXOS_Pos) /*!< 0x00000800 */
#define FDCAN_TTILS_TXOS      FDCAN_TTILS_TXOS_Msk            /*!<Tx Count Overflow Interrupt Line                  */
#define FDCAN_TTILS_SE1S_Pos  (12U)
#define FDCAN_TTILS_SE1S_Msk  (0x1UL << FDCAN_TTILS_SE1S_Pos) /*!< 0x00001000 */
#define FDCAN_TTILS_SE1S      FDCAN_TTILS_SE1S_Msk            /*!<Scheduling Error 1 Interrupt Line                 */
#define FDCAN_TTILS_SE2S_Pos  (13U)
#define FDCAN_TTILS_SE2S_Msk  (0x1UL << FDCAN_TTILS_SE2S_Pos) /*!< 0x00002000 */
#define FDCAN_TTILS_SE2S      FDCAN_TTILS_SE2S_Msk            /*!<Scheduling Error 2 Interrupt Line                 */
#define FDCAN_TTILS_ELCS_Pos  (14U)
#define FDCAN_TTILS_ELCS_Msk  (0x1UL << FDCAN_TTILS_ELCS_Pos) /*!< 0x00004000 */
#define FDCAN_TTILS_ELCS      FDCAN_TTILS_ELCS_Msk            /*!<Error Level Changed Interrupt Line                */
#define FDCAN_TTILS_IWTS_Pos  (15U)
#define FDCAN_TTILS_IWTS_Msk  (0x1UL << FDCAN_TTILS_IWTS_Pos) /*!< 0x00008000 */
#define FDCAN_TTILS_IWTS      FDCAN_TTILS_IWTS_Msk            /*!<Initialization Watch Trigger Interrupt Line       */
#define FDCAN_TTILS_WTS_Pos   (16U)
#define FDCAN_TTILS_WTS_Msk   (0x1UL << FDCAN_TTILS_WTS_Pos) /*!< 0x00010000 */
#define FDCAN_TTILS_WTS       FDCAN_TTILS_WTS_Msk            /*!<Watch Trigger Interrupt Line                      */
#define FDCAN_TTILS_AWS_Pos   (17U)
#define FDCAN_TTILS_AWS_Msk   (0x1UL << FDCAN_TTILS_AWS_Pos) /*!< 0x00020000 */
#define FDCAN_TTILS_AWS       FDCAN_TTILS_AWS_Msk            /*!<Application Watchdog Interrupt Line               */
#define FDCAN_TTILS_CERS_Pos  (18U)
#define FDCAN_TTILS_CERS_Msk  (0x1UL << FDCAN_TTILS_CERS_Pos) /*!< 0x00040000 */
#define FDCAN_TTILS_CERS      FDCAN_TTILS_CERS_Msk            /*!<Configuration Error Interrupt Line                */

/*****************  Bit definition for FDCAN_TTOST register  ********************/
#define FDCAN_TTOST_EL_Pos   (0U)
#define FDCAN_TTOST_EL_Msk   (0x3UL << FDCAN_TTOST_EL_Pos) /*!< 0x00000003 */
#define FDCAN_TTOST_EL       FDCAN_TTOST_EL_Msk            /*!<Error Level                              */
#define FDCAN_TTOST_MS_Pos   (2U)
#define FDCAN_TTOST_MS_Msk   (0x3UL << FDCAN_TTOST_MS_Pos) /*!< 0x0000000C */
#define FDCAN_TTOST_MS       FDCAN_TTOST_MS_Msk            /*!<Master State                             */
#define FDCAN_TTOST_SYS_Pos  (4U)
#define FDCAN_TTOST_SYS_Msk  (0x3UL << FDCAN_TTOST_SYS_Pos) /*!< 0x00000030 */
#define FDCAN_TTOST_SYS      FDCAN_TTOST_SYS_Msk            /*!<Synchronization State                    */
#define FDCAN_TTOST_QGTP_Pos (6U)
#define FDCAN_TTOST_QGTP_Msk (0x1UL << FDCAN_TTOST_QGTP_Pos) /*!< 0x00000040 */
#define FDCAN_TTOST_QGTP     FDCAN_TTOST_QGTP_Msk            /*!<Quality of Global Time Phase             */
#define FDCAN_TTOST_QCS_Pos  (7U)
#define FDCAN_TTOST_QCS_Msk  (0x1UL << FDCAN_TTOST_QCS_Pos) /*!< 0x00000080 */
#define FDCAN_TTOST_QCS      FDCAN_TTOST_QCS_Msk            /*!<Quality of Clock Speed                   */
#define FDCAN_TTOST_RTO_Pos  (8U)
#define FDCAN_TTOST_RTO_Msk  (0xFFUL << FDCAN_TTOST_RTO_Pos) /*!< 0x0000FF00 */
#define FDCAN_TTOST_RTO      FDCAN_TTOST_RTO_Msk             /*!<Reference Trigger Offset                 */
#define FDCAN_TTOST_WGTD_Pos (22U)
#define FDCAN_TTOST_WGTD_Msk (0x1UL << FDCAN_TTOST_WGTD_Pos) /*!< 0x00400000 */
#define FDCAN_TTOST_WGTD     FDCAN_TTOST_WGTD_Msk            /*!<Wait for Global Time Discontinuity       */
#define FDCAN_TTOST_GFI_Pos  (23U)
#define FDCAN_TTOST_GFI_Msk  (0x1UL << FDCAN_TTOST_GFI_Pos) /*!< 0x00800000 */
#define FDCAN_TTOST_GFI      FDCAN_TTOST_GFI_Msk            /*!<Gap Finished Indicator                   */
#define FDCAN_TTOST_TMP_Pos  (24U)
#define FDCAN_TTOST_TMP_Msk  (0x7UL << FDCAN_TTOST_TMP_Pos) /*!< 0x07000000 */
#define FDCAN_TTOST_TMP      FDCAN_TTOST_TMP_Msk            /*!<Time Master Priority                     */
#define FDCAN_TTOST_GSI_Pos  (27U)
#define FDCAN_TTOST_GSI_Msk  (0x1UL << FDCAN_TTOST_GSI_Pos) /*!< 0x08000000 */
#define FDCAN_TTOST_GSI      FDCAN_TTOST_GSI_Msk            /*!<Gap Started Indicator                    */
#define FDCAN_TTOST_WFE_Pos  (28U)
#define FDCAN_TTOST_WFE_Msk  (0x1UL << FDCAN_TTOST_WFE_Pos) /*!< 0x10000000 */
#define FDCAN_TTOST_WFE      FDCAN_TTOST_WFE_Msk            /*!<Wait for Event                           */
#define FDCAN_TTOST_AWE_Pos  (29U)
#define FDCAN_TTOST_AWE_Msk  (0x1UL << FDCAN_TTOST_AWE_Pos) /*!< 0x20000000 */
#define FDCAN_TTOST_AWE      FDCAN_TTOST_AWE_Msk            /*!<Application Watchdog Event               */
#define FDCAN_TTOST_WECS_Pos (30U)
#define FDCAN_TTOST_WECS_Msk (0x1UL << FDCAN_TTOST_WECS_Pos) /*!< 0x40000000 */
#define FDCAN_TTOST_WECS     FDCAN_TTOST_WECS_Msk            /*!<Wait for External Clock Synchronization  */
#define FDCAN_TTOST_SPL_Pos  (31U)
#define FDCAN_TTOST_SPL_Msk  (0x1UL << FDCAN_TTOST_SPL_Pos) /*!< 0x80000000 */
#define FDCAN_TTOST_SPL      FDCAN_TTOST_SPL_Msk            /*!<Schedule Phase Lock                      */

/*****************  Bit definition for FDCAN_TURNA register  ********************/
#define FDCAN_TURNA_NAV_Pos (0U)
#define FDCAN_TURNA_NAV_Msk (0x3FFFFUL << FDCAN_TURNA_NAV_Pos) /*!< 0x0003FFFF */
#define FDCAN_TURNA_NAV     FDCAN_TURNA_NAV_Msk                /*!<Numerator Actual Value                   */

/*****************  Bit definition for FDCAN_TTLGT register  ********************/
#define FDCAN_TTLGT_LT_Pos (0U)
#define FDCAN_TTLGT_LT_Msk (0xFFFFUL << FDCAN_TTLGT_LT_Pos) /*!< 0x0000FFFF */
#define FDCAN_TTLGT_LT     FDCAN_TTLGT_LT_Msk               /*!<Local Time                               */
#define FDCAN_TTLGT_GT_Pos (16U)
#define FDCAN_TTLGT_GT_Msk (0xFFFFUL << FDCAN_TTLGT_GT_Pos) /*!< 0xFFFF0000 */
#define FDCAN_TTLGT_GT     FDCAN_TTLGT_GT_Msk               /*!<Global Time                              */

/*****************  Bit definition for FDCAN_TTCTC register  ********************/
#define FDCAN_TTCTC_CT_Pos (0U)
#define FDCAN_TTCTC_CT_Msk (0xFFFFUL << FDCAN_TTCTC_CT_Pos) /*!< 0x0000FFFF */
#define FDCAN_TTCTC_CT     FDCAN_TTCTC_CT_Msk               /*!<Cycle Time                               */
#define FDCAN_TTCTC_CC_Pos (16U)
#define FDCAN_TTCTC_CC_Msk (0x3FUL << FDCAN_TTCTC_CC_Pos) /*!< 0x003F0000 */
#define FDCAN_TTCTC_CC     FDCAN_TTCTC_CC_Msk             /*!<Cycle Count                              */

/*****************  Bit definition for FDCAN_TTCPT register  ********************/
#define FDCAN_TTCPT_CCV_Pos (0U)
#define FDCAN_TTCPT_CCV_Msk (0x3FUL << FDCAN_TTCPT_CCV_Pos) /*!< 0x0000003F */
#define FDCAN_TTCPT_CCV     FDCAN_TTCPT_CCV_Msk             /*!<Cycle Count Value                        */
#define FDCAN_TTCPT_SWV_Pos (16U)
#define FDCAN_TTCPT_SWV_Msk (0xFFFFUL << FDCAN_TTCPT_SWV_Pos) /*!< 0xFFFF0000 */
#define FDCAN_TTCPT_SWV     FDCAN_TTCPT_SWV_Msk               /*!<Stop Watch Value                         */

