Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*****************  Bit definition for FDCAN_TTCSM register  ********************/
#define FDCAN_TTCSM_CSM_Pos (0U)
#define FDCAN_TTCSM_CSM_Msk (0xFFFFUL << FDCAN_TTCSM_CSM_Pos) /*!< 0x0000FFFF */
#define FDCAN_TTCSM_CSM     FDCAN_TTCSM_CSM_Msk               /*!<Cycle Sync Mark                          */

/*****************  Bit definition for FDCAN_TTTS register  *********************/
#define FDCAN_TTTS_SWTSEL_Pos (0U)
#define FDCAN_TTTS_SWTSEL_Msk (0x3UL << FDCAN_TTTS_SWTSEL_Pos) /*!< 0x00000003 */
#define FDCAN_TTTS_SWTSEL     FDCAN_TTTS_SWTSEL_Msk            /*!<Stop watch trigger input selection       */
#define FDCAN_TTTS_EVTSEL_Pos (4U)
#define FDCAN_TTTS_EVTSEL_Msk (0x3UL << FDCAN_TTTS_EVTSEL_Pos) /*!< 0x00000030 */
#define FDCAN_TTTS_EVTSEL     FDCAN_TTTS_EVTSEL_Msk            /*!<Event trigger input selection            */

/********************************************************************************/
/*                                                                              */
/*                      FDCANCCU (Clock Calibration unit)                       */
/*                                                                              */
/********************************************************************************/

/*****************  Bit definition for FDCANCCU_CREL register  ******************/
#define FDCANCCU_CREL_DAY_Pos     (0U)
#define FDCANCCU_CREL_DAY_Msk     (0xFFUL << FDCANCCU_CREL_DAY_Pos) /*!< 0x000000FF */
#define FDCANCCU_CREL_DAY         FDCANCCU_CREL_DAY_Msk             /*!<Timestamp Day                           */
#define FDCANCCU_CREL_MON_Pos     (8U)
#define FDCANCCU_CREL_MON_Msk     (0xFFUL << FDCANCCU_CREL_MON_Pos) /*!< 0x0000FF00 */
#define FDCANCCU_CREL_MON         FDCANCCU_CREL_MON_Msk             /*!<Timestamp Month                         */
#define FDCANCCU_CREL_YEAR_Pos    (16U)
#define FDCANCCU_CREL_YEAR_Msk    (0xFUL << FDCANCCU_CREL_YEAR_Pos) /*!< 0x000F0000 */
#define FDCANCCU_CREL_YEAR        FDCANCCU_CREL_YEAR_Msk            /*!<Timestamp Year                          */
#define FDCANCCU_CREL_SUBSTEP_Pos (20U)
#define FDCANCCU_CREL_SUBSTEP_Msk (0xFUL << FDCANCCU_CREL_SUBSTEP_Pos) /*!< 0x00F00000 */
#define FDCANCCU_CREL_SUBSTEP     FDCANCCU_CREL_SUBSTEP_Msk            /*!<Sub-step of Core release                */
#define FDCANCCU_CREL_STEP_Pos    (24U)
#define FDCANCCU_CREL_STEP_Msk    (0xFUL << FDCANCCU_CREL_STEP_Pos) /*!< 0x0F000000 */
#define FDCANCCU_CREL_STEP        FDCANCCU_CREL_STEP_Msk            /*!<Step of Core release                    */
#define FDCANCCU_CREL_REL_Pos     (28U)
#define FDCANCCU_CREL_REL_Msk     (0xFUL << FDCANCCU_CREL_REL_Pos) /*!< 0xF0000000 */
#define FDCANCCU_CREL_REL         FDCANCCU_CREL_REL_Msk            /*!<Core release                            */

/*****************  Bit definition for FDCANCCU_CCFG register  ******************/
#define FDCANCCU_CCFG_TQBT_Pos (0U)
#define FDCANCCU_CCFG_TQBT_Msk (0x1FUL << FDCANCCU_CCFG_TQBT_Pos) /*!< 0x0000001F */
#define FDCANCCU_CCFG_TQBT     FDCANCCU_CCFG_TQBT_Msk             /*!<Time Quanta per Bit Time                */
#define FDCANCCU_CCFG_BCC_Pos  (6U)
#define FDCANCCU_CCFG_BCC_Msk  (0x1UL << FDCANCCU_CCFG_BCC_Pos) /*!< 0x00000040 */
#define FDCANCCU_CCFG_BCC      FDCANCCU_CCFG_BCC_Msk            /*!<Bypass Clock Calibration                */
#define FDCANCCU_CCFG_CFL_Pos  (7U)
#define FDCANCCU_CCFG_CFL_Msk  (0x1UL << FDCANCCU_CCFG_CFL_Pos) /*!< 0x00000080 */
#define FDCANCCU_CCFG_CFL      FDCANCCU_CCFG_CFL_Msk            /*!<Calibration Field Length                */
#define FDCANCCU_CCFG_OCPM_Pos (8U)
#define FDCANCCU_CCFG_OCPM_Msk (0xFFUL << FDCANCCU_CCFG_OCPM_Pos) /*!< 0x0000FF00 */
#define FDCANCCU_CCFG_OCPM     FDCANCCU_CCFG_OCPM_Msk             /*!<Oscillator Clock Periods Minimum        */
#define FDCANCCU_CCFG_CDIV_Pos (16U)
#define FDCANCCU_CCFG_CDIV_Msk (0xFUL << FDCANCCU_CCFG_CDIV_Pos) /*!< 0x000F0000 */
#define FDCANCCU_CCFG_CDIV     FDCANCCU_CCFG_CDIV_Msk            /*!<Clock Divider                           */
#define FDCANCCU_CCFG_SWR_Pos  (31U)
#define FDCANCCU_CCFG_SWR_Msk  (0x1UL << FDCANCCU_CCFG_SWR_Pos) /*!< 0x80000000 */
#define FDCANCCU_CCFG_SWR      FDCANCCU_CCFG_SWR_Msk            /*!<Software Reset                          */

/*****************  Bit definition for FDCANCCU_CSTAT register  *****************/
#define FDCANCCU_CSTAT_OCPC_Pos (0U)
#define FDCANCCU_CSTAT_OCPC_Msk (0x3FFFFUL << FDCANCCU_CSTAT_OCPC_Pos) /*!< 0x0003FFFF */
#define FDCANCCU_CSTAT_OCPC     FDCANCCU_CSTAT_OCPC_Msk                /*!<Oscillator Clock Period Counter        */
#define FDCANCCU_CSTAT_TQC_Pos  (18U)
#define FDCANCCU_CSTAT_TQC_Msk  (0x7FFUL << FDCANCCU_CSTAT_TQC_Pos) /*!< 0x1FFC0000 */
#define FDCANCCU_CSTAT_TQC      FDCANCCU_CSTAT_TQC_Msk              /*!<Time Quanta Counter                    */
#define FDCANCCU_CSTAT_CALS_Pos (30U)
#define FDCANCCU_CSTAT_CALS_Msk (0x3UL << FDCANCCU_CSTAT_CALS_Pos) /*!< 0xC0000000 */
#define FDCANCCU_CSTAT_CALS     FDCANCCU_CSTAT_CALS_Msk            /*!<Calibration State                      */

/******************  Bit definition for FDCANCCU_CWD register  ******************/
#define FDCANCCU_CWD_WDC_Pos (0U)
#define FDCANCCU_CWD_WDC_Msk (0xFFFFUL << FDCANCCU_CWD_WDC_Pos) /*!< 0x0000FFFF */
#define FDCANCCU_CWD_WDC     FDCANCCU_CWD_WDC_Msk               /*!<Watchdog Configuration                 */
#define FDCANCCU_CWD_WDV_Pos (16U)
#define FDCANCCU_CWD_WDV_Msk (0xFFFFUL << FDCANCCU_CWD_WDV_Pos) /*!< 0xFFFF0000 */
#define FDCANCCU_CWD_WDV     FDCANCCU_CWD_WDV_Msk               /*!<Watchdog Value                         */

/******************  Bit definition for FDCANCCU_IR register  *******************/
#define FDCANCCU_IR_CWE_Pos (0U)
#define FDCANCCU_IR_CWE_Msk (0x1UL << FDCANCCU_IR_CWE_Pos) /*!< 0x00000001 */
#define FDCANCCU_IR_CWE     FDCANCCU_IR_CWE_Msk            /*!<Calibration Watchdog Event             */
#define FDCANCCU_IR_CSC_Pos (1U)
#define FDCANCCU_IR_CSC_Msk (0x1UL << FDCANCCU_IR_CSC_Pos) /*!< 0x00000002 */
#define FDCANCCU_IR_CSC     FDCANCCU_IR_CSC_Msk            /*!<Calibration State Changed              */

/******************  Bit definition for FDCANCCU_IE register  *******************/
#define FDCANCCU_IE_CWEE_Pos (0U)
#define FDCANCCU_IE_CWEE_Msk (0x1UL << FDCANCCU_IE_CWEE_Pos) /*!< 0x00000001 */
#define FDCANCCU_IE_CWEE     FDCANCCU_IE_CWEE_Msk            /*!<Calibration Watchdog Event Enable      */
#define FDCANCCU_IE_CSCE_Pos (1U)
#define FDCANCCU_IE_CSCE_Msk (0x1UL << FDCANCCU_IE_CSCE_Pos) /*!< 0x00000002 */
#define FDCANCCU_IE_CSCE     FDCANCCU_IE_CSCE_Msk            /*!<Calibration State Changed Enable       */

/******************************************************************************/
/*                                                                            */
/*                          HDMI-CEC (CEC)                                    */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CEC_CR register  *********************/
#define CEC_CR_CECEN_Pos (0U)
#define CEC_CR_CECEN_Msk (0x1UL << CEC_CR_CECEN_Pos) /*!< 0x00000001 */
#define CEC_CR_CECEN     CEC_CR_CECEN_Msk            /*!< CEC Enable                                */
#define CEC_CR_TXSOM_Pos (1U)
#define CEC_CR_TXSOM_Msk (0x1UL << CEC_CR_TXSOM_Pos) /*!< 0x00000002 */
#define CEC_CR_TXSOM     CEC_CR_TXSOM_Msk            /*!< CEC Tx Start Of Message                   */
#define CEC_CR_TXEOM_Pos (2U)
#define CEC_CR_TXEOM_Msk (0x1UL << CEC_CR_TXEOM_Pos) /*!< 0x00000004 */
#define CEC_CR_TXEOM     CEC_CR_TXEOM_Msk            /*!< CEC Tx End Of Message                     */

/*******************  Bit definition for CEC_CFGR register  *******************/
#define CEC_CFGR_SFT_Pos      (0U)
#define CEC_CFGR_SFT_Msk      (0x7UL << CEC_CFGR_SFT_Pos) /*!< 0x00000007 */
#define CEC_CFGR_SFT          CEC_CFGR_SFT_Msk            /*!< CEC Signal Free Time                      */
#define CEC_CFGR_RXTOL_Pos    (3U)
#define CEC_CFGR_RXTOL_Msk    (0x1UL << CEC_CFGR_RXTOL_Pos) /*!< 0x00000008 */
#define CEC_CFGR_RXTOL        CEC_CFGR_RXTOL_Msk            /*!< CEC Tolerance                             */
#define CEC_CFGR_BRESTP_Pos   (4U)
#define CEC_CFGR_BRESTP_Msk   (0x1UL << CEC_CFGR_BRESTP_Pos) /*!< 0x00000010 */
#define CEC_CFGR_BRESTP       CEC_CFGR_BRESTP_Msk            /*!< CEC Rx Stop                               */
#define CEC_CFGR_BREGEN_Pos   (5U)
#define CEC_CFGR_BREGEN_Msk   (0x1UL << CEC_CFGR_BREGEN_Pos) /*!< 0x00000020 */
#define CEC_CFGR_BREGEN       CEC_CFGR_BREGEN_Msk            /*!< CEC Bit Rising Error generation           */
#define CEC_CFGR_LBPEGEN_Pos  (6U)
#define CEC_CFGR_LBPEGEN_Msk  (0x1UL << CEC_CFGR_LBPEGEN_Pos) /*!< 0x00000040 */
#define CEC_CFGR_LBPEGEN      CEC_CFGR_LBPEGEN_Msk            /*!< CEC Long Bit Period Error generation      */
#define CEC_CFGR_SFTOPT_Pos   (8U)
#define CEC_CFGR_SFTOPT_Msk   (0x1UL << CEC_CFGR_SFTOPT_Pos) /*!< 0x00000100 */
#define CEC_CFGR_SFTOPT       CEC_CFGR_SFTOPT_Msk            /*!< CEC Signal Free Time optional             */
#define CEC_CFGR_BRDNOGEN_Pos (7U)
#define CEC_CFGR_BRDNOGEN_Msk (0x1UL << CEC_CFGR_BRDNOGEN_Pos) /*!< 0x00000080 */
#define CEC_CFGR_BRDNOGEN     CEC_CFGR_BRDNOGEN_Msk            /*!< CEC Broadcast No error generation         */
#define CEC_CFGR_OAR_Pos      (16U)
#define CEC_CFGR_OAR_Msk      (0x7FFFUL << CEC_CFGR_OAR_Pos) /*!< 0x7FFF0000 */
#define CEC_CFGR_OAR          CEC_CFGR_OAR_Msk               /*!< CEC Own Address                           */
#define CEC_CFGR_LSTN_Pos     (31U)
#define CEC_CFGR_LSTN_Msk     (0x1UL << CEC_CFGR_LSTN_Pos) /*!< 0x80000000 */
#define CEC_CFGR_LSTN         CEC_CFGR_LSTN_Msk            /*!< CEC Listen mode                           */

