Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for CEC_TXDR register  *******************/
#define CEC_TXDR_TXD_Pos (0U)
#define CEC_TXDR_TXD_Msk (0xFFUL << CEC_TXDR_TXD_Pos) /*!< 0x000000FF */
#define CEC_TXDR_TXD     CEC_TXDR_TXD_Msk             /*!< CEC Tx Data                               */

/*******************  Bit definition for CEC_RXDR register  *******************/
#define CEC_RXDR_RXD_Pos (0U)
#define CEC_RXDR_RXD_Msk (0xFFUL << CEC_RXDR_RXD_Pos) /*!< 0x000000FF */
#define CEC_RXDR_RXD     CEC_RXDR_RXD_Msk             /*!< CEC Rx Data                               */

/*******************  Bit definition for CEC_ISR register  ********************/
#define CEC_ISR_RXBR_Pos   (0U)
#define CEC_ISR_RXBR_Msk   (0x1UL << CEC_ISR_RXBR_Pos) /*!< 0x00000001 */
#define CEC_ISR_RXBR       CEC_ISR_RXBR_Msk            /*!< CEC Rx-Byte Received                      */
#define CEC_ISR_RXEND_Pos  (1U)
#define CEC_ISR_RXEND_Msk  (0x1UL << CEC_ISR_RXEND_Pos) /*!< 0x00000002 */
#define CEC_ISR_RXEND      CEC_ISR_RXEND_Msk            /*!< CEC End Of Reception                      */
#define CEC_ISR_RXOVR_Pos  (2U)
#define CEC_ISR_RXOVR_Msk  (0x1UL << CEC_ISR_RXOVR_Pos) /*!< 0x00000004 */
#define CEC_ISR_RXOVR      CEC_ISR_RXOVR_Msk            /*!< CEC Rx-Overrun                            */
#define CEC_ISR_BRE_Pos    (3U)
#define CEC_ISR_BRE_Msk    (0x1UL << CEC_ISR_BRE_Pos) /*!< 0x00000008 */
#define CEC_ISR_BRE        CEC_ISR_BRE_Msk            /*!< CEC Rx Bit Rising Error                   */
#define CEC_ISR_SBPE_Pos   (4U)
#define CEC_ISR_SBPE_Msk   (0x1UL << CEC_ISR_SBPE_Pos) /*!< 0x00000010 */
#define CEC_ISR_SBPE       CEC_ISR_SBPE_Msk            /*!< CEC Rx Short Bit period Error             */
#define CEC_ISR_LBPE_Pos   (5U)
#define CEC_ISR_LBPE_Msk   (0x1UL << CEC_ISR_LBPE_Pos) /*!< 0x00000020 */
#define CEC_ISR_LBPE       CEC_ISR_LBPE_Msk            /*!< CEC Rx Long Bit period Error              */
#define CEC_ISR_RXACKE_Pos (6U)
#define CEC_ISR_RXACKE_Msk (0x1UL << CEC_ISR_RXACKE_Pos) /*!< 0x00000040 */
#define CEC_ISR_RXACKE     CEC_ISR_RXACKE_Msk            /*!< CEC Rx Missing Acknowledge                */
#define CEC_ISR_ARBLST_Pos (7U)
#define CEC_ISR_ARBLST_Msk (0x1UL << CEC_ISR_ARBLST_Pos) /*!< 0x00000080 */
#define CEC_ISR_ARBLST     CEC_ISR_ARBLST_Msk            /*!< CEC Arbitration Lost                      */
#define CEC_ISR_TXBR_Pos   (8U)
#define CEC_ISR_TXBR_Msk   (0x1UL << CEC_ISR_TXBR_Pos) /*!< 0x00000100 */
#define CEC_ISR_TXBR       CEC_ISR_TXBR_Msk            /*!< CEC Tx Byte Request                       */
#define CEC_ISR_TXEND_Pos  (9U)
#define CEC_ISR_TXEND_Msk  (0x1UL << CEC_ISR_TXEND_Pos) /*!< 0x00000200 */
#define CEC_ISR_TXEND      CEC_ISR_TXEND_Msk            /*!< CEC End of Transmission                   */
#define CEC_ISR_TXUDR_Pos  (10U)
#define CEC_ISR_TXUDR_Msk  (0x1UL << CEC_ISR_TXUDR_Pos) /*!< 0x00000400 */
#define CEC_ISR_TXUDR      CEC_ISR_TXUDR_Msk            /*!< CEC Tx-Buffer Underrun                    */
#define CEC_ISR_TXERR_Pos  (11U)
#define CEC_ISR_TXERR_Msk  (0x1UL << CEC_ISR_TXERR_Pos) /*!< 0x00000800 */
#define CEC_ISR_TXERR      CEC_ISR_TXERR_Msk            /*!< CEC Tx-Error                              */
#define CEC_ISR_TXACKE_Pos (12U)
#define CEC_ISR_TXACKE_Msk (0x1UL << CEC_ISR_TXACKE_Pos) /*!< 0x00001000 */
#define CEC_ISR_TXACKE     CEC_ISR_TXACKE_Msk            /*!< CEC Tx Missing Acknowledge                */

/*******************  Bit definition for CEC_IER register  ********************/
#define CEC_IER_RXBRIE_Pos   (0U)
#define CEC_IER_RXBRIE_Msk   (0x1UL << CEC_IER_RXBRIE_Pos) /*!< 0x00000001 */
#define CEC_IER_RXBRIE       CEC_IER_RXBRIE_Msk            /*!< CEC Rx-Byte Received IT Enable            */
#define CEC_IER_RXENDIE_Pos  (1U)
#define CEC_IER_RXENDIE_Msk  (0x1UL << CEC_IER_RXENDIE_Pos) /*!< 0x00000002 */
#define CEC_IER_RXENDIE      CEC_IER_RXENDIE_Msk            /*!< CEC End Of Reception IT Enable            */
#define CEC_IER_RXOVRIE_Pos  (2U)
#define CEC_IER_RXOVRIE_Msk  (0x1UL << CEC_IER_RXOVRIE_Pos) /*!< 0x00000004 */
#define CEC_IER_RXOVRIE      CEC_IER_RXOVRIE_Msk            /*!< CEC Rx-Overrun IT Enable                  */
#define CEC_IER_BREIE_Pos    (3U)
#define CEC_IER_BREIE_Msk    (0x1UL << CEC_IER_BREIE_Pos) /*!< 0x00000008 */
#define CEC_IER_BREIE        CEC_IER_BREIE_Msk            /*!< CEC Rx Bit Rising Error IT Enable         */
#define CEC_IER_SBPEIE_Pos   (4U)
#define CEC_IER_SBPEIE_Msk   (0x1UL << CEC_IER_SBPEIE_Pos) /*!< 0x00000010 */
#define CEC_IER_SBPEIE       CEC_IER_SBPEIE_Msk            /*!< CEC Rx Short Bit period Error IT Enable   */
#define CEC_IER_LBPEIE_Pos   (5U)
#define CEC_IER_LBPEIE_Msk   (0x1UL << CEC_IER_LBPEIE_Pos) /*!< 0x00000020 */
#define CEC_IER_LBPEIE       CEC_IER_LBPEIE_Msk            /*!< CEC Rx Long Bit period Error IT Enable    */
#define CEC_IER_RXACKEIE_Pos (6U)
#define CEC_IER_RXACKEIE_Msk (0x1UL << CEC_IER_RXACKEIE_Pos) /*!< 0x00000040 */
#define CEC_IER_RXACKEIE     CEC_IER_RXACKEIE_Msk            /*!< CEC Rx Missing Acknowledge IT Enable      */
#define CEC_IER_ARBLSTIE_Pos (7U)
#define CEC_IER_ARBLSTIE_Msk (0x1UL << CEC_IER_ARBLSTIE_Pos) /*!< 0x00000080 */
#define CEC_IER_ARBLSTIE     CEC_IER_ARBLSTIE_Msk            /*!< CEC Arbitration Lost IT Enable            */
#define CEC_IER_TXBRIE_Pos   (8U)
#define CEC_IER_TXBRIE_Msk   (0x1UL << CEC_IER_TXBRIE_Pos) /*!< 0x00000100 */
#define CEC_IER_TXBRIE       CEC_IER_TXBRIE_Msk            /*!< CEC Tx Byte Request  IT Enable            */
#define CEC_IER_TXENDIE_Pos  (9U)
#define CEC_IER_TXENDIE_Msk  (0x1UL << CEC_IER_TXENDIE_Pos) /*!< 0x00000200 */
#define CEC_IER_TXENDIE      CEC_IER_TXENDIE_Msk            /*!< CEC End of Transmission IT Enable         */
#define CEC_IER_TXUDRIE_Pos  (10U)
#define CEC_IER_TXUDRIE_Msk  (0x1UL << CEC_IER_TXUDRIE_Pos) /*!< 0x00000400 */
#define CEC_IER_TXUDRIE      CEC_IER_TXUDRIE_Msk            /*!< CEC Tx-Buffer Underrun IT Enable          */
#define CEC_IER_TXERRIE_Pos  (11U)
#define CEC_IER_TXERRIE_Msk  (0x1UL << CEC_IER_TXERRIE_Pos) /*!< 0x00000800 */
#define CEC_IER_TXERRIE      CEC_IER_TXERRIE_Msk            /*!< CEC Tx-Error IT Enable                    */
#define CEC_IER_TXACKEIE_Pos (12U)
#define CEC_IER_TXACKEIE_Msk (0x1UL << CEC_IER_TXACKEIE_Pos) /*!< 0x00001000 */
#define CEC_IER_TXACKEIE     CEC_IER_TXACKEIE_Msk            /*!< CEC Tx Missing Acknowledge IT Enable      */

/******************************************************************************/
/*                                                                            */
/*                          CRC calculation unit                              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for CRC_DR register  *********************/
#define CRC_DR_DR_Pos (0U)
#define CRC_DR_DR_Msk (0xFFFFFFFFUL << CRC_DR_DR_Pos) /*!< 0xFFFFFFFF */
#define CRC_DR_DR     CRC_DR_DR_Msk                   /*!< Data register bits */

/*******************  Bit definition for CRC_IDR register  ********************/
#define CRC_IDR_IDR_Pos (0U)
#define CRC_IDR_IDR_Msk (0xFFFFFFFFUL << CRC_IDR_IDR_Pos) /*!< 0xFFFFFFFF */
#define CRC_IDR_IDR     CRC_IDR_IDR_Msk                   /*!< General-purpose 32-bit data register bits */

/********************  Bit definition for CRC_CR register  ********************/
#define CRC_CR_RESET_Pos    (0U)
#define CRC_CR_RESET_Msk    (0x1UL << CRC_CR_RESET_Pos) /*!< 0x00000001 */
#define CRC_CR_RESET        CRC_CR_RESET_Msk            /*!< RESET the CRC computation unit bit */
#define CRC_CR_POLYSIZE_Pos (3U)
#define CRC_CR_POLYSIZE_Msk (0x3UL << CRC_CR_POLYSIZE_Pos) /*!< 0x00000018 */
#define CRC_CR_POLYSIZE     CRC_CR_POLYSIZE_Msk            /*!< Polynomial size bits */
#define CRC_CR_POLYSIZE_0   (0x1UL << CRC_CR_POLYSIZE_Pos) /*!< 0x00000008 */
#define CRC_CR_POLYSIZE_1   (0x2UL << CRC_CR_POLYSIZE_Pos) /*!< 0x00000010 */
#define CRC_CR_REV_IN_Pos   (5U)
#define CRC_CR_REV_IN_Msk   (0x3UL << CRC_CR_REV_IN_Pos) /*!< 0x00000060 */
#define CRC_CR_REV_IN       CRC_CR_REV_IN_Msk            /*!< REV_IN Reverse Input Data bits */
#define CRC_CR_REV_IN_0     (0x1UL << CRC_CR_REV_IN_Pos) /*!< 0x00000020 */
#define CRC_CR_REV_IN_1     (0x2UL << CRC_CR_REV_IN_Pos) /*!< 0x00000040 */
#define CRC_CR_REV_OUT_Pos  (7U)
#define CRC_CR_REV_OUT_Msk  (0x1UL << CRC_CR_REV_OUT_Pos) /*!< 0x00000080 */
#define CRC_CR_REV_OUT      CRC_CR_REV_OUT_Msk            /*!< REV_OUT Reverse Output Data bits */

/*******************  Bit definition for CRC_INIT register  *******************/
#define CRC_INIT_INIT_Pos (0U)
#define CRC_INIT_INIT_Msk (0xFFFFFFFFUL << CRC_INIT_INIT_Pos) /*!< 0xFFFFFFFF */
#define CRC_INIT_INIT     CRC_INIT_INIT_Msk                   /*!< Initial CRC value bits */

/*******************  Bit definition for CRC_POL register  ********************/
#define CRC_POL_POL_Pos (0U)
#define CRC_POL_POL_Msk (0xFFFFFFFFUL << CRC_POL_POL_Pos) /*!< 0xFFFFFFFF */
#define CRC_POL_POL     CRC_POL_POL_Msk                   /*!< Coefficients of the polynomial */

/******************************************************************************/
/*                                                                            */
/*                          CRS Clock Recovery System                         */
/******************************************************************************/

/*******************  Bit definition for CRS_CR register  *********************/
#define CRS_CR_SYNCOKIE_Pos   (0U)
#define CRS_CR_SYNCOKIE_Msk   (0x1UL << CRS_CR_SYNCOKIE_Pos) /*!< 0x00000001 */
#define CRS_CR_SYNCOKIE       CRS_CR_SYNCOKIE_Msk            /*!< SYNC event OK interrupt enable */
#define CRS_CR_SYNCWARNIE_Pos (1U)
#define CRS_CR_SYNCWARNIE_Msk (0x1UL << CRS_CR_SYNCWARNIE_Pos) /*!< 0x00000002 */
#define CRS_CR_SYNCWARNIE     CRS_CR_SYNCWARNIE_Msk            /*!< SYNC warning interrupt enable */
#define CRS_CR_ERRIE_Pos      (2U)
#define CRS_CR_ERRIE_Msk      (0x1UL << CRS_CR_ERRIE_Pos) /*!< 0x00000004 */
#define CRS_CR_ERRIE          CRS_CR_ERRIE_Msk            /*!< SYNC error or trimming error interrupt enable */
#define CRS_CR_ESYNCIE_Pos    (3U)
#define CRS_CR_ESYNCIE_Msk    (0x1UL << CRS_CR_ESYNCIE_Pos) /*!< 0x00000008 */
#define CRS_CR_ESYNCIE        CRS_CR_ESYNCIE_Msk            /*!< Expected SYNC interrupt enable */
#define CRS_CR_CEN_Pos        (5U)
#define CRS_CR_CEN_Msk        (0x1UL << CRS_CR_CEN_Pos) /*!< 0x00000020 */
#define CRS_CR_CEN            CRS_CR_CEN_Msk            /*!< Frequency error counter enable */
#define CRS_CR_AUTOTRIMEN_Pos (6U)
#define CRS_CR_AUTOTRIMEN_Msk (0x1UL << CRS_CR_AUTOTRIMEN_Pos) /*!< 0x00000040 */
#define CRS_CR_AUTOTRIMEN     CRS_CR_AUTOTRIMEN_Msk            /*!< Automatic trimming enable */
#define CRS_CR_SWSYNC_Pos     (7U)
#define CRS_CR_SWSYNC_Msk     (0x1UL << CRS_CR_SWSYNC_Pos) /*!< 0x00000080 */
#define CRS_CR_SWSYNC         CRS_CR_SWSYNC_Msk            /*!< Generate software SYNC event */
#define CRS_CR_TRIM_Pos       (8U)
#define CRS_CR_TRIM_Msk       (0x3FUL << CRS_CR_TRIM_Pos) /*!< 0x00003F00 */
#define CRS_CR_TRIM           CRS_CR_TRIM_Msk             /*!< HSI48 oscillator smooth trimming */

/*******************  Bit definition for CRS_CFGR register  *********************/
#define CRS_CFGR_RELOAD_Pos  (0U)
#define CRS_CFGR_RELOAD_Msk  (0xFFFFUL << CRS_CFGR_RELOAD_Pos) /*!< 0x0000FFFF */
#define CRS_CFGR_RELOAD      CRS_CFGR_RELOAD_Msk               /*!< Counter reload value */
#define CRS_CFGR_FELIM_Pos   (16U)
#define CRS_CFGR_FELIM_Msk   (0xFFUL << CRS_CFGR_FELIM_Pos) /*!< 0x00FF0000 */
#define CRS_CFGR_FELIM       CRS_CFGR_FELIM_Msk             /*!< Frequency error limit */

#define CRS_CFGR_SYNCDIV_Pos (24U)
#define CRS_CFGR_SYNCDIV_Msk (0x7UL << CRS_CFGR_SYNCDIV_Pos) /*!< 0x07000000 */
#define CRS_CFGR_SYNCDIV     CRS_CFGR_SYNCDIV_Msk            /*!< SYNC divider */
#define CRS_CFGR_SYNCDIV_0   (0x1UL << CRS_CFGR_SYNCDIV_Pos) /*!< 0x01000000 */
#define CRS_CFGR_SYNCDIV_1   (0x2UL << CRS_CFGR_SYNCDIV_Pos) /*!< 0x02000000 */
#define CRS_CFGR_SYNCDIV_2   (0x4UL << CRS_CFGR_SYNCDIV_Pos) /*!< 0x04000000 */

