Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define CRS_CFGR_SYNCSRC_Pos (28U)
#define CRS_CFGR_SYNCSRC_Msk (0x3UL << CRS_CFGR_SYNCSRC_Pos) /*!< 0x30000000 */
#define CRS_CFGR_SYNCSRC     CRS_CFGR_SYNCSRC_Msk            /*!< SYNC signal source selection */
#define CRS_CFGR_SYNCSRC_0   (0x1UL << CRS_CFGR_SYNCSRC_Pos) /*!< 0x10000000 */
#define CRS_CFGR_SYNCSRC_1   (0x2UL << CRS_CFGR_SYNCSRC_Pos) /*!< 0x20000000 */

#define CRS_CFGR_SYNCPOL_Pos (31U)
#define CRS_CFGR_SYNCPOL_Msk (0x1UL << CRS_CFGR_SYNCPOL_Pos) /*!< 0x80000000 */
#define CRS_CFGR_SYNCPOL     CRS_CFGR_SYNCPOL_Msk            /*!< SYNC polarity selection */

/*******************  Bit definition for CRS_ISR register  *********************/
#define CRS_ISR_SYNCOKF_Pos   (0U)
#define CRS_ISR_SYNCOKF_Msk   (0x1UL << CRS_ISR_SYNCOKF_Pos) /*!< 0x00000001 */
#define CRS_ISR_SYNCOKF       CRS_ISR_SYNCOKF_Msk            /*!< SYNC event OK flag */
#define CRS_ISR_SYNCWARNF_Pos (1U)
#define CRS_ISR_SYNCWARNF_Msk (0x1UL << CRS_ISR_SYNCWARNF_Pos) /*!< 0x00000002 */
#define CRS_ISR_SYNCWARNF     CRS_ISR_SYNCWARNF_Msk            /*!< SYNC warning flag */
#define CRS_ISR_ERRF_Pos      (2U)
#define CRS_ISR_ERRF_Msk      (0x1UL << CRS_ISR_ERRF_Pos) /*!< 0x00000004 */
#define CRS_ISR_ERRF          CRS_ISR_ERRF_Msk            /*!< Error flag */
#define CRS_ISR_ESYNCF_Pos    (3U)
#define CRS_ISR_ESYNCF_Msk    (0x1UL << CRS_ISR_ESYNCF_Pos) /*!< 0x00000008 */
#define CRS_ISR_ESYNCF        CRS_ISR_ESYNCF_Msk            /*!< Expected SYNC flag */
#define CRS_ISR_SYNCERR_Pos   (8U)
#define CRS_ISR_SYNCERR_Msk   (0x1UL << CRS_ISR_SYNCERR_Pos) /*!< 0x00000100 */
#define CRS_ISR_SYNCERR       CRS_ISR_SYNCERR_Msk            /*!< SYNC error */
#define CRS_ISR_SYNCMISS_Pos  (9U)
#define CRS_ISR_SYNCMISS_Msk  (0x1UL << CRS_ISR_SYNCMISS_Pos) /*!< 0x00000200 */
#define CRS_ISR_SYNCMISS      CRS_ISR_SYNCMISS_Msk            /*!< SYNC missed */
#define CRS_ISR_TRIMOVF_Pos   (10U)
#define CRS_ISR_TRIMOVF_Msk   (0x1UL << CRS_ISR_TRIMOVF_Pos) /*!< 0x00000400 */
#define CRS_ISR_TRIMOVF       CRS_ISR_TRIMOVF_Msk            /*!< Trimming overflow or underflow */
#define CRS_ISR_FEDIR_Pos     (15U)
#define CRS_ISR_FEDIR_Msk     (0x1UL << CRS_ISR_FEDIR_Pos) /*!< 0x00008000 */
#define CRS_ISR_FEDIR         CRS_ISR_FEDIR_Msk            /*!< Frequency error direction */
#define CRS_ISR_FECAP_Pos     (16U)
#define CRS_ISR_FECAP_Msk     (0xFFFFUL << CRS_ISR_FECAP_Pos) /*!< 0xFFFF0000 */
#define CRS_ISR_FECAP         CRS_ISR_FECAP_Msk               /*!< Frequency error capture */

/*******************  Bit definition for CRS_ICR register  *********************/
#define CRS_ICR_SYNCOKC_Pos   (0U)
#define CRS_ICR_SYNCOKC_Msk   (0x1UL << CRS_ICR_SYNCOKC_Pos) /*!< 0x00000001 */
#define CRS_ICR_SYNCOKC       CRS_ICR_SYNCOKC_Msk            /*!< SYNC event OK clear flag */
#define CRS_ICR_SYNCWARNC_Pos (1U)
#define CRS_ICR_SYNCWARNC_Msk (0x1UL << CRS_ICR_SYNCWARNC_Pos) /*!< 0x00000002 */
#define CRS_ICR_SYNCWARNC     CRS_ICR_SYNCWARNC_Msk            /*!< SYNC warning clear flag */
#define CRS_ICR_ERRC_Pos      (2U)
#define CRS_ICR_ERRC_Msk      (0x1UL << CRS_ICR_ERRC_Pos) /*!< 0x00000004 */
#define CRS_ICR_ERRC          CRS_ICR_ERRC_Msk            /*!< Error clear flag */
#define CRS_ICR_ESYNCC_Pos    (3U)
#define CRS_ICR_ESYNCC_Msk    (0x1UL << CRS_ICR_ESYNCC_Pos) /*!< 0x00000008 */
#define CRS_ICR_ESYNCC        CRS_ICR_ESYNCC_Msk            /*!< Expected SYNC clear flag */

/******************************************************************************/
/*                                                                            */
/*                      Digital to Analog Converter                           */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for DAC_CR register  ********************/
#define DAC_CR_EN1_Pos       (0U)
#define DAC_CR_EN1_Msk       (0x1UL << DAC_CR_EN1_Pos) /*!< 0x00000001 */
#define DAC_CR_EN1           DAC_CR_EN1_Msk            /*!<DAC channel1 enable */
#define DAC_CR_TEN1_Pos      (1U)
#define DAC_CR_TEN1_Msk      (0x1UL << DAC_CR_TEN1_Pos) /*!< 0x00000002 */
#define DAC_CR_TEN1          DAC_CR_TEN1_Msk            /*!<DAC channel1 Trigger enable */

#define DAC_CR_TSEL1_Pos     (2U)
#define DAC_CR_TSEL1_Msk     (0xFUL << DAC_CR_TSEL1_Pos) /*!< 0x0000003C */
#define DAC_CR_TSEL1         DAC_CR_TSEL1_Msk            /*!<TSEL1[2:0] (DAC channel1 Trigger selection) */
#define DAC_CR_TSEL1_0       (0x1UL << DAC_CR_TSEL1_Pos) /*!< 0x00000004 */
#define DAC_CR_TSEL1_1       (0x2UL << DAC_CR_TSEL1_Pos) /*!< 0x00000008 */
#define DAC_CR_TSEL1_2       (0x4UL << DAC_CR_TSEL1_Pos) /*!< 0x00000010 */
#define DAC_CR_TSEL1_3       (0x8UL << DAC_CR_TSEL1_Pos) /*!< 0x00000020 */

#define DAC_CR_WAVE1_Pos     (6U)
#define DAC_CR_WAVE1_Msk     (0x3UL << DAC_CR_WAVE1_Pos) /*!< 0x000000C0 */
#define DAC_CR_WAVE1         DAC_CR_WAVE1_Msk /*!<WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable) */
#define DAC_CR_WAVE1_0       (0x1UL << DAC_CR_WAVE1_Pos) /*!< 0x00000040 */
#define DAC_CR_WAVE1_1       (0x2UL << DAC_CR_WAVE1_Pos) /*!< 0x00000080 */

#define DAC_CR_MAMP1_Pos     (8U)
#define DAC_CR_MAMP1_Msk     (0xFUL << DAC_CR_MAMP1_Pos) /*!< 0x00000F00 */
#define DAC_CR_MAMP1         DAC_CR_MAMP1_Msk            /*!<MAMP1[3:0] (DAC channel1 Mask/Amplitude selector) */
#define DAC_CR_MAMP1_0       (0x1UL << DAC_CR_MAMP1_Pos) /*!< 0x00000100 */
#define DAC_CR_MAMP1_1       (0x2UL << DAC_CR_MAMP1_Pos) /*!< 0x00000200 */
#define DAC_CR_MAMP1_2       (0x4UL << DAC_CR_MAMP1_Pos) /*!< 0x00000400 */
#define DAC_CR_MAMP1_3       (0x8UL << DAC_CR_MAMP1_Pos) /*!< 0x00000800 */

#define DAC_CR_DMAEN1_Pos    (12U)
#define DAC_CR_DMAEN1_Msk    (0x1UL << DAC_CR_DMAEN1_Pos) /*!< 0x00001000 */
#define DAC_CR_DMAEN1        DAC_CR_DMAEN1_Msk            /*!<DAC channel1 DMA enable */
#define DAC_CR_DMAUDRIE1_Pos (13U)
#define DAC_CR_DMAUDRIE1_Msk (0x1UL << DAC_CR_DMAUDRIE1_Pos) /*!< 0x00002000 */
#define DAC_CR_DMAUDRIE1     DAC_CR_DMAUDRIE1_Msk            /*!<DAC channel 1 DMA underrun interrupt enable  >*/
#define DAC_CR_CEN1_Pos      (14U)
#define DAC_CR_CEN1_Msk      (0x1UL << DAC_CR_CEN1_Pos) /*!< 0x00004000 */
#define DAC_CR_CEN1          DAC_CR_CEN1_Msk            /*!<DAC channel 1 calibration enable >*/

