Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/******************  Bit definition for DFSDM_FLTRDATAR register *****************/
#define DFSDM_FLTRDATAR_RDATA_Pos   (8U)
#define DFSDM_FLTRDATAR_RDATA_Msk   (0xFFFFFFUL << DFSDM_FLTRDATAR_RDATA_Pos) /*!< 0xFFFFFF00 */
#define DFSDM_FLTRDATAR_RDATA       DFSDM_FLTRDATAR_RDATA_Msk /*!< RDATA[23:0] Regular channel conversion data */
#define DFSDM_FLTRDATAR_RPEND_Pos   (4U)
#define DFSDM_FLTRDATAR_RPEND_Msk   (0x1UL << DFSDM_FLTRDATAR_RPEND_Pos) /*!< 0x00000010 */
#define DFSDM_FLTRDATAR_RPEND       DFSDM_FLTRDATAR_RPEND_Msk            /*!< RPEND Regular channel pending data */
#define DFSDM_FLTRDATAR_RDATACH_Pos (0U)
#define DFSDM_FLTRDATAR_RDATACH_Msk (0x7UL << DFSDM_FLTRDATAR_RDATACH_Pos) /*!< 0x00000007 */
#define DFSDM_FLTRDATAR_RDATACH     DFSDM_FLTRDATAR_RDATACH_Msk /*!< RDATACH[2:0] Regular channel most recently converted */

/******************  Bit definition for DFSDM_FLTAWHTR register ******************/
#define DFSDM_FLTAWHTR_AWHT_Pos  (8U)
#define DFSDM_FLTAWHTR_AWHT_Msk  (0xFFFFFFUL << DFSDM_FLTAWHTR_AWHT_Pos) /*!< 0xFFFFFF00 */
#define DFSDM_FLTAWHTR_AWHT      DFSDM_FLTAWHTR_AWHT_Msk /*!< AWHT[23:0] Analog watchdog high threshold */
#define DFSDM_FLTAWHTR_BKAWH_Pos (0U)
#define DFSDM_FLTAWHTR_BKAWH_Msk (0xFUL << DFSDM_FLTAWHTR_BKAWH_Pos) /*!< 0x0000000F */
#define DFSDM_FLTAWHTR_BKAWH                                                                                           \
  DFSDM_FLTAWHTR_BKAWH_Msk /*!< BKAWH[3:0] Break signal assignment to analog watchdog high threshold event */

/******************  Bit definition for DFSDM_FLTAWLTR register ******************/
#define DFSDM_FLTAWLTR_AWLT_Pos  (8U)
#define DFSDM_FLTAWLTR_AWLT_Msk  (0xFFFFFFUL << DFSDM_FLTAWLTR_AWLT_Pos) /*!< 0xFFFFFF00 */
#define DFSDM_FLTAWLTR_AWLT      DFSDM_FLTAWLTR_AWLT_Msk /*!< AWHT[23:0] Analog watchdog low threshold */
#define DFSDM_FLTAWLTR_BKAWL_Pos (0U)
#define DFSDM_FLTAWLTR_BKAWL_Msk (0xFUL << DFSDM_FLTAWLTR_BKAWL_Pos) /*!< 0x0000000F */
#define DFSDM_FLTAWLTR_BKAWL                                                                                           \
  DFSDM_FLTAWLTR_BKAWL_Msk /*!< BKAWL[3:0] Break signal assignment to analog watchdog low threshold event */

/******************  Bit definition for DFSDM_FLTAWSR register ******************/
#define DFSDM_FLTAWSR_AWHTF_Pos (8U)
#define DFSDM_FLTAWSR_AWHTF_Msk (0xFFUL << DFSDM_FLTAWSR_AWHTF_Pos) /*!< 0x0000FF00 */
#define DFSDM_FLTAWSR_AWHTF                                                                                            \
  DFSDM_FLTAWSR_AWHTF_Msk /*!< AWHTF[15:8] Analog watchdog high threshold error on given channels */
#define DFSDM_FLTAWSR_AWLTF_Pos (0U)
#define DFSDM_FLTAWSR_AWLTF_Msk (0xFFUL << DFSDM_FLTAWSR_AWLTF_Pos) /*!< 0x000000FF */
#define DFSDM_FLTAWSR_AWLTF                                                                                            \
  DFSDM_FLTAWSR_AWLTF_Msk /*!< AWLTF[7:0] Analog watchdog low threshold error on given channels */

/******************  Bit definition for DFSDM_FLTAWCFR) register *****************/
#define DFSDM_FLTAWCFR_CLRAWHTF_Pos (8U)
#define DFSDM_FLTAWCFR_CLRAWHTF_Msk (0xFFUL << DFSDM_FLTAWCFR_CLRAWHTF_Pos) /*!< 0x0000FF00 */
#define DFSDM_FLTAWCFR_CLRAWHTF                                                                                        \
  DFSDM_FLTAWCFR_CLRAWHTF_Msk /*!< CLRAWHTF[15:8] Clear the Analog watchdog high threshold flag */
#define DFSDM_FLTAWCFR_CLRAWLTF_Pos (0U)
#define DFSDM_FLTAWCFR_CLRAWLTF_Msk (0xFFUL << DFSDM_FLTAWCFR_CLRAWLTF_Pos) /*!< 0x000000FF */
#define DFSDM_FLTAWCFR_CLRAWLTF                                                                                        \
  DFSDM_FLTAWCFR_CLRAWLTF_Msk /*!< CLRAWLTF[7:0] Clear the Analog watchdog low threshold flag */

/******************  Bit definition for DFSDM_FLTEXMAX register ******************/
#define DFSDM_FLTEXMAX_EXMAX_Pos   (8U)
#define DFSDM_FLTEXMAX_EXMAX_Msk   (0xFFFFFFUL << DFSDM_FLTEXMAX_EXMAX_Pos) /*!< 0xFFFFFF00 */
#define DFSDM_FLTEXMAX_EXMAX       DFSDM_FLTEXMAX_EXMAX_Msk /*!< EXMAX[23:0] Extreme detector maximum value */
#define DFSDM_FLTEXMAX_EXMAXCH_Pos (0U)
#define DFSDM_FLTEXMAX_EXMAXCH_Msk (0x7UL << DFSDM_FLTEXMAX_EXMAXCH_Pos) /*!< 0x00000007 */
#define DFSDM_FLTEXMAX_EXMAXCH     DFSDM_FLTEXMAX_EXMAXCH_Msk /*!< EXMAXCH[2:0] Extreme detector maximum data channel */

/******************  Bit definition for DFSDM_FLTEXMIN register ******************/
#define DFSDM_FLTEXMIN_EXMIN_Pos   (8U)
#define DFSDM_FLTEXMIN_EXMIN_Msk   (0xFFFFFFUL << DFSDM_FLTEXMIN_EXMIN_Pos) /*!< 0xFFFFFF00 */
#define DFSDM_FLTEXMIN_EXMIN       DFSDM_FLTEXMIN_EXMIN_Msk /*!< EXMIN[23:0] Extreme detector minimum value */
#define DFSDM_FLTEXMIN_EXMINCH_Pos (0U)
#define DFSDM_FLTEXMIN_EXMINCH_Msk (0x7UL << DFSDM_FLTEXMIN_EXMINCH_Pos) /*!< 0x00000007 */
#define DFSDM_FLTEXMIN_EXMINCH     DFSDM_FLTEXMIN_EXMINCH_Msk /*!< EXMINCH[2:0] Extreme detector minimum data channel */

/******************  Bit definition for DFSDM_FLTCNVTIMR register ******************/
#define DFSDM_FLTCNVTIMR_CNVCNT_Pos (4U)
#define DFSDM_FLTCNVTIMR_CNVCNT_Msk (0xFFFFFFFUL << DFSDM_FLTCNVTIMR_CNVCNT_Pos) /*!< 0xFFFFFFF0 */
#define DFSDM_FLTCNVTIMR_CNVCNT     DFSDM_FLTCNVTIMR_CNVCNT_Msk /*!< CNVCNT[27:0]: 28-bit timer counting conversion time */

/******************************************************************************/
/*                                                                            */
/*                           BDMA Controller                                  */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for BDMA_ISR register  ********************/
#define BDMA_ISR_GIF0_Pos  (0U)
#define BDMA_ISR_GIF0_Msk  (0x1UL << BDMA_ISR_GIF0_Pos) /*!< 0x00000001 */
#define BDMA_ISR_GIF0      BDMA_ISR_GIF0_Msk            /*!< Channel 0 Global interrupt flag */
#define BDMA_ISR_TCIF0_Pos (1U)
#define BDMA_ISR_TCIF0_Msk (0x1UL << BDMA_ISR_TCIF0_Pos) /*!< 0x00000002 */
#define BDMA_ISR_TCIF0     BDMA_ISR_TCIF0_Msk            /*!< Channel 0 Transfer Complete flag */
#define BDMA_ISR_HTIF0_Pos (2U)
#define BDMA_ISR_HTIF0_Msk (0x1UL << BDMA_ISR_HTIF0_Pos) /*!< 0x00000004 */
#define BDMA_ISR_HTIF0     BDMA_ISR_HTIF0_Msk            /*!< Channel 0 Half Transfer flag */
#define BDMA_ISR_TEIF0_Pos (3U)
#define BDMA_ISR_TEIF0_Msk (0x1UL << BDMA_ISR_TEIF0_Pos) /*!< 0x00000008 */
#define BDMA_ISR_TEIF0     BDMA_ISR_TEIF0_Msk            /*!< Channel 0 Transfer Error flag */
#define BDMA_ISR_GIF1_Pos  (4U)
#define BDMA_ISR_GIF1_Msk  (0x1UL << BDMA_ISR_GIF1_Pos) /*!< 0x00000010 */
#define BDMA_ISR_GIF1      BDMA_ISR_GIF1_Msk            /*!< Channel 1 Global interrupt flag */
#define BDMA_ISR_TCIF1_Pos (5U)
#define BDMA_ISR_TCIF1_Msk (0x1UL << BDMA_ISR_TCIF1_Pos) /*!< 0x00000020 */
#define BDMA_ISR_TCIF1     BDMA_ISR_TCIF1_Msk            /*!< Channel 1 Transfer Complete flag */
#define BDMA_ISR_HTIF1_Pos (6U)
#define BDMA_ISR_HTIF1_Msk (0x1UL << BDMA_ISR_HTIF1_Pos) /*!< 0x00000040 */
#define BDMA_ISR_HTIF1     BDMA_ISR_HTIF1_Msk            /*!< Channel 1 Half Transfer flag */
#define BDMA_ISR_TEIF1_Pos (7U)
#define BDMA_ISR_TEIF1_Msk (0x1UL << BDMA_ISR_TEIF1_Pos) /*!< 0x00000080 */
#define BDMA_ISR_TEIF1     BDMA_ISR_TEIF1_Msk            /*!< Channel 1 Transfer Error flag */
#define BDMA_ISR_GIF2_Pos  (8U)
#define BDMA_ISR_GIF2_Msk  (0x1UL << BDMA_ISR_GIF2_Pos) /*!< 0x00000100 */
#define BDMA_ISR_GIF2      BDMA_ISR_GIF2_Msk            /*!< Channel 2 Global interrupt flag */
#define BDMA_ISR_TCIF2_Pos (9U)
#define BDMA_ISR_TCIF2_Msk (0x1UL << BDMA_ISR_TCIF2_Pos) /*!< 0x00000200 */
#define BDMA_ISR_TCIF2     BDMA_ISR_TCIF2_Msk            /*!< Channel 2 Transfer Complete flag */
#define BDMA_ISR_HTIF2_Pos (10U)
#define BDMA_ISR_HTIF2_Msk (0x1UL << BDMA_ISR_HTIF2_Pos) /*!< 0x00000400 */
#define BDMA_ISR_HTIF2     BDMA_ISR_HTIF2_Msk            /*!< Channel 2 Half Transfer flag */
#define BDMA_ISR_TEIF2_Pos (11U)
#define BDMA_ISR_TEIF2_Msk (0x1UL << BDMA_ISR_TEIF2_Pos) /*!< 0x00000800 */
#define BDMA_ISR_TEIF2     BDMA_ISR_TEIF2_Msk            /*!< Channel 2 Transfer Error flag */
#define BDMA_ISR_GIF3_Pos  (12U)
#define BDMA_ISR_GIF3_Msk  (0x1UL << BDMA_ISR_GIF3_Pos) /*!< 0x00001000 */
#define BDMA_ISR_GIF3      BDMA_ISR_GIF3_Msk            /*!< Channel 3 Global interrupt flag */
#define BDMA_ISR_TCIF3_Pos (13U)
#define BDMA_ISR_TCIF3_Msk (0x1UL << BDMA_ISR_TCIF3_Pos) /*!< 0x00002000 */
#define BDMA_ISR_TCIF3     BDMA_ISR_TCIF3_Msk            /*!< Channel 3 Transfer Complete flag */
#define BDMA_ISR_HTIF3_Pos (14U)
#define BDMA_ISR_HTIF3_Msk (0x1UL << BDMA_ISR_HTIF3_Pos) /*!< 0x00004000 */
#define BDMA_ISR_HTIF3     BDMA_ISR_HTIF3_Msk            /*!< Channel 3 Half Transfer flag */
#define BDMA_ISR_TEIF3_Pos (15U)
#define BDMA_ISR_TEIF3_Msk (0x1UL << BDMA_ISR_TEIF3_Pos) /*!< 0x00008000 */
#define BDMA_ISR_TEIF3     BDMA_ISR_TEIF3_Msk            /*!< Channel 3 Transfer Error flag */
#define BDMA_ISR_GIF4_Pos  (16U)
#define BDMA_ISR_GIF4_Msk  (0x1UL << BDMA_ISR_GIF4_Pos) /*!< 0x00010000 */
#define BDMA_ISR_GIF4      BDMA_ISR_GIF4_Msk            /*!< Channel 4 Global interrupt flag */
#define BDMA_ISR_TCIF4_Pos (17U)
#define BDMA_ISR_TCIF4_Msk (0x1UL << BDMA_ISR_TCIF4_Pos) /*!< 0x00020000 */
#define BDMA_ISR_TCIF4     BDMA_ISR_TCIF4_Msk            /*!< Channel 4 Transfer Complete flag */
#define BDMA_ISR_HTIF4_Pos (18U)
#define BDMA_ISR_HTIF4_Msk (0x1UL << BDMA_ISR_HTIF4_Pos) /*!< 0x00040000 */
#define BDMA_ISR_HTIF4     BDMA_ISR_HTIF4_Msk            /*!< Channel 4 Half Transfer flag */
#define BDMA_ISR_TEIF4_Pos (19U)
#define BDMA_ISR_TEIF4_Msk (0x1UL << BDMA_ISR_TEIF4_Pos) /*!< 0x00080000 */
#define BDMA_ISR_TEIF4     BDMA_ISR_TEIF4_Msk            /*!< Channel 4 Transfer Error flag */
#define BDMA_ISR_GIF5_Pos  (20U)
#define BDMA_ISR_GIF5_Msk  (0x1UL << BDMA_ISR_GIF5_Pos) /*!< 0x00100000 */
#define BDMA_ISR_GIF5      BDMA_ISR_GIF5_Msk            /*!< Channel 5 Global interrupt flag */
#define BDMA_ISR_TCIF5_Pos (21U)
#define BDMA_ISR_TCIF5_Msk (0x1UL << BDMA_ISR_TCIF5_Pos) /*!< 0x00200000 */
#define BDMA_ISR_TCIF5     BDMA_ISR_TCIF5_Msk            /*!< Channel 5 Transfer Complete flag */
#define BDMA_ISR_HTIF5_Pos (22U)
#define BDMA_ISR_HTIF5_Msk (0x1UL << BDMA_ISR_HTIF5_Pos) /*!< 0x00400000 */
#define BDMA_ISR_HTIF5     BDMA_ISR_HTIF5_Msk            /*!< Channel 5 Half Transfer flag */
#define BDMA_ISR_TEIF5_Pos (23U)
#define BDMA_ISR_TEIF5_Msk (0x1UL << BDMA_ISR_TEIF5_Pos) /*!< 0x00800000 */
#define BDMA_ISR_TEIF5     BDMA_ISR_TEIF5_Msk            /*!< Channel 5 Transfer Error flag */
#define BDMA_ISR_GIF6_Pos  (24U)
#define BDMA_ISR_GIF6_Msk  (0x1UL << BDMA_ISR_GIF6_Pos) /*!< 0x01000000 */
#define BDMA_ISR_GIF6      BDMA_ISR_GIF6_Msk            /*!< Channel 6 Global interrupt flag */
#define BDMA_ISR_TCIF6_Pos (25U)
#define BDMA_ISR_TCIF6_Msk (0x1UL << BDMA_ISR_TCIF6_Pos) /*!< 0x02000000 */
#define BDMA_ISR_TCIF6     BDMA_ISR_TCIF6_Msk            /*!< Channel 6 Transfer Complete flag */
#define BDMA_ISR_HTIF6_Pos (26U)
#define BDMA_ISR_HTIF6_Msk (0x1UL << BDMA_ISR_HTIF6_Pos) /*!< 0x04000000 */
#define BDMA_ISR_HTIF6     BDMA_ISR_HTIF6_Msk            /*!< Channel 6 Half Transfer flag */
#define BDMA_ISR_TEIF6_Pos (27U)
#define BDMA_ISR_TEIF6_Msk (0x1UL << BDMA_ISR_TEIF6_Pos) /*!< 0x08000000 */
#define BDMA_ISR_TEIF6     BDMA_ISR_TEIF6_Msk            /*!< Channel 6 Transfer Error flag */
#define BDMA_ISR_GIF7_Pos  (28U)
#define BDMA_ISR_GIF7_Msk  (0x1UL << BDMA_ISR_GIF7_Pos) /*!< 0x10000000 */
#define BDMA_ISR_GIF7      BDMA_ISR_GIF7_Msk            /*!< Channel 7 Global interrupt flag */
#define BDMA_ISR_TCIF7_Pos (29U)
#define BDMA_ISR_TCIF7_Msk (0x1UL << BDMA_ISR_TCIF7_Pos) /*!< 0x20000000 */
#define BDMA_ISR_TCIF7     BDMA_ISR_TCIF7_Msk            /*!< Channel 7 Transfer Complete flag */
#define BDMA_ISR_HTIF7_Pos (30U)
#define BDMA_ISR_HTIF7_Msk (0x1UL << BDMA_ISR_HTIF7_Pos) /*!< 0x40000000 */
#define BDMA_ISR_HTIF7     BDMA_ISR_HTIF7_Msk            /*!< Channel 7 Half Transfer flag */
#define BDMA_ISR_TEIF7_Pos (31U)
#define BDMA_ISR_TEIF7_Msk (0x1UL << BDMA_ISR_TEIF7_Pos) /*!< 0x80000000 */
#define BDMA_ISR_TEIF7     BDMA_ISR_TEIF7_Msk            /*!< Channel 7 Transfer Error flag */

/*******************  Bit definition for BDMA_IFCR register  *******************/
#define BDMA_IFCR_CGIF0_Pos  (0U)
#define BDMA_IFCR_CGIF0_Msk  (0x1UL << BDMA_IFCR_CGIF0_Pos) /*!< 0x00000001 */
#define BDMA_IFCR_CGIF0      BDMA_IFCR_CGIF0_Msk            /*!< Channel 0 Global interrupt clearr */
#define BDMA_IFCR_CTCIF0_Pos (1U)
#define BDMA_IFCR_CTCIF0_Msk (0x1UL << BDMA_IFCR_CTCIF0_Pos) /*!< 0x00000002 */
#define BDMA_IFCR_CTCIF0     BDMA_IFCR_CTCIF0_Msk            /*!< Channel 0 Transfer Complete clear */
#define BDMA_IFCR_CHTIF0_Pos (2U)
#define BDMA_IFCR_CHTIF0_Msk (0x1UL << BDMA_IFCR_CHTIF0_Pos) /*!< 0x00000004 */
#define BDMA_IFCR_CHTIF0     BDMA_IFCR_CHTIF0_Msk            /*!< Channel 0 Half Transfer clear */
#define BDMA_IFCR_CTEIF0_Pos (3U)
#define BDMA_IFCR_CTEIF0_Msk (0x1UL << BDMA_IFCR_CTEIF0_Pos) /*!< 0x00000008 */
#define BDMA_IFCR_CTEIF0     BDMA_IFCR_CTEIF0_Msk            /*!< Channel 0 Transfer Error clear */
#define BDMA_IFCR_CGIF1_Pos  (4U)
#define BDMA_IFCR_CGIF1_Msk  (0x1UL << BDMA_IFCR_CGIF1_Pos) /*!< 0x00000010 */
#define BDMA_IFCR_CGIF1      BDMA_IFCR_CGIF1_Msk            /*!< Channel 1 Global interrupt clear */
#define BDMA_IFCR_CTCIF1_Pos (5U)
#define BDMA_IFCR_CTCIF1_Msk (0x1UL << BDMA_IFCR_CTCIF1_Pos) /*!< 0x00000020 */
#define BDMA_IFCR_CTCIF1     BDMA_IFCR_CTCIF1_Msk            /*!< Channel 1 Transfer Complete clear */
#define BDMA_IFCR_CHTIF1_Pos (6U)
#define BDMA_IFCR_CHTIF1_Msk (0x1UL << BDMA_IFCR_CHTIF1_Pos) /*!< 0x00000040 */
#define BDMA_IFCR_CHTIF1     BDMA_IFCR_CHTIF1_Msk            /*!< Channel 1 Half Transfer clear */
#define BDMA_IFCR_CTEIF1_Pos (7U)
#define BDMA_IFCR_CTEIF1_Msk (0x1UL << BDMA_IFCR_CTEIF1_Pos) /*!< 0x00000080 */
#define BDMA_IFCR_CTEIF1     BDMA_IFCR_CTEIF1_Msk            /*!< Channel 1 Transfer Error clear */
#define BDMA_IFCR_CGIF2_Pos  (8U)
#define BDMA_IFCR_CGIF2_Msk  (0x1UL << BDMA_IFCR_CGIF2_Pos) /*!< 0x00000100 */
#define BDMA_IFCR_CGIF2      BDMA_IFCR_CGIF2_Msk            /*!< Channel 2 Global interrupt clear */
#define BDMA_IFCR_CTCIF2_Pos (9U)
#define BDMA_IFCR_CTCIF2_Msk (0x1UL << BDMA_IFCR_CTCIF2_Pos) /*!< 0x00000200 */
#define BDMA_IFCR_CTCIF2     BDMA_IFCR_CTCIF2_Msk            /*!< Channel 2 Transfer Complete clear */
#define BDMA_IFCR_CHTIF2_Pos (10U)
#define BDMA_IFCR_CHTIF2_Msk (0x1UL << BDMA_IFCR_CHTIF2_Pos) /*!< 0x00000400 */
#define BDMA_IFCR_CHTIF2     BDMA_IFCR_CHTIF2_Msk            /*!< Channel 2 Half Transfer clear */
#define BDMA_IFCR_CTEIF2_Pos (11U)
#define BDMA_IFCR_CTEIF2_Msk (0x1UL << BDMA_IFCR_CTEIF2_Pos) /*!< 0x00000800 */
#define BDMA_IFCR_CTEIF2     BDMA_IFCR_CTEIF2_Msk            /*!< Channel 2 Transfer Error clear */
#define BDMA_IFCR_CGIF3_Pos  (12U)
#define BDMA_IFCR_CGIF3_Msk  (0x1UL << BDMA_IFCR_CGIF3_Pos) /*!< 0x00001000 */
#define BDMA_IFCR_CGIF3      BDMA_IFCR_CGIF3_Msk            /*!< Channel 3 Global interrupt clear */
#define BDMA_IFCR_CTCIF3_Pos (13U)
#define BDMA_IFCR_CTCIF3_Msk (0x1UL << BDMA_IFCR_CTCIF3_Pos) /*!< 0x00002000 */
#define BDMA_IFCR_CTCIF3     BDMA_IFCR_CTCIF3_Msk            /*!< Channel 3 Transfer Complete clear */
#define BDMA_IFCR_CHTIF3_Pos (14U)
#define BDMA_IFCR_CHTIF3_Msk (0x1UL << BDMA_IFCR_CHTIF3_Pos) /*!< 0x00004000 */
#define BDMA_IFCR_CHTIF3     BDMA_IFCR_CHTIF3_Msk            /*!< Channel 3 Half Transfer clear */
#define BDMA_IFCR_CTEIF3_Pos (15U)
#define BDMA_IFCR_CTEIF3_Msk (0x1UL << BDMA_IFCR_CTEIF3_Pos) /*!< 0x00008000 */
#define BDMA_IFCR_CTEIF3     BDMA_IFCR_CTEIF3_Msk            /*!< Channel 3 Transfer Error clear */
#define BDMA_IFCR_CGIF4_Pos  (16U)
#define BDMA_IFCR_CGIF4_Msk  (0x1UL << BDMA_IFCR_CGIF4_Pos) /*!< 0x00010000 */
#define BDMA_IFCR_CGIF4      BDMA_IFCR_CGIF4_Msk            /*!< Channel 4 Global interrupt clear */
#define BDMA_IFCR_CTCIF4_Pos (17U)
#define BDMA_IFCR_CTCIF4_Msk (0x1UL << BDMA_IFCR_CTCIF4_Pos) /*!< 0x00020000 */
#define BDMA_IFCR_CTCIF4     BDMA_IFCR_CTCIF4_Msk            /*!< Channel 4 Transfer Complete clear */
#define BDMA_IFCR_CHTIF4_Pos (18U)
#define BDMA_IFCR_CHTIF4_Msk (0x1UL << BDMA_IFCR_CHTIF4_Pos) /*!< 0x00040000 */
#define BDMA_IFCR_CHTIF4     BDMA_IFCR_CHTIF4_Msk            /*!< Channel 4 Half Transfer clear */
#define BDMA_IFCR_CTEIF4_Pos (19U)
#define BDMA_IFCR_CTEIF4_Msk (0x1UL << BDMA_IFCR_CTEIF4_Pos) /*!< 0x00080000 */
#define BDMA_IFCR_CTEIF4     BDMA_IFCR_CTEIF4_Msk            /*!< Channel 4 Transfer Error clear */
#define BDMA_IFCR_CGIF5_Pos  (20U)
#define BDMA_IFCR_CGIF5_Msk  (0x1UL << BDMA_IFCR_CGIF5_Pos) /*!< 0x00100000 */
#define BDMA_IFCR_CGIF5      BDMA_IFCR_CGIF5_Msk            /*!< Channel 5 Global interrupt clear */
#define BDMA_IFCR_CTCIF5_Pos (21U)
#define BDMA_IFCR_CTCIF5_Msk (0x1UL << BDMA_IFCR_CTCIF5_Pos) /*!< 0x00200000 */
#define BDMA_IFCR_CTCIF5     BDMA_IFCR_CTCIF5_Msk            /*!< Channel 5 Transfer Complete clear */
#define BDMA_IFCR_CHTIF5_Pos (22U)
#define BDMA_IFCR_CHTIF5_Msk (0x1UL << BDMA_IFCR_CHTIF5_Pos) /*!< 0x00400000 */
#define BDMA_IFCR_CHTIF5     BDMA_IFCR_CHTIF5_Msk            /*!< Channel 5 Half Transfer clear */
#define BDMA_IFCR_CTEIF5_Pos (23U)
#define BDMA_IFCR_CTEIF5_Msk (0x1UL << BDMA_IFCR_CTEIF5_Pos) /*!< 0x00800000 */
#define BDMA_IFCR_CTEIF5     BDMA_IFCR_CTEIF5_Msk            /*!< Channel 5 Transfer Error clear */
#define BDMA_IFCR_CGIF6_Pos  (24U)
#define BDMA_IFCR_CGIF6_Msk  (0x1UL << BDMA_IFCR_CGIF6_Pos) /*!< 0x01000000 */
#define BDMA_IFCR_CGIF6      BDMA_IFCR_CGIF6_Msk            /*!< Channel 6 Global interrupt clear */
#define BDMA_IFCR_CTCIF6_Pos (25U)
#define BDMA_IFCR_CTCIF6_Msk (0x1UL << BDMA_IFCR_CTCIF6_Pos) /*!< 0x02000000 */
#define BDMA_IFCR_CTCIF6     BDMA_IFCR_CTCIF6_Msk            /*!< Channel 6 Transfer Complete clear */
#define BDMA_IFCR_CHTIF6_Pos (26U)
#define BDMA_IFCR_CHTIF6_Msk (0x1UL << BDMA_IFCR_CHTIF6_Pos) /*!< 0x04000000 */
#define BDMA_IFCR_CHTIF6     BDMA_IFCR_CHTIF6_Msk            /*!< Channel 6 Half Transfer clear */
#define BDMA_IFCR_CTEIF6_Pos (27U)
#define BDMA_IFCR_CTEIF6_Msk (0x1UL << BDMA_IFCR_CTEIF6_Pos) /*!< 0x08000000 */
#define BDMA_IFCR_CTEIF6     BDMA_IFCR_CTEIF6_Msk            /*!< Channel 6 Transfer Error clear */
#define BDMA_IFCR_CGIF7_Pos  (28U)
#define BDMA_IFCR_CGIF7_Msk  (0x1UL << BDMA_IFCR_CGIF7_Pos) /*!< 0x10000000 */
#define BDMA_IFCR_CGIF7      BDMA_IFCR_CGIF7_Msk            /*!< Channel 7 Global interrupt clear */
#define BDMA_IFCR_CTCIF7_Pos (29U)
#define BDMA_IFCR_CTCIF7_Msk (0x1UL << BDMA_IFCR_CTCIF7_Pos) /*!< 0x20000000 */
#define BDMA_IFCR_CTCIF7     BDMA_IFCR_CTCIF7_Msk            /*!< Channel 7 Transfer Complete clear */
#define BDMA_IFCR_CHTIF7_Pos (30U)
#define BDMA_IFCR_CHTIF7_Msk (0x1UL << BDMA_IFCR_CHTIF7_Pos) /*!< 0x40000000 */
#define BDMA_IFCR_CHTIF7     BDMA_IFCR_CHTIF7_Msk            /*!< Channel 7 Half Transfer clear */
#define BDMA_IFCR_CTEIF7_Pos (31U)
#define BDMA_IFCR_CTEIF7_Msk (0x1UL << BDMA_IFCR_CTEIF7_Pos) /*!< 0x80000000 */
#define BDMA_IFCR_CTEIF7     BDMA_IFCR_CTEIF7_Msk            /*!< Channel 7 Transfer Error clear */

/*******************  Bit definition for BDMA_CCR register  ********************/
#define BDMA_CCR_EN_Pos      (0U)
#define BDMA_CCR_EN_Msk      (0x1UL << BDMA_CCR_EN_Pos) /*!< 0x00000001 */
#define BDMA_CCR_EN          BDMA_CCR_EN_Msk            /*!< Channel enable                      */
#define BDMA_CCR_TCIE_Pos    (1U)
#define BDMA_CCR_TCIE_Msk    (0x1UL << BDMA_CCR_TCIE_Pos) /*!< 0x00000002 */
#define BDMA_CCR_TCIE        BDMA_CCR_TCIE_Msk            /*!< Transfer complete interrupt enable  */
#define BDMA_CCR_HTIE_Pos    (2U)
#define BDMA_CCR_HTIE_Msk    (0x1UL << BDMA_CCR_HTIE_Pos) /*!< 0x00000004 */
#define BDMA_CCR_HTIE        BDMA_CCR_HTIE_Msk            /*!< Half Transfer interrupt enable      */
#define BDMA_CCR_TEIE_Pos    (3U)
#define BDMA_CCR_TEIE_Msk    (0x1UL << BDMA_CCR_TEIE_Pos) /*!< 0x00000008 */
#define BDMA_CCR_TEIE        BDMA_CCR_TEIE_Msk            /*!< Transfer error interrupt enable     */
#define BDMA_CCR_DIR_Pos     (4U)
#define BDMA_CCR_DIR_Msk     (0x1UL << BDMA_CCR_DIR_Pos) /*!< 0x00000010 */
#define BDMA_CCR_DIR         BDMA_CCR_DIR_Msk            /*!< Data transfer direction             */
#define BDMA_CCR_CIRC_Pos    (5U)
#define BDMA_CCR_CIRC_Msk    (0x1UL << BDMA_CCR_CIRC_Pos) /*!< 0x00000020 */
#define BDMA_CCR_CIRC        BDMA_CCR_CIRC_Msk            /*!< Circular mode                       */
#define BDMA_CCR_PINC_Pos    (6U)
#define BDMA_CCR_PINC_Msk    (0x1UL << BDMA_CCR_PINC_Pos) /*!< 0x00000040 */
#define BDMA_CCR_PINC        BDMA_CCR_PINC_Msk            /*!< Peripheral increment mode           */
#define BDMA_CCR_MINC_Pos    (7U)
#define BDMA_CCR_MINC_Msk    (0x1UL << BDMA_CCR_MINC_Pos) /*!< 0x00000080 */
#define BDMA_CCR_MINC        BDMA_CCR_MINC_Msk            /*!< Memory increment mode               */

#define BDMA_CCR_PSIZE_Pos   (8U)
#define BDMA_CCR_PSIZE_Msk   (0x3UL << BDMA_CCR_PSIZE_Pos) /*!< 0x00000300 */
#define BDMA_CCR_PSIZE       BDMA_CCR_PSIZE_Msk            /*!< PSIZE[1:0] bits (Peripheral size)   */
#define BDMA_CCR_PSIZE_0     (0x1UL << BDMA_CCR_PSIZE_Pos) /*!< 0x00000100 */
#define BDMA_CCR_PSIZE_1     (0x2UL << BDMA_CCR_PSIZE_Pos) /*!< 0x00000200 */

