Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define BDMA_CCR_MSIZE_Pos   (10U)
#define BDMA_CCR_MSIZE_Msk   (0x3UL << BDMA_CCR_MSIZE_Pos) /*!< 0x00000C00 */
#define BDMA_CCR_MSIZE       BDMA_CCR_MSIZE_Msk            /*!< MSIZE[1:0] bits (Memory size)       */
#define BDMA_CCR_MSIZE_0     (0x1UL << BDMA_CCR_MSIZE_Pos) /*!< 0x00000400 */
#define BDMA_CCR_MSIZE_1     (0x2UL << BDMA_CCR_MSIZE_Pos) /*!< 0x00000800 */

#define BDMA_CCR_PL_Pos      (12U)
#define BDMA_CCR_PL_Msk      (0x3UL << BDMA_CCR_PL_Pos) /*!< 0x00003000 */
#define BDMA_CCR_PL          BDMA_CCR_PL_Msk            /*!< PL[1:0] bits(Channel Priority level)*/
#define BDMA_CCR_PL_0        (0x1UL << BDMA_CCR_PL_Pos) /*!< 0x00001000 */
#define BDMA_CCR_PL_1        (0x2UL << BDMA_CCR_PL_Pos) /*!< 0x00002000 */

#define BDMA_CCR_MEM2MEM_Pos (14U)
#define BDMA_CCR_MEM2MEM_Msk (0x1UL << BDMA_CCR_MEM2MEM_Pos) /*!< 0x00004000 */
#define BDMA_CCR_MEM2MEM     BDMA_CCR_MEM2MEM_Msk            /*!< Memory to memory mode               */
#define BDMA_CCR_DBM_Pos     (15U)
#define BDMA_CCR_DBM_Msk     (0x1UL << BDMA_CCR_DBM_Pos) /*!< 0x0000A000 */
#define BDMA_CCR_DBM         BDMA_CCR_DBM_Msk            /*!< Memory to memory mode               */
#define BDMA_CCR_CT_Pos      (16U)
#define BDMA_CCR_CT_Msk      (0x1UL << BDMA_CCR_CT_Pos) /*!< 0x00010000 */
#define BDMA_CCR_CT          BDMA_CCR_CT_Msk            /*!< Memory to memory mode               */

/******************  Bit definition for BDMA_CNDTR register  *******************/
#define BDMA_CNDTR_NDT_Pos (0U)
#define BDMA_CNDTR_NDT_Msk (0xFFFFUL << BDMA_CNDTR_NDT_Pos) /*!< 0x0000FFFF */
#define BDMA_CNDTR_NDT     BDMA_CNDTR_NDT_Msk               /*!< Number of data to Transfer          */

/******************  Bit definition for BDMA_CPAR register  ********************/
#define BDMA_CPAR_PA_Pos (0U)
#define BDMA_CPAR_PA_Msk (0xFFFFFFFFUL << BDMA_CPAR_PA_Pos) /*!< 0xFFFFFFFF */
#define BDMA_CPAR_PA     BDMA_CPAR_PA_Msk                   /*!< Peripheral Address                  */

/******************  Bit definition for BDMA_CM0AR register  ********************/
#define BDMA_CM0AR_MA_Pos (0U)
#define BDMA_CM0AR_MA_Msk (0xFFFFFFFFUL << BDMA_CM0AR_MA_Pos) /*!< 0xFFFFFFFF */
#define BDMA_CM0AR_MA     BDMA_CM0AR_MA_Msk                   /*!< Memory Address                      */

/******************  Bit definition for BDMA_CM1AR register  ********************/
#define BDMA_CM1AR_MA_Pos (0U)
#define BDMA_CM1AR_MA_Msk (0xFFFFFFFFUL << BDMA_CM1AR_MA_Pos) /*!< 0xFFFFFFFF */
#define BDMA_CM1AR_MA     BDMA_CM1AR_MA_Msk                   /*!< Memory Address                      */

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMA_SxCR register  *****************/
#define DMA_SxCR_MBURST_Pos (23U)
#define DMA_SxCR_MBURST_Msk (0x3UL << DMA_SxCR_MBURST_Pos) /*!< 0x01800000 */
#define DMA_SxCR_MBURST     DMA_SxCR_MBURST_Msk            /*!< Memory burst transfer configuration */
#define DMA_SxCR_MBURST_0   (0x1UL << DMA_SxCR_MBURST_Pos) /*!< 0x00800000 */
#define DMA_SxCR_MBURST_1   (0x2UL << DMA_SxCR_MBURST_Pos) /*!< 0x01000000 */
#define DMA_SxCR_PBURST_Pos (21U)
#define DMA_SxCR_PBURST_Msk (0x3UL << DMA_SxCR_PBURST_Pos) /*!< 0x00600000 */
#define DMA_SxCR_PBURST     DMA_SxCR_PBURST_Msk            /*!< Peripheral burst transfer configuration */
#define DMA_SxCR_PBURST_0   (0x1UL << DMA_SxCR_PBURST_Pos) /*!< 0x00200000 */
#define DMA_SxCR_PBURST_1   (0x2UL << DMA_SxCR_PBURST_Pos) /*!< 0x00400000 */
#define DMA_SxCR_TRBUFF_Pos (20U)
#define DMA_SxCR_TRBUFF_Msk (0x1UL << DMA_SxCR_TRBUFF_Pos) /*!< 0x00100000 */
#define DMA_SxCR_TRBUFF     DMA_SxCR_TRBUFF_Msk            /*!< bufferable transfers enabled/disable */
#define DMA_SxCR_CT_Pos     (19U)
#define DMA_SxCR_CT_Msk     (0x1UL << DMA_SxCR_CT_Pos) /*!< 0x00080000 */
#define DMA_SxCR_CT         DMA_SxCR_CT_Msk            /*!< Current target (only in double buffer mode) */
#define DMA_SxCR_DBM_Pos    (18U)
#define DMA_SxCR_DBM_Msk    (0x1UL << DMA_SxCR_DBM_Pos) /*!< 0x00040000 */
#define DMA_SxCR_DBM        DMA_SxCR_DBM_Msk            /*!< Double buffer mode */
#define DMA_SxCR_PL_Pos     (16U)
#define DMA_SxCR_PL_Msk     (0x3UL << DMA_SxCR_PL_Pos) /*!< 0x00030000 */
#define DMA_SxCR_PL         DMA_SxCR_PL_Msk            /*!< Priority level */
#define DMA_SxCR_PL_0       (0x1UL << DMA_SxCR_PL_Pos) /*!< 0x00010000 */
#define DMA_SxCR_PL_1       (0x2UL << DMA_SxCR_PL_Pos) /*!< 0x00020000 */
#define DMA_SxCR_PINCOS_Pos (15U)
#define DMA_SxCR_PINCOS_Msk (0x1UL << DMA_SxCR_PINCOS_Pos) /*!< 0x00008000 */
#define DMA_SxCR_PINCOS     DMA_SxCR_PINCOS_Msk            /*!< Peripheral increment offset size */
#define DMA_SxCR_MSIZE_Pos  (13U)
#define DMA_SxCR_MSIZE_Msk  (0x3UL << DMA_SxCR_MSIZE_Pos) /*!< 0x00006000 */
#define DMA_SxCR_MSIZE      DMA_SxCR_MSIZE_Msk            /*!< Memory data size */
#define DMA_SxCR_MSIZE_0    (0x1UL << DMA_SxCR_MSIZE_Pos) /*!< 0x00002000 */
#define DMA_SxCR_MSIZE_1    (0x2UL << DMA_SxCR_MSIZE_Pos) /*!< 0x00004000 */
#define DMA_SxCR_PSIZE_Pos  (11U)
#define DMA_SxCR_PSIZE_Msk  (0x3UL << DMA_SxCR_PSIZE_Pos) /*!< 0x00001800 */
#define DMA_SxCR_PSIZE      DMA_SxCR_PSIZE_Msk            /*< Peripheral data size */
#define DMA_SxCR_PSIZE_0    (0x1UL << DMA_SxCR_PSIZE_Pos) /*!< 0x00000800 */
#define DMA_SxCR_PSIZE_1    (0x2UL << DMA_SxCR_PSIZE_Pos) /*!< 0x00001000 */
#define DMA_SxCR_MINC_Pos   (10U)
#define DMA_SxCR_MINC_Msk   (0x1UL << DMA_SxCR_MINC_Pos) /*!< 0x00000400 */
#define DMA_SxCR_MINC       DMA_SxCR_MINC_Msk            /*!< Memory increment mode */
#define DMA_SxCR_PINC_Pos   (9U)
#define DMA_SxCR_PINC_Msk   (0x1UL << DMA_SxCR_PINC_Pos) /*!< 0x00000200 */
#define DMA_SxCR_PINC       DMA_SxCR_PINC_Msk            /*!< Peripheral increment mode */
#define DMA_SxCR_CIRC_Pos   (8U)
#define DMA_SxCR_CIRC_Msk   (0x1UL << DMA_SxCR_CIRC_Pos) /*!< 0x00000100 */
#define DMA_SxCR_CIRC       DMA_SxCR_CIRC_Msk            /*!< Circular mode */
#define DMA_SxCR_DIR_Pos    (6U)
#define DMA_SxCR_DIR_Msk    (0x3UL << DMA_SxCR_DIR_Pos) /*!< 0x000000C0 */
#define DMA_SxCR_DIR        DMA_SxCR_DIR_Msk            /*!< Data transfer direction */
#define DMA_SxCR_DIR_0      (0x1UL << DMA_SxCR_DIR_Pos) /*!< 0x00000040 */
#define DMA_SxCR_DIR_1      (0x2UL << DMA_SxCR_DIR_Pos) /*!< 0x00000080 */
#define DMA_SxCR_PFCTRL_Pos (5U)
#define DMA_SxCR_PFCTRL_Msk (0x1UL << DMA_SxCR_PFCTRL_Pos) /*!< 0x00000020 */
#define DMA_SxCR_PFCTRL     DMA_SxCR_PFCTRL_Msk            /*!< Peripheral flow controller */
#define DMA_SxCR_TCIE_Pos   (4U)
#define DMA_SxCR_TCIE_Msk   (0x1UL << DMA_SxCR_TCIE_Pos) /*!< 0x00000010 */
#define DMA_SxCR_TCIE       DMA_SxCR_TCIE_Msk            /*!< Transfer complete interrupt enable */
#define DMA_SxCR_HTIE_Pos   (3U)
#define DMA_SxCR_HTIE_Msk   (0x1UL << DMA_SxCR_HTIE_Pos) /*!< 0x00000008 */
#define DMA_SxCR_HTIE       DMA_SxCR_HTIE_Msk            /*!< Half transfer interrupt enable */
#define DMA_SxCR_TEIE_Pos   (2U)
#define DMA_SxCR_TEIE_Msk   (0x1UL << DMA_SxCR_TEIE_Pos) /*!< 0x00000004 */
#define DMA_SxCR_TEIE       DMA_SxCR_TEIE_Msk            /*!< Transfer error interrupt enable */
#define DMA_SxCR_DMEIE_Pos  (1U)
#define DMA_SxCR_DMEIE_Msk  (0x1UL << DMA_SxCR_DMEIE_Pos) /*!< 0x00000002 */
#define DMA_SxCR_DMEIE      DMA_SxCR_DMEIE_Msk            /*!< Direct mode error interrupt enable */
#define DMA_SxCR_EN_Pos     (0U)
#define DMA_SxCR_EN_Msk     (0x1UL << DMA_SxCR_EN_Pos) /*!< 0x00000001 */
#define DMA_SxCR_EN         DMA_SxCR_EN_Msk            /*!< Stream enable / flag stream ready when read low */

/********************  Bits definition for DMA_SxCNDTR register  **************/
#define DMA_SxNDT_Pos (0U)
#define DMA_SxNDT_Msk (0xFFFFUL << DMA_SxNDT_Pos) /*!< 0x0000FFFF */
#define DMA_SxNDT     DMA_SxNDT_Msk               /*!< Number of data items to transfer */
#define DMA_SxNDT_0   (0x0001UL << DMA_SxNDT_Pos) /*!< 0x00000001 */
#define DMA_SxNDT_1   (0x0002UL << DMA_SxNDT_Pos) /*!< 0x00000002 */
#define DMA_SxNDT_2   (0x0004UL << DMA_SxNDT_Pos) /*!< 0x00000004 */
#define DMA_SxNDT_3   (0x0008UL << DMA_SxNDT_Pos) /*!< 0x00000008 */
#define DMA_SxNDT_4   (0x0010UL << DMA_SxNDT_Pos) /*!< 0x00000010 */
#define DMA_SxNDT_5   (0x0020UL << DMA_SxNDT_Pos) /*!< 0x00000020 */
#define DMA_SxNDT_6   (0x0040UL << DMA_SxNDT_Pos) /*!< 0x00000040 */
#define DMA_SxNDT_7   (0x0080UL << DMA_SxNDT_Pos) /*!< 0x00000080 */
#define DMA_SxNDT_8   (0x0100UL << DMA_SxNDT_Pos) /*!< 0x00000100 */
#define DMA_SxNDT_9   (0x0200UL << DMA_SxNDT_Pos) /*!< 0x00000200 */
#define DMA_SxNDT_10  (0x0400UL << DMA_SxNDT_Pos) /*!< 0x00000400 */
#define DMA_SxNDT_11  (0x0800UL << DMA_SxNDT_Pos) /*!< 0x00000800 */
#define DMA_SxNDT_12  (0x1000UL << DMA_SxNDT_Pos) /*!< 0x00001000 */
#define DMA_SxNDT_13  (0x2000UL << DMA_SxNDT_Pos) /*!< 0x00002000 */
#define DMA_SxNDT_14  (0x4000UL << DMA_SxNDT_Pos) /*!< 0x00004000 */
#define DMA_SxNDT_15  (0x8000UL << DMA_SxNDT_Pos) /*!< 0x00008000 */

/********************  Bits definition for DMA_SxFCR register  ****************/
#define DMA_SxFCR_FEIE_Pos  (7U)
#define DMA_SxFCR_FEIE_Msk  (0x1UL << DMA_SxFCR_FEIE_Pos) /*!< 0x00000080 */
#define DMA_SxFCR_FEIE      DMA_SxFCR_FEIE_Msk            /*!< FIFO error interrupt enable */
#define DMA_SxFCR_FS_Pos    (3U)
#define DMA_SxFCR_FS_Msk    (0x7UL << DMA_SxFCR_FS_Pos) /*!< 0x00000038 */
#define DMA_SxFCR_FS        DMA_SxFCR_FS_Msk            /*!< FIFO status */
#define DMA_SxFCR_FS_0      (0x1UL << DMA_SxFCR_FS_Pos) /*!< 0x00000008 */
#define DMA_SxFCR_FS_1      (0x2UL << DMA_SxFCR_FS_Pos) /*!< 0x00000010 */
#define DMA_SxFCR_FS_2      (0x4UL << DMA_SxFCR_FS_Pos) /*!< 0x00000020 */
#define DMA_SxFCR_DMDIS_Pos (2U)
#define DMA_SxFCR_DMDIS_Msk (0x1UL << DMA_SxFCR_DMDIS_Pos) /*!< 0x00000004 */
#define DMA_SxFCR_DMDIS     DMA_SxFCR_DMDIS_Msk            /*!< Direct mode disable */
#define DMA_SxFCR_FTH_Pos   (0U)
#define DMA_SxFCR_FTH_Msk   (0x3UL << DMA_SxFCR_FTH_Pos) /*!< 0x00000003 */
#define DMA_SxFCR_FTH       DMA_SxFCR_FTH_Msk            /*!< FIFO threshold selection */
#define DMA_SxFCR_FTH_0     (0x1UL << DMA_SxFCR_FTH_Pos) /*!< 0x00000001 */
#define DMA_SxFCR_FTH_1     (0x2UL << DMA_SxFCR_FTH_Pos) /*!< 0x00000002 */

