Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bits definition for DMA_LISR register  *****************/
#define DMA_LISR_TCIF3_Pos  (27U)
#define DMA_LISR_TCIF3_Msk  (0x1UL << DMA_LISR_TCIF3_Pos) /*!< 0x08000000 */
#define DMA_LISR_TCIF3      DMA_LISR_TCIF3_Msk            /*!<  Stream 3 transfer complete interrupt flag */
#define DMA_LISR_HTIF3_Pos  (26U)
#define DMA_LISR_HTIF3_Msk  (0x1UL << DMA_LISR_HTIF3_Pos) /*!< 0x04000000 */
#define DMA_LISR_HTIF3      DMA_LISR_HTIF3_Msk            /*!<  Stream 3 half transfer interrupt flag */
#define DMA_LISR_TEIF3_Pos  (25U)
#define DMA_LISR_TEIF3_Msk  (0x1UL << DMA_LISR_TEIF3_Pos) /*!< 0x02000000 */
#define DMA_LISR_TEIF3      DMA_LISR_TEIF3_Msk            /*!<  Stream 3 transfer error interrupt flag */
#define DMA_LISR_DMEIF3_Pos (24U)
#define DMA_LISR_DMEIF3_Msk (0x1UL << DMA_LISR_DMEIF3_Pos) /*!< 0x01000000 */
#define DMA_LISR_DMEIF3     DMA_LISR_DMEIF3_Msk            /*!<  Stream 3 direct mode error interrupt flag */
#define DMA_LISR_FEIF3_Pos  (22U)
#define DMA_LISR_FEIF3_Msk  (0x1UL << DMA_LISR_FEIF3_Pos) /*!< 0x00400000 */
#define DMA_LISR_FEIF3      DMA_LISR_FEIF3_Msk            /*!<  Stream 3 FIFO error interrupt flag */
#define DMA_LISR_TCIF2_Pos  (21U)
#define DMA_LISR_TCIF2_Msk  (0x1UL << DMA_LISR_TCIF2_Pos) /*!< 0x00200000 */
#define DMA_LISR_TCIF2      DMA_LISR_TCIF2_Msk            /*!<  Stream 2 transfer complete interrupt flag */
#define DMA_LISR_HTIF2_Pos  (20U)
#define DMA_LISR_HTIF2_Msk  (0x1UL << DMA_LISR_HTIF2_Pos) /*!< 0x00100000 */
#define DMA_LISR_HTIF2      DMA_LISR_HTIF2_Msk            /*!<  Stream 2 half transfer interrupt flag */
#define DMA_LISR_TEIF2_Pos  (19U)
#define DMA_LISR_TEIF2_Msk  (0x1UL << DMA_LISR_TEIF2_Pos) /*!< 0x00080000 */
#define DMA_LISR_TEIF2      DMA_LISR_TEIF2_Msk            /*!<  Stream 2 transfer error interrupt flag */
#define DMA_LISR_DMEIF2_Pos (18U)
#define DMA_LISR_DMEIF2_Msk (0x1UL << DMA_LISR_DMEIF2_Pos) /*!< 0x00040000 */
#define DMA_LISR_DMEIF2     DMA_LISR_DMEIF2_Msk            /*!<  Stream 2 direct mode error interrupt flag */
#define DMA_LISR_FEIF2_Pos  (16U)
#define DMA_LISR_FEIF2_Msk  (0x1UL << DMA_LISR_FEIF2_Pos) /*!< 0x00010000 */
#define DMA_LISR_FEIF2      DMA_LISR_FEIF2_Msk            /*!<  Stream 2 FIFO error interrupt flag */
#define DMA_LISR_TCIF1_Pos  (11U)
#define DMA_LISR_TCIF1_Msk  (0x1UL << DMA_LISR_TCIF1_Pos) /*!< 0x00000800 */
#define DMA_LISR_TCIF1      DMA_LISR_TCIF1_Msk            /*!<  Stream 1 transfer complete interrupt flag */
#define DMA_LISR_HTIF1_Pos  (10U)
#define DMA_LISR_HTIF1_Msk  (0x1UL << DMA_LISR_HTIF1_Pos) /*!< 0x00000400 */
#define DMA_LISR_HTIF1      DMA_LISR_HTIF1_Msk            /*!<  Stream 1 half transfer interrupt flag */
#define DMA_LISR_TEIF1_Pos  (9U)
#define DMA_LISR_TEIF1_Msk  (0x1UL << DMA_LISR_TEIF1_Pos) /*!< 0x00000200 */
#define DMA_LISR_TEIF1      DMA_LISR_TEIF1_Msk            /*!<  Stream 1 transfer error interrupt flag */
#define DMA_LISR_DMEIF1_Pos (8U)
#define DMA_LISR_DMEIF1_Msk (0x1UL << DMA_LISR_DMEIF1_Pos) /*!< 0x00000100 */
#define DMA_LISR_DMEIF1     DMA_LISR_DMEIF1_Msk            /*!<  Stream 1 direct mode error interrupt flag */
#define DMA_LISR_FEIF1_Pos  (6U)
#define DMA_LISR_FEIF1_Msk  (0x1UL << DMA_LISR_FEIF1_Pos) /*!< 0x00000040 */
#define DMA_LISR_FEIF1      DMA_LISR_FEIF1_Msk            /*!<  Stream 1 FIFO error interrupt flag */
#define DMA_LISR_TCIF0_Pos  (5U)
#define DMA_LISR_TCIF0_Msk  (0x1UL << DMA_LISR_TCIF0_Pos) /*!< 0x00000020 */
#define DMA_LISR_TCIF0      DMA_LISR_TCIF0_Msk            /*!<  Stream 0 transfer complete interrupt flag */
#define DMA_LISR_HTIF0_Pos  (4U)
#define DMA_LISR_HTIF0_Msk  (0x1UL << DMA_LISR_HTIF0_Pos) /*!< 0x00000010 */
#define DMA_LISR_HTIF0      DMA_LISR_HTIF0_Msk            /*!<  Stream 0 half transfer interrupt flag */
#define DMA_LISR_TEIF0_Pos  (3U)
#define DMA_LISR_TEIF0_Msk  (0x1UL << DMA_LISR_TEIF0_Pos) /*!< 0x00000008 */
#define DMA_LISR_TEIF0      DMA_LISR_TEIF0_Msk            /*!<  Stream 0 transfer error interrupt flag */
#define DMA_LISR_DMEIF0_Pos (2U)
#define DMA_LISR_DMEIF0_Msk (0x1UL << DMA_LISR_DMEIF0_Pos) /*!< 0x00000004 */
#define DMA_LISR_DMEIF0     DMA_LISR_DMEIF0_Msk            /*!<  Stream 0 direct mode error interrupt flag */
#define DMA_LISR_FEIF0_Pos  (0U)
#define DMA_LISR_FEIF0_Msk  (0x1UL << DMA_LISR_FEIF0_Pos) /*!< 0x00000001 */
#define DMA_LISR_FEIF0      DMA_LISR_FEIF0_Msk            /*!<  Stream 0 FIFO error interrupt flag */

/********************  Bits definition for DMA_HISR register  *****************/
#define DMA_HISR_TCIF7_Pos  (27U)
#define DMA_HISR_TCIF7_Msk  (0x1UL << DMA_HISR_TCIF7_Pos) /*!< 0x08000000 */
#define DMA_HISR_TCIF7      DMA_HISR_TCIF7_Msk            /*!<  Stream 7 transfer complete interrupt flag */
#define DMA_HISR_HTIF7_Pos  (26U)
#define DMA_HISR_HTIF7_Msk  (0x1UL << DMA_HISR_HTIF7_Pos) /*!< 0x04000000 */
#define DMA_HISR_HTIF7      DMA_HISR_HTIF7_Msk            /*!<  Stream 7 half transfer interrupt flag */
#define DMA_HISR_TEIF7_Pos  (25U)
#define DMA_HISR_TEIF7_Msk  (0x1UL << DMA_HISR_TEIF7_Pos) /*!< 0x02000000 */
#define DMA_HISR_TEIF7      DMA_HISR_TEIF7_Msk            /*!<  Stream 7 transfer error interrupt flag */
#define DMA_HISR_DMEIF7_Pos (24U)
#define DMA_HISR_DMEIF7_Msk (0x1UL << DMA_HISR_DMEIF7_Pos) /*!< 0x01000000 */
#define DMA_HISR_DMEIF7     DMA_HISR_DMEIF7_Msk            /*!<  Stream 7 direct mode error interrupt flag */
#define DMA_HISR_FEIF7_Pos  (22U)
#define DMA_HISR_FEIF7_Msk  (0x1UL << DMA_HISR_FEIF7_Pos) /*!< 0x00400000 */
#define DMA_HISR_FEIF7      DMA_HISR_FEIF7_Msk            /*!<  Stream 7 FIFO error interrupt flag */
#define DMA_HISR_TCIF6_Pos  (21U)
#define DMA_HISR_TCIF6_Msk  (0x1UL << DMA_HISR_TCIF6_Pos) /*!< 0x00200000 */
#define DMA_HISR_TCIF6      DMA_HISR_TCIF6_Msk            /*!<  Stream 6 transfer complete interrupt flag */
#define DMA_HISR_HTIF6_Pos  (20U)
#define DMA_HISR_HTIF6_Msk  (0x1UL << DMA_HISR_HTIF6_Pos) /*!< 0x00100000 */
#define DMA_HISR_HTIF6      DMA_HISR_HTIF6_Msk            /*!<  Stream 6 half transfer interrupt flag */
#define DMA_HISR_TEIF6_Pos  (19U)
#define DMA_HISR_TEIF6_Msk  (0x1UL << DMA_HISR_TEIF6_Pos) /*!< 0x00080000 */
#define DMA_HISR_TEIF6      DMA_HISR_TEIF6_Msk            /*!<  Stream 6 transfer error interrupt flag */
#define DMA_HISR_DMEIF6_Pos (18U)
#define DMA_HISR_DMEIF6_Msk (0x1UL << DMA_HISR_DMEIF6_Pos) /*!< 0x00040000 */
#define DMA_HISR_DMEIF6     DMA_HISR_DMEIF6_Msk            /*!<  Stream 6 direct mode error interrupt flag */
#define DMA_HISR_FEIF6_Pos  (16U)
#define DMA_HISR_FEIF6_Msk  (0x1UL << DMA_HISR_FEIF6_Pos) /*!< 0x00010000 */
#define DMA_HISR_FEIF6      DMA_HISR_FEIF6_Msk            /*!<  Stream 6 FIFO error interrupt flag */
#define DMA_HISR_TCIF5_Pos  (11U)
#define DMA_HISR_TCIF5_Msk  (0x1UL << DMA_HISR_TCIF5_Pos) /*!< 0x00000800 */
#define DMA_HISR_TCIF5      DMA_HISR_TCIF5_Msk            /*!<  Stream 5 transfer complete interrupt flag */
#define DMA_HISR_HTIF5_Pos  (10U)
#define DMA_HISR_HTIF5_Msk  (0x1UL << DMA_HISR_HTIF5_Pos) /*!< 0x00000400 */
#define DMA_HISR_HTIF5      DMA_HISR_HTIF5_Msk            /*!<  Stream 5 half transfer interrupt flag */
#define DMA_HISR_TEIF5_Pos  (9U)
#define DMA_HISR_TEIF5_Msk  (0x1UL << DMA_HISR_TEIF5_Pos) /*!< 0x00000200 */
#define DMA_HISR_TEIF5      DMA_HISR_TEIF5_Msk            /*!<  Stream 5 transfer error interrupt flag */
#define DMA_HISR_DMEIF5_Pos (8U)
#define DMA_HISR_DMEIF5_Msk (0x1UL << DMA_HISR_DMEIF5_Pos) /*!< 0x00000100 */
#define DMA_HISR_DMEIF5     DMA_HISR_DMEIF5_Msk            /*!<  Stream 5 direct mode error interrupt flag */
#define DMA_HISR_FEIF5_Pos  (6U)
#define DMA_HISR_FEIF5_Msk  (0x1UL << DMA_HISR_FEIF5_Pos) /*!< 0x00000040 */
#define DMA_HISR_FEIF5      DMA_HISR_FEIF5_Msk            /*!<  Stream 5 FIFO error interrupt flag */
#define DMA_HISR_TCIF4_Pos  (5U)
#define DMA_HISR_TCIF4_Msk  (0x1UL << DMA_HISR_TCIF4_Pos) /*!< 0x00000020 */
#define DMA_HISR_TCIF4      DMA_HISR_TCIF4_Msk            /*!<  Stream 4 transfer complete interrupt flag */
#define DMA_HISR_HTIF4_Pos  (4U)
#define DMA_HISR_HTIF4_Msk  (0x1UL << DMA_HISR_HTIF4_Pos) /*!< 0x00000010 */
#define DMA_HISR_HTIF4      DMA_HISR_HTIF4_Msk            /*!<  Stream 4 half transfer interrupt flag */
#define DMA_HISR_TEIF4_Pos  (3U)
#define DMA_HISR_TEIF4_Msk  (0x1UL << DMA_HISR_TEIF4_Pos) /*!< 0x00000008 */
#define DMA_HISR_TEIF4      DMA_HISR_TEIF4_Msk            /*!<  Stream 4 transfer error interrupt flag */
#define DMA_HISR_DMEIF4_Pos (2U)
#define DMA_HISR_DMEIF4_Msk (0x1UL << DMA_HISR_DMEIF4_Pos) /*!< 0x00000004 */
#define DMA_HISR_DMEIF4     DMA_HISR_DMEIF4_Msk            /*!<  Stream 4 direct mode error interrupt flag */
#define DMA_HISR_FEIF4_Pos  (0U)
#define DMA_HISR_FEIF4_Msk  (0x1UL << DMA_HISR_FEIF4_Pos) /*!< 0x00000001 */
#define DMA_HISR_FEIF4      DMA_HISR_FEIF4_Msk            /*!<  Stream 4 FIFO error interrupt flag */

/********************  Bits definition for DMA_LIFCR register  ****************/
#define DMA_LIFCR_CTCIF3_Pos  (27U)
#define DMA_LIFCR_CTCIF3_Msk  (0x1UL << DMA_LIFCR_CTCIF3_Pos) /*!< 0x08000000 */
#define DMA_LIFCR_CTCIF3      DMA_LIFCR_CTCIF3_Msk            /*!<  Stream 3 clear transfer complete interrupt flag */
#define DMA_LIFCR_CHTIF3_Pos  (26U)
#define DMA_LIFCR_CHTIF3_Msk  (0x1UL << DMA_LIFCR_CHTIF3_Pos) /*!< 0x04000000 */
#define DMA_LIFCR_CHTIF3      DMA_LIFCR_CHTIF3_Msk            /*!<  Stream 3 clear half transfer interrupt flag */
#define DMA_LIFCR_CTEIF3_Pos  (25U)
#define DMA_LIFCR_CTEIF3_Msk  (0x1UL << DMA_LIFCR_CTEIF3_Pos) /*!< 0x02000000 */
#define DMA_LIFCR_CTEIF3      DMA_LIFCR_CTEIF3_Msk            /*!<  Stream 3 clear transfer error interrupt flag */
#define DMA_LIFCR_CDMEIF3_Pos (24U)
#define DMA_LIFCR_CDMEIF3_Msk (0x1UL << DMA_LIFCR_CDMEIF3_Pos) /*!< 0x01000000 */
#define DMA_LIFCR_CDMEIF3     DMA_LIFCR_CDMEIF3_Msk            /*!<  Stream 3 clear direct mode error interrupt flag */
#define DMA_LIFCR_CFEIF3_Pos  (22U)
#define DMA_LIFCR_CFEIF3_Msk  (0x1UL << DMA_LIFCR_CFEIF3_Pos) /*!< 0x00400000 */
#define DMA_LIFCR_CFEIF3      DMA_LIFCR_CFEIF3_Msk            /*!<  Stream 3 clear FIFO error interrupt flag */
#define DMA_LIFCR_CTCIF2_Pos  (21U)
#define DMA_LIFCR_CTCIF2_Msk  (0x1UL << DMA_LIFCR_CTCIF2_Pos) /*!< 0x00200000 */
#define DMA_LIFCR_CTCIF2      DMA_LIFCR_CTCIF2_Msk            /*!<  Stream 2 clear transfer complete interrupt flag */
#define DMA_LIFCR_CHTIF2_Pos  (20U)
#define DMA_LIFCR_CHTIF2_Msk  (0x1UL << DMA_LIFCR_CHTIF2_Pos) /*!< 0x00100000 */
#define DMA_LIFCR_CHTIF2      DMA_LIFCR_CHTIF2_Msk            /*!<  Stream 2 clear half transfer interrupt flag */
#define DMA_LIFCR_CTEIF2_Pos  (19U)
#define DMA_LIFCR_CTEIF2_Msk  (0x1UL << DMA_LIFCR_CTEIF2_Pos) /*!< 0x00080000 */
#define DMA_LIFCR_CTEIF2      DMA_LIFCR_CTEIF2_Msk            /*!<  Stream 2 clear transfer error interrupt flag */
#define DMA_LIFCR_CDMEIF2_Pos (18U)
#define DMA_LIFCR_CDMEIF2_Msk (0x1UL << DMA_LIFCR_CDMEIF2_Pos) /*!< 0x00040000 */
#define DMA_LIFCR_CDMEIF2     DMA_LIFCR_CDMEIF2_Msk            /*!<  Stream 2 clear direct mode error interrupt flag */
#define DMA_LIFCR_CFEIF2_Pos  (16U)
#define DMA_LIFCR_CFEIF2_Msk  (0x1UL << DMA_LIFCR_CFEIF2_Pos) /*!< 0x00010000 */
#define DMA_LIFCR_CFEIF2      DMA_LIFCR_CFEIF2_Msk            /*!<  Stream 2 clear FIFO error interrupt flag */
#define DMA_LIFCR_CTCIF1_Pos  (11U)
#define DMA_LIFCR_CTCIF1_Msk  (0x1UL << DMA_LIFCR_CTCIF1_Pos) /*!< 0x00000800 */
#define DMA_LIFCR_CTCIF1      DMA_LIFCR_CTCIF1_Msk            /*!<  Stream 1 clear transfer complete interrupt flag */
#define DMA_LIFCR_CHTIF1_Pos  (10U)
#define DMA_LIFCR_CHTIF1_Msk  (0x1UL << DMA_LIFCR_CHTIF1_Pos) /*!< 0x00000400 */
#define DMA_LIFCR_CHTIF1      DMA_LIFCR_CHTIF1_Msk            /*!<  Stream 1 clear half transfer interrupt flag */
#define DMA_LIFCR_CTEIF1_Pos  (9U)
#define DMA_LIFCR_CTEIF1_Msk  (0x1UL << DMA_LIFCR_CTEIF1_Pos) /*!< 0x00000200 */
#define DMA_LIFCR_CTEIF1      DMA_LIFCR_CTEIF1_Msk            /*!<  Stream 1 clear transfer error interrupt flag */
#define DMA_LIFCR_CDMEIF1_Pos (8U)
#define DMA_LIFCR_CDMEIF1_Msk (0x1UL << DMA_LIFCR_CDMEIF1_Pos) /*!< 0x00000100 */
#define DMA_LIFCR_CDMEIF1     DMA_LIFCR_CDMEIF1_Msk            /*!<  Stream 1 clear direct mode error interrupt flag */
#define DMA_LIFCR_CFEIF1_Pos  (6U)
#define DMA_LIFCR_CFEIF1_Msk  (0x1UL << DMA_LIFCR_CFEIF1_Pos) /*!< 0x00000040 */
#define DMA_LIFCR_CFEIF1      DMA_LIFCR_CFEIF1_Msk            /*!<  Stream 1 clear FIFO error interrupt flag */
#define DMA_LIFCR_CTCIF0_Pos  (5U)
#define DMA_LIFCR_CTCIF0_Msk  (0x1UL << DMA_LIFCR_CTCIF0_Pos) /*!< 0x00000020 */
#define DMA_LIFCR_CTCIF0      DMA_LIFCR_CTCIF0_Msk            /*!<  Stream 0 clear transfer complete interrupt flag */
#define DMA_LIFCR_CHTIF0_Pos  (4U)
#define DMA_LIFCR_CHTIF0_Msk  (0x1UL << DMA_LIFCR_CHTIF0_Pos) /*!< 0x00000010 */
#define DMA_LIFCR_CHTIF0      DMA_LIFCR_CHTIF0_Msk            /*!<  Stream 0 clear half transfer interrupt flag */
#define DMA_LIFCR_CTEIF0_Pos  (3U)
#define DMA_LIFCR_CTEIF0_Msk  (0x1UL << DMA_LIFCR_CTEIF0_Pos) /*!< 0x00000008 */
#define DMA_LIFCR_CTEIF0      DMA_LIFCR_CTEIF0_Msk            /*!<  Stream 0 clear transfer error interrupt flag */
#define DMA_LIFCR_CDMEIF0_Pos (2U)
#define DMA_LIFCR_CDMEIF0_Msk (0x1UL << DMA_LIFCR_CDMEIF0_Pos) /*!< 0x00000004 */
#define DMA_LIFCR_CDMEIF0     DMA_LIFCR_CDMEIF0_Msk            /*!<  Stream 0 clear direct mode error interrupt flag */
#define DMA_LIFCR_CFEIF0_Pos  (0U)
#define DMA_LIFCR_CFEIF0_Msk  (0x1UL << DMA_LIFCR_CFEIF0_Pos) /*!< 0x00000001 */
#define DMA_LIFCR_CFEIF0      DMA_LIFCR_CFEIF0_Msk            /*!<  Stream 0 clear FIFO error interrupt flag */

