Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bits definition for DMA_HIFCR  register  ****************/
#define DMA_HIFCR_CTCIF7_Pos  (27U)
#define DMA_HIFCR_CTCIF7_Msk  (0x1UL << DMA_HIFCR_CTCIF7_Pos) /*!< 0x08000000 */
#define DMA_HIFCR_CTCIF7      DMA_HIFCR_CTCIF7_Msk            /*!<  Stream 7 clear transfer complete interrupt flag */
#define DMA_HIFCR_CHTIF7_Pos  (26U)
#define DMA_HIFCR_CHTIF7_Msk  (0x1UL << DMA_HIFCR_CHTIF7_Pos) /*!< 0x04000000 */
#define DMA_HIFCR_CHTIF7      DMA_HIFCR_CHTIF7_Msk            /*!<  Stream 7 clear half transfer interrupt flag */
#define DMA_HIFCR_CTEIF7_Pos  (25U)
#define DMA_HIFCR_CTEIF7_Msk  (0x1UL << DMA_HIFCR_CTEIF7_Pos) /*!< 0x02000000 */
#define DMA_HIFCR_CTEIF7      DMA_HIFCR_CTEIF7_Msk            /*!<  Stream 7 clear transfer error interrupt flag */
#define DMA_HIFCR_CDMEIF7_Pos (24U)
#define DMA_HIFCR_CDMEIF7_Msk (0x1UL << DMA_HIFCR_CDMEIF7_Pos) /*!< 0x01000000 */
#define DMA_HIFCR_CDMEIF7     DMA_HIFCR_CDMEIF7_Msk            /*!<  Stream 7 clear direct mode error interrupt flag */
#define DMA_HIFCR_CFEIF7_Pos  (22U)
#define DMA_HIFCR_CFEIF7_Msk  (0x1UL << DMA_HIFCR_CFEIF7_Pos) /*!< 0x00400000 */
#define DMA_HIFCR_CFEIF7      DMA_HIFCR_CFEIF7_Msk            /*!<  Stream 7 clear FIFO error interrupt flag */
#define DMA_HIFCR_CTCIF6_Pos  (21U)
#define DMA_HIFCR_CTCIF6_Msk  (0x1UL << DMA_HIFCR_CTCIF6_Pos) /*!< 0x00200000 */
#define DMA_HIFCR_CTCIF6      DMA_HIFCR_CTCIF6_Msk            /*!<  Stream 6 clear transfer complete interrupt flag */
#define DMA_HIFCR_CHTIF6_Pos  (20U)
#define DMA_HIFCR_CHTIF6_Msk  (0x1UL << DMA_HIFCR_CHTIF6_Pos) /*!< 0x00100000 */
#define DMA_HIFCR_CHTIF6      DMA_HIFCR_CHTIF6_Msk            /*!<  Stream 6 clear half transfer interrupt flag */
#define DMA_HIFCR_CTEIF6_Pos  (19U)
#define DMA_HIFCR_CTEIF6_Msk  (0x1UL << DMA_HIFCR_CTEIF6_Pos) /*!< 0x00080000 */
#define DMA_HIFCR_CTEIF6      DMA_HIFCR_CTEIF6_Msk            /*!<  Stream 6 clear transfer error interrupt flag */
#define DMA_HIFCR_CDMEIF6_Pos (18U)
#define DMA_HIFCR_CDMEIF6_Msk (0x1UL << DMA_HIFCR_CDMEIF6_Pos) /*!< 0x00040000 */
#define DMA_HIFCR_CDMEIF6     DMA_HIFCR_CDMEIF6_Msk            /*!<  Stream 6 clear direct mode error interrupt flag */
#define DMA_HIFCR_CFEIF6_Pos  (16U)
#define DMA_HIFCR_CFEIF6_Msk  (0x1UL << DMA_HIFCR_CFEIF6_Pos) /*!< 0x00010000 */
#define DMA_HIFCR_CFEIF6      DMA_HIFCR_CFEIF6_Msk            /*!<  Stream 6 clear FIFO error interrupt flag */
#define DMA_HIFCR_CTCIF5_Pos  (11U)
#define DMA_HIFCR_CTCIF5_Msk  (0x1UL << DMA_HIFCR_CTCIF5_Pos) /*!< 0x00000800 */
#define DMA_HIFCR_CTCIF5      DMA_HIFCR_CTCIF5_Msk            /*!<  Stream 5 clear transfer complete interrupt flag */
#define DMA_HIFCR_CHTIF5_Pos  (10U)
#define DMA_HIFCR_CHTIF5_Msk  (0x1UL << DMA_HIFCR_CHTIF5_Pos) /*!< 0x00000400 */
#define DMA_HIFCR_CHTIF5      DMA_HIFCR_CHTIF5_Msk            /*!<  Stream 5 clear half transfer interrupt flag */
#define DMA_HIFCR_CTEIF5_Pos  (9U)
#define DMA_HIFCR_CTEIF5_Msk  (0x1UL << DMA_HIFCR_CTEIF5_Pos) /*!< 0x00000200 */
#define DMA_HIFCR_CTEIF5      DMA_HIFCR_CTEIF5_Msk            /*!<  Stream 5 clear transfer error interrupt flag */
#define DMA_HIFCR_CDMEIF5_Pos (8U)
#define DMA_HIFCR_CDMEIF5_Msk (0x1UL << DMA_HIFCR_CDMEIF5_Pos) /*!< 0x00000100 */
#define DMA_HIFCR_CDMEIF5     DMA_HIFCR_CDMEIF5_Msk            /*!<  Stream 5 clear direct mode error interrupt flag */
#define DMA_HIFCR_CFEIF5_Pos  (6U)
#define DMA_HIFCR_CFEIF5_Msk  (0x1UL << DMA_HIFCR_CFEIF5_Pos) /*!< 0x00000040 */
#define DMA_HIFCR_CFEIF5      DMA_HIFCR_CFEIF5_Msk            /*!<  Stream 5 clear FIFO error interrupt flag */
#define DMA_HIFCR_CTCIF4_Pos  (5U)
#define DMA_HIFCR_CTCIF4_Msk  (0x1UL << DMA_HIFCR_CTCIF4_Pos) /*!< 0x00000020 */
#define DMA_HIFCR_CTCIF4      DMA_HIFCR_CTCIF4_Msk            /*!<  Stream 4 clear transfer complete interrupt flag */
#define DMA_HIFCR_CHTIF4_Pos  (4U)
#define DMA_HIFCR_CHTIF4_Msk  (0x1UL << DMA_HIFCR_CHTIF4_Pos) /*!< 0x00000010 */
#define DMA_HIFCR_CHTIF4      DMA_HIFCR_CHTIF4_Msk            /*!<  Stream 4 clear half transfer interrupt flag */
#define DMA_HIFCR_CTEIF4_Pos  (3U)
#define DMA_HIFCR_CTEIF4_Msk  (0x1UL << DMA_HIFCR_CTEIF4_Pos) /*!< 0x00000008 */
#define DMA_HIFCR_CTEIF4      DMA_HIFCR_CTEIF4_Msk            /*!<  Stream 4 clear transfer error interrupt flag */
#define DMA_HIFCR_CDMEIF4_Pos (2U)
#define DMA_HIFCR_CDMEIF4_Msk (0x1UL << DMA_HIFCR_CDMEIF4_Pos) /*!< 0x00000004 */
#define DMA_HIFCR_CDMEIF4     DMA_HIFCR_CDMEIF4_Msk            /*!<  Stream 4 clear direct mode error interrupt flag */
#define DMA_HIFCR_CFEIF4_Pos  (0U)
#define DMA_HIFCR_CFEIF4_Msk  (0x1UL << DMA_HIFCR_CFEIF4_Pos) /*!< 0x00000001 */
#define DMA_HIFCR_CFEIF4      DMA_HIFCR_CFEIF4_Msk            /*!<  Stream 4 clear FIFO error interrupt flag */

/******************  Bit definition for DMA_SxPAR register  ********************/
#define DMA_SxPAR_PA_Pos (0U)
#define DMA_SxPAR_PA_Msk (0xFFFFFFFFUL << DMA_SxPAR_PA_Pos) /*!< 0xFFFFFFFF */
#define DMA_SxPAR_PA     DMA_SxPAR_PA_Msk                   /*!< Peripheral Address */

/******************  Bit definition for DMA_SxM0AR register  ********************/
#define DMA_SxM0AR_M0A_Pos (0U)
#define DMA_SxM0AR_M0A_Msk (0xFFFFFFFFUL << DMA_SxM0AR_M0A_Pos) /*!< 0xFFFFFFFF */
#define DMA_SxM0AR_M0A     DMA_SxM0AR_M0A_Msk                   /*!< Memory 0 Address */

/******************  Bit definition for DMA_SxM1AR register  ********************/
#define DMA_SxM1AR_M1A_Pos (0U)
#define DMA_SxM1AR_M1A_Msk (0xFFFFFFFFUL << DMA_SxM1AR_M1A_Pos) /*!< 0xFFFFFFFF */
#define DMA_SxM1AR_M1A     DMA_SxM1AR_M1A_Msk                   /*!< Memory 1 Address */

/******************************************************************************/
/*                                                                            */
/*                             DMAMUX Controller                              */
/*                                                                            */
/******************************************************************************/
/********************  Bits definition for DMAMUX_CxCR register  **************/
#define DMAMUX_CxCR_DMAREQ_ID_Pos (0U)
#define DMAMUX_CxCR_DMAREQ_ID_Msk (0xFFUL << DMAMUX_CxCR_DMAREQ_ID_Pos) /*!< 0x000000FF */
#define DMAMUX_CxCR_DMAREQ_ID     DMAMUX_CxCR_DMAREQ_ID_Msk             /*!<  DMA request identification */
#define DMAMUX_CxCR_DMAREQ_ID_0   (0x01UL << DMAMUX_CxCR_DMAREQ_ID_Pos) /*!< 0x00000001 */
#define DMAMUX_CxCR_DMAREQ_ID_1   (0x02UL << DMAMUX_CxCR_DMAREQ_ID_Pos) /*!< 0x00000002 */
#define DMAMUX_CxCR_DMAREQ_ID_2   (0x04UL << DMAMUX_CxCR_DMAREQ_ID_Pos) /*!< 0x00000004 */
#define DMAMUX_CxCR_DMAREQ_ID_3   (0x08UL << DMAMUX_CxCR_DMAREQ_ID_Pos) /*!< 0x00000008 */
#define DMAMUX_CxCR_DMAREQ_ID_4   (0x10UL << DMAMUX_CxCR_DMAREQ_ID_Pos) /*!< 0x00000010 */
#define DMAMUX_CxCR_DMAREQ_ID_5   (0x20UL << DMAMUX_CxCR_DMAREQ_ID_Pos) /*!< 0x00000020 */
#define DMAMUX_CxCR_DMAREQ_ID_6   (0x40UL << DMAMUX_CxCR_DMAREQ_ID_Pos) /*!< 0x00000040 */
#define DMAMUX_CxCR_DMAREQ_ID_7   (0x80UL << DMAMUX_CxCR_DMAREQ_ID_Pos) /*!< 0x00000080 */
#define DMAMUX_CxCR_SOIE_Pos      (8U)
#define DMAMUX_CxCR_SOIE_Msk      (0x1UL << DMAMUX_CxCR_SOIE_Pos) /*!< 0x00000100 */
#define DMAMUX_CxCR_SOIE          DMAMUX_CxCR_SOIE_Msk            /*!<  Synchronization overrun interrupt enable */
#define DMAMUX_CxCR_EGE_Pos       (9U)
#define DMAMUX_CxCR_EGE_Msk       (0x1UL << DMAMUX_CxCR_EGE_Pos) /*!< 0x00000200 */
#define DMAMUX_CxCR_EGE           DMAMUX_CxCR_EGE_Msk            /*!<  Event generation enable */
#define DMAMUX_CxCR_SE_Pos        (16U)
#define DMAMUX_CxCR_SE_Msk        (0x1UL << DMAMUX_CxCR_SE_Pos) /*!< 0x00010000 */
#define DMAMUX_CxCR_SE            DMAMUX_CxCR_SE_Msk            /*!<  Synchronization enable */
#define DMAMUX_CxCR_SPOL_Pos      (17U)
#define DMAMUX_CxCR_SPOL_Msk      (0x3UL << DMAMUX_CxCR_SPOL_Pos) /*!< 0x00060000 */
#define DMAMUX_CxCR_SPOL          DMAMUX_CxCR_SPOL_Msk            /*!<  Synchronization polarity */
#define DMAMUX_CxCR_SPOL_0        (0x1UL << DMAMUX_CxCR_SPOL_Pos) /*!< 0x00020000 */
#define DMAMUX_CxCR_SPOL_1        (0x2UL << DMAMUX_CxCR_SPOL_Pos) /*!< 0x00040000 */
#define DMAMUX_CxCR_NBREQ_Pos     (19U)
#define DMAMUX_CxCR_NBREQ_Msk     (0x1FUL << DMAMUX_CxCR_NBREQ_Pos) /*!< 0x00F80000 */
#define DMAMUX_CxCR_NBREQ         DMAMUX_CxCR_NBREQ_Msk             /*!<  Number of DMA requests minus 1 to forward */
#define DMAMUX_CxCR_NBREQ_0       (0x01UL << DMAMUX_CxCR_NBREQ_Pos) /*!< 0x00080000 */
#define DMAMUX_CxCR_NBREQ_1       (0x02UL << DMAMUX_CxCR_NBREQ_Pos) /*!< 0x00100000 */
#define DMAMUX_CxCR_NBREQ_2       (0x04UL << DMAMUX_CxCR_NBREQ_Pos) /*!< 0x00200000 */
#define DMAMUX_CxCR_NBREQ_3       (0x08UL << DMAMUX_CxCR_NBREQ_Pos) /*!< 0x00400000 */
#define DMAMUX_CxCR_NBREQ_4       (0x10UL << DMAMUX_CxCR_NBREQ_Pos) /*!< 0x00800000 */
#define DMAMUX_CxCR_SYNC_ID_Pos   (24U)
#define DMAMUX_CxCR_SYNC_ID_Msk   (0x1FUL << DMAMUX_CxCR_SYNC_ID_Pos) /*!< 0x1F000000 */
#define DMAMUX_CxCR_SYNC_ID       DMAMUX_CxCR_SYNC_ID_Msk             /*!<  Synchronization identification */
#define DMAMUX_CxCR_SYNC_ID_0     (0x01UL << DMAMUX_CxCR_SYNC_ID_Pos) /*!< 0x01000000 */
#define DMAMUX_CxCR_SYNC_ID_1     (0x02UL << DMAMUX_CxCR_SYNC_ID_Pos) /*!< 0x02000000 */
#define DMAMUX_CxCR_SYNC_ID_2     (0x04UL << DMAMUX_CxCR_SYNC_ID_Pos) /*!< 0x04000000 */
#define DMAMUX_CxCR_SYNC_ID_3     (0x08UL << DMAMUX_CxCR_SYNC_ID_Pos) /*!< 0x08000000 */
#define DMAMUX_CxCR_SYNC_ID_4     (0x10UL << DMAMUX_CxCR_SYNC_ID_Pos) /*!< 0x10000000 */

/********************  Bits definition for DMAMUX_CSR register  **************/
#define DMAMUX_CSR_SOF0_Pos  (0U)
#define DMAMUX_CSR_SOF0_Msk  (0x1UL << DMAMUX_CSR_SOF0_Pos) /*!< 0x00000001 */
#define DMAMUX_CSR_SOF0      DMAMUX_CSR_SOF0_Msk            /*!< Channel 0 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF1_Pos  (1U)
#define DMAMUX_CSR_SOF1_Msk  (0x1UL << DMAMUX_CSR_SOF1_Pos) /*!< 0x00000002 */
#define DMAMUX_CSR_SOF1      DMAMUX_CSR_SOF1_Msk            /*!< Channel 1 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF2_Pos  (2U)
#define DMAMUX_CSR_SOF2_Msk  (0x1UL << DMAMUX_CSR_SOF2_Pos) /*!< 0x00000004 */
#define DMAMUX_CSR_SOF2      DMAMUX_CSR_SOF2_Msk            /*!< Channel 2 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF3_Pos  (3U)
#define DMAMUX_CSR_SOF3_Msk  (0x1UL << DMAMUX_CSR_SOF3_Pos) /*!< 0x00000008 */
#define DMAMUX_CSR_SOF3      DMAMUX_CSR_SOF3_Msk            /*!< Channel 3 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF4_Pos  (4U)
#define DMAMUX_CSR_SOF4_Msk  (0x1UL << DMAMUX_CSR_SOF4_Pos) /*!< 0x00000010 */
#define DMAMUX_CSR_SOF4      DMAMUX_CSR_SOF4_Msk            /*!< Channel 4 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF5_Pos  (5U)
#define DMAMUX_CSR_SOF5_Msk  (0x1UL << DMAMUX_CSR_SOF5_Pos) /*!< 0x00000020 */
#define DMAMUX_CSR_SOF5      DMAMUX_CSR_SOF5_Msk            /*!< Channel 5 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF6_Pos  (6U)
#define DMAMUX_CSR_SOF6_Msk  (0x1UL << DMAMUX_CSR_SOF6_Pos) /*!< 0x00000040 */
#define DMAMUX_CSR_SOF6      DMAMUX_CSR_SOF6_Msk            /*!< Channel 6 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF7_Pos  (7U)
#define DMAMUX_CSR_SOF7_Msk  (0x1UL << DMAMUX_CSR_SOF7_Pos) /*!< 0x00000080 */
#define DMAMUX_CSR_SOF7      DMAMUX_CSR_SOF7_Msk            /*!< Channel 7 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF8_Pos  (8U)
#define DMAMUX_CSR_SOF8_Msk  (0x1UL << DMAMUX_CSR_SOF8_Pos) /*!< 0x00000100 */
#define DMAMUX_CSR_SOF8      DMAMUX_CSR_SOF8_Msk            /*!< Channel 8 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF9_Pos  (9U)
#define DMAMUX_CSR_SOF9_Msk  (0x1UL << DMAMUX_CSR_SOF9_Pos) /*!< 0x00000200 */
#define DMAMUX_CSR_SOF9      DMAMUX_CSR_SOF9_Msk            /*!< Channel 9 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF10_Pos (10U)
#define DMAMUX_CSR_SOF10_Msk (0x1UL << DMAMUX_CSR_SOF10_Pos) /*!< 0x00000400 */
#define DMAMUX_CSR_SOF10     DMAMUX_CSR_SOF10_Msk            /*!< Channel 10 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF11_Pos (11U)
#define DMAMUX_CSR_SOF11_Msk (0x1UL << DMAMUX_CSR_SOF11_Pos) /*!< 0x00000800 */
#define DMAMUX_CSR_SOF11     DMAMUX_CSR_SOF11_Msk            /*!< Channel 11 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF12_Pos (12U)
#define DMAMUX_CSR_SOF12_Msk (0x1UL << DMAMUX_CSR_SOF12_Pos) /*!< 0x00001000 */
#define DMAMUX_CSR_SOF12     DMAMUX_CSR_SOF12_Msk            /*!< Channel 12 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF13_Pos (13U)
#define DMAMUX_CSR_SOF13_Msk (0x1UL << DMAMUX_CSR_SOF13_Pos) /*!< 0x00002000 */
#define DMAMUX_CSR_SOF13     DMAMUX_CSR_SOF13_Msk            /*!< Channel 13 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF14_Pos (14U)
#define DMAMUX_CSR_SOF14_Msk (0x1UL << DMAMUX_CSR_SOF14_Pos) /*!< 0x00004000 */
#define DMAMUX_CSR_SOF14     DMAMUX_CSR_SOF14_Msk            /*!< Channel 14 Synchronization overrun event flag */
#define DMAMUX_CSR_SOF15_Pos (15U)
#define DMAMUX_CSR_SOF15_Msk (0x1UL << DMAMUX_CSR_SOF15_Pos) /*!< 0x00008000 */
#define DMAMUX_CSR_SOF15     DMAMUX_CSR_SOF15_Msk            /*!< Channel 15 Synchronization overrun event flag */

