Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define DMA2D_BGPFCCR_CM_Pos    (0U)
#define DMA2D_BGPFCCR_CM_Msk    (0xFUL << DMA2D_BGPFCCR_CM_Pos) /*!< 0x0000000F */
#define DMA2D_BGPFCCR_CM        DMA2D_BGPFCCR_CM_Msk            /*!< Input color mode CM[3:0] */
#define DMA2D_BGPFCCR_CM_0      (0x1UL << DMA2D_BGPFCCR_CM_Pos) /*!< 0x00000001 */
#define DMA2D_BGPFCCR_CM_1      (0x2UL << DMA2D_BGPFCCR_CM_Pos) /*!< 0x00000002 */
#define DMA2D_BGPFCCR_CM_2      (0x4UL << DMA2D_BGPFCCR_CM_Pos) /*!< 0x00000004 */
#define DMA2D_BGPFCCR_CM_3      (0x8UL << DMA2D_BGPFCCR_CM_Pos) /*!< 0x00000008 */
#define DMA2D_BGPFCCR_CCM_Pos   (4U)
#define DMA2D_BGPFCCR_CCM_Msk   (0x1UL << DMA2D_BGPFCCR_CCM_Pos) /*!< 0x00000010 */
#define DMA2D_BGPFCCR_CCM       DMA2D_BGPFCCR_CCM_Msk            /*!< CLUT Color mode */
#define DMA2D_BGPFCCR_START_Pos (5U)
#define DMA2D_BGPFCCR_START_Msk (0x1UL << DMA2D_BGPFCCR_START_Pos) /*!< 0x00000020 */
#define DMA2D_BGPFCCR_START     DMA2D_BGPFCCR_START_Msk            /*!< Start */
#define DMA2D_BGPFCCR_CS_Pos    (8U)
#define DMA2D_BGPFCCR_CS_Msk    (0xFFUL << DMA2D_BGPFCCR_CS_Pos) /*!< 0x0000FF00 */
#define DMA2D_BGPFCCR_CS        DMA2D_BGPFCCR_CS_Msk             /*!< CLUT size */
#define DMA2D_BGPFCCR_AM_Pos    (16U)
#define DMA2D_BGPFCCR_AM_Msk    (0x3UL << DMA2D_BGPFCCR_AM_Pos) /*!< 0x00030000 */
#define DMA2D_BGPFCCR_AM        DMA2D_BGPFCCR_AM_Msk            /*!< Alpha mode AM[1:0] */
#define DMA2D_BGPFCCR_AM_0      (0x1UL << DMA2D_BGPFCCR_AM_Pos) /*!< 0x00010000 */
#define DMA2D_BGPFCCR_AM_1      (0x2UL << DMA2D_BGPFCCR_AM_Pos) /*!< 0x00020000 */
#define DMA2D_BGPFCCR_AI_Pos    (20U)
#define DMA2D_BGPFCCR_AI_Msk    (0x1UL << DMA2D_BGPFCCR_AI_Pos) /*!< 0x00100000 */
#define DMA2D_BGPFCCR_AI        DMA2D_BGPFCCR_AI_Msk            /*!< background Input Alpha Inverted */
#define DMA2D_BGPFCCR_RBS_Pos   (21U)
#define DMA2D_BGPFCCR_RBS_Msk   (0x1UL << DMA2D_BGPFCCR_RBS_Pos) /*!< 0x00200000 */
#define DMA2D_BGPFCCR_RBS       DMA2D_BGPFCCR_RBS_Msk            /*!< Background Input Red Blue Swap */
#define DMA2D_BGPFCCR_ALPHA_Pos (24U)
#define DMA2D_BGPFCCR_ALPHA_Msk (0xFFUL << DMA2D_BGPFCCR_ALPHA_Pos) /*!< 0xFF000000 */
#define DMA2D_BGPFCCR_ALPHA     DMA2D_BGPFCCR_ALPHA_Msk             /*!< background Input Alpha value */

/********************  Bit definition for DMA2D_BGCOLR register  **************/

#define DMA2D_BGCOLR_BLUE_Pos  (0U)
#define DMA2D_BGCOLR_BLUE_Msk  (0xFFUL << DMA2D_BGCOLR_BLUE_Pos) /*!< 0x000000FF */
#define DMA2D_BGCOLR_BLUE      DMA2D_BGCOLR_BLUE_Msk             /*!< Background Blue Value */
#define DMA2D_BGCOLR_GREEN_Pos (8U)
#define DMA2D_BGCOLR_GREEN_Msk (0xFFUL << DMA2D_BGCOLR_GREEN_Pos) /*!< 0x0000FF00 */
#define DMA2D_BGCOLR_GREEN     DMA2D_BGCOLR_GREEN_Msk             /*!< Background Green Value */
#define DMA2D_BGCOLR_RED_Pos   (16U)
#define DMA2D_BGCOLR_RED_Msk   (0xFFUL << DMA2D_BGCOLR_RED_Pos) /*!< 0x00FF0000 */
#define DMA2D_BGCOLR_RED       DMA2D_BGCOLR_RED_Msk             /*!< Background Red Value */

/********************  Bit definition for DMA2D_FGCMAR register  **************/

#define DMA2D_FGCMAR_MA_Pos (0U)
#define DMA2D_FGCMAR_MA_Msk (0xFFFFFFFFUL << DMA2D_FGCMAR_MA_Pos) /*!< 0xFFFFFFFF */
#define DMA2D_FGCMAR_MA     DMA2D_FGCMAR_MA_Msk                   /*!< Foreground CLUT Memory Address */

/********************  Bit definition for DMA2D_BGCMAR register  **************/

#define DMA2D_BGCMAR_MA_Pos (0U)
#define DMA2D_BGCMAR_MA_Msk (0xFFFFFFFFUL << DMA2D_BGCMAR_MA_Pos) /*!< 0xFFFFFFFF */
#define DMA2D_BGCMAR_MA     DMA2D_BGCMAR_MA_Msk                   /*!< Background CLUT Memory Address */

/********************  Bit definition for DMA2D_OPFCCR register  **************/

#define DMA2D_OPFCCR_CM_Pos  (0U)
#define DMA2D_OPFCCR_CM_Msk  (0x7UL << DMA2D_OPFCCR_CM_Pos) /*!< 0x00000007 */
#define DMA2D_OPFCCR_CM      DMA2D_OPFCCR_CM_Msk            /*!< Output Color mode CM[2:0] */
#define DMA2D_OPFCCR_CM_0    (0x1UL << DMA2D_OPFCCR_CM_Pos) /*!< 0x00000001 */
#define DMA2D_OPFCCR_CM_1    (0x2UL << DMA2D_OPFCCR_CM_Pos) /*!< 0x00000002 */
#define DMA2D_OPFCCR_CM_2    (0x4UL << DMA2D_OPFCCR_CM_Pos) /*!< 0x00000004 */
#define DMA2D_OPFCCR_SB_Pos  (8U)
#define DMA2D_OPFCCR_SB_Msk  (0x1UL << DMA2D_OPFCCR_SB_Pos) /*!< 0x00000100 */
#define DMA2D_OPFCCR_SB      DMA2D_OPFCCR_SB_Msk            /*!< Swap Bytes */
#define DMA2D_OPFCCR_AI_Pos  (20U)
#define DMA2D_OPFCCR_AI_Msk  (0x1UL << DMA2D_OPFCCR_AI_Pos) /*!< 0x00100000 */
#define DMA2D_OPFCCR_AI      DMA2D_OPFCCR_AI_Msk            /*!< Output Alpha Inverted */
#define DMA2D_OPFCCR_RBS_Pos (21U)
#define DMA2D_OPFCCR_RBS_Msk (0x1UL << DMA2D_OPFCCR_RBS_Pos) /*!< 0x00200000 */
#define DMA2D_OPFCCR_RBS     DMA2D_OPFCCR_RBS_Msk            /*!< Output Red Blue Swap */

/********************  Bit definition for DMA2D_OCOLR register  ***************/

/*!<Mode_ARGB8888/RGB888 */

#define DMA2D_OCOLR_BLUE_1_Pos  (0U)
#define DMA2D_OCOLR_BLUE_1_Msk  (0xFFUL << DMA2D_OCOLR_BLUE_1_Pos) /*0x000000FFU*/
#define DMA2D_OCOLR_BLUE_1      DMA2D_OCOLR_BLUE_1_Msk             /*!< Output BLUE Value */
#define DMA2D_OCOLR_GREEN_1_Pos (8U)
#define DMA2D_OCOLR_GREEN_1_Msk (0xFFUL << DMA2D_OCOLR_GREEN_1_Pos) /*0x0000FF00U)*/
#define DMA2D_OCOLR_GREEN_1     DMA2D_OCOLR_GREEN_1_Msk             /*!< Output GREEN Value  */
#define DMA2D_OCOLR_RED_1_Pos   (16U)
#define DMA2D_OCOLR_RED_1_Msk   (0xFFUL << DMA2D_OCOLR_RED_1_Pos) /*0x00FF0000U */
#define DMA2D_OCOLR_RED_1       DMA2D_OCOLR_RED_1_Msk             /*!< Output Red Value */
#define DMA2D_OCOLR_ALPHA_1_Pos (24U)
#define DMA2D_OCOLR_ALPHA_1_Msk (0xFFUL << DMA2D_OCOLR_ALPHA_1_Pos) /*0xFF000000U*/
#define DMA2D_OCOLR_ALPHA_1     DMA2D_OCOLR_ALPHA_1_Msk             /*!< Output Alpha Channel Value */

/*!<Mode_RGB565 */
#define DMA2D_OCOLR_BLUE_2_Pos  (0U)
#define DMA2D_OCOLR_BLUE_2_Msk  (0x1FUL << DMA2D_OCOLR_BLUE_2_Pos) /*0x0000001FU*/
#define DMA2D_OCOLR_BLUE_2      DMA2D_OCOLR_BLUE_2_Msk             /*!< Output BLUE Value */
#define DMA2D_OCOLR_GREEN_2_Pos (5U)
#define DMA2D_OCOLR_GREEN_2_Msk (0x7EUL << DMA2D_OCOLR_GREEN_2_Pos) /* 0x000007E0U */
#define DMA2D_OCOLR_GREEN_2     DMA2D_OCOLR_GREEN_2_Msk             /*!< Output GREEN Value  */
#define DMA2D_OCOLR_RED_2_Pos   (11U)
#define DMA2D_OCOLR_RED_2_Msk   (0xF8UL << DMA2D_OCOLR_RED_2_Pos) /*0x0000F800U*/
#define DMA2D_OCOLR_RED_2       DMA2D_OCOLR_RED_2_Msk             /*!< Output Red Value */

/*!<Mode_ARGB1555 */
#define DMA2D_OCOLR_BLUE_3_Pos  (0U)
#define DMA2D_OCOLR_BLUE_3_Msk  (0x1FUL << DMA2D_OCOLR_BLUE_3_Pos) /*0x0000001FU*/
#define DMA2D_OCOLR_BLUE_3      DMA2D_OCOLR_BLUE_3_Msk             /*!< Output BLUE Value */
#define DMA2D_OCOLR_GREEN_3_Pos (5U)
#define DMA2D_OCOLR_GREEN_3_Msk (0x3EUL << DMA2D_OCOLR_GREEN_3_Pos) /*0x000003E0U*/
#define DMA2D_OCOLR_GREEN_3     DMA2D_OCOLR_GREEN_3_Msk             /*!< Output GREEN Value  */
#define DMA2D_OCOLR_RED_3_Pos   (10U)
#define DMA2D_OCOLR_RED_3_Msk   (0x7CUL << DMA2D_OCOLR_RED_3_Pos) /* 0x00007C00U*/
#define DMA2D_OCOLR_RED_3       DMA2D_OCOLR_RED_3_Msk             /*!< Output Red Value */
#define DMA2D_OCOLR_ALPHA_3_Pos (15U)
#define DMA2D_OCOLR_ALPHA_3_Msk (0x1UL << DMA2D_OCOLR_ALPHA_3_Pos) /*0x00008000U*/
#define DMA2D_OCOLR_ALPHA_3     DMA2D_OCOLR_ALPHA_3_Msk            /*!< Output Alpha Channel Value */

