Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*!<Mode_ARGB4444 */
#define DMA2D_OCOLR_BLUE_4_Pos  (0U)
#define DMA2D_OCOLR_BLUE_4_Msk  (0xFUL << DMA2D_OCOLR_BLUE_4_Pos) /*0x0000000FU*/
#define DMA2D_OCOLR_BLUE_4      DMA2D_OCOLR_BLUE_4_Msk            /*!< Output BLUE Value */
#define DMA2D_OCOLR_GREEN_4_Pos (4U)
#define DMA2D_OCOLR_GREEN_4_Msk (0xFUL << DMA2D_OCOLR_GREEN_4_Pos) /*0x000000F0U*/
#define DMA2D_OCOLR_GREEN_4     DMA2D_OCOLR_GREEN_4_Msk            /*!< Output GREEN Value  */
#define DMA2D_OCOLR_RED_4_Pos   (8U)
#define DMA2D_OCOLR_RED_4_Msk   (0xFUL << DMA2D_OCOLR_RED_4_Pos) /*0x00000F00U*/
#define DMA2D_OCOLR_RED_4       DMA2D_OCOLR_RED_4_Msk            /*!< Output Red Value */
#define DMA2D_OCOLR_ALPHA_4_Pos (12U)
#define DMA2D_OCOLR_ALPHA_4_Msk (0xFUL << DMA2D_OCOLR_ALPHA_4_Pos) /*0x0000F000U*/
#define DMA2D_OCOLR_ALPHA_4     DMA2D_OCOLR_ALPHA_4_Msk            /*!< Output Alpha Channel Value */

/********************  Bit definition for DMA2D_OMAR register  ****************/

#define DMA2D_OMAR_MA_Pos (0U)
#define DMA2D_OMAR_MA_Msk (0xFFFFFFFFUL << DMA2D_OMAR_MA_Pos) /*!< 0xFFFFFFFF */
#define DMA2D_OMAR_MA     DMA2D_OMAR_MA_Msk                   /*!< Output Memory Address */

/********************  Bit definition for DMA2D_OOR register  *****************/

#define DMA2D_OOR_LO_Pos (0U)
#define DMA2D_OOR_LO_Msk (0xFFFFUL << DMA2D_OOR_LO_Pos) /*!< 0x0000FFFF */
#define DMA2D_OOR_LO     DMA2D_OOR_LO_Msk               /*!< Output Line Offset */

/********************  Bit definition for DMA2D_NLR register  *****************/

#define DMA2D_NLR_NL_Pos (0U)
#define DMA2D_NLR_NL_Msk (0xFFFFUL << DMA2D_NLR_NL_Pos) /*!< 0x0000FFFF */
#define DMA2D_NLR_NL     DMA2D_NLR_NL_Msk               /*!< Number of Lines */
#define DMA2D_NLR_PL_Pos (16U)
#define DMA2D_NLR_PL_Msk (0x3FFFUL << DMA2D_NLR_PL_Pos) /*!< 0x3FFF0000 */
#define DMA2D_NLR_PL     DMA2D_NLR_PL_Msk               /*!< Pixel per Lines */

/********************  Bit definition for DMA2D_LWR register  *****************/

#define DMA2D_LWR_LW_Pos (0U)
#define DMA2D_LWR_LW_Msk (0xFFFFUL << DMA2D_LWR_LW_Pos) /*!< 0x0000FFFF */
#define DMA2D_LWR_LW     DMA2D_LWR_LW_Msk               /*!< Line Watermark */

/********************  Bit definition for DMA2D_AMTCR register  ***************/

#define DMA2D_AMTCR_EN_Pos (0U)
#define DMA2D_AMTCR_EN_Msk (0x1UL << DMA2D_AMTCR_EN_Pos) /*!< 0x00000001 */
#define DMA2D_AMTCR_EN     DMA2D_AMTCR_EN_Msk            /*!< Enable */
#define DMA2D_AMTCR_DT_Pos (8U)
#define DMA2D_AMTCR_DT_Msk (0xFFUL << DMA2D_AMTCR_DT_Pos) /*!< 0x0000FF00 */
#define DMA2D_AMTCR_DT     DMA2D_AMTCR_DT_Msk             /*!< Dead Time */

/********************  Bit definition for DMA2D_FGCLUT register  **************/

/********************  Bit definition for DMA2D_BGCLUT register  **************/

/******************************************************************************/
/*                                                                            */
/*                    External Interrupt/Event Controller                     */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for EXTI_RTSR1 register  *******************/
#define EXTI_RTSR1_TR_Pos   (0U)
#define EXTI_RTSR1_TR_Msk   (0x3FFFFFUL << EXTI_RTSR1_TR_Pos) /*!< 0x003FFFFF */
#define EXTI_RTSR1_TR       EXTI_RTSR1_TR_Msk                 /*!< Rising trigger event configuration bit */
#define EXTI_RTSR1_TR0_Pos  (0U)
#define EXTI_RTSR1_TR0_Msk  (0x1UL << EXTI_RTSR1_TR0_Pos) /*!< 0x00000001 */
#define EXTI_RTSR1_TR0      EXTI_RTSR1_TR0_Msk            /*!< Rising trigger event configuration bit of line 0 */
#define EXTI_RTSR1_TR1_Pos  (1U)
#define EXTI_RTSR1_TR1_Msk  (0x1UL << EXTI_RTSR1_TR1_Pos) /*!< 0x00000002 */
#define EXTI_RTSR1_TR1      EXTI_RTSR1_TR1_Msk            /*!< Rising trigger event configuration bit of line 1 */
#define EXTI_RTSR1_TR2_Pos  (2U)
#define EXTI_RTSR1_TR2_Msk  (0x1UL << EXTI_RTSR1_TR2_Pos) /*!< 0x00000004 */
#define EXTI_RTSR1_TR2      EXTI_RTSR1_TR2_Msk            /*!< Rising trigger event configuration bit of line 2 */
#define EXTI_RTSR1_TR3_Pos  (3U)
#define EXTI_RTSR1_TR3_Msk  (0x1UL << EXTI_RTSR1_TR3_Pos) /*!< 0x00000008 */
#define EXTI_RTSR1_TR3      EXTI_RTSR1_TR3_Msk            /*!< Rising trigger event configuration bit of line 3 */
#define EXTI_RTSR1_TR4_Pos  (4U)
#define EXTI_RTSR1_TR4_Msk  (0x1UL << EXTI_RTSR1_TR4_Pos) /*!< 0x00000010 */
#define EXTI_RTSR1_TR4      EXTI_RTSR1_TR4_Msk            /*!< Rising trigger event configuration bit of line 4 */
#define EXTI_RTSR1_TR5_Pos  (5U)
#define EXTI_RTSR1_TR5_Msk  (0x1UL << EXTI_RTSR1_TR5_Pos) /*!< 0x00000020 */
#define EXTI_RTSR1_TR5      EXTI_RTSR1_TR5_Msk            /*!< Rising trigger event configuration bit of line 5 */
#define EXTI_RTSR1_TR6_Pos  (6U)
#define EXTI_RTSR1_TR6_Msk  (0x1UL << EXTI_RTSR1_TR6_Pos) /*!< 0x00000040 */
#define EXTI_RTSR1_TR6      EXTI_RTSR1_TR6_Msk            /*!< Rising trigger event configuration bit of line 6 */
#define EXTI_RTSR1_TR7_Pos  (7U)
#define EXTI_RTSR1_TR7_Msk  (0x1UL << EXTI_RTSR1_TR7_Pos) /*!< 0x00000080 */
#define EXTI_RTSR1_TR7      EXTI_RTSR1_TR7_Msk            /*!< Rising trigger event configuration bit of line 7 */
#define EXTI_RTSR1_TR8_Pos  (8U)
#define EXTI_RTSR1_TR8_Msk  (0x1UL << EXTI_RTSR1_TR8_Pos) /*!< 0x00000100 */
#define EXTI_RTSR1_TR8      EXTI_RTSR1_TR8_Msk            /*!< Rising trigger event configuration bit of line 8 */
#define EXTI_RTSR1_TR9_Pos  (9U)
#define EXTI_RTSR1_TR9_Msk  (0x1UL << EXTI_RTSR1_TR9_Pos) /*!< 0x00000200 */
#define EXTI_RTSR1_TR9      EXTI_RTSR1_TR9_Msk            /*!< Rising trigger event configuration bit of line 9 */
#define EXTI_RTSR1_TR10_Pos (10U)
#define EXTI_RTSR1_TR10_Msk (0x1UL << EXTI_RTSR1_TR10_Pos) /*!< 0x00000400 */
#define EXTI_RTSR1_TR10     EXTI_RTSR1_TR10_Msk            /*!< Rising trigger event configuration bit of line 10 */
#define EXTI_RTSR1_TR11_Pos (11U)
#define EXTI_RTSR1_TR11_Msk (0x1UL << EXTI_RTSR1_TR11_Pos) /*!< 0x00000800 */
#define EXTI_RTSR1_TR11     EXTI_RTSR1_TR11_Msk            /*!< Rising trigger event configuration bit of line 11 */
#define EXTI_RTSR1_TR12_Pos (12U)
#define EXTI_RTSR1_TR12_Msk (0x1UL << EXTI_RTSR1_TR12_Pos) /*!< 0x00001000 */
#define EXTI_RTSR1_TR12     EXTI_RTSR1_TR12_Msk            /*!< Rising trigger event configuration bit of line 12 */
#define EXTI_RTSR1_TR13_Pos (13U)
#define EXTI_RTSR1_TR13_Msk (0x1UL << EXTI_RTSR1_TR13_Pos) /*!< 0x00002000 */
#define EXTI_RTSR1_TR13     EXTI_RTSR1_TR13_Msk            /*!< Rising trigger event configuration bit of line 13 */
#define EXTI_RTSR1_TR14_Pos (14U)
#define EXTI_RTSR1_TR14_Msk (0x1UL << EXTI_RTSR1_TR14_Pos) /*!< 0x00004000 */
#define EXTI_RTSR1_TR14     EXTI_RTSR1_TR14_Msk            /*!< Rising trigger event configuration bit of line 14 */
#define EXTI_RTSR1_TR15_Pos (15U)
#define EXTI_RTSR1_TR15_Msk (0x1UL << EXTI_RTSR1_TR15_Pos) /*!< 0x00008000 */
#define EXTI_RTSR1_TR15     EXTI_RTSR1_TR15_Msk            /*!< Rising trigger event configuration bit of line 15 */
#define EXTI_RTSR1_TR16_Pos (16U)
#define EXTI_RTSR1_TR16_Msk (0x1UL << EXTI_RTSR1_TR16_Pos) /*!< 0x00010000 */
#define EXTI_RTSR1_TR16     EXTI_RTSR1_TR16_Msk            /*!< Rising trigger event configuration bit of line 16 */
#define EXTI_RTSR1_TR17_Pos (17U)
#define EXTI_RTSR1_TR17_Msk (0x1UL << EXTI_RTSR1_TR17_Pos) /*!< 0x00020000 */
#define EXTI_RTSR1_TR17     EXTI_RTSR1_TR17_Msk            /*!< Rising trigger event configuration bit of line 17 */
#define EXTI_RTSR1_TR18_Pos (18U)
#define EXTI_RTSR1_TR18_Msk (0x1UL << EXTI_RTSR1_TR18_Pos) /*!< 0x00040000 */
#define EXTI_RTSR1_TR18     EXTI_RTSR1_TR18_Msk            /*!< Rising trigger event configuration bit of line 18 */
#define EXTI_RTSR1_TR19_Pos (19U)
#define EXTI_RTSR1_TR19_Msk (0x1UL << EXTI_RTSR1_TR19_Pos) /*!< 0x00080000 */
#define EXTI_RTSR1_TR19     EXTI_RTSR1_TR19_Msk            /*!< Rising trigger event configuration bit of line 19 */
#define EXTI_RTSR1_TR20_Pos (20U)
#define EXTI_RTSR1_TR20_Msk (0x1UL << EXTI_RTSR1_TR20_Pos) /*!< 0x00100000 */
#define EXTI_RTSR1_TR20     EXTI_RTSR1_TR20_Msk            /*!< Rising trigger event configuration bit of line 20 */
#define EXTI_RTSR1_TR21_Pos (21U)
#define EXTI_RTSR1_TR21_Msk (0x1UL << EXTI_RTSR1_TR21_Pos) /*!< 0x00200000 */
#define EXTI_RTSR1_TR21     EXTI_RTSR1_TR21_Msk            /*!< Rising trigger event configuration bit of line 21 */

/******************  Bit definition for EXTI_FTSR1 register  *******************/
#define EXTI_FTSR1_TR_Pos   (0U)
#define EXTI_FTSR1_TR_Msk   (0x3FFFFFUL << EXTI_FTSR1_TR_Pos) /*!< 0x003FFFFF */
#define EXTI_FTSR1_TR       EXTI_FTSR1_TR_Msk                 /*!< Falling trigger event configuration bit */
#define EXTI_FTSR1_TR0_Pos  (0U)
#define EXTI_FTSR1_TR0_Msk  (0x1UL << EXTI_FTSR1_TR0_Pos) /*!< 0x00000001 */
#define EXTI_FTSR1_TR0      EXTI_FTSR1_TR0_Msk            /*!< Falling trigger event configuration bit of line 0 */
#define EXTI_FTSR1_TR1_Pos  (1U)
#define EXTI_FTSR1_TR1_Msk  (0x1UL << EXTI_FTSR1_TR1_Pos) /*!< 0x00000002 */
#define EXTI_FTSR1_TR1      EXTI_FTSR1_TR1_Msk            /*!< Falling trigger event configuration bit of line 1 */
#define EXTI_FTSR1_TR2_Pos  (2U)
#define EXTI_FTSR1_TR2_Msk  (0x1UL << EXTI_FTSR1_TR2_Pos) /*!< 0x00000004 */
#define EXTI_FTSR1_TR2      EXTI_FTSR1_TR2_Msk            /*!< Falling trigger event configuration bit of line 2 */
#define EXTI_FTSR1_TR3_Pos  (3U)
#define EXTI_FTSR1_TR3_Msk  (0x1UL << EXTI_FTSR1_TR3_Pos) /*!< 0x00000008 */
#define EXTI_FTSR1_TR3      EXTI_FTSR1_TR3_Msk            /*!< Falling trigger event configuration bit of line 3 */
#define EXTI_FTSR1_TR4_Pos  (4U)
#define EXTI_FTSR1_TR4_Msk  (0x1UL << EXTI_FTSR1_TR4_Pos) /*!< 0x00000010 */
#define EXTI_FTSR1_TR4      EXTI_FTSR1_TR4_Msk            /*!< Falling trigger event configuration bit of line 4 */
#define EXTI_FTSR1_TR5_Pos  (5U)
#define EXTI_FTSR1_TR5_Msk  (0x1UL << EXTI_FTSR1_TR5_Pos) /*!< 0x00000020 */
#define EXTI_FTSR1_TR5      EXTI_FTSR1_TR5_Msk            /*!< Falling trigger event configuration bit of line 5 */
#define EXTI_FTSR1_TR6_Pos  (6U)
#define EXTI_FTSR1_TR6_Msk  (0x1UL << EXTI_FTSR1_TR6_Pos) /*!< 0x00000040 */
#define EXTI_FTSR1_TR6      EXTI_FTSR1_TR6_Msk            /*!< Falling trigger event configuration bit of line 6 */
#define EXTI_FTSR1_TR7_Pos  (7U)
#define EXTI_FTSR1_TR7_Msk  (0x1UL << EXTI_FTSR1_TR7_Pos) /*!< 0x00000080 */
#define EXTI_FTSR1_TR7      EXTI_FTSR1_TR7_Msk            /*!< Falling trigger event configuration bit of line 7 */
#define EXTI_FTSR1_TR8_Pos  (8U)
#define EXTI_FTSR1_TR8_Msk  (0x1UL << EXTI_FTSR1_TR8_Pos) /*!< 0x00000100 */
#define EXTI_FTSR1_TR8      EXTI_FTSR1_TR8_Msk            /*!< Falling trigger event configuration bit of line 8 */
#define EXTI_FTSR1_TR9_Pos  (9U)
#define EXTI_FTSR1_TR9_Msk  (0x1UL << EXTI_FTSR1_TR9_Pos) /*!< 0x00000200 */
#define EXTI_FTSR1_TR9      EXTI_FTSR1_TR9_Msk            /*!< Falling trigger event configuration bit of line 9 */
#define EXTI_FTSR1_TR10_Pos (10U)
#define EXTI_FTSR1_TR10_Msk (0x1UL << EXTI_FTSR1_TR10_Pos) /*!< 0x00000400 */
#define EXTI_FTSR1_TR10     EXTI_FTSR1_TR10_Msk            /*!< Falling trigger event configuration bit of line 10 */
#define EXTI_FTSR1_TR11_Pos (11U)
#define EXTI_FTSR1_TR11_Msk (0x1UL << EXTI_FTSR1_TR11_Pos) /*!< 0x00000800 */
#define EXTI_FTSR1_TR11     EXTI_FTSR1_TR11_Msk            /*!< Falling trigger event configuration bit of line 11 */
#define EXTI_FTSR1_TR12_Pos (12U)
#define EXTI_FTSR1_TR12_Msk (0x1UL << EXTI_FTSR1_TR12_Pos) /*!< 0x00001000 */
#define EXTI_FTSR1_TR12     EXTI_FTSR1_TR12_Msk            /*!< Falling trigger event configuration bit of line 12 */
#define EXTI_FTSR1_TR13_Pos (13U)
#define EXTI_FTSR1_TR13_Msk (0x1UL << EXTI_FTSR1_TR13_Pos) /*!< 0x00002000 */
#define EXTI_FTSR1_TR13     EXTI_FTSR1_TR13_Msk            /*!< Falling trigger event configuration bit of line 13 */
#define EXTI_FTSR1_TR14_Pos (14U)
#define EXTI_FTSR1_TR14_Msk (0x1UL << EXTI_FTSR1_TR14_Pos) /*!< 0x00004000 */
#define EXTI_FTSR1_TR14     EXTI_FTSR1_TR14_Msk            /*!< Falling trigger event configuration bit of line 14 */
#define EXTI_FTSR1_TR15_Pos (15U)
#define EXTI_FTSR1_TR15_Msk (0x1UL << EXTI_FTSR1_TR15_Pos) /*!< 0x00008000 */
#define EXTI_FTSR1_TR15     EXTI_FTSR1_TR15_Msk            /*!< Falling trigger event configuration bit of line 15 */
#define EXTI_FTSR1_TR16_Pos (16U)
#define EXTI_FTSR1_TR16_Msk (0x1UL << EXTI_FTSR1_TR16_Pos) /*!< 0x00010000 */
#define EXTI_FTSR1_TR16     EXTI_FTSR1_TR16_Msk            /*!< Falling trigger event configuration bit of line 16 */
#define EXTI_FTSR1_TR17_Pos (17U)
#define EXTI_FTSR1_TR17_Msk (0x1UL << EXTI_FTSR1_TR17_Pos) /*!< 0x00020000 */
#define EXTI_FTSR1_TR17     EXTI_FTSR1_TR17_Msk            /*!< Falling trigger event configuration bit of line 17 */
#define EXTI_FTSR1_TR18_Pos (18U)
#define EXTI_FTSR1_TR18_Msk (0x1UL << EXTI_FTSR1_TR18_Pos) /*!< 0x00040000 */
#define EXTI_FTSR1_TR18     EXTI_FTSR1_TR18_Msk            /*!< Falling trigger event configuration bit of line 18 */
#define EXTI_FTSR1_TR19_Pos (19U)
#define EXTI_FTSR1_TR19_Msk (0x1UL << EXTI_FTSR1_TR19_Pos) /*!< 0x00080000 */
#define EXTI_FTSR1_TR19     EXTI_FTSR1_TR19_Msk            /*!< Falling trigger event configuration bit of line 19 */
#define EXTI_FTSR1_TR20_Pos (20U)
#define EXTI_FTSR1_TR20_Msk (0x1UL << EXTI_FTSR1_TR20_Pos) /*!< 0x00100000 */
#define EXTI_FTSR1_TR20     EXTI_FTSR1_TR20_Msk            /*!< Falling trigger event configuration bit of line 20 */
#define EXTI_FTSR1_TR21_Pos (21U)
#define EXTI_FTSR1_TR21_Msk (0x1UL << EXTI_FTSR1_TR21_Pos) /*!< 0x00200000 */
#define EXTI_FTSR1_TR21     EXTI_FTSR1_TR21_Msk            /*!< Falling trigger event configuration bit of line 21 */

/******************  Bit definition for EXTI_SWIER1 register  ******************/
#define EXTI_SWIER1_SWIER0_Pos  (0U)
#define EXTI_SWIER1_SWIER0_Msk  (0x1UL << EXTI_SWIER1_SWIER0_Pos) /*!< 0x00000001 */
#define EXTI_SWIER1_SWIER0      EXTI_SWIER1_SWIER0_Msk            /*!< Software Interrupt on line 0 */
#define EXTI_SWIER1_SWIER1_Pos  (1U)
#define EXTI_SWIER1_SWIER1_Msk  (0x1UL << EXTI_SWIER1_SWIER1_Pos) /*!< 0x00000002 */
#define EXTI_SWIER1_SWIER1      EXTI_SWIER1_SWIER1_Msk            /*!< Software Interrupt on line 1 */
#define EXTI_SWIER1_SWIER2_Pos  (2U)
#define EXTI_SWIER1_SWIER2_Msk  (0x1UL << EXTI_SWIER1_SWIER2_Pos) /*!< 0x00000004 */
#define EXTI_SWIER1_SWIER2      EXTI_SWIER1_SWIER2_Msk            /*!< Software Interrupt on line 2 */
#define EXTI_SWIER1_SWIER3_Pos  (3U)
#define EXTI_SWIER1_SWIER3_Msk  (0x1UL << EXTI_SWIER1_SWIER3_Pos) /*!< 0x00000008 */
#define EXTI_SWIER1_SWIER3      EXTI_SWIER1_SWIER3_Msk            /*!< Software Interrupt on line 3 */
#define EXTI_SWIER1_SWIER4_Pos  (4U)
#define EXTI_SWIER1_SWIER4_Msk  (0x1UL << EXTI_SWIER1_SWIER4_Pos) /*!< 0x00000010 */
#define EXTI_SWIER1_SWIER4      EXTI_SWIER1_SWIER4_Msk            /*!< Software Interrupt on line 4 */
#define EXTI_SWIER1_SWIER5_Pos  (5U)
#define EXTI_SWIER1_SWIER5_Msk  (0x1UL << EXTI_SWIER1_SWIER5_Pos) /*!< 0x00000020 */
#define EXTI_SWIER1_SWIER5      EXTI_SWIER1_SWIER5_Msk            /*!< Software Interrupt on line 5 */
#define EXTI_SWIER1_SWIER6_Pos  (6U)
#define EXTI_SWIER1_SWIER6_Msk  (0x1UL << EXTI_SWIER1_SWIER6_Pos) /*!< 0x00000040 */
#define EXTI_SWIER1_SWIER6      EXTI_SWIER1_SWIER6_Msk            /*!< Software Interrupt on line 6 */
#define EXTI_SWIER1_SWIER7_Pos  (7U)
#define EXTI_SWIER1_SWIER7_Msk  (0x1UL << EXTI_SWIER1_SWIER7_Pos) /*!< 0x00000080 */
#define EXTI_SWIER1_SWIER7      EXTI_SWIER1_SWIER7_Msk            /*!< Software Interrupt on line 7 */
#define EXTI_SWIER1_SWIER8_Pos  (8U)
#define EXTI_SWIER1_SWIER8_Msk  (0x1UL << EXTI_SWIER1_SWIER8_Pos) /*!< 0x00000100 */
#define EXTI_SWIER1_SWIER8      EXTI_SWIER1_SWIER8_Msk            /*!< Software Interrupt on line 8 */
#define EXTI_SWIER1_SWIER9_Pos  (9U)
#define EXTI_SWIER1_SWIER9_Msk  (0x1UL << EXTI_SWIER1_SWIER9_Pos) /*!< 0x00000200 */
#define EXTI_SWIER1_SWIER9      EXTI_SWIER1_SWIER9_Msk            /*!< Software Interrupt on line 9 */
#define EXTI_SWIER1_SWIER10_Pos (10U)
#define EXTI_SWIER1_SWIER10_Msk (0x1UL << EXTI_SWIER1_SWIER10_Pos) /*!< 0x00000400 */
#define EXTI_SWIER1_SWIER10     EXTI_SWIER1_SWIER10_Msk            /*!< Software Interrupt on line 10 */
#define EXTI_SWIER1_SWIER11_Pos (11U)
#define EXTI_SWIER1_SWIER11_Msk (0x1UL << EXTI_SWIER1_SWIER11_Pos) /*!< 0x00000800 */
#define EXTI_SWIER1_SWIER11     EXTI_SWIER1_SWIER11_Msk            /*!< Software Interrupt on line 11 */
#define EXTI_SWIER1_SWIER12_Pos (12U)
#define EXTI_SWIER1_SWIER12_Msk (0x1UL << EXTI_SWIER1_SWIER12_Pos) /*!< 0x00001000 */
#define EXTI_SWIER1_SWIER12     EXTI_SWIER1_SWIER12_Msk            /*!< Software Interrupt on line 12 */
#define EXTI_SWIER1_SWIER13_Pos (13U)
#define EXTI_SWIER1_SWIER13_Msk (0x1UL << EXTI_SWIER1_SWIER13_Pos) /*!< 0x00002000 */
#define EXTI_SWIER1_SWIER13     EXTI_SWIER1_SWIER13_Msk            /*!< Software Interrupt on line 13 */
#define EXTI_SWIER1_SWIER14_Pos (14U)
#define EXTI_SWIER1_SWIER14_Msk (0x1UL << EXTI_SWIER1_SWIER14_Pos) /*!< 0x00004000 */
#define EXTI_SWIER1_SWIER14     EXTI_SWIER1_SWIER14_Msk            /*!< Software Interrupt on line 14 */
#define EXTI_SWIER1_SWIER15_Pos (15U)
#define EXTI_SWIER1_SWIER15_Msk (0x1UL << EXTI_SWIER1_SWIER15_Pos) /*!< 0x00008000 */
#define EXTI_SWIER1_SWIER15     EXTI_SWIER1_SWIER15_Msk            /*!< Software Interrupt on line 15 */
#define EXTI_SWIER1_SWIER16_Pos (16U)
#define EXTI_SWIER1_SWIER16_Msk (0x1UL << EXTI_SWIER1_SWIER16_Pos) /*!< 0x00010000 */
#define EXTI_SWIER1_SWIER16     EXTI_SWIER1_SWIER16_Msk            /*!< Software Interrupt on line 16 */
#define EXTI_SWIER1_SWIER17_Pos (17U)
#define EXTI_SWIER1_SWIER17_Msk (0x1UL << EXTI_SWIER1_SWIER17_Pos) /*!< 0x00020000 */
#define EXTI_SWIER1_SWIER17     EXTI_SWIER1_SWIER17_Msk            /*!< Software Interrupt on line 17 */
#define EXTI_SWIER1_SWIER18_Pos (18U)
#define EXTI_SWIER1_SWIER18_Msk (0x1UL << EXTI_SWIER1_SWIER18_Pos) /*!< 0x00040000 */
#define EXTI_SWIER1_SWIER18     EXTI_SWIER1_SWIER18_Msk            /*!< Software Interrupt on line 18 */
#define EXTI_SWIER1_SWIER19_Pos (19U)
#define EXTI_SWIER1_SWIER19_Msk (0x1UL << EXTI_SWIER1_SWIER19_Pos) /*!< 0x00080000 */
#define EXTI_SWIER1_SWIER19     EXTI_SWIER1_SWIER19_Msk            /*!< Software Interrupt on line 19 */
#define EXTI_SWIER1_SWIER20_Pos (20U)
#define EXTI_SWIER1_SWIER20_Msk (0x1UL << EXTI_SWIER1_SWIER20_Pos) /*!< 0x00100000 */
#define EXTI_SWIER1_SWIER20     EXTI_SWIER1_SWIER20_Msk            /*!< Software Interrupt on line 20 */
#define EXTI_SWIER1_SWIER21_Pos (21U)
#define EXTI_SWIER1_SWIER21_Msk (0x1UL << EXTI_SWIER1_SWIER21_Pos) /*!< 0x00200000 */
#define EXTI_SWIER1_SWIER21     EXTI_SWIER1_SWIER21_Msk            /*!< Software Interrupt on line 21 */

/******************  Bit definition for EXTI_D3PMR1 register  ******************/
#define EXTI_D3PMR1_MR0_Pos  (0U)
#define EXTI_D3PMR1_MR0_Msk  (0x1UL << EXTI_D3PMR1_MR0_Pos) /*!< 0x00000001 */
#define EXTI_D3PMR1_MR0      EXTI_D3PMR1_MR0_Msk            /*!< Pending Mask Event for line 0  */
#define EXTI_D3PMR1_MR1_Pos  (1U)
#define EXTI_D3PMR1_MR1_Msk  (0x1UL << EXTI_D3PMR1_MR1_Pos) /*!< 0x00000002 */
#define EXTI_D3PMR1_MR1      EXTI_D3PMR1_MR1_Msk            /*!< Pending Mask Event for line 1  */
#define EXTI_D3PMR1_MR2_Pos  (2U)
#define EXTI_D3PMR1_MR2_Msk  (0x1UL << EXTI_D3PMR1_MR2_Pos) /*!< 0x00000004 */
#define EXTI_D3PMR1_MR2      EXTI_D3PMR1_MR2_Msk            /*!< Pending Mask Event for line 2  */
#define EXTI_D3PMR1_MR3_Pos  (3U)
#define EXTI_D3PMR1_MR3_Msk  (0x1UL << EXTI_D3PMR1_MR3_Pos) /*!< 0x00000008 */
#define EXTI_D3PMR1_MR3      EXTI_D3PMR1_MR3_Msk            /*!< Pending Mask Event for line 3  */
#define EXTI_D3PMR1_MR4_Pos  (4U)
#define EXTI_D3PMR1_MR4_Msk  (0x1UL << EXTI_D3PMR1_MR4_Pos) /*!< 0x00000010 */
#define EXTI_D3PMR1_MR4      EXTI_D3PMR1_MR4_Msk            /*!< Pending Mask Event for line 4  */
#define EXTI_D3PMR1_MR5_Pos  (5U)
#define EXTI_D3PMR1_MR5_Msk  (0x1UL << EXTI_D3PMR1_MR5_Pos) /*!< 0x00000020 */
#define EXTI_D3PMR1_MR5      EXTI_D3PMR1_MR5_Msk            /*!< Pending Mask Event for line 5  */
#define EXTI_D3PMR1_MR6_Pos  (6U)
#define EXTI_D3PMR1_MR6_Msk  (0x1UL << EXTI_D3PMR1_MR6_Pos) /*!< 0x00000040 */
#define EXTI_D3PMR1_MR6      EXTI_D3PMR1_MR6_Msk            /*!< Pending Mask Event for line 6  */
#define EXTI_D3PMR1_MR7_Pos  (7U)
#define EXTI_D3PMR1_MR7_Msk  (0x1UL << EXTI_D3PMR1_MR7_Pos) /*!< 0x00000080 */
#define EXTI_D3PMR1_MR7      EXTI_D3PMR1_MR7_Msk            /*!< Pending Mask Event for line 7  */
#define EXTI_D3PMR1_MR8_Pos  (8U)
#define EXTI_D3PMR1_MR8_Msk  (0x1UL << EXTI_D3PMR1_MR8_Pos) /*!< 0x00000100 */
#define EXTI_D3PMR1_MR8      EXTI_D3PMR1_MR8_Msk            /*!< Pending Mask Event for line 8  */
#define EXTI_D3PMR1_MR9_Pos  (9U)
#define EXTI_D3PMR1_MR9_Msk  (0x1UL << EXTI_D3PMR1_MR9_Pos) /*!< 0x00000200 */
#define EXTI_D3PMR1_MR9      EXTI_D3PMR1_MR9_Msk            /*!< Pending Mask Event for line 9  */
#define EXTI_D3PMR1_MR10_Pos (10U)
#define EXTI_D3PMR1_MR10_Msk (0x1UL << EXTI_D3PMR1_MR10_Pos) /*!< 0x00000400 */
#define EXTI_D3PMR1_MR10     EXTI_D3PMR1_MR10_Msk            /*!< Pending Mask Event for line 10 */
#define EXTI_D3PMR1_MR11_Pos (11U)
#define EXTI_D3PMR1_MR11_Msk (0x1UL << EXTI_D3PMR1_MR11_Pos) /*!< 0x00000800 */
#define EXTI_D3PMR1_MR11     EXTI_D3PMR1_MR11_Msk            /*!< Pending Mask Event for line 11 */
#define EXTI_D3PMR1_MR12_Pos (12U)
#define EXTI_D3PMR1_MR12_Msk (0x1UL << EXTI_D3PMR1_MR12_Pos) /*!< 0x00001000 */
#define EXTI_D3PMR1_MR12     EXTI_D3PMR1_MR12_Msk            /*!< Pending Mask Event for line 12 */
#define EXTI_D3PMR1_MR13_Pos (13U)
#define EXTI_D3PMR1_MR13_Msk (0x1UL << EXTI_D3PMR1_MR13_Pos) /*!< 0x00002000 */
#define EXTI_D3PMR1_MR13     EXTI_D3PMR1_MR13_Msk            /*!< Pending Mask Event for line 13 */
#define EXTI_D3PMR1_MR14_Pos (14U)
#define EXTI_D3PMR1_MR14_Msk (0x1UL << EXTI_D3PMR1_MR14_Pos) /*!< 0x00004000 */
#define EXTI_D3PMR1_MR14     EXTI_D3PMR1_MR14_Msk            /*!< Pending Mask Event for line 14 */
#define EXTI_D3PMR1_MR15_Pos (15U)
#define EXTI_D3PMR1_MR15_Msk (0x1UL << EXTI_D3PMR1_MR15_Pos) /*!< 0x00008000 */
#define EXTI_D3PMR1_MR15     EXTI_D3PMR1_MR15_Msk            /*!< Pending Mask Event for line 15 */
#define EXTI_D3PMR1_MR19_Pos (19U)
#define EXTI_D3PMR1_MR19_Msk (0x1UL << EXTI_D3PMR1_MR19_Pos) /*!< 0x00080000 */
#define EXTI_D3PMR1_MR19     EXTI_D3PMR1_MR19_Msk            /*!< Pending Mask Event for line 19 */
#define EXTI_D3PMR1_MR20_Pos (20U)
#define EXTI_D3PMR1_MR20_Msk (0x1UL << EXTI_D3PMR1_MR20_Pos) /*!< 0x00100000 */
#define EXTI_D3PMR1_MR20     EXTI_D3PMR1_MR20_Msk            /*!< Pending Mask Event for line 20 */
#define EXTI_D3PMR1_MR21_Pos (21U)
#define EXTI_D3PMR1_MR21_Msk (0x1UL << EXTI_D3PMR1_MR21_Pos) /*!< 0x00200000 */
#define EXTI_D3PMR1_MR21     EXTI_D3PMR1_MR21_Msk            /*!< Pending Mask Event for line 21 */
#define EXTI_D3PMR1_MR25_Pos (24U)
#define EXTI_D3PMR1_MR25_Msk (0x1UL << EXTI_D3PMR1_MR25_Pos) /*!< 0x01000000 */
#define EXTI_D3PMR1_MR25     EXTI_D3PMR1_MR25_Msk            /*!< Pending Mask Event for line 25 */

