Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for EXTI_D3PCR1L register  ****************/
#define EXTI_D3PCR1L_PCS0_Pos  (0U)
#define EXTI_D3PCR1L_PCS0_Msk  (0x3UL << EXTI_D3PCR1L_PCS0_Pos) /*!< 0x00000003 */
#define EXTI_D3PCR1L_PCS0      EXTI_D3PCR1L_PCS0_Msk /*!< D3 Pending request clear input signal selection on line 0 */
#define EXTI_D3PCR1L_PCS1_Pos  (2U)
#define EXTI_D3PCR1L_PCS1_Msk  (0x3UL << EXTI_D3PCR1L_PCS1_Pos) /*!< 0x000000C0 */
#define EXTI_D3PCR1L_PCS1      EXTI_D3PCR1L_PCS1_Msk /*!< D3 Pending request clear input signal selection on line 1 */
#define EXTI_D3PCR1L_PCS2_Pos  (4U)
#define EXTI_D3PCR1L_PCS2_Msk  (0x3UL << EXTI_D3PCR1L_PCS2_Pos) /*!< 0x00000030 */
#define EXTI_D3PCR1L_PCS2      EXTI_D3PCR1L_PCS2_Msk /*!< D3 Pending request clear input signal selection on line 2 */
#define EXTI_D3PCR1L_PCS3_Pos  (6U)
#define EXTI_D3PCR1L_PCS3_Msk  (0x3UL << EXTI_D3PCR1L_PCS3_Pos) /*!< 0x000000C0 */
#define EXTI_D3PCR1L_PCS3      EXTI_D3PCR1L_PCS3_Msk /*!< D3 Pending request clear input signal selection on line 3 */
#define EXTI_D3PCR1L_PCS4_Pos  (8U)
#define EXTI_D3PCR1L_PCS4_Msk  (0x3UL << EXTI_D3PCR1L_PCS4_Pos) /*!< 0x00000300 */
#define EXTI_D3PCR1L_PCS4      EXTI_D3PCR1L_PCS4_Msk /*!< D3 Pending request clear input signal selection on line 4 */
#define EXTI_D3PCR1L_PCS5_Pos  (10U)
#define EXTI_D3PCR1L_PCS5_Msk  (0x3UL << EXTI_D3PCR1L_PCS5_Pos) /*!< 0x00000C00 */
#define EXTI_D3PCR1L_PCS5      EXTI_D3PCR1L_PCS5_Msk /*!< D3 Pending request clear input signal selection on line 5 */
#define EXTI_D3PCR1L_PCS6_Pos  (12U)
#define EXTI_D3PCR1L_PCS6_Msk  (0x3UL << EXTI_D3PCR1L_PCS6_Pos) /*!< 0x00003000 */
#define EXTI_D3PCR1L_PCS6      EXTI_D3PCR1L_PCS6_Msk /*!< D3 Pending request clear input signal selection on line 6 */
#define EXTI_D3PCR1L_PCS7_Pos  (14U)
#define EXTI_D3PCR1L_PCS7_Msk  (0x3UL << EXTI_D3PCR1L_PCS7_Pos) /*!< 0x0000C000 */
#define EXTI_D3PCR1L_PCS7      EXTI_D3PCR1L_PCS7_Msk /*!< D3 Pending request clear input signal selection on line 7 */
#define EXTI_D3PCR1L_PCS8_Pos  (16U)
#define EXTI_D3PCR1L_PCS8_Msk  (0x3UL << EXTI_D3PCR1L_PCS8_Pos) /*!< 0x00030000 */
#define EXTI_D3PCR1L_PCS8      EXTI_D3PCR1L_PCS8_Msk /*!< D3 Pending request clear input signal selection on line 8 */
#define EXTI_D3PCR1L_PCS9_Pos  (18U)
#define EXTI_D3PCR1L_PCS9_Msk  (0x3UL << EXTI_D3PCR1L_PCS9_Pos) /*!< 0x000C0000 */
#define EXTI_D3PCR1L_PCS9      EXTI_D3PCR1L_PCS9_Msk /*!< D3 Pending request clear input signal selection on line 9 */
#define EXTI_D3PCR1L_PCS10_Pos (20U)
#define EXTI_D3PCR1L_PCS10_Msk (0x3UL << EXTI_D3PCR1L_PCS10_Pos) /*!< 0x00300000 */
#define EXTI_D3PCR1L_PCS10     EXTI_D3PCR1L_PCS10_Msk /*!< D3 Pending request clear input signal selection on line 10*/
#define EXTI_D3PCR1L_PCS11_Pos (22U)
#define EXTI_D3PCR1L_PCS11_Msk (0x3UL << EXTI_D3PCR1L_PCS11_Pos) /*!< 0x00C00000 */
#define EXTI_D3PCR1L_PCS11     EXTI_D3PCR1L_PCS11_Msk /*!< D3 Pending request clear input signal selection on line 11*/
#define EXTI_D3PCR1L_PCS12_Pos (24U)
#define EXTI_D3PCR1L_PCS12_Msk (0x3UL << EXTI_D3PCR1L_PCS12_Pos) /*!< 0x03000000 */
#define EXTI_D3PCR1L_PCS12     EXTI_D3PCR1L_PCS12_Msk /*!< D3 Pending request clear input signal selection on line 12*/
#define EXTI_D3PCR1L_PCS13_Pos (26U)
#define EXTI_D3PCR1L_PCS13_Msk (0x3UL << EXTI_D3PCR1L_PCS13_Pos) /*!< 0x0C000000 */
#define EXTI_D3PCR1L_PCS13     EXTI_D3PCR1L_PCS13_Msk /*!< D3 Pending request clear input signal selection on line 13*/
#define EXTI_D3PCR1L_PCS14_Pos (28U)
#define EXTI_D3PCR1L_PCS14_Msk (0x3UL << EXTI_D3PCR1L_PCS14_Pos) /*!< 0x30000000 */
#define EXTI_D3PCR1L_PCS14     EXTI_D3PCR1L_PCS14_Msk /*!< D3 Pending request clear input signal selection on line 14*/
#define EXTI_D3PCR1L_PCS15_Pos (30U)
#define EXTI_D3PCR1L_PCS15_Msk (0x3UL << EXTI_D3PCR1L_PCS15_Pos) /*!< 0xC0000000 */
#define EXTI_D3PCR1L_PCS15     EXTI_D3PCR1L_PCS15_Msk /*!< D3 Pending request clear input signal selection on line 15*/

/*******************  Bit definition for EXTI_D3PCR1H register  ****************/
#define EXTI_D3PCR1H_PCS19_Pos (6U)
#define EXTI_D3PCR1H_PCS19_Msk (0x3UL << EXTI_D3PCR1H_PCS19_Pos) /*!< 0x000000C0 */
#define EXTI_D3PCR1H_PCS19     EXTI_D3PCR1H_PCS19_Msk /*!< D3 Pending request clear input signal selection on line 19 */
#define EXTI_D3PCR1H_PCS20_Pos (8U)
#define EXTI_D3PCR1H_PCS20_Msk (0x3UL << EXTI_D3PCR1H_PCS20_Pos) /*!< 0x00000300 */
#define EXTI_D3PCR1H_PCS20     EXTI_D3PCR1H_PCS20_Msk /*!< D3 Pending request clear input signal selection on line 20 */
#define EXTI_D3PCR1H_PCS21_Pos (10U)
#define EXTI_D3PCR1H_PCS21_Msk (0x3UL << EXTI_D3PCR1H_PCS21_Pos) /*!< 0x00000C00 */
#define EXTI_D3PCR1H_PCS21     EXTI_D3PCR1H_PCS21_Msk /*!< D3 Pending request clear input signal selection on line 21 */
#define EXTI_D3PCR1H_PCS25_Pos (18U)
#define EXTI_D3PCR1H_PCS25_Msk (0x3UL << EXTI_D3PCR1H_PCS25_Pos) /*!< 0x000C0000 */
#define EXTI_D3PCR1H_PCS25     EXTI_D3PCR1H_PCS25_Msk /*!< D3 Pending request clear input signal selection on line 25 */

/******************  Bit definition for EXTI_RTSR2 register  *******************/
#define EXTI_RTSR2_TR_Pos   (17U)
#define EXTI_RTSR2_TR_Msk   (0x5UL << EXTI_RTSR2_TR_Pos) /*!< 0x000A0000 */
#define EXTI_RTSR2_TR       EXTI_RTSR2_TR_Msk            /*!< Rising trigger event configuration bit */
#define EXTI_RTSR2_TR49_Pos (17U)
#define EXTI_RTSR2_TR49_Msk (0x1UL << EXTI_RTSR2_TR49_Pos) /*!< 0x00020000 */
#define EXTI_RTSR2_TR49     EXTI_RTSR2_TR49_Msk            /*!< Rising trigger event configuration bit of line 49 */
#define EXTI_RTSR2_TR51_Pos (19U)
#define EXTI_RTSR2_TR51_Msk (0x1UL << EXTI_RTSR2_TR51_Pos) /*!< 0x00080000 */
#define EXTI_RTSR2_TR51     EXTI_RTSR2_TR51_Msk            /*!< Rising trigger event configuration bit of line 51 */

/******************  Bit definition for EXTI_FTSR2 register  *******************/
#define EXTI_FTSR2_TR_Pos   (17U)
#define EXTI_FTSR2_TR_Msk   (0x5UL << EXTI_FTSR2_TR_Pos) /*!< 0x000A0000 */
#define EXTI_FTSR2_TR       EXTI_FTSR2_TR_Msk            /*!< Falling trigger event configuration bit */
#define EXTI_FTSR2_TR49_Pos (17U)
#define EXTI_FTSR2_TR49_Msk (0x1UL << EXTI_FTSR2_TR49_Pos) /*!< 0x00020000 */
#define EXTI_FTSR2_TR49     EXTI_FTSR2_TR49_Msk            /*!< Falling trigger event configuration bit of line 49 */
#define EXTI_FTSR2_TR51_Pos (19U)
#define EXTI_FTSR2_TR51_Msk (0x1UL << EXTI_FTSR2_TR51_Pos) /*!< 0x00080000 */
#define EXTI_FTSR2_TR51     EXTI_FTSR2_TR51_Msk            /*!< Falling trigger event configuration bit of line 51 */

