Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/******************  Bit definition for EXTI_SWIER2 register  ******************/
#define EXTI_SWIER2_SWIER49_Pos (17U)
#define EXTI_SWIER2_SWIER49_Msk (0x1UL << EXTI_SWIER2_SWIER49_Pos) /*!< 0x00020000 */
#define EXTI_SWIER2_SWIER49     EXTI_SWIER2_SWIER49_Msk            /*!< Software Interrupt on line 49 */
#define EXTI_SWIER2_SWIER51_Pos (19U)
#define EXTI_SWIER2_SWIER51_Msk (0x1UL << EXTI_SWIER2_SWIER51_Pos) /*!< 0x00080000 */
#define EXTI_SWIER2_SWIER51     EXTI_SWIER2_SWIER51_Msk            /*!< Software Interrupt on line 51 */

/******************  Bit definition for EXTI_D3PMR2 register  ******************/
#define EXTI_D3PMR2_MR34_Pos (2U)
#define EXTI_D3PMR2_MR34_Msk (0x1UL << EXTI_D3PMR2_MR34_Pos) /*!< 0x00000004 */
#define EXTI_D3PMR2_MR34     EXTI_D3PMR2_MR34_Msk            /*!< Pending Mask Event for line 34  */
#define EXTI_D3PMR2_MR35_Pos (3U)
#define EXTI_D3PMR2_MR35_Msk (0x1UL << EXTI_D3PMR2_MR35_Pos) /*!< 0x00000008 */
#define EXTI_D3PMR2_MR35     EXTI_D3PMR2_MR35_Msk            /*!< Pending Mask Event for line 35  */
#define EXTI_D3PMR2_MR41_Pos (9U)
#define EXTI_D3PMR2_MR41_Msk (0x1UL << EXTI_D3PMR2_MR41_Pos) /*!< 0x00000200 */
#define EXTI_D3PMR2_MR41     EXTI_D3PMR2_MR41_Msk            /*!< Pending Mask Event for line 41  */
#define EXTI_D3PMR2_MR48_Pos (16U)
#define EXTI_D3PMR2_MR48_Msk (0x1UL << EXTI_D3PMR2_MR48_Pos) /*!< 0x00010000 */
#define EXTI_D3PMR2_MR48     EXTI_D3PMR2_MR48_Msk            /*!< Pending Mask Event for line 48  */
#define EXTI_D3PMR2_MR49_Pos (17U)
#define EXTI_D3PMR2_MR49_Msk (0x1UL << EXTI_D3PMR2_MR49_Pos) /*!< 0x00020000 */
#define EXTI_D3PMR2_MR49     EXTI_D3PMR2_MR49_Msk            /*!< Pending Mask Event for line 49  */
#define EXTI_D3PMR2_MR50_Pos (18U)
#define EXTI_D3PMR2_MR50_Msk (0x1UL << EXTI_D3PMR2_MR50_Pos) /*!< 0x00040000 */
#define EXTI_D3PMR2_MR50     EXTI_D3PMR2_MR50_Msk            /*!< Pending Mask Event for line 50  */
#define EXTI_D3PMR2_MR51_Pos (19U)
#define EXTI_D3PMR2_MR51_Msk (0x1UL << EXTI_D3PMR2_MR51_Pos) /*!< 0x00080000 */
#define EXTI_D3PMR2_MR51     EXTI_D3PMR2_MR51_Msk            /*!< Pending Mask Event for line 51  */
/*******************  Bit definition for EXTI_D3PCR2L register  ****************/
#define EXTI_D3PCR2L_PCS34_Pos (4U)
#define EXTI_D3PCR2L_PCS34_Msk (0x3UL << EXTI_D3PCR2L_PCS34_Pos) /*!< 0x00000030 */
#define EXTI_D3PCR2L_PCS34     EXTI_D3PCR2L_PCS34_Msk /*!< D3 Pending request clear input signal selection on line 34 */
#define EXTI_D3PCR2L_PCS35_Pos (6U)
#define EXTI_D3PCR2L_PCS35_Msk (0x3UL << EXTI_D3PCR2L_PCS35_Pos) /*!< 0x000000C0 */
#define EXTI_D3PCR2L_PCS35     EXTI_D3PCR2L_PCS35_Msk /*!< D3 Pending request clear input signal selection on line 35 */
#define EXTI_D3PCR2L_PCS41_Pos (18U)
#define EXTI_D3PCR2L_PCS41_Msk (0x3UL << EXTI_D3PCR2L_PCS41_Pos) /*!< 0x000C0000 */
#define EXTI_D3PCR2L_PCS41     EXTI_D3PCR2L_PCS41_Msk /*!< D3 Pending request clear input signal selection on line 41 */

/*******************  Bit definition for EXTI_D3PCR2H register  ****************/
#define EXTI_D3PCR2H_PCS48_Pos (0U)
#define EXTI_D3PCR2H_PCS48_Msk (0x3UL << EXTI_D3PCR2H_PCS48_Pos) /*!< 0x00000003 */
#define EXTI_D3PCR2H_PCS48     EXTI_D3PCR2H_PCS48_Msk /*!< D3 Pending request clear input signal selection on line 48 */
#define EXTI_D3PCR2H_PCS49_Pos (2U)
#define EXTI_D3PCR2H_PCS49_Msk (0x3UL << EXTI_D3PCR2H_PCS49_Pos) /*!< 0x0000000C */
#define EXTI_D3PCR2H_PCS49     EXTI_D3PCR2H_PCS49_Msk /*!< D3 Pending request clear input signal selection on line 49 */
#define EXTI_D3PCR2H_PCS50_Pos (4U)
#define EXTI_D3PCR2H_PCS50_Msk (0x3UL << EXTI_D3PCR2H_PCS50_Pos) /*!< 0x00000030 */
#define EXTI_D3PCR2H_PCS50     EXTI_D3PCR2H_PCS50_Msk /*!< D3 Pending request clear input signal selection on line 50 */
#define EXTI_D3PCR2H_PCS51_Pos (6U)
#define EXTI_D3PCR2H_PCS51_Msk (0x3UL << EXTI_D3PCR2H_PCS51_Pos) /*!< 0x000000C0 */
#define EXTI_D3PCR2H_PCS51     EXTI_D3PCR2H_PCS51_Msk /*!< D3 Pending request clear input signal selection on line 51 */
/******************  Bit definition for EXTI_RTSR3 register  *******************/
#define EXTI_RTSR3_TR_Pos   (18U)
#define EXTI_RTSR3_TR_Msk   (0x9UL << EXTI_RTSR3_TR_Pos) /*!< 0x00240000 */
#define EXTI_RTSR3_TR       EXTI_RTSR3_TR_Msk            /*!< Rising trigger event configuration bit            */
#define EXTI_RTSR3_TR82_Pos (18U)
#define EXTI_RTSR3_TR82_Msk (0x1UL << EXTI_RTSR3_TR82_Pos) /*!< 0x00040000 */
#define EXTI_RTSR3_TR82     EXTI_RTSR3_TR82_Msk            /*!< Rising trigger event configuration bit of line 82 */
#define EXTI_RTSR3_TR85_Pos (21U)
#define EXTI_RTSR3_TR85_Msk (0x1UL << EXTI_RTSR3_TR85_Pos) /*!< 0x00200000 */
#define EXTI_RTSR3_TR85     EXTI_RTSR3_TR85_Msk            /*!< Rising trigger event configuration bit of line 85 */

/******************  Bit definition for EXTI_FTSR3 register  *******************/
#define EXTI_FTSR3_TR_Pos   (18U)
#define EXTI_FTSR3_TR_Msk   (0x9UL << EXTI_FTSR3_TR_Pos) /*!< 0x00240000 */
#define EXTI_FTSR3_TR       EXTI_FTSR3_TR_Msk            /*!< Falling trigger event configuration bit            */
#define EXTI_FTSR3_TR82_Pos (18U)
#define EXTI_FTSR3_TR82_Msk (0x1UL << EXTI_FTSR3_TR82_Pos) /*!< 0x00040000 */
#define EXTI_FTSR3_TR82     EXTI_FTSR3_TR82_Msk            /*!< Falling trigger event configuration bit of line 82 */
#define EXTI_FTSR3_TR85_Pos (21U)
#define EXTI_FTSR3_TR85_Msk (0x1UL << EXTI_FTSR3_TR85_Pos) /*!< 0x00200000 */
#define EXTI_FTSR3_TR85     EXTI_FTSR3_TR85_Msk            /*!< Falling trigger event configuration bit of line 85 */

/******************  Bit definition for EXTI_SWIER3 register  ******************/
#define EXTI_SWIER3_SWI_Pos     (18U)
#define EXTI_SWIER3_SWI_Msk     (0x9UL << EXTI_SWIER3_SWI_Pos) /*!< 0x00240000 */
#define EXTI_SWIER3_SWI         EXTI_SWIER3_SWI_Msk            /*!< Software Interrupt event bit */
#define EXTI_SWIER3_SWIER82_Pos (18U)
#define EXTI_SWIER3_SWIER82_Msk (0x1UL << EXTI_SWIER3_SWIER82_Pos) /*!< 0x00040000 */
#define EXTI_SWIER3_SWIER82     EXTI_SWIER3_SWIER82_Msk            /*!< Software Interrupt on line 82 */
#define EXTI_SWIER3_SWIER85_Pos (21U)
#define EXTI_SWIER3_SWIER85_Msk (0x1UL << EXTI_SWIER3_SWIER85_Pos) /*!< 0x00200000 */
#define EXTI_SWIER3_SWIER85     EXTI_SWIER3_SWIER85_Msk            /*!< Software Interrupt on line 85 */

