Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/******************  Bit definition for EXTI_D3PMR3 register  ******************/
#define EXTI_D3PMR3_MR88_Pos (24U)
#define EXTI_D3PMR3_MR88_Msk (0x1UL << EXTI_D3PMR3_MR88_Pos) /*!< 0x01000000 */
#define EXTI_D3PMR3_MR88     EXTI_D3PMR3_MR88_Msk            /*!< Pending Mask Event for line 88  */

/*******************  Bit definition for EXTI_D3PCR3H register  ****************/
#define EXTI_D3PCR3H_PCS88_Pos (16U)
#define EXTI_D3PCR3H_PCS88_Msk (0x3UL << EXTI_D3PCR3H_PCS88_Pos) /*!< 0x00030000 */
#define EXTI_D3PCR3H_PCS88     EXTI_D3PCR3H_PCS88_Msk /*!< D3 Pending request clear input signal selection on line 88 */

/*******************  Bit definition for EXTI_IMR1 register  *******************/
#define EXTI_IMR1_IM_Pos   (0U)
#define EXTI_IMR1_IM_Msk   (0xFFFFFFFFUL << EXTI_IMR1_IM_Pos) /*!< 0xFFFFFFFF */
#define EXTI_IMR1_IM       EXTI_IMR1_IM_Msk                   /*!< Interrupt Mask */
#define EXTI_IMR1_IM0_Pos  (0U)
#define EXTI_IMR1_IM0_Msk  (0x1UL << EXTI_IMR1_IM0_Pos) /*!< 0x00000001 */
#define EXTI_IMR1_IM0      EXTI_IMR1_IM0_Msk            /*!< Interrupt Mask on line 0 */
#define EXTI_IMR1_IM1_Pos  (1U)
#define EXTI_IMR1_IM1_Msk  (0x1UL << EXTI_IMR1_IM1_Pos) /*!< 0x00000002 */
#define EXTI_IMR1_IM1      EXTI_IMR1_IM1_Msk            /*!< Interrupt Mask on line 1 */
#define EXTI_IMR1_IM2_Pos  (2U)
#define EXTI_IMR1_IM2_Msk  (0x1UL << EXTI_IMR1_IM2_Pos) /*!< 0x00000004 */
#define EXTI_IMR1_IM2      EXTI_IMR1_IM2_Msk            /*!< Interrupt Mask on line 2 */
#define EXTI_IMR1_IM3_Pos  (3U)
#define EXTI_IMR1_IM3_Msk  (0x1UL << EXTI_IMR1_IM3_Pos) /*!< 0x00000008 */
#define EXTI_IMR1_IM3      EXTI_IMR1_IM3_Msk            /*!< Interrupt Mask on line 3 */
#define EXTI_IMR1_IM4_Pos  (4U)
#define EXTI_IMR1_IM4_Msk  (0x1UL << EXTI_IMR1_IM4_Pos) /*!< 0x00000010 */
#define EXTI_IMR1_IM4      EXTI_IMR1_IM4_Msk            /*!< Interrupt Mask on line 4 */
#define EXTI_IMR1_IM5_Pos  (5U)
#define EXTI_IMR1_IM5_Msk  (0x1UL << EXTI_IMR1_IM5_Pos) /*!< 0x00000020 */
#define EXTI_IMR1_IM5      EXTI_IMR1_IM5_Msk            /*!< Interrupt Mask on line 5 */
#define EXTI_IMR1_IM6_Pos  (6U)
#define EXTI_IMR1_IM6_Msk  (0x1UL << EXTI_IMR1_IM6_Pos) /*!< 0x00000040 */
#define EXTI_IMR1_IM6      EXTI_IMR1_IM6_Msk            /*!< Interrupt Mask on line 6 */
#define EXTI_IMR1_IM7_Pos  (7U)
#define EXTI_IMR1_IM7_Msk  (0x1UL << EXTI_IMR1_IM7_Pos) /*!< 0x00000080 */
#define EXTI_IMR1_IM7      EXTI_IMR1_IM7_Msk            /*!< Interrupt Mask on line 7 */
#define EXTI_IMR1_IM8_Pos  (8U)
#define EXTI_IMR1_IM8_Msk  (0x1UL << EXTI_IMR1_IM8_Pos) /*!< 0x00000100 */
#define EXTI_IMR1_IM8      EXTI_IMR1_IM8_Msk            /*!< Interrupt Mask on line 8 */
#define EXTI_IMR1_IM9_Pos  (9U)
#define EXTI_IMR1_IM9_Msk  (0x1UL << EXTI_IMR1_IM9_Pos) /*!< 0x00000200 */
#define EXTI_IMR1_IM9      EXTI_IMR1_IM9_Msk            /*!< Interrupt Mask on line 9 */
#define EXTI_IMR1_IM10_Pos (10U)
#define EXTI_IMR1_IM10_Msk (0x1UL << EXTI_IMR1_IM10_Pos) /*!< 0x00000400 */
#define EXTI_IMR1_IM10     EXTI_IMR1_IM10_Msk            /*!< Interrupt Mask on line 10 */
#define EXTI_IMR1_IM11_Pos (11U)
#define EXTI_IMR1_IM11_Msk (0x1UL << EXTI_IMR1_IM11_Pos) /*!< 0x00000800 */
#define EXTI_IMR1_IM11     EXTI_IMR1_IM11_Msk            /*!< Interrupt Mask on line 11 */
#define EXTI_IMR1_IM12_Pos (12U)
#define EXTI_IMR1_IM12_Msk (0x1UL << EXTI_IMR1_IM12_Pos) /*!< 0x00001000 */
#define EXTI_IMR1_IM12     EXTI_IMR1_IM12_Msk            /*!< Interrupt Mask on line 12 */
#define EXTI_IMR1_IM13_Pos (13U)
#define EXTI_IMR1_IM13_Msk (0x1UL << EXTI_IMR1_IM13_Pos) /*!< 0x00002000 */
#define EXTI_IMR1_IM13     EXTI_IMR1_IM13_Msk            /*!< Interrupt Mask on line 13 */
#define EXTI_IMR1_IM14_Pos (14U)
#define EXTI_IMR1_IM14_Msk (0x1UL << EXTI_IMR1_IM14_Pos) /*!< 0x00004000 */
#define EXTI_IMR1_IM14     EXTI_IMR1_IM14_Msk            /*!< Interrupt Mask on line 14 */
#define EXTI_IMR1_IM15_Pos (15U)
#define EXTI_IMR1_IM15_Msk (0x1UL << EXTI_IMR1_IM15_Pos) /*!< 0x00008000 */
#define EXTI_IMR1_IM15     EXTI_IMR1_IM15_Msk            /*!< Interrupt Mask on line 15 */
#define EXTI_IMR1_IM16_Pos (16U)
#define EXTI_IMR1_IM16_Msk (0x1UL << EXTI_IMR1_IM16_Pos) /*!< 0x00010000 */
#define EXTI_IMR1_IM16     EXTI_IMR1_IM16_Msk            /*!< Interrupt Mask on line 16 */
#define EXTI_IMR1_IM17_Pos (17U)
#define EXTI_IMR1_IM17_Msk (0x1UL << EXTI_IMR1_IM17_Pos) /*!< 0x00020000 */
#define EXTI_IMR1_IM17     EXTI_IMR1_IM17_Msk            /*!< Interrupt Mask on line 17 */
#define EXTI_IMR1_IM18_Pos (18U)
#define EXTI_IMR1_IM18_Msk (0x1UL << EXTI_IMR1_IM18_Pos) /*!< 0x00040000 */
#define EXTI_IMR1_IM18     EXTI_IMR1_IM18_Msk            /*!< Interrupt Mask on line 18 */
#define EXTI_IMR1_IM19_Pos (19U)
#define EXTI_IMR1_IM19_Msk (0x1UL << EXTI_IMR1_IM19_Pos) /*!< 0x00080000 */
#define EXTI_IMR1_IM19     EXTI_IMR1_IM19_Msk            /*!< Interrupt Mask on line 19 */
#define EXTI_IMR1_IM20_Pos (20U)
#define EXTI_IMR1_IM20_Msk (0x1UL << EXTI_IMR1_IM20_Pos) /*!< 0x00100000 */
#define EXTI_IMR1_IM20     EXTI_IMR1_IM20_Msk            /*!< Interrupt Mask on line 20 */
#define EXTI_IMR1_IM21_Pos (21U)
#define EXTI_IMR1_IM21_Msk (0x1UL << EXTI_IMR1_IM21_Pos) /*!< 0x00200000 */
#define EXTI_IMR1_IM21     EXTI_IMR1_IM21_Msk            /*!< Interrupt Mask on line 21 */
#define EXTI_IMR1_IM22_Pos (22U)
#define EXTI_IMR1_IM22_Msk (0x1UL << EXTI_IMR1_IM22_Pos) /*!< 0x00400000 */
#define EXTI_IMR1_IM22     EXTI_IMR1_IM22_Msk            /*!< Interrupt Mask on line 22 */
#define EXTI_IMR1_IM23_Pos (23U)
#define EXTI_IMR1_IM23_Msk (0x1UL << EXTI_IMR1_IM23_Pos) /*!< 0x00800000 */
#define EXTI_IMR1_IM23     EXTI_IMR1_IM23_Msk            /*!< Interrupt Mask on line 23 */
#define EXTI_IMR1_IM24_Pos (24U)
#define EXTI_IMR1_IM24_Msk (0x1UL << EXTI_IMR1_IM24_Pos) /*!< 0x01000000 */
#define EXTI_IMR1_IM24     EXTI_IMR1_IM24_Msk            /*!< Interrupt Mask on line 24 */
#define EXTI_IMR1_IM25_Pos (25U)
#define EXTI_IMR1_IM25_Msk (0x1UL << EXTI_IMR1_IM25_Pos) /*!< 0x02000000 */
#define EXTI_IMR1_IM25     EXTI_IMR1_IM25_Msk            /*!< Interrupt Mask on line 25 */
#define EXTI_IMR1_IM26_Pos (26U)
#define EXTI_IMR1_IM26_Msk (0x1UL << EXTI_IMR1_IM26_Pos) /*!< 0x04000000 */
#define EXTI_IMR1_IM26     EXTI_IMR1_IM26_Msk            /*!< Interrupt Mask on line 26 */
#define EXTI_IMR1_IM27_Pos (27U)
#define EXTI_IMR1_IM27_Msk (0x1UL << EXTI_IMR1_IM27_Pos) /*!< 0x08000000 */
#define EXTI_IMR1_IM27     EXTI_IMR1_IM27_Msk            /*!< Interrupt Mask on line 27 */
#define EXTI_IMR1_IM28_Pos (28U)
#define EXTI_IMR1_IM28_Msk (0x1UL << EXTI_IMR1_IM28_Pos) /*!< 0x10000000 */
#define EXTI_IMR1_IM28     EXTI_IMR1_IM28_Msk            /*!< Interrupt Mask on line 28 */
#define EXTI_IMR1_IM29_Pos (29U)
#define EXTI_IMR1_IM29_Msk (0x1UL << EXTI_IMR1_IM29_Pos) /*!< 0x20000000 */
#define EXTI_IMR1_IM29     EXTI_IMR1_IM29_Msk            /*!< Interrupt Mask on line 29 */
#define EXTI_IMR1_IM30_Pos (30U)
#define EXTI_IMR1_IM30_Msk (0x1UL << EXTI_IMR1_IM30_Pos) /*!< 0x40000000 */
#define EXTI_IMR1_IM30     EXTI_IMR1_IM30_Msk            /*!< Interrupt Mask on line 30 */
#define EXTI_IMR1_IM31_Pos (31U)
#define EXTI_IMR1_IM31_Msk (0x1UL << EXTI_IMR1_IM31_Pos) /*!< 0x80000000 */
#define EXTI_IMR1_IM31     EXTI_IMR1_IM31_Msk            /*!< Interrupt Mask on line 31 */

/*******************  Bit definition for EXTI_EMR1 register  *******************/
#define EXTI_EMR1_EM_Pos   (0U)
#define EXTI_EMR1_EM_Msk   (0xFFFFFFFFUL << EXTI_EMR1_EM_Pos) /*!< 0xFFFFFFFF */
#define EXTI_EMR1_EM       EXTI_EMR1_EM_Msk                   /*!< Event Mask */
#define EXTI_EMR1_EM0_Pos  (0U)
#define EXTI_EMR1_EM0_Msk  (0x1UL << EXTI_EMR1_EM0_Pos) /*!< 0x00000001 */
#define EXTI_EMR1_EM0      EXTI_EMR1_EM0_Msk            /*!< Event Mask on line 0 */
#define EXTI_EMR1_EM1_Pos  (1U)
#define EXTI_EMR1_EM1_Msk  (0x1UL << EXTI_EMR1_EM1_Pos) /*!< 0x00000002 */
#define EXTI_EMR1_EM1      EXTI_EMR1_EM1_Msk            /*!< Event Mask on line 1 */
#define EXTI_EMR1_EM2_Pos  (2U)
#define EXTI_EMR1_EM2_Msk  (0x1UL << EXTI_EMR1_EM2_Pos) /*!< 0x00000004 */
#define EXTI_EMR1_EM2      EXTI_EMR1_EM2_Msk            /*!< Event Mask on line 2 */
#define EXTI_EMR1_EM3_Pos  (3U)
#define EXTI_EMR1_EM3_Msk  (0x1UL << EXTI_EMR1_EM3_Pos) /*!< 0x00000008 */
#define EXTI_EMR1_EM3      EXTI_EMR1_EM3_Msk            /*!< Event Mask on line 3 */
#define EXTI_EMR1_EM4_Pos  (4U)
#define EXTI_EMR1_EM4_Msk  (0x1UL << EXTI_EMR1_EM4_Pos) /*!< 0x00000010 */
#define EXTI_EMR1_EM4      EXTI_EMR1_EM4_Msk            /*!< Event Mask on line 4 */
#define EXTI_EMR1_EM5_Pos  (5U)
#define EXTI_EMR1_EM5_Msk  (0x1UL << EXTI_EMR1_EM5_Pos) /*!< 0x00000020 */
#define EXTI_EMR1_EM5      EXTI_EMR1_EM5_Msk            /*!< Event Mask on line 5 */
#define EXTI_EMR1_EM6_Pos  (6U)
#define EXTI_EMR1_EM6_Msk  (0x1UL << EXTI_EMR1_EM6_Pos) /*!< 0x00000040 */
#define EXTI_EMR1_EM6      EXTI_EMR1_EM6_Msk            /*!< Event Mask on line 6 */
#define EXTI_EMR1_EM7_Pos  (7U)
#define EXTI_EMR1_EM7_Msk  (0x1UL << EXTI_EMR1_EM7_Pos) /*!< 0x00000080 */
#define EXTI_EMR1_EM7      EXTI_EMR1_EM7_Msk            /*!< Event Mask on line 7 */
#define EXTI_EMR1_EM8_Pos  (8U)
#define EXTI_EMR1_EM8_Msk  (0x1UL << EXTI_EMR1_EM8_Pos) /*!< 0x00000100 */
#define EXTI_EMR1_EM8      EXTI_EMR1_EM8_Msk            /*!< Event Mask on line 8 */
#define EXTI_EMR1_EM9_Pos  (9U)
#define EXTI_EMR1_EM9_Msk  (0x1UL << EXTI_EMR1_EM9_Pos) /*!< 0x00000200 */
#define EXTI_EMR1_EM9      EXTI_EMR1_EM9_Msk            /*!< Event Mask on line 9 */
#define EXTI_EMR1_EM10_Pos (10U)
#define EXTI_EMR1_EM10_Msk (0x1UL << EXTI_EMR1_EM10_Pos) /*!< 0x00000400 */
#define EXTI_EMR1_EM10     EXTI_EMR1_EM10_Msk            /*!< Event Mask on line 10 */
#define EXTI_EMR1_EM11_Pos (11U)
#define EXTI_EMR1_EM11_Msk (0x1UL << EXTI_EMR1_EM11_Pos) /*!< 0x00000800 */
#define EXTI_EMR1_EM11     EXTI_EMR1_EM11_Msk            /*!< Event Mask on line 11 */
#define EXTI_EMR1_EM12_Pos (12U)
#define EXTI_EMR1_EM12_Msk (0x1UL << EXTI_EMR1_EM12_Pos) /*!< 0x00001000 */
#define EXTI_EMR1_EM12     EXTI_EMR1_EM12_Msk            /*!< Event Mask on line 12 */
#define EXTI_EMR1_EM13_Pos (13U)
#define EXTI_EMR1_EM13_Msk (0x1UL << EXTI_EMR1_EM13_Pos) /*!< 0x00002000 */
#define EXTI_EMR1_EM13     EXTI_EMR1_EM13_Msk            /*!< Event Mask on line 13 */
#define EXTI_EMR1_EM14_Pos (14U)
#define EXTI_EMR1_EM14_Msk (0x1UL << EXTI_EMR1_EM14_Pos) /*!< 0x00004000 */
#define EXTI_EMR1_EM14     EXTI_EMR1_EM14_Msk            /*!< Event Mask on line 14 */
#define EXTI_EMR1_EM15_Pos (15U)
#define EXTI_EMR1_EM15_Msk (0x1UL << EXTI_EMR1_EM15_Pos) /*!< 0x00008000 */
#define EXTI_EMR1_EM15     EXTI_EMR1_EM15_Msk            /*!< Event Mask on line 15 */
#define EXTI_EMR1_EM16_Pos (16U)
#define EXTI_EMR1_EM16_Msk (0x1UL << EXTI_EMR1_EM16_Pos) /*!< 0x00010000 */
#define EXTI_EMR1_EM16     EXTI_EMR1_EM16_Msk            /*!< Event Mask on line 16 */
#define EXTI_EMR1_EM17_Pos (17U)
#define EXTI_EMR1_EM17_Msk (0x1UL << EXTI_EMR1_EM17_Pos) /*!< 0x00020000 */
#define EXTI_EMR1_EM17     EXTI_EMR1_EM17_Msk            /*!< Event Mask on line 17 */
#define EXTI_EMR1_EM18_Pos (18U)
#define EXTI_EMR1_EM18_Msk (0x1UL << EXTI_EMR1_EM18_Pos) /*!< 0x00040000 */
#define EXTI_EMR1_EM18     EXTI_EMR1_EM18_Msk            /*!< Event Mask on line 18 */
#define EXTI_EMR1_EM20_Pos (20U)
#define EXTI_EMR1_EM20_Msk (0x1UL << EXTI_EMR1_EM20_Pos) /*!< 0x00100000 */
#define EXTI_EMR1_EM20     EXTI_EMR1_EM20_Msk            /*!< Event Mask on line 20 */
#define EXTI_EMR1_EM21_Pos (21U)
#define EXTI_EMR1_EM21_Msk (0x1UL << EXTI_EMR1_EM21_Pos) /*!< 0x00200000 */
#define EXTI_EMR1_EM21     EXTI_EMR1_EM21_Msk            /*!< Event Mask on line 21 */
#define EXTI_EMR1_EM22_Pos (22U)
#define EXTI_EMR1_EM22_Msk (0x1UL << EXTI_EMR1_EM22_Pos) /*!< 0x00400000 */
#define EXTI_EMR1_EM22     EXTI_EMR1_EM22_Msk            /*!< Event Mask on line 22 */
#define EXTI_EMR1_EM23_Pos (23U)
#define EXTI_EMR1_EM23_Msk (0x1UL << EXTI_EMR1_EM23_Pos) /*!< 0x00800000 */
#define EXTI_EMR1_EM23     EXTI_EMR1_EM23_Msk            /*!< Event Mask on line 23 */
#define EXTI_EMR1_EM24_Pos (24U)
#define EXTI_EMR1_EM24_Msk (0x1UL << EXTI_EMR1_EM24_Pos) /*!< 0x01000000 */
#define EXTI_EMR1_EM24     EXTI_EMR1_EM24_Msk            /*!< Event Mask on line 24 */
#define EXTI_EMR1_EM25_Pos (25U)
#define EXTI_EMR1_EM25_Msk (0x1UL << EXTI_EMR1_EM25_Pos) /*!< 0x02000000 */
#define EXTI_EMR1_EM25     EXTI_EMR1_EM25_Msk            /*!< Event Mask on line 25 */
#define EXTI_EMR1_EM26_Pos (26U)
#define EXTI_EMR1_EM26_Msk (0x1UL << EXTI_EMR1_EM26_Pos) /*!< 0x04000000 */
#define EXTI_EMR1_EM26     EXTI_EMR1_EM26_Msk            /*!< Event Mask on line 26 */
#define EXTI_EMR1_EM27_Pos (27U)
#define EXTI_EMR1_EM27_Msk (0x1UL << EXTI_EMR1_EM27_Pos) /*!< 0x08000000 */
#define EXTI_EMR1_EM27     EXTI_EMR1_EM27_Msk            /*!< Event Mask on line 27 */
#define EXTI_EMR1_EM28_Pos (28U)
#define EXTI_EMR1_EM28_Msk (0x1UL << EXTI_EMR1_EM28_Pos) /*!< 0x10000000 */
#define EXTI_EMR1_EM28     EXTI_EMR1_EM28_Msk            /*!< Event Mask on line 28 */
#define EXTI_EMR1_EM29_Pos (29U)
#define EXTI_EMR1_EM29_Msk (0x1UL << EXTI_EMR1_EM29_Pos) /*!< 0x20000000 */
#define EXTI_EMR1_EM29     EXTI_EMR1_EM29_Msk            /*!< Event Mask on line 29 */
#define EXTI_EMR1_EM30_Pos (30U)
#define EXTI_EMR1_EM30_Msk (0x1UL << EXTI_EMR1_EM30_Pos) /*!< 0x40000000 */
#define EXTI_EMR1_EM30     EXTI_EMR1_EM30_Msk            /*!< Event Mask on line 30 */
#define EXTI_EMR1_EM31_Pos (31U)
#define EXTI_EMR1_EM31_Msk (0x1UL << EXTI_EMR1_EM31_Pos) /*!< 0x80000000 */
#define EXTI_EMR1_EM31     EXTI_EMR1_EM31_Msk            /*!< Event Mask on line 31 */

