Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for EXTI_PR1 register  ********************/
#define EXTI_PR1_PR_Pos   (0U)
#define EXTI_PR1_PR_Msk   (0x3FFFFFUL << EXTI_PR1_PR_Pos) /*!< 0x003FFFFF */
#define EXTI_PR1_PR       EXTI_PR1_PR_Msk                 /*!< Pending bit */
#define EXTI_PR1_PR0_Pos  (0U)
#define EXTI_PR1_PR0_Msk  (0x1UL << EXTI_PR1_PR0_Pos) /*!< 0x00000001 */
#define EXTI_PR1_PR0      EXTI_PR1_PR0_Msk            /*!< Pending bit for line 0 */
#define EXTI_PR1_PR1_Pos  (1U)
#define EXTI_PR1_PR1_Msk  (0x1UL << EXTI_PR1_PR1_Pos) /*!< 0x00000002 */
#define EXTI_PR1_PR1      EXTI_PR1_PR1_Msk            /*!< Pending bit for line 1 */
#define EXTI_PR1_PR2_Pos  (2U)
#define EXTI_PR1_PR2_Msk  (0x1UL << EXTI_PR1_PR2_Pos) /*!< 0x00000004 */
#define EXTI_PR1_PR2      EXTI_PR1_PR2_Msk            /*!< Pending bit for line 2 */
#define EXTI_PR1_PR3_Pos  (3U)
#define EXTI_PR1_PR3_Msk  (0x1UL << EXTI_PR1_PR3_Pos) /*!< 0x00000008 */
#define EXTI_PR1_PR3      EXTI_PR1_PR3_Msk            /*!< Pending bit for line 3 */
#define EXTI_PR1_PR4_Pos  (4U)
#define EXTI_PR1_PR4_Msk  (0x1UL << EXTI_PR1_PR4_Pos) /*!< 0x00000010 */
#define EXTI_PR1_PR4      EXTI_PR1_PR4_Msk            /*!< Pending bit for line 4 */
#define EXTI_PR1_PR5_Pos  (5U)
#define EXTI_PR1_PR5_Msk  (0x1UL << EXTI_PR1_PR5_Pos) /*!< 0x00000020 */
#define EXTI_PR1_PR5      EXTI_PR1_PR5_Msk            /*!< Pending bit for line 5 */
#define EXTI_PR1_PR6_Pos  (6U)
#define EXTI_PR1_PR6_Msk  (0x1UL << EXTI_PR1_PR6_Pos) /*!< 0x00000040 */
#define EXTI_PR1_PR6      EXTI_PR1_PR6_Msk            /*!< Pending bit for line 6 */
#define EXTI_PR1_PR7_Pos  (7U)
#define EXTI_PR1_PR7_Msk  (0x1UL << EXTI_PR1_PR7_Pos) /*!< 0x00000080 */
#define EXTI_PR1_PR7      EXTI_PR1_PR7_Msk            /*!< Pending bit for line 7 */
#define EXTI_PR1_PR8_Pos  (8U)
#define EXTI_PR1_PR8_Msk  (0x1UL << EXTI_PR1_PR8_Pos) /*!< 0x00000100 */
#define EXTI_PR1_PR8      EXTI_PR1_PR8_Msk            /*!< Pending bit for line 8 */
#define EXTI_PR1_PR9_Pos  (9U)
#define EXTI_PR1_PR9_Msk  (0x1UL << EXTI_PR1_PR9_Pos) /*!< 0x00000200 */
#define EXTI_PR1_PR9      EXTI_PR1_PR9_Msk            /*!< Pending bit for line 9 */
#define EXTI_PR1_PR10_Pos (10U)
#define EXTI_PR1_PR10_Msk (0x1UL << EXTI_PR1_PR10_Pos) /*!< 0x00000400 */
#define EXTI_PR1_PR10     EXTI_PR1_PR10_Msk            /*!< Pending bit for line 10 */
#define EXTI_PR1_PR11_Pos (11U)
#define EXTI_PR1_PR11_Msk (0x1UL << EXTI_PR1_PR11_Pos) /*!< 0x00000800 */
#define EXTI_PR1_PR11     EXTI_PR1_PR11_Msk            /*!< Pending bit for line 11 */
#define EXTI_PR1_PR12_Pos (12U)
#define EXTI_PR1_PR12_Msk (0x1UL << EXTI_PR1_PR12_Pos) /*!< 0x00001000 */
#define EXTI_PR1_PR12     EXTI_PR1_PR12_Msk            /*!< Pending bit for line 12 */
#define EXTI_PR1_PR13_Pos (13U)
#define EXTI_PR1_PR13_Msk (0x1UL << EXTI_PR1_PR13_Pos) /*!< 0x00002000 */
#define EXTI_PR1_PR13     EXTI_PR1_PR13_Msk            /*!< Pending bit for line 13 */
#define EXTI_PR1_PR14_Pos (14U)
#define EXTI_PR1_PR14_Msk (0x1UL << EXTI_PR1_PR14_Pos) /*!< 0x00004000 */
#define EXTI_PR1_PR14     EXTI_PR1_PR14_Msk            /*!< Pending bit for line 14 */
#define EXTI_PR1_PR15_Pos (15U)
#define EXTI_PR1_PR15_Msk (0x1UL << EXTI_PR1_PR15_Pos) /*!< 0x00008000 */
#define EXTI_PR1_PR15     EXTI_PR1_PR15_Msk            /*!< Pending bit for line 15 */
#define EXTI_PR1_PR16_Pos (16U)
#define EXTI_PR1_PR16_Msk (0x1UL << EXTI_PR1_PR16_Pos) /*!< 0x00010000 */
#define EXTI_PR1_PR16     EXTI_PR1_PR16_Msk            /*!< Pending bit for line 16 */
#define EXTI_PR1_PR17_Pos (17U)
#define EXTI_PR1_PR17_Msk (0x1UL << EXTI_PR1_PR17_Pos) /*!< 0x00020000 */
#define EXTI_PR1_PR17     EXTI_PR1_PR17_Msk            /*!< Pending bit for line 17 */
#define EXTI_PR1_PR18_Pos (18U)
#define EXTI_PR1_PR18_Msk (0x1UL << EXTI_PR1_PR18_Pos) /*!< 0x00040000 */
#define EXTI_PR1_PR18     EXTI_PR1_PR18_Msk            /*!< Pending bit for line 18 */
#define EXTI_PR1_PR19_Pos (19U)
#define EXTI_PR1_PR19_Msk (0x1UL << EXTI_PR1_PR19_Pos) /*!< 0x00080000 */
#define EXTI_PR1_PR19     EXTI_PR1_PR19_Msk            /*!< Pending bit for line 19 */
#define EXTI_PR1_PR20_Pos (20U)
#define EXTI_PR1_PR20_Msk (0x1UL << EXTI_PR1_PR20_Pos) /*!< 0x00100000 */
#define EXTI_PR1_PR20     EXTI_PR1_PR20_Msk            /*!< Pending bit for line 20 */
#define EXTI_PR1_PR21_Pos (21U)
#define EXTI_PR1_PR21_Msk (0x1UL << EXTI_PR1_PR21_Pos) /*!< 0x00200000 */
#define EXTI_PR1_PR21     EXTI_PR1_PR21_Msk            /*!< Pending bit for line 21 */

/*******************  Bit definition for EXTI_IMR2 register  *******************/
#define EXTI_IMR2_IM_Pos   (0U)
#define EXTI_IMR2_IM_Msk   (0xFFFF8FFFUL << EXTI_IMR2_IM_Pos) /*!< 0xFFFF8FFF */
#define EXTI_IMR2_IM       EXTI_IMR2_IM_Msk                   /*!< Interrupt Mask            */
#define EXTI_IMR2_IM32_Pos (0U)
#define EXTI_IMR2_IM32_Msk (0x1UL << EXTI_IMR2_IM32_Pos) /*!< 0x00000001 */
#define EXTI_IMR2_IM32     EXTI_IMR2_IM32_Msk            /*!< Interrupt Mask on line 32 */
#define EXTI_IMR2_IM33_Pos (1U)
#define EXTI_IMR2_IM33_Msk (0x1UL << EXTI_IMR2_IM33_Pos) /*!< 0x00000002 */
#define EXTI_IMR2_IM33     EXTI_IMR2_IM33_Msk            /*!< Interrupt Mask on line 33 */
#define EXTI_IMR2_IM34_Pos (2U)
#define EXTI_IMR2_IM34_Msk (0x1UL << EXTI_IMR2_IM34_Pos) /*!< 0x00000004 */
#define EXTI_IMR2_IM34     EXTI_IMR2_IM34_Msk            /*!< Interrupt Mask on line 34 */
#define EXTI_IMR2_IM35_Pos (3U)
#define EXTI_IMR2_IM35_Msk (0x1UL << EXTI_IMR2_IM35_Pos) /*!< 0x00000008 */
#define EXTI_IMR2_IM35     EXTI_IMR2_IM35_Msk            /*!< Interrupt Mask on line 35 */
#define EXTI_IMR2_IM36_Pos (4U)
#define EXTI_IMR2_IM36_Msk (0x1UL << EXTI_IMR2_IM36_Pos) /*!< 0x00000010 */
#define EXTI_IMR2_IM36     EXTI_IMR2_IM36_Msk            /*!< Interrupt Mask on line 36 */
#define EXTI_IMR2_IM37_Pos (5U)
#define EXTI_IMR2_IM37_Msk (0x1UL << EXTI_IMR2_IM37_Pos) /*!< 0x00000020 */
#define EXTI_IMR2_IM37     EXTI_IMR2_IM37_Msk            /*!< Interrupt Mask on line 37 */
#define EXTI_IMR2_IM38_Pos (6U)
#define EXTI_IMR2_IM38_Msk (0x1UL << EXTI_IMR2_IM38_Pos) /*!< 0x00000040 */
#define EXTI_IMR2_IM38     EXTI_IMR2_IM38_Msk            /*!< Interrupt Mask on line 38 */
#define EXTI_IMR2_IM39_Pos (7U)
#define EXTI_IMR2_IM39_Msk (0x1UL << EXTI_IMR2_IM39_Pos) /*!< 0x00000080 */
#define EXTI_IMR2_IM39     EXTI_IMR2_IM39_Msk            /*!< Interrupt Mask on line 39 */
#define EXTI_IMR2_IM40_Pos (8U)
#define EXTI_IMR2_IM40_Msk (0x1UL << EXTI_IMR2_IM40_Pos) /*!< 0x00000100 */
#define EXTI_IMR2_IM40     EXTI_IMR2_IM40_Msk            /*!< Interrupt Mask on line 40 */
#define EXTI_IMR2_IM41_Pos (9U)
#define EXTI_IMR2_IM41_Msk (0x1UL << EXTI_IMR2_IM41_Pos) /*!< 0x00000200 */
#define EXTI_IMR2_IM41     EXTI_IMR2_IM41_Msk            /*!< Interrupt Mask on line 41 */
#define EXTI_IMR2_IM42_Pos (10U)
#define EXTI_IMR2_IM42_Msk (0x1UL << EXTI_IMR2_IM42_Pos) /*!< 0x00000400 */
#define EXTI_IMR2_IM42     EXTI_IMR2_IM42_Msk            /*!< Interrupt Mask on line 42 */
#define EXTI_IMR2_IM43_Pos (11U)
#define EXTI_IMR2_IM43_Msk (0x1UL << EXTI_IMR2_IM43_Pos) /*!< 0x00000800 */
#define EXTI_IMR2_IM43     EXTI_IMR2_IM43_Msk            /*!< Interrupt Mask on line 43 */
#define EXTI_IMR2_IM47_Pos (15U)
#define EXTI_IMR2_IM47_Msk (0x1UL << EXTI_IMR2_IM47_Pos) /*!< 0x00008000 */
#define EXTI_IMR2_IM47     EXTI_IMR2_IM47_Msk            /*!< Interrupt Mask on line 47 */
#define EXTI_IMR2_IM48_Pos (16U)
#define EXTI_IMR2_IM48_Msk (0x1UL << EXTI_IMR2_IM48_Pos) /*!< 0x00010000 */
#define EXTI_IMR2_IM48     EXTI_IMR2_IM48_Msk            /*!< Interrupt Mask on line 48 */
#define EXTI_IMR2_IM49_Pos (17U)
#define EXTI_IMR2_IM49_Msk (0x1UL << EXTI_IMR2_IM49_Pos) /*!< 0x00020000 */
#define EXTI_IMR2_IM49     EXTI_IMR2_IM49_Msk            /*!< Interrupt Mask on line 49 */
#define EXTI_IMR2_IM50_Pos (18U)
#define EXTI_IMR2_IM50_Msk (0x1UL << EXTI_IMR2_IM50_Pos) /*!< 0x00040000 */
#define EXTI_IMR2_IM50     EXTI_IMR2_IM50_Msk            /*!< Interrupt Mask on line 50 */
#define EXTI_IMR2_IM51_Pos (19U)
#define EXTI_IMR2_IM51_Msk (0x1UL << EXTI_IMR2_IM51_Pos) /*!< 0x00080000 */
#define EXTI_IMR2_IM51     EXTI_IMR2_IM51_Msk            /*!< Interrupt Mask on line 51 */
#define EXTI_IMR2_IM52_Pos (20U)
#define EXTI_IMR2_IM52_Msk (0x1UL << EXTI_IMR2_IM52_Pos) /*!< 0x00100000 */
#define EXTI_IMR2_IM52     EXTI_IMR2_IM52_Msk            /*!< Interrupt Mask on line 52 */
#define EXTI_IMR2_IM53_Pos (21U)
#define EXTI_IMR2_IM53_Msk (0x1UL << EXTI_IMR2_IM53_Pos) /*!< 0x00200000 */
#define EXTI_IMR2_IM53     EXTI_IMR2_IM53_Msk            /*!< Interrupt Mask on line 53 */
#define EXTI_IMR2_IM54_Pos (22U)
#define EXTI_IMR2_IM54_Msk (0x1UL << EXTI_IMR2_IM54_Pos) /*!< 0x00400000 */
#define EXTI_IMR2_IM54     EXTI_IMR2_IM54_Msk            /*!< Interrupt Mask on line 54 */
#define EXTI_IMR2_IM55_Pos (23U)
#define EXTI_IMR2_IM55_Msk (0x1UL << EXTI_IMR2_IM55_Pos) /*!< 0x00800000 */
#define EXTI_IMR2_IM55     EXTI_IMR2_IM55_Msk            /*!< Interrupt Mask on line 55 */
#define EXTI_IMR2_IM56_Pos (24U)
#define EXTI_IMR2_IM56_Msk (0x1UL << EXTI_IMR2_IM56_Pos) /*!< 0x01000000 */
#define EXTI_IMR2_IM56     EXTI_IMR2_IM56_Msk            /*!< Interrupt Mask on line 56 */
#define EXTI_IMR2_IM57_Pos (25U)
#define EXTI_IMR2_IM57_Msk (0x1UL << EXTI_IMR2_IM57_Pos) /*!< 0x02000000 */
#define EXTI_IMR2_IM57     EXTI_IMR2_IM57_Msk            /*!< Interrupt Mask on line 57 */
#define EXTI_IMR2_IM58_Pos (26U)
#define EXTI_IMR2_IM58_Msk (0x1UL << EXTI_IMR2_IM58_Pos) /*!< 0x04000000 */
#define EXTI_IMR2_IM58     EXTI_IMR2_IM58_Msk            /*!< Interrupt Mask on line 58 */
#define EXTI_IMR2_IM59_Pos (27U)
#define EXTI_IMR2_IM59_Msk (0x1UL << EXTI_IMR2_IM59_Pos) /*!< 0x08000000 */
#define EXTI_IMR2_IM59     EXTI_IMR2_IM59_Msk            /*!< Interrupt Mask on line 59 */
#define EXTI_IMR2_IM60_Pos (28U)
#define EXTI_IMR2_IM60_Msk (0x1UL << EXTI_IMR2_IM60_Pos) /*!< 0x10000000 */
#define EXTI_IMR2_IM60     EXTI_IMR2_IM60_Msk            /*!< Interrupt Mask on line 60 */
#define EXTI_IMR2_IM61_Pos (29U)
#define EXTI_IMR2_IM61_Msk (0x1UL << EXTI_IMR2_IM61_Pos) /*!< 0x20000000 */
#define EXTI_IMR2_IM61     EXTI_IMR2_IM61_Msk            /*!< Interrupt Mask on line 61 */
#define EXTI_IMR2_IM62_Pos (30U)
#define EXTI_IMR2_IM62_Msk (0x1UL << EXTI_IMR2_IM62_Pos) /*!< 0x40000000 */
#define EXTI_IMR2_IM62     EXTI_IMR2_IM62_Msk            /*!< Interrupt Mask on line 62 */
#define EXTI_IMR2_IM63_Pos (31U)
#define EXTI_IMR2_IM63_Msk (0x1UL << EXTI_IMR2_IM63_Pos) /*!< 0x80000000 */
#define EXTI_IMR2_IM63     EXTI_IMR2_IM63_Msk            /*!< Interrupt Mask on line 63 */

