Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for EXTI_EMR2 register  *******************/
#define EXTI_EMR2_EM_Pos   (0U)
#define EXTI_EMR2_EM_Msk   (0xFFFF8FFFUL << EXTI_EMR2_EM_Pos) /*!< 0xFFFF8FFF */
#define EXTI_EMR2_EM       EXTI_EMR2_EM_Msk                   /*!< Event Mask           */
#define EXTI_EMR2_EM32_Pos (0U)
#define EXTI_EMR2_EM32_Msk (0x1UL << EXTI_EMR2_EM32_Pos) /*!< 0x00000001 */
#define EXTI_EMR2_EM32     EXTI_EMR2_EM32_Msk            /*!< Event Mask on line 32*/
#define EXTI_EMR2_EM33_Pos (1U)
#define EXTI_EMR2_EM33_Msk (0x1UL << EXTI_EMR2_EM33_Pos) /*!< 0x00000002 */
#define EXTI_EMR2_EM33     EXTI_EMR2_EM33_Msk            /*!< Event Mask on line 33*/
#define EXTI_EMR2_EM34_Pos (2U)
#define EXTI_EMR2_EM34_Msk (0x1UL << EXTI_EMR2_EM34_Pos) /*!< 0x00000004 */
#define EXTI_EMR2_EM34     EXTI_EMR2_EM34_Msk            /*!< Event Mask on line 34*/
#define EXTI_EMR2_EM35_Pos (3U)
#define EXTI_EMR2_EM35_Msk (0x1UL << EXTI_EMR2_EM35_Pos) /*!< 0x00000008 */
#define EXTI_EMR2_EM35     EXTI_EMR2_EM35_Msk            /*!< Event Mask on line 35*/
#define EXTI_EMR2_EM36_Pos (4U)
#define EXTI_EMR2_EM36_Msk (0x1UL << EXTI_EMR2_EM36_Pos) /*!< 0x00000010 */
#define EXTI_EMR2_EM36     EXTI_EMR2_EM36_Msk            /*!< Event Mask on line 36*/
#define EXTI_EMR2_EM37_Pos (5U)
#define EXTI_EMR2_EM37_Msk (0x1UL << EXTI_EMR2_EM37_Pos) /*!< 0x00000020 */
#define EXTI_EMR2_EM37     EXTI_EMR2_EM37_Msk            /*!< Event Mask on line 37*/
#define EXTI_EMR2_EM38_Pos (6U)
#define EXTI_EMR2_EM38_Msk (0x1UL << EXTI_EMR2_EM38_Pos) /*!< 0x00000040 */
#define EXTI_EMR2_EM38     EXTI_EMR2_EM38_Msk            /*!< Event Mask on line 38*/
#define EXTI_EMR2_EM39_Pos (7U)
#define EXTI_EMR2_EM39_Msk (0x1UL << EXTI_EMR2_EM39_Pos) /*!< 0x00000080 */
#define EXTI_EMR2_EM39     EXTI_EMR2_EM39_Msk            /*!< Event Mask on line 39*/
#define EXTI_EMR2_EM40_Pos (8U)
#define EXTI_EMR2_EM40_Msk (0x1UL << EXTI_EMR2_EM40_Pos) /*!< 0x00000100 */
#define EXTI_EMR2_EM40     EXTI_EMR2_EM40_Msk            /*!< Event Mask on line 40*/
#define EXTI_EMR2_EM41_Pos (9U)
#define EXTI_EMR2_EM41_Msk (0x1UL << EXTI_EMR2_EM41_Pos) /*!< 0x00000200 */
#define EXTI_EMR2_EM41     EXTI_EMR2_EM41_Msk            /*!< Event Mask on line 41*/
#define EXTI_EMR2_EM42_Pos (10U)
#define EXTI_EMR2_EM42_Msk (0x1UL << EXTI_EMR2_EM42_Pos) /*!< 0x00000400 */
#define EXTI_EMR2_EM42     EXTI_EMR2_EM42_Msk            /*!< Event Mask on line 42 */
#define EXTI_EMR2_EM43_Pos (11U)
#define EXTI_EMR2_EM43_Msk (0x1UL << EXTI_EMR2_EM43_Pos) /*!< 0x00000800 */
#define EXTI_EMR2_EM43     EXTI_EMR2_EM43_Msk            /*!< Event Mask on line 43 */
#define EXTI_EMR2_EM47_Pos (15U)
#define EXTI_EMR2_EM47_Msk (0x1UL << EXTI_EMR2_EM47_Pos) /*!< 0x00008000 */
#define EXTI_EMR2_EM47     EXTI_EMR2_EM47_Msk            /*!< Event Mask on line 47 */
#define EXTI_EMR2_EM48_Pos (16U)
#define EXTI_EMR2_EM48_Msk (0x1UL << EXTI_EMR2_EM48_Pos) /*!< 0x00010000 */
#define EXTI_EMR2_EM48     EXTI_EMR2_EM48_Msk            /*!< Event Mask on line 48 */
#define EXTI_EMR2_EM49_Pos (17U)
#define EXTI_EMR2_EM49_Msk (0x1UL << EXTI_EMR2_EM49_Pos) /*!< 0x00020000 */
#define EXTI_EMR2_EM49     EXTI_EMR2_EM49_Msk            /*!< Event Mask on line 49 */
#define EXTI_EMR2_EM50_Pos (18U)
#define EXTI_EMR2_EM50_Msk (0x1UL << EXTI_EMR2_EM50_Pos) /*!< 0x00040000 */
#define EXTI_EMR2_EM50     EXTI_EMR2_EM50_Msk            /*!< Event Mask on line 50 */
#define EXTI_EMR2_EM51_Pos (19U)
#define EXTI_EMR2_EM51_Msk (0x1UL << EXTI_EMR2_EM51_Pos) /*!< 0x00080000 */
#define EXTI_EMR2_EM51     EXTI_EMR2_EM51_Msk            /*!< Event Mask on line 51 */
#define EXTI_EMR2_EM52_Pos (20U)
#define EXTI_EMR2_EM52_Msk (0x1UL << EXTI_EMR2_EM52_Pos) /*!< 0x00100000 */
#define EXTI_EMR2_EM52     EXTI_EMR2_EM52_Msk            /*!< Event Mask on line 52 */
#define EXTI_EMR2_EM53_Pos (21U)
#define EXTI_EMR2_EM53_Msk (0x1UL << EXTI_EMR2_EM53_Pos) /*!< 0x00200000 */
#define EXTI_EMR2_EM53     EXTI_EMR2_EM53_Msk            /*!< Event Mask on line 53 */
#define EXTI_EMR2_EM54_Pos (22U)
#define EXTI_EMR2_EM54_Msk (0x1UL << EXTI_EMR2_EM54_Pos) /*!< 0x00400000 */
#define EXTI_EMR2_EM54     EXTI_EMR2_EM54_Msk            /*!< Event Mask on line 54 */
#define EXTI_EMR2_EM55_Pos (23U)
#define EXTI_EMR2_EM55_Msk (0x1UL << EXTI_EMR2_EM55_Pos) /*!< 0x00800000 */
#define EXTI_EMR2_EM55     EXTI_EMR2_EM55_Msk            /*!< Event Mask on line 55 */
#define EXTI_EMR2_EM56_Pos (24U)
#define EXTI_EMR2_EM56_Msk (0x1UL << EXTI_EMR2_EM56_Pos) /*!< 0x01000000 */
#define EXTI_EMR2_EM56     EXTI_EMR2_EM56_Msk            /*!< Event Mask on line 56 */
#define EXTI_EMR2_EM57_Pos (25U)
#define EXTI_EMR2_EM57_Msk (0x1UL << EXTI_EMR2_EM57_Pos) /*!< 0x02000000 */
#define EXTI_EMR2_EM57     EXTI_EMR2_EM57_Msk            /*!< Event Mask on line 57 */
#define EXTI_EMR2_EM58_Pos (26U)
#define EXTI_EMR2_EM58_Msk (0x1UL << EXTI_EMR2_EM58_Pos) /*!< 0x04000000 */
#define EXTI_EMR2_EM58     EXTI_EMR2_EM58_Msk            /*!< Event Mask on line 58 */
#define EXTI_EMR2_EM59_Pos (27U)
#define EXTI_EMR2_EM59_Msk (0x1UL << EXTI_EMR2_EM59_Pos) /*!< 0x08000000 */
#define EXTI_EMR2_EM59     EXTI_EMR2_EM59_Msk            /*!< Event Mask on line 59 */
#define EXTI_EMR2_EM60_Pos (28U)
#define EXTI_EMR2_EM60_Msk (0x1UL << EXTI_EMR2_EM60_Pos) /*!< 0x10000000 */
#define EXTI_EMR2_EM60     EXTI_EMR2_EM60_Msk            /*!< Event Mask on line 60 */
#define EXTI_EMR2_EM61_Pos (29U)
#define EXTI_EMR2_EM61_Msk (0x1UL << EXTI_EMR2_EM61_Pos) /*!< 0x20000000 */
#define EXTI_EMR2_EM61     EXTI_EMR2_EM61_Msk            /*!< Event Mask on line 61 */
#define EXTI_EMR2_EM62_Pos (30U)
#define EXTI_EMR2_EM62_Msk (0x1UL << EXTI_EMR2_EM62_Pos) /*!< 0x40000000 */
#define EXTI_EMR2_EM62     EXTI_EMR2_EM62_Msk            /*!< Event Mask on line 62 */
#define EXTI_EMR2_EM63_Pos (31U)
#define EXTI_EMR2_EM63_Msk (0x1UL << EXTI_EMR2_EM63_Pos) /*!< 0x80000000 */
#define EXTI_EMR2_EM63     EXTI_EMR2_EM63_Msk            /*!< Event Mask on line 63 */

/*******************  Bit definition for EXTI_PR2 register  ********************/
#define EXTI_PR2_PR_Pos   (17U)
#define EXTI_PR2_PR_Msk   (0x5UL << EXTI_PR2_PR_Pos) /*!< 0x000A0000 */
#define EXTI_PR2_PR       EXTI_PR2_PR_Msk            /*!< Pending bit */
#define EXTI_PR2_PR49_Pos (17U)
#define EXTI_PR2_PR49_Msk (0x1UL << EXTI_PR2_PR49_Pos) /*!< 0x00020000 */
#define EXTI_PR2_PR49     EXTI_PR2_PR49_Msk            /*!< Pending bit for line 49 */
#define EXTI_PR2_PR51_Pos (19U)
#define EXTI_PR2_PR51_Msk (0x1UL << EXTI_PR2_PR51_Pos) /*!< 0x00080000 */
#define EXTI_PR2_PR51     EXTI_PR2_PR51_Msk            /*!< Pending bit for line 51 */

/*******************  Bit definition for EXTI_IMR3 register  *******************/
#define EXTI_IMR3_IM_Pos   (0U)
#define EXTI_IMR3_IM_Msk   (0x01A527FFUL << EXTI_IMR3_IM_Pos) /*!< 0x01A527FF */
#define EXTI_IMR3_IM       EXTI_IMR3_IM_Msk                   /*!< Interrupt Mask            */
#define EXTI_IMR3_IM64_Pos (0U)
#define EXTI_IMR3_IM64_Msk (0x1UL << EXTI_IMR3_IM64_Pos) /*!< 0x00000001 */
#define EXTI_IMR3_IM64     EXTI_IMR3_IM64_Msk            /*!< Interrupt Mask on line 64 */
#define EXTI_IMR3_IM65_Pos (1U)
#define EXTI_IMR3_IM65_Msk (0x1UL << EXTI_IMR3_IM65_Pos) /*!< 0x00000002 */
#define EXTI_IMR3_IM65     EXTI_IMR3_IM65_Msk            /*!< Interrupt Mask on line 65 */
#define EXTI_IMR3_IM66_Pos (2U)
#define EXTI_IMR3_IM66_Msk (0x1UL << EXTI_IMR3_IM66_Pos) /*!< 0x00000004 */
#define EXTI_IMR3_IM66     EXTI_IMR3_IM66_Msk            /*!< Interrupt Mask on line 66 */
#define EXTI_IMR3_IM67_Pos (3U)
#define EXTI_IMR3_IM67_Msk (0x1UL << EXTI_IMR3_IM67_Pos) /*!< 0x00000008 */
#define EXTI_IMR3_IM67     EXTI_IMR3_IM67_Msk            /*!< Interrupt Mask on line 67 */
#define EXTI_IMR3_IM68_Pos (4U)
#define EXTI_IMR3_IM68_Msk (0x1UL << EXTI_IMR3_IM68_Pos) /*!< 0x00000010 */
#define EXTI_IMR3_IM68     EXTI_IMR3_IM68_Msk            /*!< Interrupt Mask on line 68 */
#define EXTI_IMR3_IM69_Pos (5U)
#define EXTI_IMR3_IM69_Msk (0x1UL << EXTI_IMR3_IM69_Pos) /*!< 0x00000020 */
#define EXTI_IMR3_IM69     EXTI_IMR3_IM69_Msk            /*!< Interrupt Mask on line 69 */
#define EXTI_IMR3_IM70_Pos (6U)
#define EXTI_IMR3_IM70_Msk (0x1UL << EXTI_IMR3_IM70_Pos) /*!< 0x00000040 */
#define EXTI_IMR3_IM70     EXTI_IMR3_IM70_Msk            /*!< Interrupt Mask on line 70 */
#define EXTI_IMR3_IM71_Pos (7U)
#define EXTI_IMR3_IM71_Msk (0x1UL << EXTI_IMR3_IM71_Pos) /*!< 0x00000080 */
#define EXTI_IMR3_IM71     EXTI_IMR3_IM71_Msk            /*!< Interrupt Mask on line 71 */
#define EXTI_IMR3_IM72_Pos (8U)
#define EXTI_IMR3_IM72_Msk (0x1UL << EXTI_IMR3_IM72_Pos) /*!< 0x00000100 */
#define EXTI_IMR3_IM72     EXTI_IMR3_IM72_Msk            /*!< Interrupt Mask on line 72 */
#define EXTI_IMR3_IM73_Pos (9U)
#define EXTI_IMR3_IM73_Msk (0x1UL << EXTI_IMR3_IM73_Pos) /*!< 0x00000200 */
#define EXTI_IMR3_IM73     EXTI_IMR3_IM73_Msk            /*!< Interrupt Mask on line 73 */
#define EXTI_IMR3_IM74_Pos (10U)
#define EXTI_IMR3_IM74_Msk (0x1UL << EXTI_IMR3_IM74_Pos) /*!< 0x00000400 */
#define EXTI_IMR3_IM74     EXTI_IMR3_IM74_Msk            /*!< Interrupt Mask on line 74 */
#define EXTI_IMR3_IM77_Pos (13U)
#define EXTI_IMR3_IM77_Msk (0x1UL << EXTI_IMR3_IM77_Pos) /*!< 0x00002000 */
#define EXTI_IMR3_IM77     EXTI_IMR3_IM77_Msk            /*!< Interrupt Mask on line 77 */
#define EXTI_IMR3_IM80_Pos (16U)
#define EXTI_IMR3_IM80_Msk (0x1UL << EXTI_IMR3_IM80_Pos) /*!< 0x00010000 */
#define EXTI_IMR3_IM80     EXTI_IMR3_IM80_Msk            /*!< Interrupt Mask on line 80 */
#define EXTI_IMR3_IM82_Pos (18U)
#define EXTI_IMR3_IM82_Msk (0x1UL << EXTI_IMR3_IM82_Pos) /*!< 0x00040000 */
#define EXTI_IMR3_IM82     EXTI_IMR3_IM82_Msk            /*!< Interrupt Mask on line 82 */
#define EXTI_IMR3_IM85_Pos (21U)
#define EXTI_IMR3_IM85_Msk (0x1UL << EXTI_IMR3_IM85_Pos) /*!< 0x00200000 */
#define EXTI_IMR3_IM85     EXTI_IMR3_IM85_Msk            /*!< Interrupt Mask on line 85 */
#define EXTI_IMR3_IM87_Pos (23U)
#define EXTI_IMR3_IM87_Msk (0x1UL << EXTI_IMR3_IM87_Pos) /*!< 0x00800000 */
#define EXTI_IMR3_IM87     EXTI_IMR3_IM87_Msk            /*!< Interrupt Mask on line 87 */

#define EXTI_IMR3_IM88_Pos (24U)
#define EXTI_IMR3_IM88_Msk (0x1UL << EXTI_IMR3_IM88_Pos) /*!< 0x01000000 */
#define EXTI_IMR3_IM88     EXTI_IMR3_IM88_Msk            /*!< Interrupt Mask on line 88 */

/*******************  Bit definition for EXTI_EMR3 register  *******************/
#define EXTI_EMR3_EM_Pos   (0U)
#define EXTI_EMR3_EM_Msk   (0x01A527FFUL << EXTI_EMR3_EM_Pos) /*!< 0x01A527FF */
#define EXTI_EMR3_EM       EXTI_EMR3_EM_Msk                   /*!< Event Mask           */
#define EXTI_EMR3_EM64_Pos (0U)
#define EXTI_EMR3_EM64_Msk (0x1UL << EXTI_EMR3_EM64_Pos) /*!< 0x00000001 */
#define EXTI_EMR3_EM64     EXTI_EMR3_EM64_Msk            /*!< Event Mask on line 64*/
#define EXTI_EMR3_EM65_Pos (1U)
#define EXTI_EMR3_EM65_Msk (0x1UL << EXTI_EMR3_EM65_Pos) /*!< 0x00000002 */
#define EXTI_EMR3_EM65     EXTI_EMR3_EM65_Msk            /*!< Event Mask on line 65*/
#define EXTI_EMR3_EM66_Pos (2U)
#define EXTI_EMR3_EM66_Msk (0x1UL << EXTI_EMR3_EM66_Pos) /*!< 0x00000004 */
#define EXTI_EMR3_EM66     EXTI_EMR3_EM66_Msk            /*!< Event Mask on line 66*/
#define EXTI_EMR3_EM67_Pos (3U)
#define EXTI_EMR3_EM67_Msk (0x1UL << EXTI_EMR3_EM67_Pos) /*!< 0x00000008 */
#define EXTI_EMR3_EM67     EXTI_EMR3_EM67_Msk            /*!< Event Mask on line 67*/
#define EXTI_EMR3_EM68_Pos (4U)
#define EXTI_EMR3_EM68_Msk (0x1UL << EXTI_EMR3_EM68_Pos) /*!< 0x00000010 */
#define EXTI_EMR3_EM68     EXTI_EMR3_EM68_Msk            /*!< Event Mask on line 68*/
#define EXTI_EMR3_EM69_Pos (5U)
#define EXTI_EMR3_EM69_Msk (0x1UL << EXTI_EMR3_EM69_Pos) /*!< 0x00000020 */
#define EXTI_EMR3_EM69     EXTI_EMR3_EM69_Msk            /*!< Event Mask on line 69*/
#define EXTI_EMR3_EM70_Pos (6U)
#define EXTI_EMR3_EM70_Msk (0x1UL << EXTI_EMR3_EM70_Pos) /*!< 0x00000040 */
#define EXTI_EMR3_EM70     EXTI_EMR3_EM70_Msk            /*!< Event Mask on line 70*/
#define EXTI_EMR3_EM71_Pos (7U)
#define EXTI_EMR3_EM71_Msk (0x1UL << EXTI_EMR3_EM71_Pos) /*!< 0x00000080 */
#define EXTI_EMR3_EM71     EXTI_EMR3_EM71_Msk            /*!< Event Mask on line 71*/
#define EXTI_EMR3_EM72_Pos (8U)
#define EXTI_EMR3_EM72_Msk (0x1UL << EXTI_EMR3_EM72_Pos) /*!< 0x00000100 */
#define EXTI_EMR3_EM72     EXTI_EMR3_EM72_Msk            /*!< Event Mask on line 72*/
#define EXTI_EMR3_EM73_Pos (9U)
#define EXTI_EMR3_EM73_Msk (0x1UL << EXTI_EMR3_EM73_Pos) /*!< 0x00000200 */
#define EXTI_EMR3_EM73     EXTI_EMR3_EM73_Msk            /*!< Event Mask on line 73*/
#define EXTI_EMR3_EM74_Pos (10U)
#define EXTI_EMR3_EM74_Msk (0x1UL << EXTI_EMR3_EM74_Pos) /*!< 0x00000400 */
#define EXTI_EMR3_EM74     EXTI_EMR3_EM74_Msk            /*!< Event Mask on line 74 */
#define EXTI_EMR3_EM77_Pos (13U)
#define EXTI_EMR3_EM77_Msk (0x1UL << EXTI_EMR3_EM77_Pos) /*!< 0x00002000 */
#define EXTI_EMR3_EM77     EXTI_EMR3_EM77_Msk            /*!< Event Mask on line 77 */
#define EXTI_EMR3_EM80_Pos (16U)
#define EXTI_EMR3_EM80_Msk (0x1UL << EXTI_EMR3_EM80_Pos) /*!< 0x00010000 */
#define EXTI_EMR3_EM80     EXTI_EMR3_EM80_Msk            /*!< Event Mask on line 80 */
#define EXTI_EMR3_EM81_Pos (17U)
#define EXTI_EMR3_EM81_Msk (0x1UL << EXTI_EMR3_EM81_Pos) /*!< 0x00020000 */
#define EXTI_EMR3_EM81     EXTI_EMR3_EM81_Msk            /*!< Event Mask on line 81 */
#define EXTI_EMR3_EM82_Pos (18U)
#define EXTI_EMR3_EM82_Msk (0x1UL << EXTI_EMR3_EM82_Pos) /*!< 0x00040000 */
#define EXTI_EMR3_EM82     EXTI_EMR3_EM82_Msk            /*!< Event Mask on line 82 */
#define EXTI_EMR3_EM85_Pos (21U)
#define EXTI_EMR3_EM85_Msk (0x1UL << EXTI_EMR3_EM85_Pos) /*!< 0x00200000 */
#define EXTI_EMR3_EM85     EXTI_EMR3_EM85_Msk            /*!< Event Mask on line 85 */
#define EXTI_EMR3_EM87_Pos (23U)
#define EXTI_EMR3_EM87_Msk (0x1UL << EXTI_EMR3_EM87_Pos) /*!< 0x00800000 */
#define EXTI_EMR3_EM87     EXTI_EMR3_EM87_Msk            /*!< Event Mask on line 87 */

