Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define EXTI_EMR3_EM88_Pos (24U)
#define EXTI_EMR3_EM88_Msk (0x1UL << EXTI_EMR3_EM88_Pos) /*!< 0x01000000 */
#define EXTI_EMR3_EM88     EXTI_EMR3_EM88_Msk            /*!< Event Mask on line 88 */

/*******************  Bit definition for EXTI_PR3 register  ********************/
#define EXTI_PR3_PR_Pos   (18U)
#define EXTI_PR3_PR_Msk   (0x9UL << EXTI_PR3_PR_Pos) /*!< 0x00240000 */
#define EXTI_PR3_PR       EXTI_PR3_PR_Msk            /*!< Pending bit             */
#define EXTI_PR3_PR82_Pos (18U)
#define EXTI_PR3_PR82_Msk (0x1UL << EXTI_PR3_PR82_Pos) /*!< 0x00040000 */
#define EXTI_PR3_PR82     EXTI_PR3_PR82_Msk            /*!< Pending bit for line 82 */
#define EXTI_PR3_PR85_Pos (21U)
#define EXTI_PR3_PR85_Msk (0x1UL << EXTI_PR3_PR85_Pos) /*!< 0x00200000 */
#define EXTI_PR3_PR85     EXTI_PR3_PR85_Msk            /*!< Pending bit for line 85 */
/******************************************************************************/
/*                                                                            */
/*                                    FLASH                                   */
/*                                                                            */
/******************************************************************************/
/*
 * @brief FLASH Global Defines
 */
#define FLASH_SIZE_DATA_REGISTER 0x08FFF80CU
#define FLASH_SECTOR_TOTAL       128U /* 128 sectors */
#define FLASH_SIZE                                                                                                     \
  ((((*((uint16_t*)FLASH_SIZE_DATA_REGISTER)) == 0xFFFFU))                                                             \
      ? 0x200000U                                                                                                      \
      : ((((*((uint16_t*)FLASH_SIZE_DATA_REGISTER)) == 0x0000U))                                                       \
            ? 0x200000U                                                                                                \
            : (((uint32_t)(*((uint16_t*)FLASH_SIZE_DATA_REGISTER)) & (0x0FFFU)) << 10U))) /* 2 MB   */
#define FLASH_BANK_SIZE                 (FLASH_SIZE >> 1)                                 /* 1 MB   */
#define FLASH_SECTOR_SIZE               0x00002000UL                                      /* 8 KB   */
#define FLASH_LATENCY_DEFAULT           FLASH_ACR_LATENCY_3WS /* FLASH Three Latency cycles */
#define FLASH_NB_32BITWORD_IN_FLASHWORD 4U                    /* 128 bits */
#define DUAL_BANK                                             /* Dual-bank Flash */

/*******************  Bits definition for FLASH_ACR register  **********************/
#define FLASH_ACR_LATENCY_Pos    (0U)
#define FLASH_ACR_LATENCY_Msk    (0xFUL << FLASH_ACR_LATENCY_Pos) /*!< 0x0000000F: bit4 is kept only for legacy purpose */
#define FLASH_ACR_LATENCY        FLASH_ACR_LATENCY_Msk            /*!< Read Latency */
#define FLASH_ACR_LATENCY_0WS    (0x00000000UL)
#define FLASH_ACR_LATENCY_1WS    (0x00000001UL)
#define FLASH_ACR_LATENCY_2WS    (0x00000002UL)
#define FLASH_ACR_LATENCY_3WS    (0x00000003UL)
#define FLASH_ACR_LATENCY_4WS    (0x00000004UL)
#define FLASH_ACR_LATENCY_5WS    (0x00000005UL)
#define FLASH_ACR_LATENCY_6WS    (0x00000006UL)
#define FLASH_ACR_LATENCY_7WS    (0x00000007UL)

#define FLASH_ACR_WRHIGHFREQ_Pos (4U)
#define FLASH_ACR_WRHIGHFREQ_Msk (0x3UL << FLASH_ACR_WRHIGHFREQ_Pos) /*!< 0x00000030 */
#define FLASH_ACR_WRHIGHFREQ     FLASH_ACR_WRHIGHFREQ_Msk            /*!< Flash signal delay */
#define FLASH_ACR_WRHIGHFREQ_0   (0x1UL << FLASH_ACR_WRHIGHFREQ_Pos) /*!< 0x00000010 */
#define FLASH_ACR_WRHIGHFREQ_1   (0x2UL << FLASH_ACR_WRHIGHFREQ_Pos) /*!< 0x00000020 */

/* Legacy FLASH Latency defines */
#define FLASH_ACR_LATENCY_8WS  (0x00000008UL)
#define FLASH_ACR_LATENCY_9WS  (0x00000009UL)
#define FLASH_ACR_LATENCY_10WS (0x0000000AUL)
#define FLASH_ACR_LATENCY_11WS (0x0000000BUL)
#define FLASH_ACR_LATENCY_12WS (0x0000000CUL)
#define FLASH_ACR_LATENCY_13WS (0x0000000DUL)
#define FLASH_ACR_LATENCY_14WS (0x0000000EUL)
#define FLASH_ACR_LATENCY_15WS (0x0000000FUL)
/*******************  Bits definition for FLASH_CR register  ***********************/
#define FLASH_CR_LOCK_Pos       (0U)
#define FLASH_CR_LOCK_Msk       (0x1UL << FLASH_CR_LOCK_Pos) /*!< 0x00000001 */
#define FLASH_CR_LOCK           FLASH_CR_LOCK_Msk            /*!< Configuration lock bit */
#define FLASH_CR_PG_Pos         (1U)
#define FLASH_CR_PG_Msk         (0x1UL << FLASH_CR_PG_Pos) /*!< 0x00000002 */
#define FLASH_CR_PG             FLASH_CR_PG_Msk            /*!< Internal buffer control bit */
#define FLASH_CR_SER_Pos        (2U)
#define FLASH_CR_SER_Msk        (0x1UL << FLASH_CR_SER_Pos) /*!< 0x00000004 */
#define FLASH_CR_SER            FLASH_CR_SER_Msk            /*!< Sector erase request */
#define FLASH_CR_BER_Pos        (3U)
#define FLASH_CR_BER_Msk        (0x1UL << FLASH_CR_BER_Pos) /*!< 0x00000008 */
#define FLASH_CR_BER            FLASH_CR_BER_Msk            /*!< Bank erase request */
#define FLASH_CR_FW_Pos         (4U)
#define FLASH_CR_FW_Msk         (0x1UL << FLASH_CR_FW_Pos) /*!< 0x00000010 */
#define FLASH_CR_FW             FLASH_CR_FW_Msk            /*!< Write forcing control bit */
#define FLASH_CR_START_Pos      (5U)
#define FLASH_CR_START_Msk      (0x1UL << FLASH_CR_START_Pos) /*!< 0x00000020 */
#define FLASH_CR_START          FLASH_CR_START_Msk            /*!< Erase start control bit */
#define FLASH_CR_SNB_Pos        (6U)
#define FLASH_CR_SNB_Msk        (0x7FUL << FLASH_CR_SNB_Pos) /*!< 0x00001FC0 */
#define FLASH_CR_SNB            FLASH_CR_SNB_Msk             /*!< Sector erase selection number */
#define FLASH_CR_SNB_0          (0x01UL << FLASH_CR_SNB_Pos) /*!< 0x00000040 */
#define FLASH_CR_SNB_1          (0x02UL << FLASH_CR_SNB_Pos) /*!< 0x00000080 */
#define FLASH_CR_SNB_2          (0x04UL << FLASH_CR_SNB_Pos) /*!< 0x00000100 */
#define FLASH_CR_SNB_3          (0x08UL << FLASH_CR_SNB_Pos) /*!< 0x00000200 */
#define FLASH_CR_SNB_4          (0x10UL << FLASH_CR_SNB_Pos) /*!< 0x00000400 */
#define FLASH_CR_SNB_5          (0x20UL << FLASH_CR_SNB_Pos) /*!< 0x00000800 */
#define FLASH_CR_SNB_6          (0x40UL << FLASH_CR_SNB_Pos) /*!< 0x00001000 */
#define FLASH_CR_CRC_EN_Pos     (15U)
#define FLASH_CR_CRC_EN_Msk     (0x1UL << FLASH_CR_CRC_EN_Pos) /*!< 0x00008000 */
#define FLASH_CR_CRC_EN         FLASH_CR_CRC_EN_Msk            /*!< CRC control bit */
#define FLASH_CR_EOPIE_Pos      (16U)
#define FLASH_CR_EOPIE_Msk      (0x1UL << FLASH_CR_EOPIE_Pos) /*!< 0x00010000 */
#define FLASH_CR_EOPIE          FLASH_CR_EOPIE_Msk            /*!< End-of-program interrupt control bit */
#define FLASH_CR_WRPERRIE_Pos   (17U)
#define FLASH_CR_WRPERRIE_Msk   (0x1UL << FLASH_CR_WRPERRIE_Pos) /*!< 0x00020000 */
#define FLASH_CR_WRPERRIE       FLASH_CR_WRPERRIE_Msk            /*!< Write protection error interrupt enable bit */
#define FLASH_CR_PGSERRIE_Pos   (18U)
#define FLASH_CR_PGSERRIE_Msk   (0x1UL << FLASH_CR_PGSERRIE_Pos) /*!< 0x00040000 */
#define FLASH_CR_PGSERRIE       FLASH_CR_PGSERRIE_Msk            /*!< Programming sequence error interrupt enable bit */
#define FLASH_CR_STRBERRIE_Pos  (19U)
#define FLASH_CR_STRBERRIE_Msk  (0x1UL << FLASH_CR_STRBERRIE_Pos) /*!< 0x00080000 */
#define FLASH_CR_STRBERRIE      FLASH_CR_STRBERRIE_Msk            /*!< Strobe error interrupt enable bit */
#define FLASH_CR_INCERRIE_Pos   (21U)
#define FLASH_CR_INCERRIE_Msk   (0x1UL << FLASH_CR_INCERRIE_Pos) /*!< 0x00200000 */
#define FLASH_CR_INCERRIE       FLASH_CR_INCERRIE_Msk            /*!< Inconsistency error interrupt enable bit */
#define FLASH_CR_RDPERRIE_Pos   (23U)
#define FLASH_CR_RDPERRIE_Msk   (0x1UL << FLASH_CR_RDPERRIE_Pos) /*!< 0x00800000 */
#define FLASH_CR_RDPERRIE       FLASH_CR_RDPERRIE_Msk            /*!< Read protection error interrupt enable bit */
#define FLASH_CR_RDSERRIE_Pos   (24U)
#define FLASH_CR_RDSERRIE_Msk   (0x1UL << FLASH_CR_RDSERRIE_Pos) /*!< 0x01000000 */
#define FLASH_CR_RDSERRIE       FLASH_CR_RDSERRIE_Msk            /*!< Secure error interrupt enable bit */
#define FLASH_CR_SNECCERRIE_Pos (25U)
#define FLASH_CR_SNECCERRIE_Msk (0x1UL << FLASH_CR_SNECCERRIE_Pos) /*!< 0x02000000 */
#define FLASH_CR_SNECCERRIE     FLASH_CR_SNECCERRIE_Msk /*!< ECC single correction error interrupt enable bit */
#define FLASH_CR_DBECCERRIE_Pos (26U)
#define FLASH_CR_DBECCERRIE_Msk (0x1UL << FLASH_CR_DBECCERRIE_Pos) /*!< 0x04000000 */
#define FLASH_CR_DBECCERRIE     FLASH_CR_DBECCERRIE_Msk /*!< ECC double detection error interrupt enable bit */
#define FLASH_CR_CRCENDIE_Pos   (27U)
#define FLASH_CR_CRCENDIE_Msk   (0x1UL << FLASH_CR_CRCENDIE_Pos) /*!< 0x08000000 */
#define FLASH_CR_CRCENDIE       FLASH_CR_CRCENDIE_Msk            /*!< CRC end of calculation interrupt enable bit */
#define FLASH_CR_CRCRDERRIE_Pos (28U)
#define FLASH_CR_CRCRDERRIE_Msk (0x1UL << FLASH_CR_CRCRDERRIE_Pos) /*!< 0x10000000 */
#define FLASH_CR_CRCRDERRIE     FLASH_CR_CRCRDERRIE_Msk            /*!< CRC read error interrupt enable bit */

