Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bits definition for FLASH_ECC_FA register  *******************/
#define FLASH_ECC_FA_FAIL_ECC_ADDR_Pos (0U)
#define FLASH_ECC_FA_FAIL_ECC_ADDR_Msk (0xFFFFUL << FLASH_ECC_FA_FAIL_ECC_ADDR_Pos) /*!< 0x0000FFFF */
#define FLASH_ECC_FA_FAIL_ECC_ADDR     FLASH_ECC_FA_FAIL_ECC_ADDR_Msk               /*!< ECC error address */
#define FLASH_ECC_FA_OTP_FAIL_ECC_Pos  (31U)
#define FLASH_ECC_FA_OTP_FAIL_ECC_Msk  (0x1UL << FLASH_ECC_FA_OTP_FAIL_ECC_Pos) /*!< 0x80000000 */
#define FLASH_ECC_FA_OTP_FAIL_ECC      FLASH_ECC_FA_OTP_FAIL_ECC_Msk            /*!< OTP ECC error bit */

/*******************  Bits definition for FLASH_OTPBL register  *******************/
#define FLASH_OTPBL_LOCKBL_Pos (0U)
#define FLASH_OTPBL_LOCKBL_Msk (0xFFFFUL << FLASH_OTPBL_LOCKBL_Pos) /*!< 0x0000FFFF */
#define FLASH_OTPBL_LOCKBL     FLASH_OTPBL_LOCKBL_Msk               /*!< OTP Block Lock */

/******************************************************************************/
/*                                                                            */
/*                          Flexible Memory Controller                        */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for FMC_BCR1 register  *******************/
#define FMC_BCR1_CCLKEN_Pos (20U)
#define FMC_BCR1_CCLKEN_Msk (0x1UL << FMC_BCR1_CCLKEN_Pos) /*!< 0x00100000 */
#define FMC_BCR1_CCLKEN     FMC_BCR1_CCLKEN_Msk            /*!<Continuous clock enable     */
#define FMC_BCR1_WFDIS_Pos  (21U)
#define FMC_BCR1_WFDIS_Msk  (0x1UL << FMC_BCR1_WFDIS_Pos) /*!< 0x00200000 */
#define FMC_BCR1_WFDIS      FMC_BCR1_WFDIS_Msk            /*!<Write FIFO Disable         */

#define FMC_BCR1_BMAP_Pos   (24U)
#define FMC_BCR1_BMAP_Msk   (0x3UL << FMC_BCR1_BMAP_Pos) /*!< 0x03000000 */
#define FMC_BCR1_BMAP       FMC_BCR1_BMAP_Msk            /*!<BMAP[1:0] FMC bank mapping */
#define FMC_BCR1_BMAP_0     (0x1UL << FMC_BCR1_BMAP_Pos) /*!< 0x01000000 */
#define FMC_BCR1_BMAP_1     (0x2UL << FMC_BCR1_BMAP_Pos) /*!< 0x02000000 */

#define FMC_BCR1_FMCEN_Pos  (31U)
#define FMC_BCR1_FMCEN_Msk  (0x1UL << FMC_BCR1_FMCEN_Pos) /*!< 0x80000000 */
#define FMC_BCR1_FMCEN      FMC_BCR1_FMCEN_Msk            /*!<FMC controller Enable */
/******************  Bit definition for FMC_BCRx registers (x=1..4)  *********/
#define FMC_BCRx_MBKEN_Pos     (0U)
#define FMC_BCRx_MBKEN_Msk     (0x1UL << FMC_BCRx_MBKEN_Pos) /*!< 0x00000001 */
#define FMC_BCRx_MBKEN         FMC_BCRx_MBKEN_Msk            /*!<Memory bank enable bit                 */
#define FMC_BCRx_MUXEN_Pos     (1U)
#define FMC_BCRx_MUXEN_Msk     (0x1UL << FMC_BCRx_MUXEN_Pos) /*!< 0x00000002 */
#define FMC_BCRx_MUXEN         FMC_BCRx_MUXEN_Msk            /*!<Address/data multiplexing enable bit   */

#define FMC_BCRx_MTYP_Pos      (2U)
#define FMC_BCRx_MTYP_Msk      (0x3UL << FMC_BCRx_MTYP_Pos) /*!< 0x0000000C */
#define FMC_BCRx_MTYP          FMC_BCRx_MTYP_Msk            /*!<MTYP[1:0] bits (Memory type)           */
#define FMC_BCRx_MTYP_0        (0x1UL << FMC_BCRx_MTYP_Pos) /*!< 0x00000004 */
#define FMC_BCRx_MTYP_1        (0x2UL << FMC_BCRx_MTYP_Pos) /*!< 0x00000008 */

#define FMC_BCRx_MWID_Pos      (4U)
#define FMC_BCRx_MWID_Msk      (0x3UL << FMC_BCRx_MWID_Pos) /*!< 0x00000030 */
#define FMC_BCRx_MWID          FMC_BCRx_MWID_Msk            /*!<MWID[1:0] bits (Memory data bus width) */
#define FMC_BCRx_MWID_0        (0x1UL << FMC_BCRx_MWID_Pos) /*!< 0x00000010 */
#define FMC_BCRx_MWID_1        (0x2UL << FMC_BCRx_MWID_Pos) /*!< 0x00000020 */

#define FMC_BCRx_FACCEN_Pos    (6U)
#define FMC_BCRx_FACCEN_Msk    (0x1UL << FMC_BCRx_FACCEN_Pos) /*!< 0x00000040 */
#define FMC_BCRx_FACCEN        FMC_BCRx_FACCEN_Msk            /*!<Flash access enable        */
#define FMC_BCRx_BURSTEN_Pos   (8U)
#define FMC_BCRx_BURSTEN_Msk   (0x1UL << FMC_BCRx_BURSTEN_Pos) /*!< 0x00000100 */
#define FMC_BCRx_BURSTEN       FMC_BCRx_BURSTEN_Msk            /*!<Burst enable bit           */
#define FMC_BCRx_WAITPOL_Pos   (9U)
#define FMC_BCRx_WAITPOL_Msk   (0x1UL << FMC_BCRx_WAITPOL_Pos) /*!< 0x00000200 */
#define FMC_BCRx_WAITPOL       FMC_BCRx_WAITPOL_Msk            /*!<Wait signal polarity bit   */
#define FMC_BCRx_WAITCFG_Pos   (11U)
#define FMC_BCRx_WAITCFG_Msk   (0x1UL << FMC_BCRx_WAITCFG_Pos) /*!< 0x00000800 */
#define FMC_BCRx_WAITCFG       FMC_BCRx_WAITCFG_Msk            /*!<Wait timing configuration  */
#define FMC_BCRx_WREN_Pos      (12U)
#define FMC_BCRx_WREN_Msk      (0x1UL << FMC_BCRx_WREN_Pos) /*!< 0x00001000 */
#define FMC_BCRx_WREN          FMC_BCRx_WREN_Msk            /*!<Write enable bit           */
#define FMC_BCRx_WAITEN_Pos    (13U)
#define FMC_BCRx_WAITEN_Msk    (0x1UL << FMC_BCRx_WAITEN_Pos) /*!< 0x00002000 */
#define FMC_BCRx_WAITEN        FMC_BCRx_WAITEN_Msk            /*!<Wait enable bit            */
#define FMC_BCRx_EXTMOD_Pos    (14U)
#define FMC_BCRx_EXTMOD_Msk    (0x1UL << FMC_BCRx_EXTMOD_Pos) /*!< 0x00004000 */
#define FMC_BCRx_EXTMOD        FMC_BCRx_EXTMOD_Msk            /*!<Extended mode enable       */
#define FMC_BCRx_ASYNCWAIT_Pos (15U)
#define FMC_BCRx_ASYNCWAIT_Msk (0x1UL << FMC_BCRx_ASYNCWAIT_Pos) /*!< 0x00008000 */
#define FMC_BCRx_ASYNCWAIT     FMC_BCRx_ASYNCWAIT_Msk            /*!<Asynchronous wait          */

#define FMC_BCRx_CPSIZE_Pos    (16U)
#define FMC_BCRx_CPSIZE_Msk    (0x7UL << FMC_BCRx_CPSIZE_Pos) /*!< 0x00070000 */
#define FMC_BCRx_CPSIZE        FMC_BCRx_CPSIZE_Msk            /*!<PSIZE[2:0] bits CRAM Page Size */
#define FMC_BCRx_CPSIZE_0      (0x1UL << FMC_BCRx_CPSIZE_Pos) /*!< 0x00010000 */
#define FMC_BCRx_CPSIZE_1      (0x2UL << FMC_BCRx_CPSIZE_Pos) /*!< 0x00020000 */
#define FMC_BCRx_CPSIZE_2      (0x4UL << FMC_BCRx_CPSIZE_Pos) /*!< 0x00040000 */

#define FMC_BCRx_CBURSTRW_Pos  (19U)
#define FMC_BCRx_CBURSTRW_Msk  (0x1UL << FMC_BCRx_CBURSTRW_Pos) /*!< 0x00080000 */
#define FMC_BCRx_CBURSTRW      FMC_BCRx_CBURSTRW_Msk            /*!<Write burst enable         */

/******************  Bit definition for FMC_BTRx registers (x=1..4)  *********/
#define FMC_BTRx_ADDSET_Pos  (0U)
#define FMC_BTRx_ADDSET_Msk  (0xFUL << FMC_BTRx_ADDSET_Pos) /*!< 0x0000000F */
#define FMC_BTRx_ADDSET      FMC_BTRx_ADDSET_Msk            /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define FMC_BTRx_ADDSET_0    (0x1UL << FMC_BTRx_ADDSET_Pos) /*!< 0x00000001 */
#define FMC_BTRx_ADDSET_1    (0x2UL << FMC_BTRx_ADDSET_Pos) /*!< 0x00000002 */
#define FMC_BTRx_ADDSET_2    (0x4UL << FMC_BTRx_ADDSET_Pos) /*!< 0x00000004 */
#define FMC_BTRx_ADDSET_3    (0x8UL << FMC_BTRx_ADDSET_Pos) /*!< 0x00000008 */

#define FMC_BTRx_ADDHLD_Pos  (4U)
#define FMC_BTRx_ADDHLD_Msk  (0xFUL << FMC_BTRx_ADDHLD_Pos) /*!< 0x000000F0 */
#define FMC_BTRx_ADDHLD      FMC_BTRx_ADDHLD_Msk            /*!<ADDHLD[3:0] bits (Address-hold phase duration)  */
#define FMC_BTRx_ADDHLD_0    (0x1UL << FMC_BTRx_ADDHLD_Pos) /*!< 0x00000010 */
#define FMC_BTRx_ADDHLD_1    (0x2UL << FMC_BTRx_ADDHLD_Pos) /*!< 0x00000020 */
#define FMC_BTRx_ADDHLD_2    (0x4UL << FMC_BTRx_ADDHLD_Pos) /*!< 0x00000040 */
#define FMC_BTRx_ADDHLD_3    (0x8UL << FMC_BTRx_ADDHLD_Pos) /*!< 0x00000080 */

