Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define FMC_BTRx_DATAST_Pos  (8U)
#define FMC_BTRx_DATAST_Msk  (0xFFUL << FMC_BTRx_DATAST_Pos) /*!< 0x0000FF00 */
#define FMC_BTRx_DATAST      FMC_BTRx_DATAST_Msk             /*!<DATAST [3:0] bits (Data-phase duration) */
#define FMC_BTRx_DATAST_0    (0x01UL << FMC_BTRx_DATAST_Pos) /*!< 0x00000100 */
#define FMC_BTRx_DATAST_1    (0x02UL << FMC_BTRx_DATAST_Pos) /*!< 0x00000200 */
#define FMC_BTRx_DATAST_2    (0x04UL << FMC_BTRx_DATAST_Pos) /*!< 0x00000400 */
#define FMC_BTRx_DATAST_3    (0x08UL << FMC_BTRx_DATAST_Pos) /*!< 0x00000800 */
#define FMC_BTRx_DATAST_4    (0x10UL << FMC_BTRx_DATAST_Pos) /*!< 0x00001000 */
#define FMC_BTRx_DATAST_5    (0x20UL << FMC_BTRx_DATAST_Pos) /*!< 0x00002000 */
#define FMC_BTRx_DATAST_6    (0x40UL << FMC_BTRx_DATAST_Pos) /*!< 0x00004000 */
#define FMC_BTRx_DATAST_7    (0x80UL << FMC_BTRx_DATAST_Pos) /*!< 0x00008000 */

#define FMC_BTRx_BUSTURN_Pos (16U)
#define FMC_BTRx_BUSTURN_Msk (0xFUL << FMC_BTRx_BUSTURN_Pos) /*!< 0x000F0000 */
#define FMC_BTRx_BUSTURN     FMC_BTRx_BUSTURN_Msk            /*!<BUSTURN[3:0] bits (Bus turnaround phase duration) */
#define FMC_BTRx_BUSTURN_0   (0x1UL << FMC_BTRx_BUSTURN_Pos) /*!< 0x00010000 */
#define FMC_BTRx_BUSTURN_1   (0x2UL << FMC_BTRx_BUSTURN_Pos) /*!< 0x00020000 */
#define FMC_BTRx_BUSTURN_2   (0x4UL << FMC_BTRx_BUSTURN_Pos) /*!< 0x00040000 */
#define FMC_BTRx_BUSTURN_3   (0x8UL << FMC_BTRx_BUSTURN_Pos) /*!< 0x00080000 */

#define FMC_BTRx_CLKDIV_Pos  (20U)
#define FMC_BTRx_CLKDIV_Msk  (0xFUL << FMC_BTRx_CLKDIV_Pos) /*!< 0x00F00000 */
#define FMC_BTRx_CLKDIV      FMC_BTRx_CLKDIV_Msk            /*!<CLKDIV[3:0] bits (Clock divide ratio) */
#define FMC_BTRx_CLKDIV_0    (0x1UL << FMC_BTRx_CLKDIV_Pos) /*!< 0x00100000 */
#define FMC_BTRx_CLKDIV_1    (0x2UL << FMC_BTRx_CLKDIV_Pos) /*!< 0x00200000 */
#define FMC_BTRx_CLKDIV_2    (0x4UL << FMC_BTRx_CLKDIV_Pos) /*!< 0x00400000 */
#define FMC_BTRx_CLKDIV_3    (0x8UL << FMC_BTRx_CLKDIV_Pos) /*!< 0x00800000 */

#define FMC_BTRx_DATLAT_Pos  (24U)
#define FMC_BTRx_DATLAT_Msk  (0xFUL << FMC_BTRx_DATLAT_Pos) /*!< 0x0F000000 */
#define FMC_BTRx_DATLAT      FMC_BTRx_DATLAT_Msk            /*!<DATLA[3:0] bits (Data latency) */
#define FMC_BTRx_DATLAT_0    (0x1UL << FMC_BTRx_DATLAT_Pos) /*!< 0x01000000 */
#define FMC_BTRx_DATLAT_1    (0x2UL << FMC_BTRx_DATLAT_Pos) /*!< 0x02000000 */
#define FMC_BTRx_DATLAT_2    (0x4UL << FMC_BTRx_DATLAT_Pos) /*!< 0x04000000 */
#define FMC_BTRx_DATLAT_3    (0x8UL << FMC_BTRx_DATLAT_Pos) /*!< 0x08000000 */

#define FMC_BTRx_ACCMOD_Pos  (28U)
#define FMC_BTRx_ACCMOD_Msk  (0x3UL << FMC_BTRx_ACCMOD_Pos) /*!< 0x30000000 */
#define FMC_BTRx_ACCMOD      FMC_BTRx_ACCMOD_Msk            /*!<ACCMOD[1:0] bits (Access mode) */
#define FMC_BTRx_ACCMOD_0    (0x1UL << FMC_BTRx_ACCMOD_Pos) /*!< 0x10000000 */
#define FMC_BTRx_ACCMOD_1    (0x2UL << FMC_BTRx_ACCMOD_Pos) /*!< 0x20000000 */

/******************  Bit definition for FMC_BWTRx registers (x=1..4)  *********/
#define FMC_BWTRx_ADDSET_Pos  (0U)
#define FMC_BWTRx_ADDSET_Msk  (0xFUL << FMC_BWTRx_ADDSET_Pos) /*!< 0x0000000F */
#define FMC_BWTRx_ADDSET      FMC_BWTRx_ADDSET_Msk            /*!<ADDSET[3:0] bits (Address setup phase duration) */
#define FMC_BWTRx_ADDSET_0    (0x1UL << FMC_BWTRx_ADDSET_Pos) /*!< 0x00000001 */
#define FMC_BWTRx_ADDSET_1    (0x2UL << FMC_BWTRx_ADDSET_Pos) /*!< 0x00000002 */
#define FMC_BWTRx_ADDSET_2    (0x4UL << FMC_BWTRx_ADDSET_Pos) /*!< 0x00000004 */
#define FMC_BWTRx_ADDSET_3    (0x8UL << FMC_BWTRx_ADDSET_Pos) /*!< 0x00000008 */

#define FMC_BWTRx_ADDHLD_Pos  (4U)
#define FMC_BWTRx_ADDHLD_Msk  (0xFUL << FMC_BWTRx_ADDHLD_Pos) /*!< 0x000000F0 */
#define FMC_BWTRx_ADDHLD      FMC_BWTRx_ADDHLD_Msk            /*!<ADDHLD[3:0] bits (Address-hold phase duration) */
#define FMC_BWTRx_ADDHLD_0    (0x1UL << FMC_BWTRx_ADDHLD_Pos) /*!< 0x00000010 */
#define FMC_BWTRx_ADDHLD_1    (0x2UL << FMC_BWTRx_ADDHLD_Pos) /*!< 0x00000020 */
#define FMC_BWTRx_ADDHLD_2    (0x4UL << FMC_BWTRx_ADDHLD_Pos) /*!< 0x00000040 */
#define FMC_BWTRx_ADDHLD_3    (0x8UL << FMC_BWTRx_ADDHLD_Pos) /*!< 0x00000080 */

#define FMC_BWTRx_DATAST_Pos  (8U)
#define FMC_BWTRx_DATAST_Msk  (0xFFUL << FMC_BWTRx_DATAST_Pos) /*!< 0x0000FF00 */
#define FMC_BWTRx_DATAST      FMC_BWTRx_DATAST_Msk             /*!<DATAST [3:0] bits (Data-phase duration) */
#define FMC_BWTRx_DATAST_0    (0x01UL << FMC_BWTRx_DATAST_Pos) /*!< 0x00000100 */
#define FMC_BWTRx_DATAST_1    (0x02UL << FMC_BWTRx_DATAST_Pos) /*!< 0x00000200 */
#define FMC_BWTRx_DATAST_2    (0x04UL << FMC_BWTRx_DATAST_Pos) /*!< 0x00000400 */
#define FMC_BWTRx_DATAST_3    (0x08UL << FMC_BWTRx_DATAST_Pos) /*!< 0x00000800 */
#define FMC_BWTRx_DATAST_4    (0x10UL << FMC_BWTRx_DATAST_Pos) /*!< 0x00001000 */
#define FMC_BWTRx_DATAST_5    (0x20UL << FMC_BWTRx_DATAST_Pos) /*!< 0x00002000 */
#define FMC_BWTRx_DATAST_6    (0x40UL << FMC_BWTRx_DATAST_Pos) /*!< 0x00004000 */
#define FMC_BWTRx_DATAST_7    (0x80UL << FMC_BWTRx_DATAST_Pos) /*!< 0x00008000 */

#define FMC_BWTRx_BUSTURN_Pos (16U)
#define FMC_BWTRx_BUSTURN_Msk (0xFUL << FMC_BWTRx_BUSTURN_Pos) /*!< 0x000F0000 */
#define FMC_BWTRx_BUSTURN     FMC_BWTRx_BUSTURN_Msk            /*!<BUSTURN[3:0] bits (Bus turnaround phase duration) */
#define FMC_BWTRx_BUSTURN_0   (0x1UL << FMC_BWTRx_BUSTURN_Pos) /*!< 0x00010000 */
#define FMC_BWTRx_BUSTURN_1   (0x2UL << FMC_BWTRx_BUSTURN_Pos) /*!< 0x00020000 */
#define FMC_BWTRx_BUSTURN_2   (0x4UL << FMC_BWTRx_BUSTURN_Pos) /*!< 0x00040000 */
#define FMC_BWTRx_BUSTURN_3   (0x8UL << FMC_BWTRx_BUSTURN_Pos) /*!< 0x00080000 */

#define FMC_BWTRx_ACCMOD_Pos  (28U)
#define FMC_BWTRx_ACCMOD_Msk  (0x3UL << FMC_BWTRx_ACCMOD_Pos) /*!< 0x30000000 */
#define FMC_BWTRx_ACCMOD      FMC_BWTRx_ACCMOD_Msk            /*!<ACCMOD[1:0] bits (Access mode) */
#define FMC_BWTRx_ACCMOD_0    (0x1UL << FMC_BWTRx_ACCMOD_Pos) /*!< 0x10000000 */
#define FMC_BWTRx_ACCMOD_1    (0x2UL << FMC_BWTRx_ACCMOD_Pos) /*!< 0x20000000 */

/******************  Bit definition for FMC_PCR register  *******************/
#define FMC_PCR_PWAITEN_Pos (1U)
#define FMC_PCR_PWAITEN_Msk (0x1UL << FMC_PCR_PWAITEN_Pos) /*!< 0x00000002 */
#define FMC_PCR_PWAITEN     FMC_PCR_PWAITEN_Msk            /*!<Wait feature enable bit                   */
#define FMC_PCR_PBKEN_Pos   (2U)
#define FMC_PCR_PBKEN_Msk   (0x1UL << FMC_PCR_PBKEN_Pos) /*!< 0x00000004 */
#define FMC_PCR_PBKEN       FMC_PCR_PBKEN_Msk            /*!<NAND Flash memory bank enable bit */

#define FMC_PCR_PWID_Pos    (4U)
#define FMC_PCR_PWID_Msk    (0x3UL << FMC_PCR_PWID_Pos) /*!< 0x00000030 */
#define FMC_PCR_PWID        FMC_PCR_PWID_Msk            /*!<PWID[1:0] bits (NAND Flash databus width) */
#define FMC_PCR_PWID_0      (0x1UL << FMC_PCR_PWID_Pos) /*!< 0x00000010 */
#define FMC_PCR_PWID_1      (0x2UL << FMC_PCR_PWID_Pos) /*!< 0x00000020 */

#define FMC_PCR_ECCEN_Pos   (6U)
#define FMC_PCR_ECCEN_Msk   (0x1UL << FMC_PCR_ECCEN_Pos) /*!< 0x00000040 */
#define FMC_PCR_ECCEN       FMC_PCR_ECCEN_Msk            /*!<ECC computation logic enable bit          */

