Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/******************  Bit definition for FMC_PATT register  ******************/
#define FMC_PATT_ATTSET_Pos  (0U)
#define FMC_PATT_ATTSET_Msk  (0xFFUL << FMC_PATT_ATTSET_Pos) /*!< 0x000000FF */
#define FMC_PATT_ATTSET      FMC_PATT_ATTSET_Msk             /*!<ATTSET[7:0] bits (Attribute memory setup time) */
#define FMC_PATT_ATTSET_0    (0x01UL << FMC_PATT_ATTSET_Pos) /*!< 0x00000001 */
#define FMC_PATT_ATTSET_1    (0x02UL << FMC_PATT_ATTSET_Pos) /*!< 0x00000002 */
#define FMC_PATT_ATTSET_2    (0x04UL << FMC_PATT_ATTSET_Pos) /*!< 0x00000004 */
#define FMC_PATT_ATTSET_3    (0x08UL << FMC_PATT_ATTSET_Pos) /*!< 0x00000008 */
#define FMC_PATT_ATTSET_4    (0x10UL << FMC_PATT_ATTSET_Pos) /*!< 0x00000010 */
#define FMC_PATT_ATTSET_5    (0x20UL << FMC_PATT_ATTSET_Pos) /*!< 0x00000020 */
#define FMC_PATT_ATTSET_6    (0x40UL << FMC_PATT_ATTSET_Pos) /*!< 0x00000040 */
#define FMC_PATT_ATTSET_7    (0x80UL << FMC_PATT_ATTSET_Pos) /*!< 0x00000080 */

#define FMC_PATT_ATTWAIT_Pos (8U)
#define FMC_PATT_ATTWAIT_Msk (0xFFUL << FMC_PATT_ATTWAIT_Pos) /*!< 0x0000FF00 */
#define FMC_PATT_ATTWAIT     FMC_PATT_ATTWAIT_Msk             /*!<ATTWAIT[7:0] bits (Attribute memory wait time) */
#define FMC_PATT_ATTWAIT_0   (0x01UL << FMC_PATT_ATTWAIT_Pos) /*!< 0x00000100 */
#define FMC_PATT_ATTWAIT_1   (0x02UL << FMC_PATT_ATTWAIT_Pos) /*!< 0x00000200 */
#define FMC_PATT_ATTWAIT_2   (0x04UL << FMC_PATT_ATTWAIT_Pos) /*!< 0x00000400 */
#define FMC_PATT_ATTWAIT_3   (0x08UL << FMC_PATT_ATTWAIT_Pos) /*!< 0x00000800 */
#define FMC_PATT_ATTWAIT_4   (0x10UL << FMC_PATT_ATTWAIT_Pos) /*!< 0x00001000 */
#define FMC_PATT_ATTWAIT_5   (0x20UL << FMC_PATT_ATTWAIT_Pos) /*!< 0x00002000 */
#define FMC_PATT_ATTWAIT_6   (0x40UL << FMC_PATT_ATTWAIT_Pos) /*!< 0x00004000 */
#define FMC_PATT_ATTWAIT_7   (0x80UL << FMC_PATT_ATTWAIT_Pos) /*!< 0x00008000 */

#define FMC_PATT_ATTHOLD_Pos (16U)
#define FMC_PATT_ATTHOLD_Msk (0xFFUL << FMC_PATT_ATTHOLD_Pos) /*!< 0x00FF0000 */
#define FMC_PATT_ATTHOLD     FMC_PATT_ATTHOLD_Msk             /*!<ATTHOLD[7:0] bits (Attribute memory hold time) */
#define FMC_PATT_ATTHOLD_0   (0x01UL << FMC_PATT_ATTHOLD_Pos) /*!< 0x00010000 */
#define FMC_PATT_ATTHOLD_1   (0x02UL << FMC_PATT_ATTHOLD_Pos) /*!< 0x00020000 */
#define FMC_PATT_ATTHOLD_2   (0x04UL << FMC_PATT_ATTHOLD_Pos) /*!< 0x00040000 */
#define FMC_PATT_ATTHOLD_3   (0x08UL << FMC_PATT_ATTHOLD_Pos) /*!< 0x00080000 */
#define FMC_PATT_ATTHOLD_4   (0x10UL << FMC_PATT_ATTHOLD_Pos) /*!< 0x00100000 */
#define FMC_PATT_ATTHOLD_5   (0x20UL << FMC_PATT_ATTHOLD_Pos) /*!< 0x00200000 */
#define FMC_PATT_ATTHOLD_6   (0x40UL << FMC_PATT_ATTHOLD_Pos) /*!< 0x00400000 */
#define FMC_PATT_ATTHOLD_7   (0x80UL << FMC_PATT_ATTHOLD_Pos) /*!< 0x00800000 */

#define FMC_PATT_ATTHIZ_Pos  (24U)
#define FMC_PATT_ATTHIZ_Msk  (0xFFUL << FMC_PATT_ATTHIZ_Pos) /*!< 0xFF000000 */
#define FMC_PATT_ATTHIZ      FMC_PATT_ATTHIZ_Msk             /*!<ATTHIZ[7:0] bits (Attribute memory databus HiZ time) */
#define FMC_PATT_ATTHIZ_0    (0x01UL << FMC_PATT_ATTHIZ_Pos) /*!< 0x01000000 */
#define FMC_PATT_ATTHIZ_1    (0x02UL << FMC_PATT_ATTHIZ_Pos) /*!< 0x02000000 */
#define FMC_PATT_ATTHIZ_2    (0x04UL << FMC_PATT_ATTHIZ_Pos) /*!< 0x04000000 */
#define FMC_PATT_ATTHIZ_3    (0x08UL << FMC_PATT_ATTHIZ_Pos) /*!< 0x08000000 */
#define FMC_PATT_ATTHIZ_4    (0x10UL << FMC_PATT_ATTHIZ_Pos) /*!< 0x10000000 */
#define FMC_PATT_ATTHIZ_5    (0x20UL << FMC_PATT_ATTHIZ_Pos) /*!< 0x20000000 */
#define FMC_PATT_ATTHIZ_6    (0x40UL << FMC_PATT_ATTHIZ_Pos) /*!< 0x40000000 */
#define FMC_PATT_ATTHIZ_7    (0x80UL << FMC_PATT_ATTHIZ_Pos) /*!< 0x80000000 */

/******************  Bit definition for FMC_ECCR3 register  ******************/
#define FMC_ECCR3_ECC3_Pos (0U)
#define FMC_ECCR3_ECC3_Msk (0xFFFFFFFFUL << FMC_ECCR3_ECC3_Pos) /*!< 0xFFFFFFFF */
#define FMC_ECCR3_ECC3     FMC_ECCR3_ECC3_Msk                   /*!<ECC result */

/******************  Bit definition for FMC_SDCRx registers (x=1..4)  *********/
#define FMC_SDCRx_NC_Pos     (0U)
#define FMC_SDCRx_NC_Msk     (0x3UL << FMC_SDCRx_NC_Pos) /*!< 0x00000003 */
#define FMC_SDCRx_NC         FMC_SDCRx_NC_Msk            /*!<NC[1:0] bits (Number of column bits) */
#define FMC_SDCRx_NC_0       (0x1UL << FMC_SDCRx_NC_Pos) /*!< 0x00000001 */
#define FMC_SDCRx_NC_1       (0x2UL << FMC_SDCRx_NC_Pos) /*!< 0x00000002 */

#define FMC_SDCRx_NR_Pos     (2U)
#define FMC_SDCRx_NR_Msk     (0x3UL << FMC_SDCRx_NR_Pos) /*!< 0x0000000C */
#define FMC_SDCRx_NR         FMC_SDCRx_NR_Msk            /*!<NR[1:0] bits (Number of row bits) */
#define FMC_SDCRx_NR_0       (0x1UL << FMC_SDCRx_NR_Pos) /*!< 0x00000004 */
#define FMC_SDCRx_NR_1       (0x2UL << FMC_SDCRx_NR_Pos) /*!< 0x00000008 */

#define FMC_SDCRx_MWID_Pos   (4U)
#define FMC_SDCRx_MWID_Msk   (0x3UL << FMC_SDCRx_MWID_Pos) /*!< 0x00000030 */
#define FMC_SDCRx_MWID       FMC_SDCRx_MWID_Msk            /*!<NR[1:0] bits (Number of row bits) */
#define FMC_SDCRx_MWID_0     (0x1UL << FMC_SDCRx_MWID_Pos) /*!< 0x00000010 */
#define FMC_SDCRx_MWID_1     (0x2UL << FMC_SDCRx_MWID_Pos) /*!< 0x00000020 */

#define FMC_SDCRx_NB_Pos     (6U)
#define FMC_SDCRx_NB_Msk     (0x1UL << FMC_SDCRx_NB_Pos) /*!< 0x00000040 */
#define FMC_SDCRx_NB         FMC_SDCRx_NB_Msk            /*!<Number of internal bank */

#define FMC_SDCRx_CAS_Pos    (7U)
#define FMC_SDCRx_CAS_Msk    (0x3UL << FMC_SDCRx_CAS_Pos) /*!< 0x00000180 */
#define FMC_SDCRx_CAS        FMC_SDCRx_CAS_Msk            /*!<CAS[1:0] bits (CAS latency) */
#define FMC_SDCRx_CAS_0      (0x1UL << FMC_SDCRx_CAS_Pos) /*!< 0x00000080 */
#define FMC_SDCRx_CAS_1      (0x2UL << FMC_SDCRx_CAS_Pos) /*!< 0x00000100 */

#define FMC_SDCRx_WP_Pos     (9U)
#define FMC_SDCRx_WP_Msk     (0x1UL << FMC_SDCRx_WP_Pos) /*!< 0x00000200 */
#define FMC_SDCRx_WP         FMC_SDCRx_WP_Msk            /*!<Write protection */

#define FMC_SDCRx_SDCLK_Pos  (10U)
#define FMC_SDCRx_SDCLK_Msk  (0x3UL << FMC_SDCRx_SDCLK_Pos) /*!< 0x00000C00 */
#define FMC_SDCRx_SDCLK      FMC_SDCRx_SDCLK_Msk            /*!<SDRAM clock configuration */
#define FMC_SDCRx_SDCLK_0    (0x1UL << FMC_SDCRx_SDCLK_Pos) /*!< 0x00000400 */
#define FMC_SDCRx_SDCLK_1    (0x2UL << FMC_SDCRx_SDCLK_Pos) /*!< 0x00000800 */

