Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define FMC_SDCRx_RBURST_Pos (12U)
#define FMC_SDCRx_RBURST_Msk (0x1UL << FMC_SDCRx_RBURST_Pos) /*!< 0x00001000 */
#define FMC_SDCRx_RBURST     FMC_SDCRx_RBURST_Msk            /*!<Read burst */

#define FMC_SDCRx_RPIPE_Pos  (13U)
#define FMC_SDCRx_RPIPE_Msk  (0x3UL << FMC_SDCRx_RPIPE_Pos) /*!< 0x00006000 */
#define FMC_SDCRx_RPIPE      FMC_SDCRx_RPIPE_Msk            /*!<Write protection */
#define FMC_SDCRx_RPIPE_0    (0x1UL << FMC_SDCRx_RPIPE_Pos) /*!< 0x00002000 */
#define FMC_SDCRx_RPIPE_1    (0x2UL << FMC_SDCRx_RPIPE_Pos) /*!< 0x00004000 */

/******************  Bit definition for FMC_SDTRx(1,2) register  ******************/
#define FMC_SDTRx_TMRD_Pos (0U)
#define FMC_SDTRx_TMRD_Msk (0xFUL << FMC_SDTRx_TMRD_Pos) /*!< 0x0000000F */
#define FMC_SDTRx_TMRD     FMC_SDTRx_TMRD_Msk            /*!<TMRD[3:0] bits (Load mode register to active) */
#define FMC_SDTRx_TMRD_0   (0x1UL << FMC_SDTRx_TMRD_Pos) /*!< 0x00000001 */
#define FMC_SDTRx_TMRD_1   (0x2UL << FMC_SDTRx_TMRD_Pos) /*!< 0x00000002 */
#define FMC_SDTRx_TMRD_2   (0x4UL << FMC_SDTRx_TMRD_Pos) /*!< 0x00000004 */
#define FMC_SDTRx_TMRD_3   (0x8UL << FMC_SDTRx_TMRD_Pos) /*!< 0x00000008 */

#define FMC_SDTRx_TXSR_Pos (4U)
#define FMC_SDTRx_TXSR_Msk (0xFUL << FMC_SDTRx_TXSR_Pos) /*!< 0x000000F0 */
#define FMC_SDTRx_TXSR     FMC_SDTRx_TXSR_Msk            /*!<TXSR[3:0] bits (Exit self refresh) */
#define FMC_SDTRx_TXSR_0   (0x1UL << FMC_SDTRx_TXSR_Pos) /*!< 0x00000010 */
#define FMC_SDTRx_TXSR_1   (0x2UL << FMC_SDTRx_TXSR_Pos) /*!< 0x00000020 */
#define FMC_SDTRx_TXSR_2   (0x4UL << FMC_SDTRx_TXSR_Pos) /*!< 0x00000040 */
#define FMC_SDTRx_TXSR_3   (0x8UL << FMC_SDTRx_TXSR_Pos) /*!< 0x00000080 */

#define FMC_SDTRx_TRAS_Pos (8U)
#define FMC_SDTRx_TRAS_Msk (0xFUL << FMC_SDTRx_TRAS_Pos) /*!< 0x00000F00 */
#define FMC_SDTRx_TRAS     FMC_SDTRx_TRAS_Msk            /*!<TRAS[3:0] bits (Self refresh time) */
#define FMC_SDTRx_TRAS_0   (0x1UL << FMC_SDTRx_TRAS_Pos) /*!< 0x00000100 */
#define FMC_SDTRx_TRAS_1   (0x2UL << FMC_SDTRx_TRAS_Pos) /*!< 0x00000200 */
#define FMC_SDTRx_TRAS_2   (0x4UL << FMC_SDTRx_TRAS_Pos) /*!< 0x00000400 */
#define FMC_SDTRx_TRAS_3   (0x8UL << FMC_SDTRx_TRAS_Pos) /*!< 0x00000800 */

#define FMC_SDTRx_TRC_Pos  (12U)
#define FMC_SDTRx_TRC_Msk  (0xFUL << FMC_SDTRx_TRC_Pos) /*!< 0x0000F000 */
#define FMC_SDTRx_TRC      FMC_SDTRx_TRC_Msk            /*!<TRC[2:0] bits (Row cycle delay) */
#define FMC_SDTRx_TRC_0    (0x1UL << FMC_SDTRx_TRC_Pos) /*!< 0x00001000 */
#define FMC_SDTRx_TRC_1    (0x2UL << FMC_SDTRx_TRC_Pos) /*!< 0x00002000 */
#define FMC_SDTRx_TRC_2    (0x4UL << FMC_SDTRx_TRC_Pos) /*!< 0x00004000 */

#define FMC_SDTRx_TWR_Pos  (16U)
#define FMC_SDTRx_TWR_Msk  (0xFUL << FMC_SDTRx_TWR_Pos) /*!< 0x000F0000 */
#define FMC_SDTRx_TWR      FMC_SDTRx_TWR_Msk            /*!<TRC[2:0] bits (Write recovery delay) */
#define FMC_SDTRx_TWR_0    (0x1UL << FMC_SDTRx_TWR_Pos) /*!< 0x00010000 */
#define FMC_SDTRx_TWR_1    (0x2UL << FMC_SDTRx_TWR_Pos) /*!< 0x00020000 */
#define FMC_SDTRx_TWR_2    (0x4UL << FMC_SDTRx_TWR_Pos) /*!< 0x00040000 */

#define FMC_SDTRx_TRP_Pos  (20U)
#define FMC_SDTRx_TRP_Msk  (0xFUL << FMC_SDTRx_TRP_Pos) /*!< 0x00F00000 */
#define FMC_SDTRx_TRP      FMC_SDTRx_TRP_Msk            /*!<TRP[2:0] bits (Row precharge delay) */
#define FMC_SDTRx_TRP_0    (0x1UL << FMC_SDTRx_TRP_Pos) /*!< 0x00100000 */
#define FMC_SDTRx_TRP_1    (0x2UL << FMC_SDTRx_TRP_Pos) /*!< 0x00200000 */
#define FMC_SDTRx_TRP_2    (0x4UL << FMC_SDTRx_TRP_Pos) /*!< 0x00400000 */

#define FMC_SDTRx_TRCD_Pos (24U)
#define FMC_SDTRx_TRCD_Msk (0xFUL << FMC_SDTRx_TRCD_Pos) /*!< 0x0F000000 */
#define FMC_SDTRx_TRCD     FMC_SDTRx_TRCD_Msk            /*!<TRP[2:0] bits (Row to column delay) */
#define FMC_SDTRx_TRCD_0   (0x1UL << FMC_SDTRx_TRCD_Pos) /*!< 0x01000000 */
#define FMC_SDTRx_TRCD_1   (0x2UL << FMC_SDTRx_TRCD_Pos) /*!< 0x02000000 */
#define FMC_SDTRx_TRCD_2   (0x4UL << FMC_SDTRx_TRCD_Pos) /*!< 0x04000000 */

/******************  Bit definition for FMC_SDCMR register  ******************/
#define FMC_SDCMR_MODE_Pos (0U)
#define FMC_SDCMR_MODE_Msk (0x7UL << FMC_SDCMR_MODE_Pos) /*!< 0x00000007 */
#define FMC_SDCMR_MODE     FMC_SDCMR_MODE_Msk            /*!<MODE[2:0] bits (Command mode) */
#define FMC_SDCMR_MODE_0   (0x1UL << FMC_SDCMR_MODE_Pos) /*!< 0x00000001 */
#define FMC_SDCMR_MODE_1   (0x2UL << FMC_SDCMR_MODE_Pos) /*!< 0x00000002 */
#define FMC_SDCMR_MODE_2   (0x4UL << FMC_SDCMR_MODE_Pos) /*!< 0x00000004 */

#define FMC_SDCMR_CTB2_Pos (3U)
#define FMC_SDCMR_CTB2_Msk (0x1UL << FMC_SDCMR_CTB2_Pos) /*!< 0x00000008 */
#define FMC_SDCMR_CTB2     FMC_SDCMR_CTB2_Msk            /*!<Command target 2 */

#define FMC_SDCMR_CTB1_Pos (4U)
#define FMC_SDCMR_CTB1_Msk (0x1UL << FMC_SDCMR_CTB1_Pos) /*!< 0x00000010 */
#define FMC_SDCMR_CTB1     FMC_SDCMR_CTB1_Msk            /*!<Command target 1 */

#define FMC_SDCMR_NRFS_Pos (5U)
#define FMC_SDCMR_NRFS_Msk (0xFUL << FMC_SDCMR_NRFS_Pos) /*!< 0x000001E0 */
#define FMC_SDCMR_NRFS     FMC_SDCMR_NRFS_Msk            /*!<NRFS[3:0] bits (Number of auto-refresh) */
#define FMC_SDCMR_NRFS_0   (0x1UL << FMC_SDCMR_NRFS_Pos) /*!< 0x00000020 */
#define FMC_SDCMR_NRFS_1   (0x2UL << FMC_SDCMR_NRFS_Pos) /*!< 0x00000040 */
#define FMC_SDCMR_NRFS_2   (0x4UL << FMC_SDCMR_NRFS_Pos) /*!< 0x00000080 */
#define FMC_SDCMR_NRFS_3   (0x8UL << FMC_SDCMR_NRFS_Pos) /*!< 0x00000100 */

#define FMC_SDCMR_MRD_Pos  (9U)
#define FMC_SDCMR_MRD_Msk  (0x1FFFUL << FMC_SDCMR_MRD_Pos) /*!< 0x003FFE00 */
#define FMC_SDCMR_MRD      FMC_SDCMR_MRD_Msk               /*!<MRD[12:0] bits (Mode register definition) */

/******************  Bit definition for FMC_SDRTR register  ******************/
#define FMC_SDRTR_CRE_Pos   (0U)
#define FMC_SDRTR_CRE_Msk   (0x1UL << FMC_SDRTR_CRE_Pos) /*!< 0x00000001 */
#define FMC_SDRTR_CRE       FMC_SDRTR_CRE_Msk            /*!<Clear refresh error flag */

#define FMC_SDRTR_COUNT_Pos (1U)
#define FMC_SDRTR_COUNT_Msk (0x1FFFUL << FMC_SDRTR_COUNT_Pos) /*!< 0x00003FFE */
#define FMC_SDRTR_COUNT     FMC_SDRTR_COUNT_Msk               /*!<COUNT[12:0] bits (Refresh timer count) */

#define FMC_SDRTR_REIE_Pos  (14U)
#define FMC_SDRTR_REIE_Msk  (0x1UL << FMC_SDRTR_REIE_Pos) /*!< 0x00004000 */
#define FMC_SDRTR_REIE      FMC_SDRTR_REIE_Msk            /*!<RES interrupt enable */

/******************  Bit definition for FMC_SDSR register  ******************/
#define FMC_SDSR_RE_Pos     (0U)
#define FMC_SDSR_RE_Msk     (0x1UL << FMC_SDSR_RE_Pos) /*!< 0x00000001 */
#define FMC_SDSR_RE         FMC_SDSR_RE_Msk            /*!<Refresh error flag */

#define FMC_SDSR_MODES1_Pos (1U)
#define FMC_SDSR_MODES1_Msk (0x3UL << FMC_SDSR_MODES1_Pos) /*!< 0x00000006 */
#define FMC_SDSR_MODES1     FMC_SDSR_MODES1_Msk            /*!<MODES1[1:0]bits (Status mode for bank 1) */
#define FMC_SDSR_MODES1_0   (0x1UL << FMC_SDSR_MODES1_Pos) /*!< 0x00000002 */
#define FMC_SDSR_MODES1_1   (0x2UL << FMC_SDSR_MODES1_Pos) /*!< 0x00000004 */

#define FMC_SDSR_MODES2_Pos (3U)
#define FMC_SDSR_MODES2_Msk (0x3UL << FMC_SDSR_MODES2_Pos) /*!< 0x00000018 */
#define FMC_SDSR_MODES2     FMC_SDSR_MODES2_Msk            /*!<MODES2[1:0]bits (Status mode for bank 2) */
#define FMC_SDSR_MODES2_0   (0x1UL << FMC_SDSR_MODES2_Pos) /*!< 0x00000008 */
#define FMC_SDSR_MODES2_1   (0x2UL << FMC_SDSR_MODES2_Pos) /*!< 0x00000010 */

/******************************************************************************/
/*                                                                            */
/*                       Graphic MMU (GFXMMU)                                 */
/*                                                                            */
/******************************************************************************/
/****************** Bits definition for GFXMMU_CR register ********************/
#define GFXMMU_CR_B0OIE_Pos (0U)
#define GFXMMU_CR_B0OIE_Msk (0x1UL << GFXMMU_CR_B0OIE_Pos) /*!< 0x00000001 */
#define GFXMMU_CR_B0OIE     GFXMMU_CR_B0OIE_Msk            /*!< Buffer 0 overflow interrupt enable */
#define GFXMMU_CR_B1OIE_Pos (1U)
#define GFXMMU_CR_B1OIE_Msk (0x1UL << GFXMMU_CR_B1OIE_Pos) /*!< 0x00000002 */
#define GFXMMU_CR_B1OIE     GFXMMU_CR_B1OIE_Msk            /*!< Buffer 1 overflow interrupt enable */
#define GFXMMU_CR_B2OIE_Pos (2U)
#define GFXMMU_CR_B2OIE_Msk (0x1UL << GFXMMU_CR_B2OIE_Pos) /*!< 0x00000004 */
#define GFXMMU_CR_B2OIE     GFXMMU_CR_B2OIE_Msk            /*!< Buffer 2 overflow interrupt enable */
#define GFXMMU_CR_B3OIE_Pos (3U)
#define GFXMMU_CR_B3OIE_Msk (0x1UL << GFXMMU_CR_B3OIE_Pos) /*!< 0x00000008 */
#define GFXMMU_CR_B3OIE     GFXMMU_CR_B3OIE_Msk            /*!< Buffer 3 overflow interrupt enable */
#define GFXMMU_CR_AMEIE_Pos (4U)
#define GFXMMU_CR_AMEIE_Msk (0x1UL << GFXMMU_CR_AMEIE_Pos) /*!< 0x00000010 */
#define GFXMMU_CR_AMEIE     GFXMMU_CR_AMEIE_Msk            /*!< AHB master error interrupt enable */
#define GFXMMU_CR_192BM_Pos (6U)
#define GFXMMU_CR_192BM_Msk (0x1UL << GFXMMU_CR_192BM_Pos) /*!< 0x00000040 */
#define GFXMMU_CR_192BM     GFXMMU_CR_192BM_Msk            /*!< 192 block mode */
#define GFXMMU_CR_CE_Pos    (7U)
#define GFXMMU_CR_CE_Msk    (0x1UL << GFXMMU_CR_CE_Pos) /*!< 0x00000080 */
#define GFXMMU_CR_CE        GFXMMU_CR_CE_Msk            /*!< Cache Enable */
#define GFXMMU_CR_CL_Pos    (8U)
#define GFXMMU_CR_CL_Msk    (0x1UL << GFXMMU_CR_CL_Pos) /*!< 0x00000100 */
#define GFXMMU_CR_CL        GFXMMU_CR_CL_Msk            /*!< Cache Lock */
#define GFXMMU_CR_CLB_Pos   (9U)
#define GFXMMU_CR_CLB_Msk   (0x3UL << GFXMMU_CR_CLB_Pos) /*!< 0x00000600 */
#define GFXMMU_CR_CLB       GFXMMU_CR_CLB_Msk            /*!< CLB[1:0]: Cache Lock Buffer */
#define GFXMMU_CR_CLB_0     (0x1UL << GFXMMU_CR_CLB_Pos) /*!< Cache locked on buffer 1 */
#define GFXMMU_CR_CLB_1     (0x2UL << GFXMMU_CR_CLB_Pos) /*!< Cache locked on buffer 2 */
#define GFXMMU_CR_FC_Pos    (11U)
#define GFXMMU_CR_FC_Msk    (0x1UL << GFXMMU_CR_FC_Pos) /*!< 0x00000800 */
#define GFXMMU_CR_FC        GFXMMU_CR_FC_Msk            /*!< Force Caching */
#define GFXMMU_CR_PD_Pos    (12U)
#define GFXMMU_CR_PD_Msk    (0x1UL << GFXMMU_CR_PD_Pos) /*!< 0x00001000 */
#define GFXMMU_CR_PD        GFXMMU_CR_PD_Msk            /*!< Prefetch Disable */
#define GFXMMU_CR_OC_Pos    (16U)
#define GFXMMU_CR_OC_Msk    (0x1UL << GFXMMU_CR_OC_Pos) /*!< 0x00002000 */
#define GFXMMU_CR_OC        GFXMMU_CR_OC_Msk            /*!< Outer Cachability */
#define GFXMMU_CR_OB_Pos    (17U)
#define GFXMMU_CR_OB_Msk    (0x1UL << GFXMMU_CR_OB_Pos) /*!< 0x00002000 */
#define GFXMMU_CR_OB        GFXMMU_CR_OB_Msk            /*!< Outer Bufferability */

