Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define GPIO_MODER_MODE14_Pos GPIO_MODER_MODER14_Po
#define GPIO_MODER_MODE14_Msk GPIO_MODER_MODER14_Ms
#define GPIO_MODER_MODE14     GPIO_MODER_MODER14
#define GPIO_MODER_MODE14_0   GPIO_MODER_MODER14_0
#define GPIO_MODER_MODE14_1   GPIO_MODER_MODER14_1

#define GPIO_MODER_MODE15_Pos GPIO_MODER_MODER15_Po
#define GPIO_MODER_MODE15_Msk GPIO_MODER_MODER15_Ms
#define GPIO_MODER_MODE15     GPIO_MODER_MODER15
#define GPIO_MODER_MODE15_0   GPIO_MODER_MODER15_0
#define GPIO_MODER_MODE15_1   GPIO_MODER_MODER15_1

/******************  Bits definition for GPIO_OTYPER register  ****************/
#define GPIO_OTYPER_OT0_Pos  (0U)
#define GPIO_OTYPER_OT0_Msk  (0x1UL << GPIO_OTYPER_OT0_Pos) /*!< 0x00000001 */
#define GPIO_OTYPER_OT0      GPIO_OTYPER_OT0_Msk
#define GPIO_OTYPER_OT1_Pos  (1U)
#define GPIO_OTYPER_OT1_Msk  (0x1UL << GPIO_OTYPER_OT1_Pos) /*!< 0x00000002 */
#define GPIO_OTYPER_OT1      GPIO_OTYPER_OT1_Msk
#define GPIO_OTYPER_OT2_Pos  (2U)
#define GPIO_OTYPER_OT2_Msk  (0x1UL << GPIO_OTYPER_OT2_Pos) /*!< 0x00000004 */
#define GPIO_OTYPER_OT2      GPIO_OTYPER_OT2_Msk
#define GPIO_OTYPER_OT3_Pos  (3U)
#define GPIO_OTYPER_OT3_Msk  (0x1UL << GPIO_OTYPER_OT3_Pos) /*!< 0x00000008 */
#define GPIO_OTYPER_OT3      GPIO_OTYPER_OT3_Msk
#define GPIO_OTYPER_OT4_Pos  (4U)
#define GPIO_OTYPER_OT4_Msk  (0x1UL << GPIO_OTYPER_OT4_Pos) /*!< 0x00000010 */
#define GPIO_OTYPER_OT4      GPIO_OTYPER_OT4_Msk
#define GPIO_OTYPER_OT5_Pos  (5U)
#define GPIO_OTYPER_OT5_Msk  (0x1UL << GPIO_OTYPER_OT5_Pos) /*!< 0x00000020 */
#define GPIO_OTYPER_OT5      GPIO_OTYPER_OT5_Msk
#define GPIO_OTYPER_OT6_Pos  (6U)
#define GPIO_OTYPER_OT6_Msk  (0x1UL << GPIO_OTYPER_OT6_Pos) /*!< 0x00000040 */
#define GPIO_OTYPER_OT6      GPIO_OTYPER_OT6_Msk
#define GPIO_OTYPER_OT7_Pos  (7U)
#define GPIO_OTYPER_OT7_Msk  (0x1UL << GPIO_OTYPER_OT7_Pos) /*!< 0x00000080 */
#define GPIO_OTYPER_OT7      GPIO_OTYPER_OT7_Msk
#define GPIO_OTYPER_OT8_Pos  (8U)
#define GPIO_OTYPER_OT8_Msk  (0x1UL << GPIO_OTYPER_OT8_Pos) /*!< 0x00000100 */
#define GPIO_OTYPER_OT8      GPIO_OTYPER_OT8_Msk
#define GPIO_OTYPER_OT9_Pos  (9U)
#define GPIO_OTYPER_OT9_Msk  (0x1UL << GPIO_OTYPER_OT9_Pos) /*!< 0x00000200 */
#define GPIO_OTYPER_OT9      GPIO_OTYPER_OT9_Msk
#define GPIO_OTYPER_OT10_Pos (10U)
#define GPIO_OTYPER_OT10_Msk (0x1UL << GPIO_OTYPER_OT10_Pos) /*!< 0x00000400 */
#define GPIO_OTYPER_OT10     GPIO_OTYPER_OT10_Msk
#define GPIO_OTYPER_OT11_Pos (11U)
#define GPIO_OTYPER_OT11_Msk (0x1UL << GPIO_OTYPER_OT11_Pos) /*!< 0x00000800 */
#define GPIO_OTYPER_OT11     GPIO_OTYPER_OT11_Msk
#define GPIO_OTYPER_OT12_Pos (12U)
#define GPIO_OTYPER_OT12_Msk (0x1UL << GPIO_OTYPER_OT12_Pos) /*!< 0x00001000 */
#define GPIO_OTYPER_OT12     GPIO_OTYPER_OT12_Msk
#define GPIO_OTYPER_OT13_Pos (13U)
#define GPIO_OTYPER_OT13_Msk (0x1UL << GPIO_OTYPER_OT13_Pos) /*!< 0x00002000 */
#define GPIO_OTYPER_OT13     GPIO_OTYPER_OT13_Msk
#define GPIO_OTYPER_OT14_Pos (14U)
#define GPIO_OTYPER_OT14_Msk (0x1UL << GPIO_OTYPER_OT14_Pos) /*!< 0x00004000 */
#define GPIO_OTYPER_OT14     GPIO_OTYPER_OT14_Msk
#define GPIO_OTYPER_OT15_Pos (15U)
#define GPIO_OTYPER_OT15_Msk (0x1UL << GPIO_OTYPER_OT15_Pos) /*!< 0x00008000 */
#define GPIO_OTYPER_OT15     GPIO_OTYPER_OT15_Msk

/******************  Bits definition for GPIO_OSPEEDR register  ***************/
#define GPIO_OSPEEDR_OSPEED0_Pos  (0U)
#define GPIO_OSPEEDR_OSPEED0_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED0_Pos) /*!< 0x00000003 */
#define GPIO_OSPEEDR_OSPEED0      GPIO_OSPEEDR_OSPEED0_Msk
#define GPIO_OSPEEDR_OSPEED0_0    (0x1UL << GPIO_OSPEEDR_OSPEED0_Pos) /*!< 0x00000001 */
#define GPIO_OSPEEDR_OSPEED0_1    (0x2UL << GPIO_OSPEEDR_OSPEED0_Pos) /*!< 0x00000002 */

#define GPIO_OSPEEDR_OSPEED1_Pos  (2U)
#define GPIO_OSPEEDR_OSPEED1_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED1_Pos) /*!< 0x0000000C */
#define GPIO_OSPEEDR_OSPEED1      GPIO_OSPEEDR_OSPEED1_Msk
#define GPIO_OSPEEDR_OSPEED1_0    (0x1UL << GPIO_OSPEEDR_OSPEED1_Pos) /*!< 0x00000004 */
#define GPIO_OSPEEDR_OSPEED1_1    (0x2UL << GPIO_OSPEEDR_OSPEED1_Pos) /*!< 0x00000008 */

#define GPIO_OSPEEDR_OSPEED2_Pos  (4U)
#define GPIO_OSPEEDR_OSPEED2_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED2_Pos) /*!< 0x00000030 */
#define GPIO_OSPEEDR_OSPEED2      GPIO_OSPEEDR_OSPEED2_Msk
#define GPIO_OSPEEDR_OSPEED2_0    (0x1UL << GPIO_OSPEEDR_OSPEED2_Pos) /*!< 0x00000010 */
#define GPIO_OSPEEDR_OSPEED2_1    (0x2UL << GPIO_OSPEEDR_OSPEED2_Pos) /*!< 0x00000020 */

#define GPIO_OSPEEDR_OSPEED3_Pos  (6U)
#define GPIO_OSPEEDR_OSPEED3_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED3_Pos) /*!< 0x000000C0 */
#define GPIO_OSPEEDR_OSPEED3      GPIO_OSPEEDR_OSPEED3_Msk
#define GPIO_OSPEEDR_OSPEED3_0    (0x1UL << GPIO_OSPEEDR_OSPEED3_Pos) /*!< 0x00000040 */
#define GPIO_OSPEEDR_OSPEED3_1    (0x2UL << GPIO_OSPEEDR_OSPEED3_Pos) /*!< 0x00000080 */

#define GPIO_OSPEEDR_OSPEED4_Pos  (8U)
#define GPIO_OSPEEDR_OSPEED4_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED4_Pos) /*!< 0x00000300 */
#define GPIO_OSPEEDR_OSPEED4      GPIO_OSPEEDR_OSPEED4_Msk
#define GPIO_OSPEEDR_OSPEED4_0    (0x1UL << GPIO_OSPEEDR_OSPEED4_Pos) /*!< 0x00000100 */
#define GPIO_OSPEEDR_OSPEED4_1    (0x2UL << GPIO_OSPEEDR_OSPEED4_Pos) /*!< 0x00000200 */

#define GPIO_OSPEEDR_OSPEED5_Pos  (10U)
#define GPIO_OSPEEDR_OSPEED5_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED5_Pos) /*!< 0x00000C00 */
#define GPIO_OSPEEDR_OSPEED5      GPIO_OSPEEDR_OSPEED5_Msk
#define GPIO_OSPEEDR_OSPEED5_0    (0x1UL << GPIO_OSPEEDR_OSPEED5_Pos) /*!< 0x00000400 */
#define GPIO_OSPEEDR_OSPEED5_1    (0x2UL << GPIO_OSPEEDR_OSPEED5_Pos) /*!< 0x00000800 */

#define GPIO_OSPEEDR_OSPEED6_Pos  (12U)
#define GPIO_OSPEEDR_OSPEED6_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED6_Pos) /*!< 0x00003000 */
#define GPIO_OSPEEDR_OSPEED6      GPIO_OSPEEDR_OSPEED6_Msk
#define GPIO_OSPEEDR_OSPEED6_0    (0x1UL << GPIO_OSPEEDR_OSPEED6_Pos) /*!< 0x00001000 */
#define GPIO_OSPEEDR_OSPEED6_1    (0x2UL << GPIO_OSPEEDR_OSPEED6_Pos) /*!< 0x00002000 */

#define GPIO_OSPEEDR_OSPEED7_Pos  (14U)
#define GPIO_OSPEEDR_OSPEED7_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED7_Pos) /*!< 0x0000C000 */
#define GPIO_OSPEEDR_OSPEED7      GPIO_OSPEEDR_OSPEED7_Msk
#define GPIO_OSPEEDR_OSPEED7_0    (0x1UL << GPIO_OSPEEDR_OSPEED7_Pos) /*!< 0x00004000 */
#define GPIO_OSPEEDR_OSPEED7_1    (0x2UL << GPIO_OSPEEDR_OSPEED7_Pos) /*!< 0x00008000 */

#define GPIO_OSPEEDR_OSPEED8_Pos  (16U)
#define GPIO_OSPEEDR_OSPEED8_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED8_Pos) /*!< 0x00030000 */
#define GPIO_OSPEEDR_OSPEED8      GPIO_OSPEEDR_OSPEED8_Msk
#define GPIO_OSPEEDR_OSPEED8_0    (0x1UL << GPIO_OSPEEDR_OSPEED8_Pos) /*!< 0x00010000 */
#define GPIO_OSPEEDR_OSPEED8_1    (0x2UL << GPIO_OSPEEDR_OSPEED8_Pos) /*!< 0x00020000 */

#define GPIO_OSPEEDR_OSPEED9_Pos  (18U)
#define GPIO_OSPEEDR_OSPEED9_Msk  (0x3UL << GPIO_OSPEEDR_OSPEED9_Pos) /*!< 0x000C0000 */
#define GPIO_OSPEEDR_OSPEED9      GPIO_OSPEEDR_OSPEED9_Msk
#define GPIO_OSPEEDR_OSPEED9_0    (0x1UL << GPIO_OSPEEDR_OSPEED9_Pos) /*!< 0x00040000 */
#define GPIO_OSPEEDR_OSPEED9_1    (0x2UL << GPIO_OSPEEDR_OSPEED9_Pos) /*!< 0x00080000 */

