Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define GPIO_OSPEEDR_OSPEED10_Pos (20U)
#define GPIO_OSPEEDR_OSPEED10_Msk (0x3UL << GPIO_OSPEEDR_OSPEED10_Pos) /*!< 0x00300000 */
#define GPIO_OSPEEDR_OSPEED10     GPIO_OSPEEDR_OSPEED10_Msk
#define GPIO_OSPEEDR_OSPEED10_0   (0x1UL << GPIO_OSPEEDR_OSPEED10_Pos) /*!< 0x00100000 */
#define GPIO_OSPEEDR_OSPEED10_1   (0x2UL << GPIO_OSPEEDR_OSPEED10_Pos) /*!< 0x00200000 */

#define GPIO_OSPEEDR_OSPEED11_Pos (22U)
#define GPIO_OSPEEDR_OSPEED11_Msk (0x3UL << GPIO_OSPEEDR_OSPEED11_Pos) /*!< 0x00C00000 */
#define GPIO_OSPEEDR_OSPEED11     GPIO_OSPEEDR_OSPEED11_Msk
#define GPIO_OSPEEDR_OSPEED11_0   (0x1UL << GPIO_OSPEEDR_OSPEED11_Pos) /*!< 0x00400000 */
#define GPIO_OSPEEDR_OSPEED11_1   (0x2UL << GPIO_OSPEEDR_OSPEED11_Pos) /*!< 0x00800000 */

#define GPIO_OSPEEDR_OSPEED12_Pos (24U)
#define GPIO_OSPEEDR_OSPEED12_Msk (0x3UL << GPIO_OSPEEDR_OSPEED12_Pos) /*!< 0x03000000 */
#define GPIO_OSPEEDR_OSPEED12     GPIO_OSPEEDR_OSPEED12_Msk
#define GPIO_OSPEEDR_OSPEED12_0   (0x1UL << GPIO_OSPEEDR_OSPEED12_Pos) /*!< 0x01000000 */
#define GPIO_OSPEEDR_OSPEED12_1   (0x2UL << GPIO_OSPEEDR_OSPEED12_Pos) /*!< 0x02000000 */

#define GPIO_OSPEEDR_OSPEED13_Pos (26U)
#define GPIO_OSPEEDR_OSPEED13_Msk (0x3UL << GPIO_OSPEEDR_OSPEED13_Pos) /*!< 0x0C000000 */
#define GPIO_OSPEEDR_OSPEED13     GPIO_OSPEEDR_OSPEED13_Msk
#define GPIO_OSPEEDR_OSPEED13_0   (0x1UL << GPIO_OSPEEDR_OSPEED13_Pos) /*!< 0x04000000 */
#define GPIO_OSPEEDR_OSPEED13_1   (0x2UL << GPIO_OSPEEDR_OSPEED13_Pos) /*!< 0x08000000 */

#define GPIO_OSPEEDR_OSPEED14_Pos (28U)
#define GPIO_OSPEEDR_OSPEED14_Msk (0x3UL << GPIO_OSPEEDR_OSPEED14_Pos) /*!< 0x30000000 */
#define GPIO_OSPEEDR_OSPEED14     GPIO_OSPEEDR_OSPEED14_Msk
#define GPIO_OSPEEDR_OSPEED14_0   (0x1UL << GPIO_OSPEEDR_OSPEED14_Pos) /*!< 0x10000000 */
#define GPIO_OSPEEDR_OSPEED14_1   (0x2UL << GPIO_OSPEEDR_OSPEED14_Pos) /*!< 0x20000000 */

#define GPIO_OSPEEDR_OSPEED15_Pos (30U)
#define GPIO_OSPEEDR_OSPEED15_Msk (0x3UL << GPIO_OSPEEDR_OSPEED15_Pos) /*!< 0xC0000000 */
#define GPIO_OSPEEDR_OSPEED15     GPIO_OSPEEDR_OSPEED15_Msk
#define GPIO_OSPEEDR_OSPEED15_0   (0x1UL << GPIO_OSPEEDR_OSPEED15_Pos) /*!< 0x40000000 */
#define GPIO_OSPEEDR_OSPEED15_1   (0x2UL << GPIO_OSPEEDR_OSPEED15_Pos) /*!< 0x80000000 */

/******************  Bits definition for GPIO_PUPDR register  *****************/
#define GPIO_PUPDR_PUPD0_Pos  (0U)
#define GPIO_PUPDR_PUPD0_Msk  (0x3UL << GPIO_PUPDR_PUPD0_Pos) /*!< 0x00000003 */
#define GPIO_PUPDR_PUPD0      GPIO_PUPDR_PUPD0_Msk
#define GPIO_PUPDR_PUPD0_0    (0x1UL << GPIO_PUPDR_PUPD0_Pos) /*!< 0x00000001 */
#define GPIO_PUPDR_PUPD0_1    (0x2UL << GPIO_PUPDR_PUPD0_Pos) /*!< 0x00000002 */

#define GPIO_PUPDR_PUPD1_Pos  (2U)
#define GPIO_PUPDR_PUPD1_Msk  (0x3UL << GPIO_PUPDR_PUPD1_Pos) /*!< 0x0000000C */
#define GPIO_PUPDR_PUPD1      GPIO_PUPDR_PUPD1_Msk
#define GPIO_PUPDR_PUPD1_0    (0x1UL << GPIO_PUPDR_PUPD1_Pos) /*!< 0x00000004 */
#define GPIO_PUPDR_PUPD1_1    (0x2UL << GPIO_PUPDR_PUPD1_Pos) /*!< 0x00000008 */

#define GPIO_PUPDR_PUPD2_Pos  (4U)
#define GPIO_PUPDR_PUPD2_Msk  (0x3UL << GPIO_PUPDR_PUPD2_Pos) /*!< 0x00000030 */
#define GPIO_PUPDR_PUPD2      GPIO_PUPDR_PUPD2_Msk
#define GPIO_PUPDR_PUPD2_0    (0x1UL << GPIO_PUPDR_PUPD2_Pos) /*!< 0x00000010 */
#define GPIO_PUPDR_PUPD2_1    (0x2UL << GPIO_PUPDR_PUPD2_Pos) /*!< 0x00000020 */

#define GPIO_PUPDR_PUPD3_Pos  (6U)
#define GPIO_PUPDR_PUPD3_Msk  (0x3UL << GPIO_PUPDR_PUPD3_Pos) /*!< 0x000000C0 */
#define GPIO_PUPDR_PUPD3      GPIO_PUPDR_PUPD3_Msk
#define GPIO_PUPDR_PUPD3_0    (0x1UL << GPIO_PUPDR_PUPD3_Pos) /*!< 0x00000040 */
#define GPIO_PUPDR_PUPD3_1    (0x2UL << GPIO_PUPDR_PUPD3_Pos) /*!< 0x00000080 */

#define GPIO_PUPDR_PUPD4_Pos  (8U)
#define GPIO_PUPDR_PUPD4_Msk  (0x3UL << GPIO_PUPDR_PUPD4_Pos) /*!< 0x00000300 */
#define GPIO_PUPDR_PUPD4      GPIO_PUPDR_PUPD4_Msk
#define GPIO_PUPDR_PUPD4_0    (0x1UL << GPIO_PUPDR_PUPD4_Pos) /*!< 0x00000100 */
#define GPIO_PUPDR_PUPD4_1    (0x2UL << GPIO_PUPDR_PUPD4_Pos) /*!< 0x00000200 */

#define GPIO_PUPDR_PUPD5_Pos  (10U)
#define GPIO_PUPDR_PUPD5_Msk  (0x3UL << GPIO_PUPDR_PUPD5_Pos) /*!< 0x00000C00 */
#define GPIO_PUPDR_PUPD5      GPIO_PUPDR_PUPD5_Msk
#define GPIO_PUPDR_PUPD5_0    (0x1UL << GPIO_PUPDR_PUPD5_Pos) /*!< 0x00000400 */
#define GPIO_PUPDR_PUPD5_1    (0x2UL << GPIO_PUPDR_PUPD5_Pos) /*!< 0x00000800 */

#define GPIO_PUPDR_PUPD6_Pos  (12U)
#define GPIO_PUPDR_PUPD6_Msk  (0x3UL << GPIO_PUPDR_PUPD6_Pos) /*!< 0x00003000 */
#define GPIO_PUPDR_PUPD6      GPIO_PUPDR_PUPD6_Msk
#define GPIO_PUPDR_PUPD6_0    (0x1UL << GPIO_PUPDR_PUPD6_Pos) /*!< 0x00001000 */
#define GPIO_PUPDR_PUPD6_1    (0x2UL << GPIO_PUPDR_PUPD6_Pos) /*!< 0x00002000 */

#define GPIO_PUPDR_PUPD7_Pos  (14U)
#define GPIO_PUPDR_PUPD7_Msk  (0x3UL << GPIO_PUPDR_PUPD7_Pos) /*!< 0x0000C000 */
#define GPIO_PUPDR_PUPD7      GPIO_PUPDR_PUPD7_Msk
#define GPIO_PUPDR_PUPD7_0    (0x1UL << GPIO_PUPDR_PUPD7_Pos) /*!< 0x00004000 */
#define GPIO_PUPDR_PUPD7_1    (0x2UL << GPIO_PUPDR_PUPD7_Pos) /*!< 0x00008000 */

#define GPIO_PUPDR_PUPD8_Pos  (16U)
#define GPIO_PUPDR_PUPD8_Msk  (0x3UL << GPIO_PUPDR_PUPD8_Pos) /*!< 0x00030000 */
#define GPIO_PUPDR_PUPD8      GPIO_PUPDR_PUPD8_Msk
#define GPIO_PUPDR_PUPD8_0    (0x1UL << GPIO_PUPDR_PUPD8_Pos) /*!< 0x00010000 */
#define GPIO_PUPDR_PUPD8_1    (0x2UL << GPIO_PUPDR_PUPD8_Pos) /*!< 0x00020000 */

#define GPIO_PUPDR_PUPD9_Pos  (18U)
#define GPIO_PUPDR_PUPD9_Msk  (0x3UL << GPIO_PUPDR_PUPD9_Pos) /*!< 0x000C0000 */
#define GPIO_PUPDR_PUPD9      GPIO_PUPDR_PUPD9_Msk
#define GPIO_PUPDR_PUPD9_0    (0x1UL << GPIO_PUPDR_PUPD9_Pos) /*!< 0x00040000 */
#define GPIO_PUPDR_PUPD9_1    (0x2UL << GPIO_PUPDR_PUPD9_Pos) /*!< 0x00080000 */

#define GPIO_PUPDR_PUPD10_Pos (20U)
#define GPIO_PUPDR_PUPD10_Msk (0x3UL << GPIO_PUPDR_PUPD10_Pos) /*!< 0x00300000 */
#define GPIO_PUPDR_PUPD10     GPIO_PUPDR_PUPD10_Msk
#define GPIO_PUPDR_PUPD10_0   (0x1UL << GPIO_PUPDR_PUPD10_Pos) /*!< 0x00100000 */
#define GPIO_PUPDR_PUPD10_1   (0x2UL << GPIO_PUPDR_PUPD10_Pos) /*!< 0x00200000 */

#define GPIO_PUPDR_PUPD11_Pos (22U)
#define GPIO_PUPDR_PUPD11_Msk (0x3UL << GPIO_PUPDR_PUPD11_Pos) /*!< 0x00C00000 */
#define GPIO_PUPDR_PUPD11     GPIO_PUPDR_PUPD11_Msk
#define GPIO_PUPDR_PUPD11_0   (0x1UL << GPIO_PUPDR_PUPD11_Pos) /*!< 0x00400000 */
#define GPIO_PUPDR_PUPD11_1   (0x2UL << GPIO_PUPDR_PUPD11_Pos) /*!< 0x00800000 */

#define GPIO_PUPDR_PUPD12_Pos (24U)
#define GPIO_PUPDR_PUPD12_Msk (0x3UL << GPIO_PUPDR_PUPD12_Pos) /*!< 0x03000000 */
#define GPIO_PUPDR_PUPD12     GPIO_PUPDR_PUPD12_Msk
#define GPIO_PUPDR_PUPD12_0   (0x1UL << GPIO_PUPDR_PUPD12_Pos) /*!< 0x01000000 */
#define GPIO_PUPDR_PUPD12_1   (0x2UL << GPIO_PUPDR_PUPD12_Pos) /*!< 0x02000000 */

#define GPIO_PUPDR_PUPD13_Pos (26U)
#define GPIO_PUPDR_PUPD13_Msk (0x3UL << GPIO_PUPDR_PUPD13_Pos) /*!< 0x0C000000 */
#define GPIO_PUPDR_PUPD13     GPIO_PUPDR_PUPD13_Msk
#define GPIO_PUPDR_PUPD13_0   (0x1UL << GPIO_PUPDR_PUPD13_Pos) /*!< 0x04000000 */
#define GPIO_PUPDR_PUPD13_1   (0x2UL << GPIO_PUPDR_PUPD13_Pos) /*!< 0x08000000 */

#define GPIO_PUPDR_PUPD14_Pos (28U)
#define GPIO_PUPDR_PUPD14_Msk (0x3UL << GPIO_PUPDR_PUPD14_Pos) /*!< 0x30000000 */
#define GPIO_PUPDR_PUPD14     GPIO_PUPDR_PUPD14_Msk
#define GPIO_PUPDR_PUPD14_0   (0x1UL << GPIO_PUPDR_PUPD14_Pos) /*!< 0x10000000 */
#define GPIO_PUPDR_PUPD14_1   (0x2UL << GPIO_PUPDR_PUPD14_Pos) /*!< 0x20000000 */

#define GPIO_PUPDR_PUPD15_Pos (30U)
#define GPIO_PUPDR_PUPD15_Msk (0x3UL << GPIO_PUPDR_PUPD15_Pos) /*!< 0xC0000000 */
#define GPIO_PUPDR_PUPD15     GPIO_PUPDR_PUPD15_Msk
#define GPIO_PUPDR_PUPD15_0   (0x1UL << GPIO_PUPDR_PUPD15_Pos) /*!< 0x40000000 */
#define GPIO_PUPDR_PUPD15_1   (0x2UL << GPIO_PUPDR_PUPD15_Pos) /*!< 0x80000000 */

/******************  Bits definition for GPIO_IDR register  *******************/
#define GPIO_IDR_ID0_Pos  (0U)
#define GPIO_IDR_ID0_Msk  (0x1UL << GPIO_IDR_ID0_Pos) /*!< 0x00000001 */
#define GPIO_IDR_ID0      GPIO_IDR_ID0_Msk
#define GPIO_IDR_ID1_Pos  (1U)
#define GPIO_IDR_ID1_Msk  (0x1UL << GPIO_IDR_ID1_Pos) /*!< 0x00000002 */
#define GPIO_IDR_ID1      GPIO_IDR_ID1_Msk
#define GPIO_IDR_ID2_Pos  (2U)
#define GPIO_IDR_ID2_Msk  (0x1UL << GPIO_IDR_ID2_Pos) /*!< 0x00000004 */
#define GPIO_IDR_ID2      GPIO_IDR_ID2_Msk
#define GPIO_IDR_ID3_Pos  (3U)
#define GPIO_IDR_ID3_Msk  (0x1UL << GPIO_IDR_ID3_Pos) /*!< 0x00000008 */
#define GPIO_IDR_ID3      GPIO_IDR_ID3_Msk
#define GPIO_IDR_ID4_Pos  (4U)
#define GPIO_IDR_ID4_Msk  (0x1UL << GPIO_IDR_ID4_Pos) /*!< 0x00000010 */
#define GPIO_IDR_ID4      GPIO_IDR_ID4_Msk
#define GPIO_IDR_ID5_Pos  (5U)
#define GPIO_IDR_ID5_Msk  (0x1UL << GPIO_IDR_ID5_Pos) /*!< 0x00000020 */
#define GPIO_IDR_ID5      GPIO_IDR_ID5_Msk
#define GPIO_IDR_ID6_Pos  (6U)
#define GPIO_IDR_ID6_Msk  (0x1UL << GPIO_IDR_ID6_Pos) /*!< 0x00000040 */
#define GPIO_IDR_ID6      GPIO_IDR_ID6_Msk
#define GPIO_IDR_ID7_Pos  (7U)
#define GPIO_IDR_ID7_Msk  (0x1UL << GPIO_IDR_ID7_Pos) /*!< 0x00000080 */
#define GPIO_IDR_ID7      GPIO_IDR_ID7_Msk
#define GPIO_IDR_ID8_Pos  (8U)
#define GPIO_IDR_ID8_Msk  (0x1UL << GPIO_IDR_ID8_Pos) /*!< 0x00000100 */
#define GPIO_IDR_ID8      GPIO_IDR_ID8_Msk
#define GPIO_IDR_ID9_Pos  (9U)
#define GPIO_IDR_ID9_Msk  (0x1UL << GPIO_IDR_ID9_Pos) /*!< 0x00000200 */
#define GPIO_IDR_ID9      GPIO_IDR_ID9_Msk
#define GPIO_IDR_ID10_Pos (10U)
#define GPIO_IDR_ID10_Msk (0x1UL << GPIO_IDR_ID10_Pos) /*!< 0x00000400 */
#define GPIO_IDR_ID10     GPIO_IDR_ID10_Msk
#define GPIO_IDR_ID11_Pos (11U)
#define GPIO_IDR_ID11_Msk (0x1UL << GPIO_IDR_ID11_Pos) /*!< 0x00000800 */
#define GPIO_IDR_ID11     GPIO_IDR_ID11_Msk
#define GPIO_IDR_ID12_Pos (12U)
#define GPIO_IDR_ID12_Msk (0x1UL << GPIO_IDR_ID12_Pos) /*!< 0x00001000 */
#define GPIO_IDR_ID12     GPIO_IDR_ID12_Msk
#define GPIO_IDR_ID13_Pos (13U)
#define GPIO_IDR_ID13_Msk (0x1UL << GPIO_IDR_ID13_Pos) /*!< 0x00002000 */
#define GPIO_IDR_ID13     GPIO_IDR_ID13_Msk
#define GPIO_IDR_ID14_Pos (14U)
#define GPIO_IDR_ID14_Msk (0x1UL << GPIO_IDR_ID14_Pos) /*!< 0x00004000 */
#define GPIO_IDR_ID14     GPIO_IDR_ID14_Msk
#define GPIO_IDR_ID15_Pos (15U)
#define GPIO_IDR_ID15_Msk (0x1UL << GPIO_IDR_ID15_Pos) /*!< 0x00008000 */
#define GPIO_IDR_ID15     GPIO_IDR_ID15_Msk

/******************  Bits definition for GPIO_ODR register  *******************/
#define GPIO_ODR_OD0_Pos  (0U)
#define GPIO_ODR_OD0_Msk  (0x1UL << GPIO_ODR_OD0_Pos) /*!< 0x00000001 */
#define GPIO_ODR_OD0      GPIO_ODR_OD0_Msk
#define GPIO_ODR_OD1_Pos  (1U)
#define GPIO_ODR_OD1_Msk  (0x1UL << GPIO_ODR_OD1_Pos) /*!< 0x00000002 */
#define GPIO_ODR_OD1      GPIO_ODR_OD1_Msk
#define GPIO_ODR_OD2_Pos  (2U)
#define GPIO_ODR_OD2_Msk  (0x1UL << GPIO_ODR_OD2_Pos) /*!< 0x00000004 */
#define GPIO_ODR_OD2      GPIO_ODR_OD2_Msk
#define GPIO_ODR_OD3_Pos  (3U)
#define GPIO_ODR_OD3_Msk  (0x1UL << GPIO_ODR_OD3_Pos) /*!< 0x00000008 */
#define GPIO_ODR_OD3      GPIO_ODR_OD3_Msk
#define GPIO_ODR_OD4_Pos  (4U)
#define GPIO_ODR_OD4_Msk  (0x1UL << GPIO_ODR_OD4_Pos) /*!< 0x00000010 */
#define GPIO_ODR_OD4      GPIO_ODR_OD4_Msk
#define GPIO_ODR_OD5_Pos  (5U)
#define GPIO_ODR_OD5_Msk  (0x1UL << GPIO_ODR_OD5_Pos) /*!< 0x00000020 */
#define GPIO_ODR_OD5      GPIO_ODR_OD5_Msk
#define GPIO_ODR_OD6_Pos  (6U)
#define GPIO_ODR_OD6_Msk  (0x1UL << GPIO_ODR_OD6_Pos) /*!< 0x00000040 */
#define GPIO_ODR_OD6      GPIO_ODR_OD6_Msk
#define GPIO_ODR_OD7_Pos  (7U)
#define GPIO_ODR_OD7_Msk  (0x1UL << GPIO_ODR_OD7_Pos) /*!< 0x00000080 */
#define GPIO_ODR_OD7      GPIO_ODR_OD7_Msk
#define GPIO_ODR_OD8_Pos  (8U)
#define GPIO_ODR_OD8_Msk  (0x1UL << GPIO_ODR_OD8_Pos) /*!< 0x00000100 */
#define GPIO_ODR_OD8      GPIO_ODR_OD8_Msk
#define GPIO_ODR_OD9_Pos  (9U)
#define GPIO_ODR_OD9_Msk  (0x1UL << GPIO_ODR_OD9_Pos) /*!< 0x00000200 */
#define GPIO_ODR_OD9      GPIO_ODR_OD9_Msk
#define GPIO_ODR_OD10_Pos (10U)
#define GPIO_ODR_OD10_Msk (0x1UL << GPIO_ODR_OD10_Pos) /*!< 0x00000400 */
#define GPIO_ODR_OD10     GPIO_ODR_OD10_Msk
#define GPIO_ODR_OD11_Pos (11U)
#define GPIO_ODR_OD11_Msk (0x1UL << GPIO_ODR_OD11_Pos) /*!< 0x00000800 */
#define GPIO_ODR_OD11     GPIO_ODR_OD11_Msk
#define GPIO_ODR_OD12_Pos (12U)
#define GPIO_ODR_OD12_Msk (0x1UL << GPIO_ODR_OD12_Pos) /*!< 0x00001000 */
#define GPIO_ODR_OD12     GPIO_ODR_OD12_Msk
#define GPIO_ODR_OD13_Pos (13U)
#define GPIO_ODR_OD13_Msk (0x1UL << GPIO_ODR_OD13_Pos) /*!< 0x00002000 */
#define GPIO_ODR_OD13     GPIO_ODR_OD13_Msk
#define GPIO_ODR_OD14_Pos (14U)
#define GPIO_ODR_OD14_Msk (0x1UL << GPIO_ODR_OD14_Pos) /*!< 0x00004000 */
#define GPIO_ODR_OD14     GPIO_ODR_OD14_Msk
#define GPIO_ODR_OD15_Pos (15U)
#define GPIO_ODR_OD15_Msk (0x1UL << GPIO_ODR_OD15_Pos) /*!< 0x00008000 */
#define GPIO_ODR_OD15     GPIO_ODR_OD15_Msk

/******************  Bits definition for GPIO_BSRR register  ******************/
#define GPIO_BSRR_BS0_Pos  (0U)
#define GPIO_BSRR_BS0_Msk  (0x1UL << GPIO_BSRR_BS0_Pos) /*!< 0x00000001 */
#define GPIO_BSRR_BS0      GPIO_BSRR_BS0_Msk
#define GPIO_BSRR_BS1_Pos  (1U)
#define GPIO_BSRR_BS1_Msk  (0x1UL << GPIO_BSRR_BS1_Pos) /*!< 0x00000002 */
#define GPIO_BSRR_BS1      GPIO_BSRR_BS1_Msk
#define GPIO_BSRR_BS2_Pos  (2U)
#define GPIO_BSRR_BS2_Msk  (0x1UL << GPIO_BSRR_BS2_Pos) /*!< 0x00000004 */
#define GPIO_BSRR_BS2      GPIO_BSRR_BS2_Msk
#define GPIO_BSRR_BS3_Pos  (3U)
#define GPIO_BSRR_BS3_Msk  (0x1UL << GPIO_BSRR_BS3_Pos) /*!< 0x00000008 */
#define GPIO_BSRR_BS3      GPIO_BSRR_BS3_Msk
#define GPIO_BSRR_BS4_Pos  (4U)
#define GPIO_BSRR_BS4_Msk  (0x1UL << GPIO_BSRR_BS4_Pos) /*!< 0x00000010 */
#define GPIO_BSRR_BS4      GPIO_BSRR_BS4_Msk
#define GPIO_BSRR_BS5_Pos  (5U)
#define GPIO_BSRR_BS5_Msk  (0x1UL << GPIO_BSRR_BS5_Pos) /*!< 0x00000020 */
#define GPIO_BSRR_BS5      GPIO_BSRR_BS5_Msk
#define GPIO_BSRR_BS6_Pos  (6U)
#define GPIO_BSRR_BS6_Msk  (0x1UL << GPIO_BSRR_BS6_Pos) /*!< 0x00000040 */
#define GPIO_BSRR_BS6      GPIO_BSRR_BS6_Msk
#define GPIO_BSRR_BS7_Pos  (7U)
#define GPIO_BSRR_BS7_Msk  (0x1UL << GPIO_BSRR_BS7_Pos) /*!< 0x00000080 */
#define GPIO_BSRR_BS7      GPIO_BSRR_BS7_Msk
#define GPIO_BSRR_BS8_Pos  (8U)
#define GPIO_BSRR_BS8_Msk  (0x1UL << GPIO_BSRR_BS8_Pos) /*!< 0x00000100 */
#define GPIO_BSRR_BS8      GPIO_BSRR_BS8_Msk
#define GPIO_BSRR_BS9_Pos  (9U)
#define GPIO_BSRR_BS9_Msk  (0x1UL << GPIO_BSRR_BS9_Pos) /*!< 0x00000200 */
#define GPIO_BSRR_BS9      GPIO_BSRR_BS9_Msk
#define GPIO_BSRR_BS10_Pos (10U)
#define GPIO_BSRR_BS10_Msk (0x1UL << GPIO_BSRR_BS10_Pos) /*!< 0x00000400 */
#define GPIO_BSRR_BS10     GPIO_BSRR_BS10_Msk
#define GPIO_BSRR_BS11_Pos (11U)
#define GPIO_BSRR_BS11_Msk (0x1UL << GPIO_BSRR_BS11_Pos) /*!< 0x00000800 */
#define GPIO_BSRR_BS11     GPIO_BSRR_BS11_Msk
#define GPIO_BSRR_BS12_Pos (12U)
#define GPIO_BSRR_BS12_Msk (0x1UL << GPIO_BSRR_BS12_Pos) /*!< 0x00001000 */
#define GPIO_BSRR_BS12     GPIO_BSRR_BS12_Msk
#define GPIO_BSRR_BS13_Pos (13U)
#define GPIO_BSRR_BS13_Msk (0x1UL << GPIO_BSRR_BS13_Pos) /*!< 0x00002000 */
#define GPIO_BSRR_BS13     GPIO_BSRR_BS13_Msk
#define GPIO_BSRR_BS14_Pos (14U)
#define GPIO_BSRR_BS14_Msk (0x1UL << GPIO_BSRR_BS14_Pos) /*!< 0x00004000 */
#define GPIO_BSRR_BS14     GPIO_BSRR_BS14_Msk
#define GPIO_BSRR_BS15_Pos (15U)
#define GPIO_BSRR_BS15_Msk (0x1UL << GPIO_BSRR_BS15_Pos) /*!< 0x00008000 */
#define GPIO_BSRR_BS15     GPIO_BSRR_BS15_Msk
#define GPIO_BSRR_BR0_Pos  (16U)
#define GPIO_BSRR_BR0_Msk  (0x1UL << GPIO_BSRR_BR0_Pos) /*!< 0x00010000 */
#define GPIO_BSRR_BR0      GPIO_BSRR_BR0_Msk
#define GPIO_BSRR_BR1_Pos  (17U)
#define GPIO_BSRR_BR1_Msk  (0x1UL << GPIO_BSRR_BR1_Pos) /*!< 0x00020000 */
#define GPIO_BSRR_BR1      GPIO_BSRR_BR1_Msk
#define GPIO_BSRR_BR2_Pos  (18U)
#define GPIO_BSRR_BR2_Msk  (0x1UL << GPIO_BSRR_BR2_Pos) /*!< 0x00040000 */
#define GPIO_BSRR_BR2      GPIO_BSRR_BR2_Msk
#define GPIO_BSRR_BR3_Pos  (19U)
#define GPIO_BSRR_BR3_Msk  (0x1UL << GPIO_BSRR_BR3_Pos) /*!< 0x00080000 */
#define GPIO_BSRR_BR3      GPIO_BSRR_BR3_Msk
#define GPIO_BSRR_BR4_Pos  (20U)
#define GPIO_BSRR_BR4_Msk  (0x1UL << GPIO_BSRR_BR4_Pos) /*!< 0x00100000 */
#define GPIO_BSRR_BR4      GPIO_BSRR_BR4_Msk
#define GPIO_BSRR_BR5_Pos  (21U)
#define GPIO_BSRR_BR5_Msk  (0x1UL << GPIO_BSRR_BR5_Pos) /*!< 0x00200000 */
#define GPIO_BSRR_BR5      GPIO_BSRR_BR5_Msk
#define GPIO_BSRR_BR6_Pos  (22U)
#define GPIO_BSRR_BR6_Msk  (0x1UL << GPIO_BSRR_BR6_Pos) /*!< 0x00400000 */
#define GPIO_BSRR_BR6      GPIO_BSRR_BR6_Msk
#define GPIO_BSRR_BR7_Pos  (23U)
#define GPIO_BSRR_BR7_Msk  (0x1UL << GPIO_BSRR_BR7_Pos) /*!< 0x00800000 */
#define GPIO_BSRR_BR7      GPIO_BSRR_BR7_Msk
#define GPIO_BSRR_BR8_Pos  (24U)
#define GPIO_BSRR_BR8_Msk  (0x1UL << GPIO_BSRR_BR8_Pos) /*!< 0x01000000 */
#define GPIO_BSRR_BR8      GPIO_BSRR_BR8_Msk
#define GPIO_BSRR_BR9_Pos  (25U)
#define GPIO_BSRR_BR9_Msk  (0x1UL << GPIO_BSRR_BR9_Pos) /*!< 0x02000000 */
#define GPIO_BSRR_BR9      GPIO_BSRR_BR9_Msk
#define GPIO_BSRR_BR10_Pos (26U)
#define GPIO_BSRR_BR10_Msk (0x1UL << GPIO_BSRR_BR10_Pos) /*!< 0x04000000 */
#define GPIO_BSRR_BR10     GPIO_BSRR_BR10_Msk
#define GPIO_BSRR_BR11_Pos (27U)
#define GPIO_BSRR_BR11_Msk (0x1UL << GPIO_BSRR_BR11_Pos) /*!< 0x08000000 */
#define GPIO_BSRR_BR11     GPIO_BSRR_BR11_Msk
#define GPIO_BSRR_BR12_Pos (28U)
#define GPIO_BSRR_BR12_Msk (0x1UL << GPIO_BSRR_BR12_Pos) /*!< 0x10000000 */
#define GPIO_BSRR_BR12     GPIO_BSRR_BR12_Msk
#define GPIO_BSRR_BR13_Pos (29U)
#define GPIO_BSRR_BR13_Msk (0x1UL << GPIO_BSRR_BR13_Pos) /*!< 0x20000000 */
#define GPIO_BSRR_BR13     GPIO_BSRR_BR13_Msk
#define GPIO_BSRR_BR14_Pos (30U)
#define GPIO_BSRR_BR14_Msk (0x1UL << GPIO_BSRR_BR14_Pos) /*!< 0x40000000 */
#define GPIO_BSRR_BR14     GPIO_BSRR_BR14_Msk
#define GPIO_BSRR_BR15_Pos (31U)
#define GPIO_BSRR_BR15_Msk (0x1UL << GPIO_BSRR_BR15_Pos) /*!< 0x80000000 */
#define GPIO_BSRR_BR15     GPIO_BSRR_BR15_Msk

/****************** Bit definition for GPIO_LCKR register *********************/
#define GPIO_LCKR_LCK0_Pos  (0U)
#define GPIO_LCKR_LCK0_Msk  (0x1UL << GPIO_LCKR_LCK0_Pos) /*!< 0x00000001 */
#define GPIO_LCKR_LCK0      GPIO_LCKR_LCK0_Msk
#define GPIO_LCKR_LCK1_Pos  (1U)
#define GPIO_LCKR_LCK1_Msk  (0x1UL << GPIO_LCKR_LCK1_Pos) /*!< 0x00000002 */
#define GPIO_LCKR_LCK1      GPIO_LCKR_LCK1_Msk
#define GPIO_LCKR_LCK2_Pos  (2U)
#define GPIO_LCKR_LCK2_Msk  (0x1UL << GPIO_LCKR_LCK2_Pos) /*!< 0x00000004 */
#define GPIO_LCKR_LCK2      GPIO_LCKR_LCK2_Msk
#define GPIO_LCKR_LCK3_Pos  (3U)
#define GPIO_LCKR_LCK3_Msk  (0x1UL << GPIO_LCKR_LCK3_Pos) /*!< 0x00000008 */
#define GPIO_LCKR_LCK3      GPIO_LCKR_LCK3_Msk
#define GPIO_LCKR_LCK4_Pos  (4U)
#define GPIO_LCKR_LCK4_Msk  (0x1UL << GPIO_LCKR_LCK4_Pos) /*!< 0x00000010 */
#define GPIO_LCKR_LCK4      GPIO_LCKR_LCK4_Msk
#define GPIO_LCKR_LCK5_Pos  (5U)
#define GPIO_LCKR_LCK5_Msk  (0x1UL << GPIO_LCKR_LCK5_Pos) /*!< 0x00000020 */
#define GPIO_LCKR_LCK5      GPIO_LCKR_LCK5_Msk
#define GPIO_LCKR_LCK6_Pos  (6U)
#define GPIO_LCKR_LCK6_Msk  (0x1UL << GPIO_LCKR_LCK6_Pos) /*!< 0x00000040 */
#define GPIO_LCKR_LCK6      GPIO_LCKR_LCK6_Msk
#define GPIO_LCKR_LCK7_Pos  (7U)
#define GPIO_LCKR_LCK7_Msk  (0x1UL << GPIO_LCKR_LCK7_Pos) /*!< 0x00000080 */
#define GPIO_LCKR_LCK7      GPIO_LCKR_LCK7_Msk
#define GPIO_LCKR_LCK8_Pos  (8U)
#define GPIO_LCKR_LCK8_Msk  (0x1UL << GPIO_LCKR_LCK8_Pos) /*!< 0x00000100 */
#define GPIO_LCKR_LCK8      GPIO_LCKR_LCK8_Msk
#define GPIO_LCKR_LCK9_Pos  (9U)
#define GPIO_LCKR_LCK9_Msk  (0x1UL << GPIO_LCKR_LCK9_Pos) /*!< 0x00000200 */
#define GPIO_LCKR_LCK9      GPIO_LCKR_LCK9_Msk
#define GPIO_LCKR_LCK10_Pos (10U)
#define GPIO_LCKR_LCK10_Msk (0x1UL << GPIO_LCKR_LCK10_Pos) /*!< 0x00000400 */
#define GPIO_LCKR_LCK10     GPIO_LCKR_LCK10_Msk
#define GPIO_LCKR_LCK11_Pos (11U)
#define GPIO_LCKR_LCK11_Msk (0x1UL << GPIO_LCKR_LCK11_Pos) /*!< 0x00000800 */
#define GPIO_LCKR_LCK11     GPIO_LCKR_LCK11_Msk
#define GPIO_LCKR_LCK12_Pos (12U)
#define GPIO_LCKR_LCK12_Msk (0x1UL << GPIO_LCKR_LCK12_Pos) /*!< 0x00001000 */
#define GPIO_LCKR_LCK12     GPIO_LCKR_LCK12_Msk
#define GPIO_LCKR_LCK13_Pos (13U)
#define GPIO_LCKR_LCK13_Msk (0x1UL << GPIO_LCKR_LCK13_Pos) /*!< 0x00002000 */
#define GPIO_LCKR_LCK13     GPIO_LCKR_LCK13_Msk
#define GPIO_LCKR_LCK14_Pos (14U)
#define GPIO_LCKR_LCK14_Msk (0x1UL << GPIO_LCKR_LCK14_Pos) /*!< 0x00004000 */
#define GPIO_LCKR_LCK14     GPIO_LCKR_LCK14_Msk
#define GPIO_LCKR_LCK15_Pos (15U)
#define GPIO_LCKR_LCK15_Msk (0x1UL << GPIO_LCKR_LCK15_Pos) /*!< 0x00008000 */
#define GPIO_LCKR_LCK15     GPIO_LCKR_LCK15_Msk
#define GPIO_LCKR_LCKK_Pos  (16U)
#define GPIO_LCKR_LCKK_Msk  (0x1UL << GPIO_LCKR_LCKK_Pos) /*!< 0x00010000 */
#define GPIO_LCKR_LCKK      GPIO_LCKR_LCKK_Msk

