Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/* Legacy defines */
#define GPIO_AFRH_AFRH0 GPIO_AFRH_AFSEL8
#define GPIO_AFRH_AFRH1 GPIO_AFRH_AFSEL9
#define GPIO_AFRH_AFRH2 GPIO_AFRH_AFSEL10
#define GPIO_AFRH_AFRH3 GPIO_AFRH_AFSEL11
#define GPIO_AFRH_AFRH4 GPIO_AFRH_AFSEL12
#define GPIO_AFRH_AFRH5 GPIO_AFRH_AFSEL13
#define GPIO_AFRH_AFRH6 GPIO_AFRH_AFSEL14
#define GPIO_AFRH_AFRH7 GPIO_AFRH_AFSEL15

/******************************************************************************/
/*                                                                            */
/*                        HSEM HW Semaphore                                   */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for HSEM_R register  ********************/
#define HSEM_R_PROCID_Pos (0U)
#define HSEM_R_PROCID_Msk (0xFFUL << HSEM_R_PROCID_Pos) /*!< 0x000000FF */
#define HSEM_R_PROCID     HSEM_R_PROCID_Msk             /*!<Semaphore ProcessID */
#define HSEM_R_COREID_Pos (8U)
#define HSEM_R_COREID_Msk (0xFFUL << HSEM_R_COREID_Pos) /*!< 0x0000FF00 */
#define HSEM_R_COREID     HSEM_R_COREID_Msk             /*!<Semaphore CoreID.   */
#define HSEM_R_LOCK_Pos   (31U)
#define HSEM_R_LOCK_Msk   (0x1UL << HSEM_R_LOCK_Pos) /*!< 0x80000000 */
#define HSEM_R_LOCK       HSEM_R_LOCK_Msk            /*!<Lock indication.    */

/********************  Bit definition for HSEM_RLR register  ******************/
#define HSEM_RLR_PROCID_Pos (0U)
#define HSEM_RLR_PROCID_Msk (0xFFUL << HSEM_RLR_PROCID_Pos) /*!< 0x000000FF */
#define HSEM_RLR_PROCID     HSEM_RLR_PROCID_Msk             /*!<Semaphore ProcessID */
#define HSEM_RLR_COREID_Pos (8U)
#define HSEM_RLR_COREID_Msk (0xFFUL << HSEM_RLR_COREID_Pos) /*!< 0x0000FF00 */
#define HSEM_RLR_COREID     HSEM_RLR_COREID_Msk             /*!<Semaphore CoreID.   */
#define HSEM_RLR_LOCK_Pos   (31U)
#define HSEM_RLR_LOCK_Msk   (0x1UL << HSEM_RLR_LOCK_Pos) /*!< 0x80000000 */
#define HSEM_RLR_LOCK       HSEM_RLR_LOCK_Msk            /*!<Lock indication.    */

/********************  Bit definition for HSEM_C1IER register  *****************/
#define HSEM_C1IER_ISE0_Pos  (0U)
#define HSEM_C1IER_ISE0_Msk  (0x1UL << HSEM_C1IER_ISE0_Pos) /*!< 0x00000001 */
#define HSEM_C1IER_ISE0      HSEM_C1IER_ISE0_Msk            /*!<semaphore 0 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE1_Pos  (1U)
#define HSEM_C1IER_ISE1_Msk  (0x1UL << HSEM_C1IER_ISE1_Pos) /*!< 0x00000002 */
#define HSEM_C1IER_ISE1      HSEM_C1IER_ISE1_Msk            /*!<semaphore 1 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE2_Pos  (2U)
#define HSEM_C1IER_ISE2_Msk  (0x1UL << HSEM_C1IER_ISE2_Pos) /*!< 0x00000004 */
#define HSEM_C1IER_ISE2      HSEM_C1IER_ISE2_Msk            /*!<semaphore 2 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE3_Pos  (3U)
#define HSEM_C1IER_ISE3_Msk  (0x1UL << HSEM_C1IER_ISE3_Pos) /*!< 0x00000008 */
#define HSEM_C1IER_ISE3      HSEM_C1IER_ISE3_Msk            /*!<semaphore 3 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE4_Pos  (4U)
#define HSEM_C1IER_ISE4_Msk  (0x1UL << HSEM_C1IER_ISE4_Pos) /*!< 0x00000010 */
#define HSEM_C1IER_ISE4      HSEM_C1IER_ISE4_Msk            /*!<semaphore 4 , interrupt 0 enable bit.  */
#define HSEM_C1IER_ISE5_Pos  (5U)
#define HSEM_C1IER_ISE5_Msk  (0x1UL << HSEM_C1IER_ISE5_Pos) /*!< 0x00000020 */
#define HSEM_C1IER_ISE5      HSEM_C1IER_ISE5_Msk            /*!<semaphore 5 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE6_Pos  (6U)
#define HSEM_C1IER_ISE6_Msk  (0x1UL << HSEM_C1IER_ISE6_Pos) /*!< 0x00000040 */
#define HSEM_C1IER_ISE6      HSEM_C1IER_ISE6_Msk            /*!<semaphore 6 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE7_Pos  (7U)
#define HSEM_C1IER_ISE7_Msk  (0x1UL << HSEM_C1IER_ISE7_Pos) /*!< 0x00000080 */
#define HSEM_C1IER_ISE7      HSEM_C1IER_ISE7_Msk            /*!<semaphore 7 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE8_Pos  (8U)
#define HSEM_C1IER_ISE8_Msk  (0x1UL << HSEM_C1IER_ISE8_Pos) /*!< 0x00000100 */
#define HSEM_C1IER_ISE8      HSEM_C1IER_ISE8_Msk            /*!<semaphore 8 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE9_Pos  (9U)
#define HSEM_C1IER_ISE9_Msk  (0x1UL << HSEM_C1IER_ISE9_Pos) /*!< 0x00000200 */
#define HSEM_C1IER_ISE9      HSEM_C1IER_ISE9_Msk            /*!<semaphore 9 interrupt 0 enable bit.    */
#define HSEM_C1IER_ISE10_Pos (10U)
#define HSEM_C1IER_ISE10_Msk (0x1UL << HSEM_C1IER_ISE10_Pos) /*!< 0x00000400 */
#define HSEM_C1IER_ISE10     HSEM_C1IER_ISE10_Msk            /*!<semaphore 10 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE11_Pos (11U)
#define HSEM_C1IER_ISE11_Msk (0x1UL << HSEM_C1IER_ISE11_Pos) /*!< 0x00000800 */
#define HSEM_C1IER_ISE11     HSEM_C1IER_ISE11_Msk            /*!<semaphore 11 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE12_Pos (12U)
#define HSEM_C1IER_ISE12_Msk (0x1UL << HSEM_C1IER_ISE12_Pos) /*!< 0x00001000 */
#define HSEM_C1IER_ISE12     HSEM_C1IER_ISE12_Msk            /*!<semaphore 12 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE13_Pos (13U)
#define HSEM_C1IER_ISE13_Msk (0x1UL << HSEM_C1IER_ISE13_Pos) /*!< 0x00002000 */
#define HSEM_C1IER_ISE13     HSEM_C1IER_ISE13_Msk            /*!<semaphore 13 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE14_Pos (14U)
#define HSEM_C1IER_ISE14_Msk (0x1UL << HSEM_C1IER_ISE14_Pos) /*!< 0x00004000 */
#define HSEM_C1IER_ISE14     HSEM_C1IER_ISE14_Msk            /*!<semaphore 14 interrupt 0 enable bit.   */
#define HSEM_C1IER_ISE15_Pos (15U)
#define HSEM_C1IER_ISE15_Msk (0x1UL << HSEM_C1IER_ISE15_Pos) /*!< 0x00008000 */
#define HSEM_C1IER_ISE15     HSEM_C1IER_ISE15_Msk            /*!<semaphore 15 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE16_Pos (16U)
#define HSEM_C1IER_ISE16_Msk (0x1UL << HSEM_C1IER_ISE16_Pos) /*!< 0x00010000 */
#define HSEM_C1IER_ISE16     HSEM_C1IER_ISE16_Msk            /*!<semaphore 16 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE17_Pos (17U)
#define HSEM_C1IER_ISE17_Msk (0x1UL << HSEM_C1IER_ISE17_Pos) /*!< 0x00020000 */
#define HSEM_C1IER_ISE17     HSEM_C1IER_ISE17_Msk            /*!<semaphore 17 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE18_Pos (18U)
#define HSEM_C1IER_ISE18_Msk (0x1UL << HSEM_C1IER_ISE18_Pos) /*!< 0x00040000 */
#define HSEM_C1IER_ISE18     HSEM_C1IER_ISE18_Msk            /*!<semaphore 18 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE19_Pos (19U)
#define HSEM_C1IER_ISE19_Msk (0x1UL << HSEM_C1IER_ISE19_Pos) /*!< 0x00080000 */
#define HSEM_C1IER_ISE19     HSEM_C1IER_ISE19_Msk            /*!<semaphore 19 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE20_Pos (20U)
#define HSEM_C1IER_ISE20_Msk (0x1UL << HSEM_C1IER_ISE20_Pos) /*!< 0x00100000 */
#define HSEM_C1IER_ISE20     HSEM_C1IER_ISE20_Msk            /*!<semaphore 20 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE21_Pos (21U)
#define HSEM_C1IER_ISE21_Msk (0x1UL << HSEM_C1IER_ISE21_Pos) /*!< 0x00200000 */
#define HSEM_C1IER_ISE21     HSEM_C1IER_ISE21_Msk            /*!<semaphore 21 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE22_Pos (22U)
#define HSEM_C1IER_ISE22_Msk (0x1UL << HSEM_C1IER_ISE22_Pos) /*!< 0x00400000 */
#define HSEM_C1IER_ISE22     HSEM_C1IER_ISE22_Msk            /*!<semaphore 22 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE23_Pos (23U)
#define HSEM_C1IER_ISE23_Msk (0x1UL << HSEM_C1IER_ISE23_Pos) /*!< 0x00800000 */
#define HSEM_C1IER_ISE23     HSEM_C1IER_ISE23_Msk            /*!<semaphore 23 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE24_Pos (24U)
#define HSEM_C1IER_ISE24_Msk (0x1UL << HSEM_C1IER_ISE24_Pos) /*!< 0x01000000 */
#define HSEM_C1IER_ISE24     HSEM_C1IER_ISE24_Msk            /*!<semaphore 24 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE25_Pos (25U)
#define HSEM_C1IER_ISE25_Msk (0x1UL << HSEM_C1IER_ISE25_Pos) /*!< 0x02000000 */
#define HSEM_C1IER_ISE25     HSEM_C1IER_ISE25_Msk            /*!<semaphore 25 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE26_Pos (26U)
#define HSEM_C1IER_ISE26_Msk (0x1UL << HSEM_C1IER_ISE26_Pos) /*!< 0x04000000 */
#define HSEM_C1IER_ISE26     HSEM_C1IER_ISE26_Msk            /*!<semaphore 26 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE27_Pos (27U)
#define HSEM_C1IER_ISE27_Msk (0x1UL << HSEM_C1IER_ISE27_Pos) /*!< 0x08000000 */
#define HSEM_C1IER_ISE27     HSEM_C1IER_ISE27_Msk            /*!<semaphore 27 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE28_Pos (28U)
#define HSEM_C1IER_ISE28_Msk (0x1UL << HSEM_C1IER_ISE28_Pos) /*!< 0x10000000 */
#define HSEM_C1IER_ISE28     HSEM_C1IER_ISE28_Msk            /*!<semaphore 28 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE29_Pos (29U)
#define HSEM_C1IER_ISE29_Msk (0x1UL << HSEM_C1IER_ISE29_Pos) /*!< 0x20000000 */
#define HSEM_C1IER_ISE29     HSEM_C1IER_ISE29_Msk            /*!<semaphore 29 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE30_Pos (30U)
#define HSEM_C1IER_ISE30_Msk (0x1UL << HSEM_C1IER_ISE30_Pos) /*!< 0x40000000 */
#define HSEM_C1IER_ISE30     HSEM_C1IER_ISE30_Msk            /*!<semaphore 30 interrupt 0 enable bit. */
#define HSEM_C1IER_ISE31_Pos (31U)
#define HSEM_C1IER_ISE31_Msk (0x1UL << HSEM_C1IER_ISE31_Pos) /*!< 0x80000000 */
#define HSEM_C1IER_ISE31     HSEM_C1IER_ISE31_Msk            /*!<semaphore 31 interrupt 0 enable bit. */

/********************  Bit definition for HSEM_C1ICR register  *****************/
#define HSEM_C1ICR_ISC0_Pos  (0U)
#define HSEM_C1ICR_ISC0_Msk  (0x1UL << HSEM_C1ICR_ISC0_Pos) /*!< 0x00000001 */
#define HSEM_C1ICR_ISC0      HSEM_C1ICR_ISC0_Msk            /*!<semaphore 0 , interrupt 0 clear bit.  */
#define HSEM_C1ICR_ISC1_Pos  (1U)
#define HSEM_C1ICR_ISC1_Msk  (0x1UL << HSEM_C1ICR_ISC1_Pos) /*!< 0x00000002 */
#define HSEM_C1ICR_ISC1      HSEM_C1ICR_ISC1_Msk            /*!<semaphore 1 , interrupt 0 clear bit.  */
#define HSEM_C1ICR_ISC2_Pos  (2U)
#define HSEM_C1ICR_ISC2_Msk  (0x1UL << HSEM_C1ICR_ISC2_Pos) /*!< 0x00000004 */
#define HSEM_C1ICR_ISC2      HSEM_C1ICR_ISC2_Msk            /*!<semaphore 2 , interrupt 0 clear bit.  */
#define HSEM_C1ICR_ISC3_Pos  (3U)
#define HSEM_C1ICR_ISC3_Msk  (0x1UL << HSEM_C1ICR_ISC3_Pos) /*!< 0x00000008 */
#define HSEM_C1ICR_ISC3      HSEM_C1ICR_ISC3_Msk            /*!<semaphore 3 , interrupt 0 clear bit.  */
#define HSEM_C1ICR_ISC4_Pos  (4U)
#define HSEM_C1ICR_ISC4_Msk  (0x1UL << HSEM_C1ICR_ISC4_Pos) /*!< 0x00000010 */
#define HSEM_C1ICR_ISC4      HSEM_C1ICR_ISC4_Msk            /*!<semaphore 4 , interrupt 0 clear bit.  */
#define HSEM_C1ICR_ISC5_Pos  (5U)
#define HSEM_C1ICR_ISC5_Msk  (0x1UL << HSEM_C1ICR_ISC5_Pos) /*!< 0x00000020 */
#define HSEM_C1ICR_ISC5      HSEM_C1ICR_ISC5_Msk            /*!<semaphore 5 interrupt 0 clear bit.  */
#define HSEM_C1ICR_ISC6_Pos  (6U)
#define HSEM_C1ICR_ISC6_Msk  (0x1UL << HSEM_C1ICR_ISC6_Pos) /*!< 0x00000040 */
#define HSEM_C1ICR_ISC6      HSEM_C1ICR_ISC6_Msk            /*!<semaphore 6 interrupt 0 clear bit.  */
#define HSEM_C1ICR_ISC7_Pos  (7U)
#define HSEM_C1ICR_ISC7_Msk  (0x1UL << HSEM_C1ICR_ISC7_Pos) /*!< 0x00000080 */
#define HSEM_C1ICR_ISC7      HSEM_C1ICR_ISC7_Msk            /*!<semaphore 7 interrupt 0 clear bit.  */
#define HSEM_C1ICR_ISC8_Pos  (8U)
#define HSEM_C1ICR_ISC8_Msk  (0x1UL << HSEM_C1ICR_ISC8_Pos) /*!< 0x00000100 */
#define HSEM_C1ICR_ISC8      HSEM_C1ICR_ISC8_Msk            /*!<semaphore 8 interrupt 0 clear bit.  */
#define HSEM_C1ICR_ISC9_Pos  (9U)
#define HSEM_C1ICR_ISC9_Msk  (0x1UL << HSEM_C1ICR_ISC9_Pos) /*!< 0x00000200 */
#define HSEM_C1ICR_ISC9      HSEM_C1ICR_ISC9_Msk            /*!<semaphore 9 interrupt 0 clear bit.  */
#define HSEM_C1ICR_ISC10_Pos (10U)
#define HSEM_C1ICR_ISC10_Msk (0x1UL << HSEM_C1ICR_ISC10_Pos) /*!< 0x00000400 */
#define HSEM_C1ICR_ISC10     HSEM_C1ICR_ISC10_Msk            /*!<semaphore 10 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC11_Pos (11U)
#define HSEM_C1ICR_ISC11_Msk (0x1UL << HSEM_C1ICR_ISC11_Pos) /*!< 0x00000800 */
#define HSEM_C1ICR_ISC11     HSEM_C1ICR_ISC11_Msk            /*!<semaphore 11 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC12_Pos (12U)
#define HSEM_C1ICR_ISC12_Msk (0x1UL << HSEM_C1ICR_ISC12_Pos) /*!< 0x00001000 */
#define HSEM_C1ICR_ISC12     HSEM_C1ICR_ISC12_Msk            /*!<semaphore 12 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC13_Pos (13U)
#define HSEM_C1ICR_ISC13_Msk (0x1UL << HSEM_C1ICR_ISC13_Pos) /*!< 0x00002000 */
#define HSEM_C1ICR_ISC13     HSEM_C1ICR_ISC13_Msk            /*!<semaphore 13 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC14_Pos (14U)
#define HSEM_C1ICR_ISC14_Msk (0x1UL << HSEM_C1ICR_ISC14_Pos) /*!< 0x00004000 */
#define HSEM_C1ICR_ISC14     HSEM_C1ICR_ISC14_Msk            /*!<semaphore 14 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC15_Pos (15U)
#define HSEM_C1ICR_ISC15_Msk (0x1UL << HSEM_C1ICR_ISC15_Pos) /*!< 0x00008000 */
#define HSEM_C1ICR_ISC15     HSEM_C1ICR_ISC15_Msk            /*!<semaphore 15 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC16_Pos (16U)
#define HSEM_C1ICR_ISC16_Msk (0x1UL << HSEM_C1ICR_ISC16_Pos) /*!< 0x00010000 */
#define HSEM_C1ICR_ISC16     HSEM_C1ICR_ISC16_Msk            /*!<semaphore 16 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC17_Pos (17U)
#define HSEM_C1ICR_ISC17_Msk (0x1UL << HSEM_C1ICR_ISC17_Pos) /*!< 0x00020000 */
#define HSEM_C1ICR_ISC17     HSEM_C1ICR_ISC17_Msk            /*!<semaphore 17 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC18_Pos (18U)
#define HSEM_C1ICR_ISC18_Msk (0x1UL << HSEM_C1ICR_ISC18_Pos) /*!< 0x00040000 */
#define HSEM_C1ICR_ISC18     HSEM_C1ICR_ISC18_Msk            /*!<semaphore 18 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC19_Pos (19U)
#define HSEM_C1ICR_ISC19_Msk (0x1UL << HSEM_C1ICR_ISC19_Pos) /*!< 0x00080000 */
#define HSEM_C1ICR_ISC19     HSEM_C1ICR_ISC19_Msk            /*!<semaphore 19 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC20_Pos (20U)
#define HSEM_C1ICR_ISC20_Msk (0x1UL << HSEM_C1ICR_ISC20_Pos) /*!< 0x00100000 */
#define HSEM_C1ICR_ISC20     HSEM_C1ICR_ISC20_Msk            /*!<semaphore 20 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC21_Pos (21U)
#define HSEM_C1ICR_ISC21_Msk (0x1UL << HSEM_C1ICR_ISC21_Pos) /*!< 0x00200000 */
#define HSEM_C1ICR_ISC21     HSEM_C1ICR_ISC21_Msk            /*!<semaphore 21 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC22_Pos (22U)
#define HSEM_C1ICR_ISC22_Msk (0x1UL << HSEM_C1ICR_ISC22_Pos) /*!< 0x00400000 */
#define HSEM_C1ICR_ISC22     HSEM_C1ICR_ISC22_Msk            /*!<semaphore 22 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC23_Pos (23U)
#define HSEM_C1ICR_ISC23_Msk (0x1UL << HSEM_C1ICR_ISC23_Pos) /*!< 0x00800000 */
#define HSEM_C1ICR_ISC23     HSEM_C1ICR_ISC23_Msk            /*!<semaphore 23 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC24_Pos (24U)
#define HSEM_C1ICR_ISC24_Msk (0x1UL << HSEM_C1ICR_ISC24_Pos) /*!< 0x01000000 */
#define HSEM_C1ICR_ISC24     HSEM_C1ICR_ISC24_Msk            /*!<semaphore 24 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC25_Pos (25U)
#define HSEM_C1ICR_ISC25_Msk (0x1UL << HSEM_C1ICR_ISC25_Pos) /*!< 0x02000000 */
#define HSEM_C1ICR_ISC25     HSEM_C1ICR_ISC25_Msk            /*!<semaphore 25 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC26_Pos (26U)
#define HSEM_C1ICR_ISC26_Msk (0x1UL << HSEM_C1ICR_ISC26_Pos) /*!< 0x04000000 */
#define HSEM_C1ICR_ISC26     HSEM_C1ICR_ISC26_Msk            /*!<semaphore 26 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC27_Pos (27U)
#define HSEM_C1ICR_ISC27_Msk (0x1UL << HSEM_C1ICR_ISC27_Pos) /*!< 0x08000000 */
#define HSEM_C1ICR_ISC27     HSEM_C1ICR_ISC27_Msk            /*!<semaphore 27 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC28_Pos (28U)
#define HSEM_C1ICR_ISC28_Msk (0x1UL << HSEM_C1ICR_ISC28_Pos) /*!< 0x10000000 */
#define HSEM_C1ICR_ISC28     HSEM_C1ICR_ISC28_Msk            /*!<semaphore 28 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC29_Pos (29U)
#define HSEM_C1ICR_ISC29_Msk (0x1UL << HSEM_C1ICR_ISC29_Pos) /*!< 0x20000000 */
#define HSEM_C1ICR_ISC29     HSEM_C1ICR_ISC29_Msk            /*!<semaphore 29 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC30_Pos (30U)
#define HSEM_C1ICR_ISC30_Msk (0x1UL << HSEM_C1ICR_ISC30_Pos) /*!< 0x40000000 */
#define HSEM_C1ICR_ISC30     HSEM_C1ICR_ISC30_Msk            /*!<semaphore 30 interrupt 0 clear bit. */
#define HSEM_C1ICR_ISC31_Pos (31U)
#define HSEM_C1ICR_ISC31_Msk (0x1UL << HSEM_C1ICR_ISC31_Pos) /*!< 0x80000000 */
#define HSEM_C1ICR_ISC31     HSEM_C1ICR_ISC31_Msk            /*!<semaphore 31 interrupt 0 clear bit. */

/********************  Bit definition for HSEM_C1ISR register  *****************/
#define HSEM_C1ISR_ISF0_Pos  (0U)
#define HSEM_C1ISR_ISF0_Msk  (0x1UL << HSEM_C1ISR_ISF0_Pos) /*!< 0x00000001 */
#define HSEM_C1ISR_ISF0      HSEM_C1ISR_ISF0_Msk            /*!<semaphore 0 interrupt 0 status bit.  */
#define HSEM_C1ISR_ISF1_Pos  (1U)
#define HSEM_C1ISR_ISF1_Msk  (0x1UL << HSEM_C1ISR_ISF1_Pos) /*!< 0x00000002 */
#define HSEM_C1ISR_ISF1      HSEM_C1ISR_ISF1_Msk            /*!<semaphore 1 interrupt 0 status bit.  */
#define HSEM_C1ISR_ISF2_Pos  (2U)
#define HSEM_C1ISR_ISF2_Msk  (0x1UL << HSEM_C1ISR_ISF2_Pos) /*!< 0x00000004 */
#define HSEM_C1ISR_ISF2      HSEM_C1ISR_ISF2_Msk            /*!<semaphore 2 interrupt 0 status bit.  */
#define HSEM_C1ISR_ISF3_Pos  (3U)
#define HSEM_C1ISR_ISF3_Msk  (0x1UL << HSEM_C1ISR_ISF3_Pos) /*!< 0x00000008 */
#define HSEM_C1ISR_ISF3      HSEM_C1ISR_ISF3_Msk            /*!<semaphore 3 interrupt 0 status bit.  */
#define HSEM_C1ISR_ISF4_Pos  (4U)
#define HSEM_C1ISR_ISF4_Msk  (0x1UL << HSEM_C1ISR_ISF4_Pos) /*!< 0x00000010 */
#define HSEM_C1ISR_ISF4      HSEM_C1ISR_ISF4_Msk            /*!<semaphore 4 interrupt 0 status bit.  */
#define HSEM_C1ISR_ISF5_Pos  (5U)
#define HSEM_C1ISR_ISF5_Msk  (0x1UL << HSEM_C1ISR_ISF5_Pos) /*!< 0x00000020 */
#define HSEM_C1ISR_ISF5      HSEM_C1ISR_ISF5_Msk            /*!<semaphore 5 interrupt 0 status bit.  */
#define HSEM_C1ISR_ISF6_Pos  (6U)
#define HSEM_C1ISR_ISF6_Msk  (0x1UL << HSEM_C1ISR_ISF6_Pos) /*!< 0x00000040 */
#define HSEM_C1ISR_ISF6      HSEM_C1ISR_ISF6_Msk            /*!<semaphore 6 interrupt 0 status bit.  */
#define HSEM_C1ISR_ISF7_Pos  (7U)
#define HSEM_C1ISR_ISF7_Msk  (0x1UL << HSEM_C1ISR_ISF7_Pos) /*!< 0x00000080 */
#define HSEM_C1ISR_ISF7      HSEM_C1ISR_ISF7_Msk            /*!<semaphore 7 interrupt 0 status bit.  */
#define HSEM_C1ISR_ISF8_Pos  (8U)
#define HSEM_C1ISR_ISF8_Msk  (0x1UL << HSEM_C1ISR_ISF8_Pos) /*!< 0x00000100 */
#define HSEM_C1ISR_ISF8      HSEM_C1ISR_ISF8_Msk            /*!<semaphore 8 interrupt 0 status bit.  */
#define HSEM_C1ISR_ISF9_Pos  (9U)
#define HSEM_C1ISR_ISF9_Msk  (0x1UL << HSEM_C1ISR_ISF9_Pos) /*!< 0x00000200 */
#define HSEM_C1ISR_ISF9      HSEM_C1ISR_ISF9_Msk            /*!<semaphore 9 interrupt 0 status bit.  */
#define HSEM_C1ISR_ISF10_Pos (10U)
#define HSEM_C1ISR_ISF10_Msk (0x1UL << HSEM_C1ISR_ISF10_Pos) /*!< 0x00000400 */
#define HSEM_C1ISR_ISF10     HSEM_C1ISR_ISF10_Msk            /*!<semaphore 10 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF11_Pos (11U)
#define HSEM_C1ISR_ISF11_Msk (0x1UL << HSEM_C1ISR_ISF11_Pos) /*!< 0x00000800 */
#define HSEM_C1ISR_ISF11     HSEM_C1ISR_ISF11_Msk            /*!<semaphore 11 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF12_Pos (12U)
#define HSEM_C1ISR_ISF12_Msk (0x1UL << HSEM_C1ISR_ISF12_Pos) /*!< 0x00001000 */
#define HSEM_C1ISR_ISF12     HSEM_C1ISR_ISF12_Msk            /*!<semaphore 12 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF13_Pos (13U)
#define HSEM_C1ISR_ISF13_Msk (0x1UL << HSEM_C1ISR_ISF13_Pos) /*!< 0x00002000 */
#define HSEM_C1ISR_ISF13     HSEM_C1ISR_ISF13_Msk            /*!<semaphore 13 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF14_Pos (14U)
#define HSEM_C1ISR_ISF14_Msk (0x1UL << HSEM_C1ISR_ISF14_Pos) /*!< 0x00004000 */
#define HSEM_C1ISR_ISF14     HSEM_C1ISR_ISF14_Msk            /*!<semaphore 14 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF15_Pos (15U)
#define HSEM_C1ISR_ISF15_Msk (0x1UL << HSEM_C1ISR_ISF15_Pos) /*!< 0x00008000 */
#define HSEM_C1ISR_ISF15     HSEM_C1ISR_ISF15_Msk            /*!<semaphore 15 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF16_Pos (16U)
#define HSEM_C1ISR_ISF16_Msk (0x1UL << HSEM_C1ISR_ISF16_Pos) /*!< 0x00010000 */
#define HSEM_C1ISR_ISF16     HSEM_C1ISR_ISF16_Msk            /*!<semaphore 16 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF17_Pos (17U)
#define HSEM_C1ISR_ISF17_Msk (0x1UL << HSEM_C1ISR_ISF17_Pos) /*!< 0x00020000 */
#define HSEM_C1ISR_ISF17     HSEM_C1ISR_ISF17_Msk            /*!<semaphore 17 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF18_Pos (18U)
#define HSEM_C1ISR_ISF18_Msk (0x1UL << HSEM_C1ISR_ISF18_Pos) /*!< 0x00040000 */
#define HSEM_C1ISR_ISF18     HSEM_C1ISR_ISF18_Msk            /*!<semaphore 18 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF19_Pos (19U)
#define HSEM_C1ISR_ISF19_Msk (0x1UL << HSEM_C1ISR_ISF19_Pos) /*!< 0x00080000 */
#define HSEM_C1ISR_ISF19     HSEM_C1ISR_ISF19_Msk            /*!<semaphore 19 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF20_Pos (20U)
#define HSEM_C1ISR_ISF20_Msk (0x1UL << HSEM_C1ISR_ISF20_Pos) /*!< 0x00100000 */
#define HSEM_C1ISR_ISF20     HSEM_C1ISR_ISF20_Msk            /*!<semaphore 20 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF21_Pos (21U)
#define HSEM_C1ISR_ISF21_Msk (0x1UL << HSEM_C1ISR_ISF21_Pos) /*!< 0x00200000 */
#define HSEM_C1ISR_ISF21     HSEM_C1ISR_ISF21_Msk            /*!<semaphore 21 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF22_Pos (22U)
#define HSEM_C1ISR_ISF22_Msk (0x1UL << HSEM_C1ISR_ISF22_Pos) /*!< 0x00400000 */
#define HSEM_C1ISR_ISF22     HSEM_C1ISR_ISF22_Msk            /*!<semaphore 22 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF23_Pos (23U)
#define HSEM_C1ISR_ISF23_Msk (0x1UL << HSEM_C1ISR_ISF23_Pos) /*!< 0x00800000 */
#define HSEM_C1ISR_ISF23     HSEM_C1ISR_ISF23_Msk            /*!<semaphore 23 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF24_Pos (24U)
#define HSEM_C1ISR_ISF24_Msk (0x1UL << HSEM_C1ISR_ISF24_Pos) /*!< 0x01000000 */
#define HSEM_C1ISR_ISF24     HSEM_C1ISR_ISF24_Msk            /*!<semaphore 24 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF25_Pos (25U)
#define HSEM_C1ISR_ISF25_Msk (0x1UL << HSEM_C1ISR_ISF25_Pos) /*!< 0x02000000 */
#define HSEM_C1ISR_ISF25     HSEM_C1ISR_ISF25_Msk            /*!<semaphore 25 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF26_Pos (26U)
#define HSEM_C1ISR_ISF26_Msk (0x1UL << HSEM_C1ISR_ISF26_Pos) /*!< 0x04000000 */
#define HSEM_C1ISR_ISF26     HSEM_C1ISR_ISF26_Msk            /*!<semaphore 26 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF27_Pos (27U)
#define HSEM_C1ISR_ISF27_Msk (0x1UL << HSEM_C1ISR_ISF27_Pos) /*!< 0x08000000 */
#define HSEM_C1ISR_ISF27     HSEM_C1ISR_ISF27_Msk            /*!<semaphore 27 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF28_Pos (28U)
#define HSEM_C1ISR_ISF28_Msk (0x1UL << HSEM_C1ISR_ISF28_Pos) /*!< 0x10000000 */
#define HSEM_C1ISR_ISF28     HSEM_C1ISR_ISF28_Msk            /*!<semaphore 28 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF29_Pos (29U)
#define HSEM_C1ISR_ISF29_Msk (0x1UL << HSEM_C1ISR_ISF29_Pos) /*!< 0x20000000 */
#define HSEM_C1ISR_ISF29     HSEM_C1ISR_ISF29_Msk            /*!<semaphore 29 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF30_Pos (30U)
#define HSEM_C1ISR_ISF30_Msk (0x1UL << HSEM_C1ISR_ISF30_Pos) /*!< 0x40000000 */
#define HSEM_C1ISR_ISF30     HSEM_C1ISR_ISF30_Msk            /*!<semaphore 30 interrupt 0 status bit. */
#define HSEM_C1ISR_ISF31_Pos (31U)
#define HSEM_C1ISR_ISF31_Msk (0x1UL << HSEM_C1ISR_ISF31_Pos) /*!< 0x80000000 */
#define HSEM_C1ISR_ISF31     HSEM_C1ISR_ISF31_Msk            /*!<semaphore 31 interrupt 0 status bit. */

