Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bit definition for HSEM_C1MISR register  *****************/
#define HSEM_C1MISR_MISF0_Pos  (0U)
#define HSEM_C1MISR_MISF0_Msk  (0x1UL << HSEM_C1MISR_MISF0_Pos) /*!< 0x00000001 */
#define HSEM_C1MISR_MISF0      HSEM_C1MISR_MISF0_Msk            /*!<semaphore 0 interrupt 0 masked status bit.  */
#define HSEM_C1MISR_MISF1_Pos  (1U)
#define HSEM_C1MISR_MISF1_Msk  (0x1UL << HSEM_C1MISR_MISF1_Pos) /*!< 0x00000002 */
#define HSEM_C1MISR_MISF1      HSEM_C1MISR_MISF1_Msk            /*!<semaphore 1 interrupt 0 masked status bit.  */
#define HSEM_C1MISR_MISF2_Pos  (2U)
#define HSEM_C1MISR_MISF2_Msk  (0x1UL << HSEM_C1MISR_MISF2_Pos) /*!< 0x00000004 */
#define HSEM_C1MISR_MISF2      HSEM_C1MISR_MISF2_Msk            /*!<semaphore 2 interrupt 0 masked status bit.  */
#define HSEM_C1MISR_MISF3_Pos  (3U)
#define HSEM_C1MISR_MISF3_Msk  (0x1UL << HSEM_C1MISR_MISF3_Pos) /*!< 0x00000008 */
#define HSEM_C1MISR_MISF3      HSEM_C1MISR_MISF3_Msk            /*!<semaphore 3 interrupt 0 masked status bit.  */
#define HSEM_C1MISR_MISF4_Pos  (4U)
#define HSEM_C1MISR_MISF4_Msk  (0x1UL << HSEM_C1MISR_MISF4_Pos) /*!< 0x00000010 */
#define HSEM_C1MISR_MISF4      HSEM_C1MISR_MISF4_Msk            /*!<semaphore 4 interrupt 0 masked status bit.  */
#define HSEM_C1MISR_MISF5_Pos  (5U)
#define HSEM_C1MISR_MISF5_Msk  (0x1UL << HSEM_C1MISR_MISF5_Pos) /*!< 0x00000020 */
#define HSEM_C1MISR_MISF5      HSEM_C1MISR_MISF5_Msk            /*!<semaphore 5 interrupt 0 masked status bit.  */
#define HSEM_C1MISR_MISF6_Pos  (6U)
#define HSEM_C1MISR_MISF6_Msk  (0x1UL << HSEM_C1MISR_MISF6_Pos) /*!< 0x00000040 */
#define HSEM_C1MISR_MISF6      HSEM_C1MISR_MISF6_Msk            /*!<semaphore 6 interrupt 0 masked status bit.  */
#define HSEM_C1MISR_MISF7_Pos  (7U)
#define HSEM_C1MISR_MISF7_Msk  (0x1UL << HSEM_C1MISR_MISF7_Pos) /*!< 0x00000080 */
#define HSEM_C1MISR_MISF7      HSEM_C1MISR_MISF7_Msk            /*!<semaphore 7 interrupt 0 masked status bit.  */
#define HSEM_C1MISR_MISF8_Pos  (8U)
#define HSEM_C1MISR_MISF8_Msk  (0x1UL << HSEM_C1MISR_MISF8_Pos) /*!< 0x00000100 */
#define HSEM_C1MISR_MISF8      HSEM_C1MISR_MISF8_Msk            /*!<semaphore 8 interrupt 0 masked status bit.  */
#define HSEM_C1MISR_MISF9_Pos  (9U)
#define HSEM_C1MISR_MISF9_Msk  (0x1UL << HSEM_C1MISR_MISF9_Pos) /*!< 0x00000200 */
#define HSEM_C1MISR_MISF9      HSEM_C1MISR_MISF9_Msk            /*!<semaphore 9 interrupt 0 masked status bit.  */
#define HSEM_C1MISR_MISF10_Pos (10U)
#define HSEM_C1MISR_MISF10_Msk (0x1UL << HSEM_C1MISR_MISF10_Pos) /*!< 0x00000400 */
#define HSEM_C1MISR_MISF10     HSEM_C1MISR_MISF10_Msk            /*!<semaphore 10 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF11_Pos (11U)
#define HSEM_C1MISR_MISF11_Msk (0x1UL << HSEM_C1MISR_MISF11_Pos) /*!< 0x00000800 */
#define HSEM_C1MISR_MISF11     HSEM_C1MISR_MISF11_Msk            /*!<semaphore 11 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF12_Pos (12U)
#define HSEM_C1MISR_MISF12_Msk (0x1UL << HSEM_C1MISR_MISF12_Pos) /*!< 0x00001000 */
#define HSEM_C1MISR_MISF12     HSEM_C1MISR_MISF12_Msk            /*!<semaphore 12 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF13_Pos (13U)
#define HSEM_C1MISR_MISF13_Msk (0x1UL << HSEM_C1MISR_MISF13_Pos) /*!< 0x00002000 */
#define HSEM_C1MISR_MISF13     HSEM_C1MISR_MISF13_Msk            /*!<semaphore 13 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF14_Pos (14U)
#define HSEM_C1MISR_MISF14_Msk (0x1UL << HSEM_C1MISR_MISF14_Pos) /*!< 0x00004000 */
#define HSEM_C1MISR_MISF14     HSEM_C1MISR_MISF14_Msk            /*!<semaphore 14 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF15_Pos (15U)
#define HSEM_C1MISR_MISF15_Msk (0x1UL << HSEM_C1MISR_MISF15_Pos) /*!< 0x00008000 */
#define HSEM_C1MISR_MISF15     HSEM_C1MISR_MISF15_Msk            /*!<semaphore 15 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF16_Pos (16U)
#define HSEM_C1MISR_MISF16_Msk (0x1UL << HSEM_C1MISR_MISF16_Pos) /*!< 0x00010000 */
#define HSEM_C1MISR_MISF16     HSEM_C1MISR_MISF16_Msk            /*!<semaphore 16 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF17_Pos (17U)
#define HSEM_C1MISR_MISF17_Msk (0x1UL << HSEM_C1MISR_MISF17_Pos) /*!< 0x00020000 */
#define HSEM_C1MISR_MISF17     HSEM_C1MISR_MISF17_Msk            /*!<semaphore 17 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF18_Pos (18U)
#define HSEM_C1MISR_MISF18_Msk (0x1UL << HSEM_C1MISR_MISF18_Pos) /*!< 0x00040000 */
#define HSEM_C1MISR_MISF18     HSEM_C1MISR_MISF18_Msk            /*!<semaphore 18 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF19_Pos (19U)
#define HSEM_C1MISR_MISF19_Msk (0x1UL << HSEM_C1MISR_MISF19_Pos) /*!< 0x00080000 */
#define HSEM_C1MISR_MISF19     HSEM_C1MISR_MISF19_Msk            /*!<semaphore 19 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF20_Pos (20U)
#define HSEM_C1MISR_MISF20_Msk (0x1UL << HSEM_C1MISR_MISF20_Pos) /*!< 0x00100000 */
#define HSEM_C1MISR_MISF20     HSEM_C1MISR_MISF20_Msk            /*!<semaphore 20 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF21_Pos (21U)
#define HSEM_C1MISR_MISF21_Msk (0x1UL << HSEM_C1MISR_MISF21_Pos) /*!< 0x00200000 */
#define HSEM_C1MISR_MISF21     HSEM_C1MISR_MISF21_Msk            /*!<semaphore 21 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF22_Pos (22U)
#define HSEM_C1MISR_MISF22_Msk (0x1UL << HSEM_C1MISR_MISF22_Pos) /*!< 0x00400000 */
#define HSEM_C1MISR_MISF22     HSEM_C1MISR_MISF22_Msk            /*!<semaphore 22 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF23_Pos (23U)
#define HSEM_C1MISR_MISF23_Msk (0x1UL << HSEM_C1MISR_MISF23_Pos) /*!< 0x00800000 */
#define HSEM_C1MISR_MISF23     HSEM_C1MISR_MISF23_Msk            /*!<semaphore 23 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF24_Pos (24U)
#define HSEM_C1MISR_MISF24_Msk (0x1UL << HSEM_C1MISR_MISF24_Pos) /*!< 0x01000000 */
#define HSEM_C1MISR_MISF24     HSEM_C1MISR_MISF24_Msk            /*!<semaphore 24 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF25_Pos (25U)
#define HSEM_C1MISR_MISF25_Msk (0x1UL << HSEM_C1MISR_MISF25_Pos) /*!< 0x02000000 */
#define HSEM_C1MISR_MISF25     HSEM_C1MISR_MISF25_Msk            /*!<semaphore 25 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF26_Pos (26U)
#define HSEM_C1MISR_MISF26_Msk (0x1UL << HSEM_C1MISR_MISF26_Pos) /*!< 0x04000000 */
#define HSEM_C1MISR_MISF26     HSEM_C1MISR_MISF26_Msk            /*!<semaphore 26 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF27_Pos (27U)
#define HSEM_C1MISR_MISF27_Msk (0x1UL << HSEM_C1MISR_MISF27_Pos) /*!< 0x08000000 */
#define HSEM_C1MISR_MISF27     HSEM_C1MISR_MISF27_Msk            /*!<semaphore 27 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF28_Pos (28U)
#define HSEM_C1MISR_MISF28_Msk (0x1UL << HSEM_C1MISR_MISF28_Pos) /*!< 0x10000000 */
#define HSEM_C1MISR_MISF28     HSEM_C1MISR_MISF28_Msk            /*!<semaphore 28 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF29_Pos (29U)
#define HSEM_C1MISR_MISF29_Msk (0x1UL << HSEM_C1MISR_MISF29_Pos) /*!< 0x20000000 */
#define HSEM_C1MISR_MISF29     HSEM_C1MISR_MISF29_Msk            /*!<semaphore 29 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF30_Pos (30U)
#define HSEM_C1MISR_MISF30_Msk (0x1UL << HSEM_C1MISR_MISF30_Pos) /*!< 0x40000000 */
#define HSEM_C1MISR_MISF30     HSEM_C1MISR_MISF30_Msk            /*!<semaphore 30 interrupt 0 masked status bit. */
#define HSEM_C1MISR_MISF31_Pos (31U)
#define HSEM_C1MISR_MISF31_Msk (0x1UL << HSEM_C1MISR_MISF31_Pos) /*!< 0x80000000 */
#define HSEM_C1MISR_MISF31     HSEM_C1MISR_MISF31_Msk            /*!<semaphore 31 interrupt 0 masked status bit. */

/********************  Bit definition for HSEM_CR register  *****************/
#define HSEM_CR_COREID_Pos (8U)
#define HSEM_CR_COREID_Msk (0xFFUL << HSEM_CR_COREID_Pos) /*!< 0x0000FF00 */
#define HSEM_CR_COREID     HSEM_CR_COREID_Msk             /*!<CoreID of semaphores to be cleared. */
#define HSEM_CR_KEY_Pos    (16U)
#define HSEM_CR_KEY_Msk    (0xFFFFUL << HSEM_CR_KEY_Pos) /*!< 0xFFFF0000 */
#define HSEM_CR_KEY        HSEM_CR_KEY_Msk               /*!<semaphores clear key. */

/********************  Bit definition for HSEM_KEYR register  *****************/
#define HSEM_KEYR_KEY_Pos (16U)
#define HSEM_KEYR_KEY_Msk (0xFFFFUL << HSEM_KEYR_KEY_Pos) /*!< 0xFFFF0000 */
#define HSEM_KEYR_KEY     HSEM_KEYR_KEY_Msk               /*!<semaphores clear key. */

/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface (I2C)              */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for I2C_CR1 register  *******************/
#define I2C_CR1_PE_Pos        (0U)
#define I2C_CR1_PE_Msk        (0x1UL << I2C_CR1_PE_Pos) /*!< 0x00000001 */
#define I2C_CR1_PE            I2C_CR1_PE_Msk            /*!< Peripheral enable */
#define I2C_CR1_TXIE_Pos      (1U)
#define I2C_CR1_TXIE_Msk      (0x1UL << I2C_CR1_TXIE_Pos) /*!< 0x00000002 */
#define I2C_CR1_TXIE          I2C_CR1_TXIE_Msk            /*!< TX interrupt enable */
#define I2C_CR1_RXIE_Pos      (2U)
#define I2C_CR1_RXIE_Msk      (0x1UL << I2C_CR1_RXIE_Pos) /*!< 0x00000004 */
#define I2C_CR1_RXIE          I2C_CR1_RXIE_Msk            /*!< RX interrupt enable */
#define I2C_CR1_ADDRIE_Pos    (3U)
#define I2C_CR1_ADDRIE_Msk    (0x1UL << I2C_CR1_ADDRIE_Pos) /*!< 0x00000008 */
#define I2C_CR1_ADDRIE        I2C_CR1_ADDRIE_Msk            /*!< Address match interrupt enable */
#define I2C_CR1_NACKIE_Pos    (4U)
#define I2C_CR1_NACKIE_Msk    (0x1UL << I2C_CR1_NACKIE_Pos) /*!< 0x00000010 */
#define I2C_CR1_NACKIE        I2C_CR1_NACKIE_Msk            /*!< NACK received interrupt enable */
#define I2C_CR1_STOPIE_Pos    (5U)
#define I2C_CR1_STOPIE_Msk    (0x1UL << I2C_CR1_STOPIE_Pos) /*!< 0x00000020 */
#define I2C_CR1_STOPIE        I2C_CR1_STOPIE_Msk            /*!< STOP detection interrupt enable */
#define I2C_CR1_TCIE_Pos      (6U)
#define I2C_CR1_TCIE_Msk      (0x1UL << I2C_CR1_TCIE_Pos) /*!< 0x00000040 */
#define I2C_CR1_TCIE          I2C_CR1_TCIE_Msk            /*!< Transfer complete interrupt enable */
#define I2C_CR1_ERRIE_Pos     (7U)
#define I2C_CR1_ERRIE_Msk     (0x1UL << I2C_CR1_ERRIE_Pos) /*!< 0x00000080 */
#define I2C_CR1_ERRIE         I2C_CR1_ERRIE_Msk            /*!< Errors interrupt enable */
#define I2C_CR1_DNF_Pos       (8U)
#define I2C_CR1_DNF_Msk       (0xFUL << I2C_CR1_DNF_Pos) /*!< 0x00000F00 */
#define I2C_CR1_DNF           I2C_CR1_DNF_Msk            /*!< Digital noise filter */
#define I2C_CR1_ANFOFF_Pos    (12U)
#define I2C_CR1_ANFOFF_Msk    (0x1UL << I2C_CR1_ANFOFF_Pos) /*!< 0x00001000 */
#define I2C_CR1_ANFOFF        I2C_CR1_ANFOFF_Msk            /*!< Analog noise filter OFF */
#define I2C_CR1_TXDMAEN_Pos   (14U)
#define I2C_CR1_TXDMAEN_Msk   (0x1UL << I2C_CR1_TXDMAEN_Pos) /*!< 0x00004000 */
#define I2C_CR1_TXDMAEN       I2C_CR1_TXDMAEN_Msk            /*!< DMA transmission requests enable */
#define I2C_CR1_RXDMAEN_Pos   (15U)
#define I2C_CR1_RXDMAEN_Msk   (0x1UL << I2C_CR1_RXDMAEN_Pos) /*!< 0x00008000 */
#define I2C_CR1_RXDMAEN       I2C_CR1_RXDMAEN_Msk            /*!< DMA reception requests enable */
#define I2C_CR1_SBC_Pos       (16U)
#define I2C_CR1_SBC_Msk       (0x1UL << I2C_CR1_SBC_Pos) /*!< 0x00010000 */
#define I2C_CR1_SBC           I2C_CR1_SBC_Msk            /*!< Slave byte control */
#define I2C_CR1_NOSTRETCH_Pos (17U)
#define I2C_CR1_NOSTRETCH_Msk (0x1UL << I2C_CR1_NOSTRETCH_Pos) /*!< 0x00020000 */
#define I2C_CR1_NOSTRETCH     I2C_CR1_NOSTRETCH_Msk            /*!< Clock stretching disable */
#define I2C_CR1_WUPEN_Pos     (18U)
#define I2C_CR1_WUPEN_Msk     (0x1UL << I2C_CR1_WUPEN_Pos) /*!< 0x00040000 */
#define I2C_CR1_WUPEN         I2C_CR1_WUPEN_Msk            /*!< Wakeup from STOP enable */
#define I2C_CR1_GCEN_Pos      (19U)
#define I2C_CR1_GCEN_Msk      (0x1UL << I2C_CR1_GCEN_Pos) /*!< 0x00080000 */
#define I2C_CR1_GCEN          I2C_CR1_GCEN_Msk            /*!< General call enable */
#define I2C_CR1_SMBHEN_Pos    (20U)
#define I2C_CR1_SMBHEN_Msk    (0x1UL << I2C_CR1_SMBHEN_Pos) /*!< 0x00100000 */
#define I2C_CR1_SMBHEN        I2C_CR1_SMBHEN_Msk            /*!< SMBus host address enable */
#define I2C_CR1_SMBDEN_Pos    (21U)
#define I2C_CR1_SMBDEN_Msk    (0x1UL << I2C_CR1_SMBDEN_Pos) /*!< 0x00200000 */
#define I2C_CR1_SMBDEN        I2C_CR1_SMBDEN_Msk            /*!< SMBus device default address enable */
#define I2C_CR1_ALERTEN_Pos   (22U)
#define I2C_CR1_ALERTEN_Msk   (0x1UL << I2C_CR1_ALERTEN_Pos) /*!< 0x00400000 */
#define I2C_CR1_ALERTEN       I2C_CR1_ALERTEN_Msk            /*!< SMBus alert enable */
#define I2C_CR1_PECEN_Pos     (23U)
#define I2C_CR1_PECEN_Msk     (0x1UL << I2C_CR1_PECEN_Pos) /*!< 0x00800000 */
#define I2C_CR1_PECEN         I2C_CR1_PECEN_Msk            /*!< PEC enable */

/******************  Bit definition for I2C_CR2 register  ********************/
#define I2C_CR2_SADD_Pos    (0U)
#define I2C_CR2_SADD_Msk    (0x3FFUL << I2C_CR2_SADD_Pos) /*!< 0x000003FF */
#define I2C_CR2_SADD        I2C_CR2_SADD_Msk              /*!< Slave address (master mode) */
#define I2C_CR2_RD_WRN_Pos  (10U)
#define I2C_CR2_RD_WRN_Msk  (0x1UL << I2C_CR2_RD_WRN_Pos) /*!< 0x00000400 */
#define I2C_CR2_RD_WRN      I2C_CR2_RD_WRN_Msk            /*!< Transfer direction (master mode) */
#define I2C_CR2_ADD10_Pos   (11U)
#define I2C_CR2_ADD10_Msk   (0x1UL << I2C_CR2_ADD10_Pos) /*!< 0x00000800 */
#define I2C_CR2_ADD10       I2C_CR2_ADD10_Msk            /*!< 10-bit addressing mode (master mode) */
#define I2C_CR2_HEAD10R_Pos (12U)
#define I2C_CR2_HEAD10R_Msk (0x1UL << I2C_CR2_HEAD10R_Pos) /*!< 0x00001000 */
#define I2C_CR2_HEAD10R     I2C_CR2_HEAD10R_Msk /*!< 10-bit address header only read direction (master mode) */
#define I2C_CR2_START_Pos   (13U)
#define I2C_CR2_START_Msk   (0x1UL << I2C_CR2_START_Pos) /*!< 0x00002000 */
#define I2C_CR2_START       I2C_CR2_START_Msk            /*!< START generation */
#define I2C_CR2_STOP_Pos    (14U)
#define I2C_CR2_STOP_Msk    (0x1UL << I2C_CR2_STOP_Pos) /*!< 0x00004000 */
#define I2C_CR2_STOP        I2C_CR2_STOP_Msk            /*!< STOP generation (master mode) */
#define I2C_CR2_NACK_Pos    (15U)
#define I2C_CR2_NACK_Msk    (0x1UL << I2C_CR2_NACK_Pos) /*!< 0x00008000 */
#define I2C_CR2_NACK        I2C_CR2_NACK_Msk            /*!< NACK generation (slave mode) */
#define I2C_CR2_NBYTES_Pos  (16U)
#define I2C_CR2_NBYTES_Msk  (0xFFUL << I2C_CR2_NBYTES_Pos) /*!< 0x00FF0000 */
#define I2C_CR2_NBYTES      I2C_CR2_NBYTES_Msk             /*!< Number of bytes */
#define I2C_CR2_RELOAD_Pos  (24U)
#define I2C_CR2_RELOAD_Msk  (0x1UL << I2C_CR2_RELOAD_Pos) /*!< 0x01000000 */
#define I2C_CR2_RELOAD      I2C_CR2_RELOAD_Msk            /*!< NBYTES reload mode */
#define I2C_CR2_AUTOEND_Pos (25U)
#define I2C_CR2_AUTOEND_Msk (0x1UL << I2C_CR2_AUTOEND_Pos) /*!< 0x02000000 */
#define I2C_CR2_AUTOEND     I2C_CR2_AUTOEND_Msk            /*!< Automatic end mode (master mode) */
#define I2C_CR2_PECBYTE_Pos (26U)
#define I2C_CR2_PECBYTE_Msk (0x1UL << I2C_CR2_PECBYTE_Pos) /*!< 0x04000000 */
#define I2C_CR2_PECBYTE     I2C_CR2_PECBYTE_Msk            /*!< Packet error checking byte */

/*******************  Bit definition for I2C_OAR1 register  ******************/
#define I2C_OAR1_OA1_Pos     (0U)
#define I2C_OAR1_OA1_Msk     (0x3FFUL << I2C_OAR1_OA1_Pos) /*!< 0x000003FF */
#define I2C_OAR1_OA1         I2C_OAR1_OA1_Msk              /*!< Interface own address 1 */
#define I2C_OAR1_OA1MODE_Pos (10U)
#define I2C_OAR1_OA1MODE_Msk (0x1UL << I2C_OAR1_OA1MODE_Pos) /*!< 0x00000400 */
#define I2C_OAR1_OA1MODE     I2C_OAR1_OA1MODE_Msk            /*!< Own address 1 10-bit mode */
#define I2C_OAR1_OA1EN_Pos   (15U)
#define I2C_OAR1_OA1EN_Msk   (0x1UL << I2C_OAR1_OA1EN_Pos) /*!< 0x00008000 */
#define I2C_OAR1_OA1EN       I2C_OAR1_OA1EN_Msk            /*!< Own address 1 enable */

