Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for I2C_OAR2 register  ******************/
#define I2C_OAR2_OA2_Pos       (1U)
#define I2C_OAR2_OA2_Msk       (0x7FUL << I2C_OAR2_OA2_Pos) /*!< 0x000000FE */
#define I2C_OAR2_OA2           I2C_OAR2_OA2_Msk             /*!< Interface own address 2 */
#define I2C_OAR2_OA2MSK_Pos    (8U)
#define I2C_OAR2_OA2MSK_Msk    (0x7UL << I2C_OAR2_OA2MSK_Pos) /*!< 0x00000700 */
#define I2C_OAR2_OA2MSK        I2C_OAR2_OA2MSK_Msk            /*!< Own address 2 masks */
#define I2C_OAR2_OA2NOMASK     0x00000000UL                   /*!< No mask */
#define I2C_OAR2_OA2MASK01_Pos (8U)
#define I2C_OAR2_OA2MASK01_Msk (0x1UL << I2C_OAR2_OA2MASK01_Pos) /*!< 0x00000100 */
#define I2C_OAR2_OA2MASK01     I2C_OAR2_OA2MASK01_Msk            /*!< OA2[1] is masked, Only OA2[7:2] are compared */
#define I2C_OAR2_OA2MASK02_Pos (9U)
#define I2C_OAR2_OA2MASK02_Msk (0x1UL << I2C_OAR2_OA2MASK02_Pos) /*!< 0x00000200 */
#define I2C_OAR2_OA2MASK02     I2C_OAR2_OA2MASK02_Msk            /*!< OA2[2:1] is masked, Only OA2[7:3] are compared */
#define I2C_OAR2_OA2MASK03_Pos (8U)
#define I2C_OAR2_OA2MASK03_Msk (0x3UL << I2C_OAR2_OA2MASK03_Pos) /*!< 0x00000300 */
#define I2C_OAR2_OA2MASK03     I2C_OAR2_OA2MASK03_Msk            /*!< OA2[3:1] is masked, Only OA2[7:4] are compared */
#define I2C_OAR2_OA2MASK04_Pos (10U)
#define I2C_OAR2_OA2MASK04_Msk (0x1UL << I2C_OAR2_OA2MASK04_Pos) /*!< 0x00000400 */
#define I2C_OAR2_OA2MASK04     I2C_OAR2_OA2MASK04_Msk            /*!< OA2[4:1] is masked, Only OA2[7:5] are compared */
#define I2C_OAR2_OA2MASK05_Pos (8U)
#define I2C_OAR2_OA2MASK05_Msk (0x5UL << I2C_OAR2_OA2MASK05_Pos) /*!< 0x00000500 */
#define I2C_OAR2_OA2MASK05     I2C_OAR2_OA2MASK05_Msk            /*!< OA2[5:1] is masked, Only OA2[7:6] are compared */
#define I2C_OAR2_OA2MASK06_Pos (9U)
#define I2C_OAR2_OA2MASK06_Msk (0x3UL << I2C_OAR2_OA2MASK06_Pos) /*!< 0x00000600 */
#define I2C_OAR2_OA2MASK06     I2C_OAR2_OA2MASK06_Msk            /*!< OA2[6:1] is masked, Only OA2[7] are compared */
#define I2C_OAR2_OA2MASK07_Pos (8U)
#define I2C_OAR2_OA2MASK07_Msk (0x7UL << I2C_OAR2_OA2MASK07_Pos) /*!< 0x00000700 */
#define I2C_OAR2_OA2MASK07     I2C_OAR2_OA2MASK07_Msk            /*!< OA2[7:1] is masked, No comparison is done */
#define I2C_OAR2_OA2EN_Pos     (15U)
#define I2C_OAR2_OA2EN_Msk     (0x1UL << I2C_OAR2_OA2EN_Pos) /*!< 0x00008000 */
#define I2C_OAR2_OA2EN         I2C_OAR2_OA2EN_Msk            /*!< Own address 2 enable */

/*******************  Bit definition for I2C_TIMINGR register *******************/
#define I2C_TIMINGR_SCLL_Pos   (0U)
#define I2C_TIMINGR_SCLL_Msk   (0xFFUL << I2C_TIMINGR_SCLL_Pos) /*!< 0x000000FF */
#define I2C_TIMINGR_SCLL       I2C_TIMINGR_SCLL_Msk             /*!< SCL low period (master mode) */
#define I2C_TIMINGR_SCLH_Pos   (8U)
#define I2C_TIMINGR_SCLH_Msk   (0xFFUL << I2C_TIMINGR_SCLH_Pos) /*!< 0x0000FF00 */
#define I2C_TIMINGR_SCLH       I2C_TIMINGR_SCLH_Msk             /*!< SCL high period (master mode) */
#define I2C_TIMINGR_SDADEL_Pos (16U)
#define I2C_TIMINGR_SDADEL_Msk (0xFUL << I2C_TIMINGR_SDADEL_Pos) /*!< 0x000F0000 */
#define I2C_TIMINGR_SDADEL     I2C_TIMINGR_SDADEL_Msk            /*!< Data hold time */
#define I2C_TIMINGR_SCLDEL_Pos (20U)
#define I2C_TIMINGR_SCLDEL_Msk (0xFUL << I2C_TIMINGR_SCLDEL_Pos) /*!< 0x00F00000 */
#define I2C_TIMINGR_SCLDEL     I2C_TIMINGR_SCLDEL_Msk            /*!< Data setup time */
#define I2C_TIMINGR_PRESC_Pos  (28U)
#define I2C_TIMINGR_PRESC_Msk  (0xFUL << I2C_TIMINGR_PRESC_Pos) /*!< 0xF0000000 */
#define I2C_TIMINGR_PRESC      I2C_TIMINGR_PRESC_Msk            /*!< Timings prescaler */

/******************* Bit definition for I2C_TIMEOUTR register *******************/
#define I2C_TIMEOUTR_TIMEOUTA_Pos (0U)
#define I2C_TIMEOUTR_TIMEOUTA_Msk (0xFFFUL << I2C_TIMEOUTR_TIMEOUTA_Pos) /*!< 0x00000FFF */
#define I2C_TIMEOUTR_TIMEOUTA     I2C_TIMEOUTR_TIMEOUTA_Msk              /*!< Bus timeout A */
#define I2C_TIMEOUTR_TIDLE_Pos    (12U)
#define I2C_TIMEOUTR_TIDLE_Msk    (0x1UL << I2C_TIMEOUTR_TIDLE_Pos) /*!< 0x00001000 */
#define I2C_TIMEOUTR_TIDLE        I2C_TIMEOUTR_TIDLE_Msk            /*!< Idle clock timeout detection */
#define I2C_TIMEOUTR_TIMOUTEN_Pos (15U)
#define I2C_TIMEOUTR_TIMOUTEN_Msk (0x1UL << I2C_TIMEOUTR_TIMOUTEN_Pos) /*!< 0x00008000 */
#define I2C_TIMEOUTR_TIMOUTEN     I2C_TIMEOUTR_TIMOUTEN_Msk            /*!< Clock timeout enable */
#define I2C_TIMEOUTR_TIMEOUTB_Pos (16U)
#define I2C_TIMEOUTR_TIMEOUTB_Msk (0xFFFUL << I2C_TIMEOUTR_TIMEOUTB_Pos) /*!< 0x0FFF0000 */
#define I2C_TIMEOUTR_TIMEOUTB     I2C_TIMEOUTR_TIMEOUTB_Msk              /*!< Bus timeout B*/
#define I2C_TIMEOUTR_TEXTEN_Pos   (31U)
#define I2C_TIMEOUTR_TEXTEN_Msk   (0x1UL << I2C_TIMEOUTR_TEXTEN_Pos) /*!< 0x80000000 */
#define I2C_TIMEOUTR_TEXTEN       I2C_TIMEOUTR_TEXTEN_Msk            /*!< Extended clock timeout enable */

/******************  Bit definition for I2C_ISR register  *********************/
#define I2C_ISR_TXE_Pos     (0U)
#define I2C_ISR_TXE_Msk     (0x1UL << I2C_ISR_TXE_Pos) /*!< 0x00000001 */
#define I2C_ISR_TXE         I2C_ISR_TXE_Msk            /*!< Transmit data register empty */
#define I2C_ISR_TXIS_Pos    (1U)
#define I2C_ISR_TXIS_Msk    (0x1UL << I2C_ISR_TXIS_Pos) /*!< 0x00000002 */
#define I2C_ISR_TXIS        I2C_ISR_TXIS_Msk            /*!< Transmit interrupt status */
#define I2C_ISR_RXNE_Pos    (2U)
#define I2C_ISR_RXNE_Msk    (0x1UL << I2C_ISR_RXNE_Pos) /*!< 0x00000004 */
#define I2C_ISR_RXNE        I2C_ISR_RXNE_Msk            /*!< Receive data register not empty */
#define I2C_ISR_ADDR_Pos    (3U)
#define I2C_ISR_ADDR_Msk    (0x1UL << I2C_ISR_ADDR_Pos) /*!< 0x00000008 */
#define I2C_ISR_ADDR        I2C_ISR_ADDR_Msk            /*!< Address matched (slave mode)*/
#define I2C_ISR_NACKF_Pos   (4U)
#define I2C_ISR_NACKF_Msk   (0x1UL << I2C_ISR_NACKF_Pos) /*!< 0x00000010 */
#define I2C_ISR_NACKF       I2C_ISR_NACKF_Msk            /*!< NACK received flag */
#define I2C_ISR_STOPF_Pos   (5U)
#define I2C_ISR_STOPF_Msk   (0x1UL << I2C_ISR_STOPF_Pos) /*!< 0x00000020 */
#define I2C_ISR_STOPF       I2C_ISR_STOPF_Msk            /*!< STOP detection flag */
#define I2C_ISR_TC_Pos      (6U)
#define I2C_ISR_TC_Msk      (0x1UL << I2C_ISR_TC_Pos) /*!< 0x00000040 */
#define I2C_ISR_TC          I2C_ISR_TC_Msk            /*!< Transfer complete (master mode) */
#define I2C_ISR_TCR_Pos     (7U)
#define I2C_ISR_TCR_Msk     (0x1UL << I2C_ISR_TCR_Pos) /*!< 0x00000080 */
#define I2C_ISR_TCR         I2C_ISR_TCR_Msk            /*!< Transfer complete reload */
#define I2C_ISR_BERR_Pos    (8U)
#define I2C_ISR_BERR_Msk    (0x1UL << I2C_ISR_BERR_Pos) /*!< 0x00000100 */
#define I2C_ISR_BERR        I2C_ISR_BERR_Msk            /*!< Bus error */
#define I2C_ISR_ARLO_Pos    (9U)
#define I2C_ISR_ARLO_Msk    (0x1UL << I2C_ISR_ARLO_Pos) /*!< 0x00000200 */
#define I2C_ISR_ARLO        I2C_ISR_ARLO_Msk            /*!< Arbitration lost */
#define I2C_ISR_OVR_Pos     (10U)
#define I2C_ISR_OVR_Msk     (0x1UL << I2C_ISR_OVR_Pos) /*!< 0x00000400 */
#define I2C_ISR_OVR         I2C_ISR_OVR_Msk            /*!< Overrun/Underrun */
#define I2C_ISR_PECERR_Pos  (11U)
#define I2C_ISR_PECERR_Msk  (0x1UL << I2C_ISR_PECERR_Pos) /*!< 0x00000800 */
#define I2C_ISR_PECERR      I2C_ISR_PECERR_Msk            /*!< PEC error in reception */
#define I2C_ISR_TIMEOUT_Pos (12U)
#define I2C_ISR_TIMEOUT_Msk (0x1UL << I2C_ISR_TIMEOUT_Pos) /*!< 0x00001000 */
#define I2C_ISR_TIMEOUT     I2C_ISR_TIMEOUT_Msk            /*!< Timeout or Tlow detection flag */
#define I2C_ISR_ALERT_Pos   (13U)
#define I2C_ISR_ALERT_Msk   (0x1UL << I2C_ISR_ALERT_Pos) /*!< 0x00002000 */
#define I2C_ISR_ALERT       I2C_ISR_ALERT_Msk            /*!< SMBus alert */
#define I2C_ISR_BUSY_Pos    (15U)
#define I2C_ISR_BUSY_Msk    (0x1UL << I2C_ISR_BUSY_Pos) /*!< 0x00008000 */
#define I2C_ISR_BUSY        I2C_ISR_BUSY_Msk            /*!< Bus busy */
#define I2C_ISR_DIR_Pos     (16U)
#define I2C_ISR_DIR_Msk     (0x1UL << I2C_ISR_DIR_Pos) /*!< 0x00010000 */
#define I2C_ISR_DIR         I2C_ISR_DIR_Msk            /*!< Transfer direction (slave mode) */
#define I2C_ISR_ADDCODE_Pos (17U)
#define I2C_ISR_ADDCODE_Msk (0x7FUL << I2C_ISR_ADDCODE_Pos) /*!< 0x00FE0000 */
#define I2C_ISR_ADDCODE     I2C_ISR_ADDCODE_Msk             /*!< Address match code (slave mode) */

/******************  Bit definition for I2C_ICR register  *********************/
#define I2C_ICR_ADDRCF_Pos   (3U)
#define I2C_ICR_ADDRCF_Msk   (0x1UL << I2C_ICR_ADDRCF_Pos) /*!< 0x00000008 */
#define I2C_ICR_ADDRCF       I2C_ICR_ADDRCF_Msk            /*!< Address matched clear flag */
#define I2C_ICR_NACKCF_Pos   (4U)
#define I2C_ICR_NACKCF_Msk   (0x1UL << I2C_ICR_NACKCF_Pos) /*!< 0x00000010 */
#define I2C_ICR_NACKCF       I2C_ICR_NACKCF_Msk            /*!< NACK clear flag */
#define I2C_ICR_STOPCF_Pos   (5U)
#define I2C_ICR_STOPCF_Msk   (0x1UL << I2C_ICR_STOPCF_Pos) /*!< 0x00000020 */
#define I2C_ICR_STOPCF       I2C_ICR_STOPCF_Msk            /*!< STOP detection clear flag */
#define I2C_ICR_BERRCF_Pos   (8U)
#define I2C_ICR_BERRCF_Msk   (0x1UL << I2C_ICR_BERRCF_Pos) /*!< 0x00000100 */
#define I2C_ICR_BERRCF       I2C_ICR_BERRCF_Msk            /*!< Bus error clear flag */
#define I2C_ICR_ARLOCF_Pos   (9U)
#define I2C_ICR_ARLOCF_Msk   (0x1UL << I2C_ICR_ARLOCF_Pos) /*!< 0x00000200 */
#define I2C_ICR_ARLOCF       I2C_ICR_ARLOCF_Msk            /*!< Arbitration lost clear flag */
#define I2C_ICR_OVRCF_Pos    (10U)
#define I2C_ICR_OVRCF_Msk    (0x1UL << I2C_ICR_OVRCF_Pos) /*!< 0x00000400 */
#define I2C_ICR_OVRCF        I2C_ICR_OVRCF_Msk            /*!< Overrun/Underrun clear flag */
#define I2C_ICR_PECCF_Pos    (11U)
#define I2C_ICR_PECCF_Msk    (0x1UL << I2C_ICR_PECCF_Pos) /*!< 0x00000800 */
#define I2C_ICR_PECCF        I2C_ICR_PECCF_Msk            /*!< PAC error clear flag */
#define I2C_ICR_TIMOUTCF_Pos (12U)
#define I2C_ICR_TIMOUTCF_Msk (0x1UL << I2C_ICR_TIMOUTCF_Pos) /*!< 0x00001000 */
#define I2C_ICR_TIMOUTCF     I2C_ICR_TIMOUTCF_Msk            /*!< Timeout clear flag */
#define I2C_ICR_ALERTCF_Pos  (13U)
#define I2C_ICR_ALERTCF_Msk  (0x1UL << I2C_ICR_ALERTCF_Pos) /*!< 0x00002000 */
#define I2C_ICR_ALERTCF      I2C_ICR_ALERTCF_Msk            /*!< Alert clear flag */

