Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/******************  Bit definition for I2C_PECR register  *********************/
#define I2C_PECR_PEC_Pos (0U)
#define I2C_PECR_PEC_Msk (0xFFUL << I2C_PECR_PEC_Pos) /*!< 0x000000FF */
#define I2C_PECR_PEC     I2C_PECR_PEC_Msk             /*!< PEC register */

/******************  Bit definition for I2C_RXDR register  *********************/
#define I2C_RXDR_RXDATA_Pos (0U)
#define I2C_RXDR_RXDATA_Msk (0xFFUL << I2C_RXDR_RXDATA_Pos) /*!< 0x000000FF */
#define I2C_RXDR_RXDATA     I2C_RXDR_RXDATA_Msk             /*!< 8-bit receive data */

/******************  Bit definition for I2C_TXDR register  *********************/
#define I2C_TXDR_TXDATA_Pos (0U)
#define I2C_TXDR_TXDATA_Msk (0xFFUL << I2C_TXDR_TXDATA_Pos) /*!< 0x000000FF */
#define I2C_TXDR_TXDATA     I2C_TXDR_TXDATA_Msk             /*!< 8-bit transmit data */

/******************************************************************************/
/*                                                                            */
/*                           Independent WATCHDOG                             */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for IWDG_KR register  ********************/
#define IWDG_KR_KEY_Pos (0U)
#define IWDG_KR_KEY_Msk (0xFFFFUL << IWDG_KR_KEY_Pos) /*!< 0x0000FFFF */
#define IWDG_KR_KEY     IWDG_KR_KEY_Msk               /*!<Key value (write only, read 0000h)  */

/*******************  Bit definition for IWDG_PR register  ********************/
#define IWDG_PR_PR_Pos (0U)
#define IWDG_PR_PR_Msk (0x7UL << IWDG_PR_PR_Pos) /*!< 0x00000007 */
#define IWDG_PR_PR     IWDG_PR_PR_Msk            /*!<PR[2:0] (Prescaler divider)         */
#define IWDG_PR_PR_0   (0x1UL << IWDG_PR_PR_Pos) /*!< 0x00000001 */
#define IWDG_PR_PR_1   (0x2UL << IWDG_PR_PR_Pos) /*!< 0x00000002 */
#define IWDG_PR_PR_2   (0x4UL << IWDG_PR_PR_Pos) /*!< 0x00000004 */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define IWDG_RLR_RL_Pos (0U)
#define IWDG_RLR_RL_Msk (0xFFFUL << IWDG_RLR_RL_Pos) /*!< 0x00000FFF */
#define IWDG_RLR_RL     IWDG_RLR_RL_Msk              /*!<Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ********************/
#define IWDG_SR_PVU_Pos (0U)
#define IWDG_SR_PVU_Msk (0x1UL << IWDG_SR_PVU_Pos) /*!< 0x00000001 */
#define IWDG_SR_PVU     IWDG_SR_PVU_Msk            /*!< Watchdog prescaler value update */
#define IWDG_SR_RVU_Pos (1U)
#define IWDG_SR_RVU_Msk (0x1UL << IWDG_SR_RVU_Pos) /*!< 0x00000002 */
#define IWDG_SR_RVU     IWDG_SR_RVU_Msk            /*!< Watchdog counter reload value update */
#define IWDG_SR_WVU_Pos (2U)
#define IWDG_SR_WVU_Msk (0x1UL << IWDG_SR_WVU_Pos) /*!< 0x00000004 */
#define IWDG_SR_WVU     IWDG_SR_WVU_Msk            /*!< Watchdog counter window value update */

/*******************  Bit definition for IWDG_KR register  ********************/
#define IWDG_WINR_WIN_Pos (0U)
#define IWDG_WINR_WIN_Msk (0xFFFUL << IWDG_WINR_WIN_Pos) /*!< 0x00000FFF */
#define IWDG_WINR_WIN     IWDG_WINR_WIN_Msk              /*!< Watchdog counter window value */

/******************************************************************************/
/*                                                                            */
/*                        JPEG Encoder/Decoder                                */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for CONFR0 register  ********************/
#define JPEG_CONFR0_START_Pos (0U)
#define JPEG_CONFR0_START_Msk (0x1UL << JPEG_CONFR0_START_Pos) /*!< 0x00000001 */
#define JPEG_CONFR0_START     JPEG_CONFR0_START_Msk            /*!<Start/Stop bit */

/********************  Bit definition for CONFR1 register  ********************/
#define JPEG_CONFR1_NF_Pos         (0U)
#define JPEG_CONFR1_NF_Msk         (0x3UL << JPEG_CONFR1_NF_Pos) /*!< 0x00000003 */
#define JPEG_CONFR1_NF             JPEG_CONFR1_NF_Msk            /*!<Number of color components */
#define JPEG_CONFR1_NF_0           (0x1UL << JPEG_CONFR1_NF_Pos) /*!< 0x00000001 */
#define JPEG_CONFR1_NF_1           (0x2UL << JPEG_CONFR1_NF_Pos) /*!< 0x00000002 */
#define JPEG_CONFR1_DE_Pos         (3U)
#define JPEG_CONFR1_DE_Msk         (0x1UL << JPEG_CONFR1_DE_Pos) /*!< 0x00000008 */
#define JPEG_CONFR1_DE             JPEG_CONFR1_DE_Msk            /*!<Decoding Enable */
#define JPEG_CONFR1_COLORSPACE_Pos (4U)
#define JPEG_CONFR1_COLORSPACE_Msk (0x3UL << JPEG_CONFR1_COLORSPACE_Pos) /*!< 0x00000030 */
#define JPEG_CONFR1_COLORSPACE     JPEG_CONFR1_COLORSPACE_Msk            /*!<Color Space */
#define JPEG_CONFR1_COLORSPACE_0   (0x1UL << JPEG_CONFR1_COLORSPACE_Pos) /*!< 0x00000010 */
#define JPEG_CONFR1_COLORSPACE_1   (0x2UL << JPEG_CONFR1_COLORSPACE_Pos) /*!< 0x00000020 */
#define JPEG_CONFR1_NS_Pos         (6U)
#define JPEG_CONFR1_NS_Msk         (0x3UL << JPEG_CONFR1_NS_Pos) /*!< 0x000000C0 */
#define JPEG_CONFR1_NS             JPEG_CONFR1_NS_Msk            /*!<Number of components for Scan */
#define JPEG_CONFR1_NS_0           (0x1UL << JPEG_CONFR1_NS_Pos) /*!< 0x00000040 */
#define JPEG_CONFR1_NS_1           (0x2UL << JPEG_CONFR1_NS_Pos) /*!< 0x00000080 */
#define JPEG_CONFR1_HDR_Pos        (8U)
#define JPEG_CONFR1_HDR_Msk        (0x1UL << JPEG_CONFR1_HDR_Pos) /*!< 0x00000100 */
#define JPEG_CONFR1_HDR            JPEG_CONFR1_HDR_Msk            /*!<Header Processing On/Off */
#define JPEG_CONFR1_YSIZE_Pos      (16U)
#define JPEG_CONFR1_YSIZE_Msk      (0xFFFFUL << JPEG_CONFR1_YSIZE_Pos) /*!< 0xFFFF0000 */
#define JPEG_CONFR1_YSIZE          JPEG_CONFR1_YSIZE_Msk               /*!<Number of lines in source image */

/********************  Bit definition for CONFR2 register  ********************/
#define JPEG_CONFR2_NMCU_Pos (0U)
#define JPEG_CONFR2_NMCU_Msk (0x3FFFFFFUL << JPEG_CONFR2_NMCU_Pos) /*!< 0x03FFFFFF */
#define JPEG_CONFR2_NMCU     JPEG_CONFR2_NMCU_Msk                  /*!<Number of MCU units minus 1 to encode */

/********************  Bit definition for CONFR3 register  ********************/
#define JPEG_CONFR3_XSIZE_Pos (16U)
#define JPEG_CONFR3_XSIZE_Msk (0xFFFFUL << JPEG_CONFR3_XSIZE_Pos) /*!< 0xFFFF0000 */
#define JPEG_CONFR3_XSIZE     JPEG_CONFR3_XSIZE_Msk               /*!<Number of pixels per line */

/********************  Bit definition for CONFR4 register  ********************/
#define JPEG_CONFR4_HD_Pos (0U)
#define JPEG_CONFR4_HD_Msk (0x1UL << JPEG_CONFR4_HD_Pos) /*!< 0x00000001 */
#define JPEG_CONFR4_HD     JPEG_CONFR4_HD_Msk /*!<Selects the Huffman table for encoding the DC coefficients */
#define JPEG_CONFR4_HA_Pos (1U)
#define JPEG_CONFR4_HA_Msk (0x1UL << JPEG_CONFR4_HA_Pos) /*!< 0x00000002 */
#define JPEG_CONFR4_HA     JPEG_CONFR4_HA_Msk /*!<Selects the Huffman table for encoding the AC coefficients */
#define JPEG_CONFR4_QT_Pos (2U)
#define JPEG_CONFR4_QT_Msk (0x3UL << JPEG_CONFR4_QT_Pos) /*!< 0x0000000C */
#define JPEG_CONFR4_QT     JPEG_CONFR4_QT_Msk /*!<Selects quantization table associated with a color component */
#define JPEG_CONFR4_QT_0   (0x1UL << JPEG_CONFR4_QT_Pos) /*!< 0x00000004 */
#define JPEG_CONFR4_QT_1   (0x2UL << JPEG_CONFR4_QT_Pos) /*!< 0x00000008 */
#define JPEG_CONFR4_NB_Pos (4U)
#define JPEG_CONFR4_NB_Msk (0xFUL << JPEG_CONFR4_NB_Pos) /*!< 0x000000F0 */
#define JPEG_CONFR4_NB                                                                                                 \
  JPEG_CONFR4_NB_Msk /*!<Number of data units minus 1 that belong to a particular color in the MCU */
#define JPEG_CONFR4_NB_0    (0x1UL << JPEG_CONFR4_NB_Pos) /*!< 0x00000010 */
#define JPEG_CONFR4_NB_1    (0x2UL << JPEG_CONFR4_NB_Pos) /*!< 0x00000020 */
#define JPEG_CONFR4_NB_2    (0x4UL << JPEG_CONFR4_NB_Pos) /*!< 0x00000040 */
#define JPEG_CONFR4_NB_3    (0x8UL << JPEG_CONFR4_NB_Pos) /*!< 0x00000080 */
#define JPEG_CONFR4_VSF_Pos (8U)
#define JPEG_CONFR4_VSF_Msk (0xFUL << JPEG_CONFR4_VSF_Pos) /*!< 0x00000F00 */
#define JPEG_CONFR4_VSF     JPEG_CONFR4_VSF_Msk            /*!<Vertical sampling factor for component 1 */
#define JPEG_CONFR4_VSF_0   (0x1UL << JPEG_CONFR4_VSF_Pos) /*!< 0x00000100 */
#define JPEG_CONFR4_VSF_1   (0x2UL << JPEG_CONFR4_VSF_Pos) /*!< 0x00000200 */
#define JPEG_CONFR4_VSF_2   (0x4UL << JPEG_CONFR4_VSF_Pos) /*!< 0x00000400 */
#define JPEG_CONFR4_VSF_3   (0x8UL << JPEG_CONFR4_VSF_Pos) /*!< 0x00000800 */
#define JPEG_CONFR4_HSF_Pos (12U)
#define JPEG_CONFR4_HSF_Msk (0xFUL << JPEG_CONFR4_HSF_Pos) /*!< 0x0000F000 */
#define JPEG_CONFR4_HSF     JPEG_CONFR4_HSF_Msk            /*!<Horizontal sampling factor for component 1 */
#define JPEG_CONFR4_HSF_0   (0x1UL << JPEG_CONFR4_HSF_Pos) /*!< 0x00001000 */
#define JPEG_CONFR4_HSF_1   (0x2UL << JPEG_CONFR4_HSF_Pos) /*!< 0x00002000 */
#define JPEG_CONFR4_HSF_2   (0x4UL << JPEG_CONFR4_HSF_Pos) /*!< 0x00004000 */
#define JPEG_CONFR4_HSF_3   (0x8UL << JPEG_CONFR4_HSF_Pos) /*!< 0x00008000 */

