Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bit definition for CFR register  ********************/
#define JPEG_CFR_CEOCF_Pos (5U)
#define JPEG_CFR_CEOCF_Msk (0x1UL << JPEG_CFR_CEOCF_Pos) /*!< 0x00000010 */
#define JPEG_CFR_CEOCF     JPEG_CFR_CEOCF_Msk            /*!<Clear End of Conversion Flag */
#define JPEG_CFR_CHPDF_Pos (6U)
#define JPEG_CFR_CHPDF_Msk (0x1UL << JPEG_CFR_CHPDF_Pos) /*!< 0x00000020 */
#define JPEG_CFR_CHPDF     JPEG_CFR_CHPDF_Msk            /*!<Clear Header Parsing Done Flag */

/********************  Bit definition for DIR register  ********************/
#define JPEG_DIR_DATAIN_Pos (0U)
#define JPEG_DIR_DATAIN_Msk (0xFFFFFFFFUL << JPEG_DIR_DATAIN_Pos) /*!< 0xFFFFFFFF */
#define JPEG_DIR_DATAIN     JPEG_DIR_DATAIN_Msk                   /*!<Data Input FIFO */

/********************  Bit definition for DOR register  ********************/
#define JPEG_DOR_DATAOUT_Pos (0U)
#define JPEG_DOR_DATAOUT_Msk (0xFFFFFFFFUL << JPEG_DOR_DATAOUT_Pos) /*!< 0xFFFFFFFF */
#define JPEG_DOR_DATAOUT     JPEG_DOR_DATAOUT_Msk                   /*!<Data Output FIFO */

/******************************************************************************/
/*                                                                            */
/*                      LCD-TFT Display Controller (LTDC)                     */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for LTDC_SSCR register  *****************/

#define LTDC_SSCR_VSH_Pos (0U)
#define LTDC_SSCR_VSH_Msk (0x7FFUL << LTDC_SSCR_VSH_Pos) /*!< 0x000007FF */
#define LTDC_SSCR_VSH     LTDC_SSCR_VSH_Msk              /*!< Vertical Synchronization Height  */
#define LTDC_SSCR_HSW_Pos (16U)
#define LTDC_SSCR_HSW_Msk (0xFFFUL << LTDC_SSCR_HSW_Pos) /*!< 0x0FFF0000 */
#define LTDC_SSCR_HSW     LTDC_SSCR_HSW_Msk              /*!< Horizontal Synchronization Width */

/********************  Bit definition for LTDC_BPCR register  *****************/

#define LTDC_BPCR_AVBP_Pos (0U)
#define LTDC_BPCR_AVBP_Msk (0x7FFUL << LTDC_BPCR_AVBP_Pos) /*!< 0x000007FF */
#define LTDC_BPCR_AVBP     LTDC_BPCR_AVBP_Msk              /*!< Accumulated Vertical Back Porch   */
#define LTDC_BPCR_AHBP_Pos (16U)
#define LTDC_BPCR_AHBP_Msk (0xFFFUL << LTDC_BPCR_AHBP_Pos) /*!< 0x0FFF0000 */
#define LTDC_BPCR_AHBP     LTDC_BPCR_AHBP_Msk              /*!< Accumulated Horizontal Back Porch */

/********************  Bit definition for LTDC_AWCR register  *****************/

#define LTDC_AWCR_AAH_Pos (0U)
#define LTDC_AWCR_AAH_Msk (0x7FFUL << LTDC_AWCR_AAH_Pos) /*!< 0x000007FF */
#define LTDC_AWCR_AAH     LTDC_AWCR_AAH_Msk              /*!< Accumulated Active height */
#define LTDC_AWCR_AAW_Pos (16U)
#define LTDC_AWCR_AAW_Msk (0xFFFUL << LTDC_AWCR_AAW_Pos) /*!< 0x0FFF0000 */
#define LTDC_AWCR_AAW     LTDC_AWCR_AAW_Msk              /*!< Accumulated Active Width */

/********************  Bit definition for LTDC_TWCR register  *****************/

#define LTDC_TWCR_TOTALH_Pos (0U)
#define LTDC_TWCR_TOTALH_Msk (0x7FFUL << LTDC_TWCR_TOTALH_Pos) /*!< 0x000007FF */
#define LTDC_TWCR_TOTALH     LTDC_TWCR_TOTALH_Msk              /*!< Total height */
#define LTDC_TWCR_TOTALW_Pos (16U)
#define LTDC_TWCR_TOTALW_Msk (0xFFFUL << LTDC_TWCR_TOTALW_Pos) /*!< 0x0FFF0000 */
#define LTDC_TWCR_TOTALW     LTDC_TWCR_TOTALW_Msk              /*!< Total Width */

/********************  Bit definition for LTDC_GCR register  ******************/

#define LTDC_GCR_LTDCEN_Pos (0U)
#define LTDC_GCR_LTDCEN_Msk (0x1UL << LTDC_GCR_LTDCEN_Pos) /*!< 0x00000001 */
#define LTDC_GCR_LTDCEN     LTDC_GCR_LTDCEN_Msk            /*!< LCD-TFT controller enable bit       */
#define LTDC_GCR_DBW_Pos    (4U)
#define LTDC_GCR_DBW_Msk    (0x7UL << LTDC_GCR_DBW_Pos) /*!< 0x00000070 */
#define LTDC_GCR_DBW        LTDC_GCR_DBW_Msk            /*!< Dither Blue Width                   */
#define LTDC_GCR_DGW_Pos    (8U)
#define LTDC_GCR_DGW_Msk    (0x7UL << LTDC_GCR_DGW_Pos) /*!< 0x00000700 */
#define LTDC_GCR_DGW        LTDC_GCR_DGW_Msk            /*!< Dither Green Width                  */
#define LTDC_GCR_DRW_Pos    (12U)
#define LTDC_GCR_DRW_Msk    (0x7UL << LTDC_GCR_DRW_Pos) /*!< 0x00007000 */
#define LTDC_GCR_DRW        LTDC_GCR_DRW_Msk            /*!< Dither Red Width                    */
#define LTDC_GCR_DEN_Pos    (16U)
#define LTDC_GCR_DEN_Msk    (0x1UL << LTDC_GCR_DEN_Pos) /*!< 0x00010000 */
#define LTDC_GCR_DEN        LTDC_GCR_DEN_Msk            /*!< Dither Enable                       */
#define LTDC_GCR_PCPOL_Pos  (28U)
#define LTDC_GCR_PCPOL_Msk  (0x1UL << LTDC_GCR_PCPOL_Pos) /*!< 0x10000000 */
#define LTDC_GCR_PCPOL      LTDC_GCR_PCPOL_Msk            /*!< Pixel Clock Polarity                */
#define LTDC_GCR_DEPOL_Pos  (29U)
#define LTDC_GCR_DEPOL_Msk  (0x1UL << LTDC_GCR_DEPOL_Pos) /*!< 0x20000000 */
#define LTDC_GCR_DEPOL      LTDC_GCR_DEPOL_Msk            /*!< Data Enable Polarity                */
#define LTDC_GCR_VSPOL_Pos  (30U)
#define LTDC_GCR_VSPOL_Msk  (0x1UL << LTDC_GCR_VSPOL_Pos) /*!< 0x40000000 */
#define LTDC_GCR_VSPOL      LTDC_GCR_VSPOL_Msk            /*!< Vertical Synchronization Polarity   */
#define LTDC_GCR_HSPOL_Pos  (31U)
#define LTDC_GCR_HSPOL_Msk  (0x1UL << LTDC_GCR_HSPOL_Pos) /*!< 0x80000000 */
#define LTDC_GCR_HSPOL      LTDC_GCR_HSPOL_Msk            /*!< Horizontal Synchronization Polarity */

/********************  Bit definition for LTDC_SRCR register  *****************/

#define LTDC_SRCR_IMR_Pos (0U)
#define LTDC_SRCR_IMR_Msk (0x1UL << LTDC_SRCR_IMR_Pos) /*!< 0x00000001 */
#define LTDC_SRCR_IMR     LTDC_SRCR_IMR_Msk            /*!< Immediate Reload         */
#define LTDC_SRCR_VBR_Pos (1U)
#define LTDC_SRCR_VBR_Msk (0x1UL << LTDC_SRCR_VBR_Pos) /*!< 0x00000002 */
#define LTDC_SRCR_VBR     LTDC_SRCR_VBR_Msk            /*!< Vertical Blanking Reload */

/********************  Bit definition for LTDC_BCCR register  *****************/

#define LTDC_BCCR_BCBLUE_Pos  (0U)
#define LTDC_BCCR_BCBLUE_Msk  (0xFFUL << LTDC_BCCR_BCBLUE_Pos) /*!< 0x000000FF */
#define LTDC_BCCR_BCBLUE      LTDC_BCCR_BCBLUE_Msk             /*!< Background Blue value  */
#define LTDC_BCCR_BCGREEN_Pos (8U)
#define LTDC_BCCR_BCGREEN_Msk (0xFFUL << LTDC_BCCR_BCGREEN_Pos) /*!< 0x0000FF00 */
#define LTDC_BCCR_BCGREEN     LTDC_BCCR_BCGREEN_Msk             /*!< Background Green value */
#define LTDC_BCCR_BCRED_Pos   (16U)
#define LTDC_BCCR_BCRED_Msk   (0xFFUL << LTDC_BCCR_BCRED_Pos) /*!< 0x00FF0000 */
#define LTDC_BCCR_BCRED       LTDC_BCCR_BCRED_Msk             /*!< Background Red value   */

/********************  Bit definition for LTDC_IER register  ******************/

#define LTDC_IER_LIE_Pos    (0U)
#define LTDC_IER_LIE_Msk    (0x1UL << LTDC_IER_LIE_Pos) /*!< 0x00000001 */
#define LTDC_IER_LIE        LTDC_IER_LIE_Msk            /*!< Line Interrupt Enable            */
#define LTDC_IER_FUIE_Pos   (1U)
#define LTDC_IER_FUIE_Msk   (0x1UL << LTDC_IER_FUIE_Pos) /*!< 0x00000002 */
#define LTDC_IER_FUIE       LTDC_IER_FUIE_Msk            /*!< FIFO Underrun Interrupt Enable   */
#define LTDC_IER_TERRIE_Pos (2U)
#define LTDC_IER_TERRIE_Msk (0x1UL << LTDC_IER_TERRIE_Pos) /*!< 0x00000004 */
#define LTDC_IER_TERRIE     LTDC_IER_TERRIE_Msk            /*!< Transfer Error Interrupt Enable  */
#define LTDC_IER_RRIE_Pos   (3U)
#define LTDC_IER_RRIE_Msk   (0x1UL << LTDC_IER_RRIE_Pos) /*!< 0x00000008 */
#define LTDC_IER_RRIE       LTDC_IER_RRIE_Msk            /*!< Register Reload interrupt enable */

