Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bit definition for LTDC_ISR register  ******************/

#define LTDC_ISR_LIF_Pos    (0U)
#define LTDC_ISR_LIF_Msk    (0x1UL << LTDC_ISR_LIF_Pos) /*!< 0x00000001 */
#define LTDC_ISR_LIF        LTDC_ISR_LIF_Msk            /*!< Line Interrupt Flag */
#define LTDC_ISR_FUIF_Pos   (1U)
#define LTDC_ISR_FUIF_Msk   (0x1UL << LTDC_ISR_FUIF_Pos) /*!< 0x00000002 */
#define LTDC_ISR_FUIF       LTDC_ISR_FUIF_Msk            /*!< FIFO Underrun Interrupt Flag */
#define LTDC_ISR_TERRIF_Pos (2U)
#define LTDC_ISR_TERRIF_Msk (0x1UL << LTDC_ISR_TERRIF_Pos) /*!< 0x00000004 */
#define LTDC_ISR_TERRIF     LTDC_ISR_TERRIF_Msk            /*!< Transfer Error Interrupt Flag */
#define LTDC_ISR_RRIF_Pos   (3U)
#define LTDC_ISR_RRIF_Msk   (0x1UL << LTDC_ISR_RRIF_Pos) /*!< 0x00000008 */
#define LTDC_ISR_RRIF       LTDC_ISR_RRIF_Msk            /*!< Register Reload interrupt Flag */

/********************  Bit definition for LTDC_ICR register  ******************/

#define LTDC_ICR_CLIF_Pos    (0U)
#define LTDC_ICR_CLIF_Msk    (0x1UL << LTDC_ICR_CLIF_Pos) /*!< 0x00000001 */
#define LTDC_ICR_CLIF        LTDC_ICR_CLIF_Msk            /*!< Clears the Line Interrupt Flag */
#define LTDC_ICR_CFUIF_Pos   (1U)
#define LTDC_ICR_CFUIF_Msk   (0x1UL << LTDC_ICR_CFUIF_Pos) /*!< 0x00000002 */
#define LTDC_ICR_CFUIF       LTDC_ICR_CFUIF_Msk            /*!< Clears the FIFO Underrun Interrupt Flag */
#define LTDC_ICR_CTERRIF_Pos (2U)
#define LTDC_ICR_CTERRIF_Msk (0x1UL << LTDC_ICR_CTERRIF_Pos) /*!< 0x00000004 */
#define LTDC_ICR_CTERRIF     LTDC_ICR_CTERRIF_Msk            /*!< Clears the Transfer Error Interrupt Flag */
#define LTDC_ICR_CRRIF_Pos   (3U)
#define LTDC_ICR_CRRIF_Msk   (0x1UL << LTDC_ICR_CRRIF_Pos) /*!< 0x00000008 */
#define LTDC_ICR_CRRIF       LTDC_ICR_CRRIF_Msk            /*!< Clears Register Reload interrupt Flag */

/********************  Bit definition for LTDC_LIPCR register  ****************/

#define LTDC_LIPCR_LIPOS_Pos (0U)
#define LTDC_LIPCR_LIPOS_Msk (0x7FFUL << LTDC_LIPCR_LIPOS_Pos) /*!< 0x000007FF */
#define LTDC_LIPCR_LIPOS     LTDC_LIPCR_LIPOS_Msk              /*!< Line Interrupt Position */

/********************  Bit definition for LTDC_CPSR register  *****************/

#define LTDC_CPSR_CYPOS_Pos (0U)
#define LTDC_CPSR_CYPOS_Msk (0xFFFFUL << LTDC_CPSR_CYPOS_Pos) /*!< 0x0000FFFF */
#define LTDC_CPSR_CYPOS     LTDC_CPSR_CYPOS_Msk               /*!< Current Y Position */
#define LTDC_CPSR_CXPOS_Pos (16U)
#define LTDC_CPSR_CXPOS_Msk (0xFFFFUL << LTDC_CPSR_CXPOS_Pos) /*!< 0xFFFF0000 */
#define LTDC_CPSR_CXPOS     LTDC_CPSR_CXPOS_Msk               /*!< Current X Position */

/********************  Bit definition for LTDC_CDSR register  *****************/

#define LTDC_CDSR_VDES_Pos   (0U)
#define LTDC_CDSR_VDES_Msk   (0x1UL << LTDC_CDSR_VDES_Pos) /*!< 0x00000001 */
#define LTDC_CDSR_VDES       LTDC_CDSR_VDES_Msk            /*!< Vertical Data Enable Status       */
#define LTDC_CDSR_HDES_Pos   (1U)
#define LTDC_CDSR_HDES_Msk   (0x1UL << LTDC_CDSR_HDES_Pos) /*!< 0x00000002 */
#define LTDC_CDSR_HDES       LTDC_CDSR_HDES_Msk            /*!< Horizontal Data Enable Status     */
#define LTDC_CDSR_VSYNCS_Pos (2U)
#define LTDC_CDSR_VSYNCS_Msk (0x1UL << LTDC_CDSR_VSYNCS_Pos) /*!< 0x00000004 */
#define LTDC_CDSR_VSYNCS     LTDC_CDSR_VSYNCS_Msk            /*!< Vertical Synchronization Status   */
#define LTDC_CDSR_HSYNCS_Pos (3U)
#define LTDC_CDSR_HSYNCS_Msk (0x1UL << LTDC_CDSR_HSYNCS_Pos) /*!< 0x00000008 */
#define LTDC_CDSR_HSYNCS     LTDC_CDSR_HSYNCS_Msk            /*!< Horizontal Synchronization Status */

/********************  Bit definition for LTDC_LxCR register  *****************/

#define LTDC_LxCR_LEN_Pos    (0U)
#define LTDC_LxCR_LEN_Msk    (0x1UL << LTDC_LxCR_LEN_Pos) /*!< 0x00000001 */
#define LTDC_LxCR_LEN        LTDC_LxCR_LEN_Msk            /*!< Layer Enable              */
#define LTDC_LxCR_COLKEN_Pos (1U)
#define LTDC_LxCR_COLKEN_Msk (0x1UL << LTDC_LxCR_COLKEN_Pos) /*!< 0x00000002 */
#define LTDC_LxCR_COLKEN     LTDC_LxCR_COLKEN_Msk            /*!< Color Keying Enable       */
#define LTDC_LxCR_CLUTEN_Pos (4U)
#define LTDC_LxCR_CLUTEN_Msk (0x1UL << LTDC_LxCR_CLUTEN_Pos) /*!< 0x00000010 */
#define LTDC_LxCR_CLUTEN     LTDC_LxCR_CLUTEN_Msk            /*!< Color Lockup Table Enable */

/********************  Bit definition for LTDC_LxWHPCR register  **************/

#define LTDC_LxWHPCR_WHSTPOS_Pos (0U)
#define LTDC_LxWHPCR_WHSTPOS_Msk (0xFFFUL << LTDC_LxWHPCR_WHSTPOS_Pos) /*!< 0x00000FFF */
#define LTDC_LxWHPCR_WHSTPOS     LTDC_LxWHPCR_WHSTPOS_Msk              /*!< Window Horizontal Start Position */
#define LTDC_LxWHPCR_WHSPPOS_Pos (16U)
#define LTDC_LxWHPCR_WHSPPOS_Msk (0xFFFFUL << LTDC_LxWHPCR_WHSPPOS_Pos) /*!< 0xFFFF0000 */
#define LTDC_LxWHPCR_WHSPPOS     LTDC_LxWHPCR_WHSPPOS_Msk               /*!< Window Horizontal Stop Position  */

/********************  Bit definition for LTDC_LxWVPCR register  **************/

#define LTDC_LxWVPCR_WVSTPOS_Pos (0U)
#define LTDC_LxWVPCR_WVSTPOS_Msk (0xFFFUL << LTDC_LxWVPCR_WVSTPOS_Pos) /*!< 0x00000FFF */
#define LTDC_LxWVPCR_WVSTPOS     LTDC_LxWVPCR_WVSTPOS_Msk              /*!< Window Vertical Start Position */
#define LTDC_LxWVPCR_WVSPPOS_Pos (16U)
#define LTDC_LxWVPCR_WVSPPOS_Msk (0xFFFFUL << LTDC_LxWVPCR_WVSPPOS_Pos) /*!< 0xFFFF0000 */
#define LTDC_LxWVPCR_WVSPPOS     LTDC_LxWVPCR_WVSPPOS_Msk               /*!< Window Vertical Stop Position  */

/********************  Bit definition for LTDC_LxCKCR register  ***************/

#define LTDC_LxCKCR_CKBLUE_Pos  (0U)
#define LTDC_LxCKCR_CKBLUE_Msk  (0xFFUL << LTDC_LxCKCR_CKBLUE_Pos) /*!< 0x000000FF */
#define LTDC_LxCKCR_CKBLUE      LTDC_LxCKCR_CKBLUE_Msk             /*!< Color Key Blue value  */
#define LTDC_LxCKCR_CKGREEN_Pos (8U)
#define LTDC_LxCKCR_CKGREEN_Msk (0xFFUL << LTDC_LxCKCR_CKGREEN_Pos) /*!< 0x0000FF00 */
#define LTDC_LxCKCR_CKGREEN     LTDC_LxCKCR_CKGREEN_Msk             /*!< Color Key Green value */
#define LTDC_LxCKCR_CKRED_Pos   (16U)
#define LTDC_LxCKCR_CKRED_Msk   (0xFFUL << LTDC_LxCKCR_CKRED_Pos) /*!< 0x00FF0000 */
#define LTDC_LxCKCR_CKRED       LTDC_LxCKCR_CKRED_Msk             /*!< Color Key Red value   */

/********************  Bit definition for LTDC_LxPFCR register  ***************/

