Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define LTDC_LxPFCR_PF_Pos (0U)
#define LTDC_LxPFCR_PF_Msk (0x7UL << LTDC_LxPFCR_PF_Pos) /*!< 0x00000007 */
#define LTDC_LxPFCR_PF     LTDC_LxPFCR_PF_Msk            /*!< Pixel Format */

/********************  Bit definition for LTDC_LxCACR register  ***************/

#define LTDC_LxCACR_CONSTA_Pos (0U)
#define LTDC_LxCACR_CONSTA_Msk (0xFFUL << LTDC_LxCACR_CONSTA_Pos) /*!< 0x000000FF */
#define LTDC_LxCACR_CONSTA     LTDC_LxCACR_CONSTA_Msk             /*!< Constant Alpha */

/********************  Bit definition for LTDC_LxDCCR register  ***************/

#define LTDC_LxDCCR_DCBLUE_Pos  (0U)
#define LTDC_LxDCCR_DCBLUE_Msk  (0xFFUL << LTDC_LxDCCR_DCBLUE_Pos) /*!< 0x000000FF */
#define LTDC_LxDCCR_DCBLUE      LTDC_LxDCCR_DCBLUE_Msk             /*!< Default Color Blue  */
#define LTDC_LxDCCR_DCGREEN_Pos (8U)
#define LTDC_LxDCCR_DCGREEN_Msk (0xFFUL << LTDC_LxDCCR_DCGREEN_Pos) /*!< 0x0000FF00 */
#define LTDC_LxDCCR_DCGREEN     LTDC_LxDCCR_DCGREEN_Msk             /*!< Default Color Green */
#define LTDC_LxDCCR_DCRED_Pos   (16U)
#define LTDC_LxDCCR_DCRED_Msk   (0xFFUL << LTDC_LxDCCR_DCRED_Pos) /*!< 0x00FF0000 */
#define LTDC_LxDCCR_DCRED       LTDC_LxDCCR_DCRED_Msk             /*!< Default Color Red   */
#define LTDC_LxDCCR_DCALPHA_Pos (24U)
#define LTDC_LxDCCR_DCALPHA_Msk (0xFFUL << LTDC_LxDCCR_DCALPHA_Pos) /*!< 0xFF000000 */
#define LTDC_LxDCCR_DCALPHA     LTDC_LxDCCR_DCALPHA_Msk             /*!< Default Color Alpha */

/********************  Bit definition for LTDC_LxBFCR register  ***************/

#define LTDC_LxBFCR_BF2_Pos (0U)
#define LTDC_LxBFCR_BF2_Msk (0x7UL << LTDC_LxBFCR_BF2_Pos) /*!< 0x00000007 */
#define LTDC_LxBFCR_BF2     LTDC_LxBFCR_BF2_Msk            /*!< Blending Factor 2 */
#define LTDC_LxBFCR_BF1_Pos (8U)
#define LTDC_LxBFCR_BF1_Msk (0x7UL << LTDC_LxBFCR_BF1_Pos) /*!< 0x00000700 */
#define LTDC_LxBFCR_BF1     LTDC_LxBFCR_BF1_Msk            /*!< Blending Factor 1 */

/********************  Bit definition for LTDC_LxCFBAR register  **************/

#define LTDC_LxCFBAR_CFBADD_Pos (0U)
#define LTDC_LxCFBAR_CFBADD_Msk (0xFFFFFFFFUL << LTDC_LxCFBAR_CFBADD_Pos) /*!< 0xFFFFFFFF */
#define LTDC_LxCFBAR_CFBADD     LTDC_LxCFBAR_CFBADD_Msk                   /*!< Color Frame Buffer Start Address */

/********************  Bit definition for LTDC_LxCFBLR register  **************/

#define LTDC_LxCFBLR_CFBLL_Pos (0U)
#define LTDC_LxCFBLR_CFBLL_Msk (0x1FFFUL << LTDC_LxCFBLR_CFBLL_Pos) /*!< 0x00001FFF */
#define LTDC_LxCFBLR_CFBLL     LTDC_LxCFBLR_CFBLL_Msk               /*!< Color Frame Buffer Line Length    */
#define LTDC_LxCFBLR_CFBP_Pos  (16U)
#define LTDC_LxCFBLR_CFBP_Msk  (0x1FFFUL << LTDC_LxCFBLR_CFBP_Pos) /*!< 0x1FFF0000 */
#define LTDC_LxCFBLR_CFBP      LTDC_LxCFBLR_CFBP_Msk               /*!< Color Frame Buffer Pitch in bytes */

/********************  Bit definition for LTDC_LxCFBLNR register  *************/

#define LTDC_LxCFBLNR_CFBLNBR_Pos (0U)
#define LTDC_LxCFBLNR_CFBLNBR_Msk (0x7FFUL << LTDC_LxCFBLNR_CFBLNBR_Pos) /*!< 0x000007FF */
#define LTDC_LxCFBLNR_CFBLNBR     LTDC_LxCFBLNR_CFBLNBR_Msk              /*!< Frame Buffer Line Number */

/********************  Bit definition for LTDC_LxCLUTWR register  *************/

#define LTDC_LxCLUTWR_BLUE_Pos    (0U)
#define LTDC_LxCLUTWR_BLUE_Msk    (0xFFUL << LTDC_LxCLUTWR_BLUE_Pos) /*!< 0x000000FF */
#define LTDC_LxCLUTWR_BLUE        LTDC_LxCLUTWR_BLUE_Msk             /*!< Blue value   */
#define LTDC_LxCLUTWR_GREEN_Pos   (8U)
#define LTDC_LxCLUTWR_GREEN_Msk   (0xFFUL << LTDC_LxCLUTWR_GREEN_Pos) /*!< 0x0000FF00 */
#define LTDC_LxCLUTWR_GREEN       LTDC_LxCLUTWR_GREEN_Msk             /*!< Green value  */
#define LTDC_LxCLUTWR_RED_Pos     (16U)
#define LTDC_LxCLUTWR_RED_Msk     (0xFFUL << LTDC_LxCLUTWR_RED_Pos) /*!< 0x00FF0000 */
#define LTDC_LxCLUTWR_RED         LTDC_LxCLUTWR_RED_Msk             /*!< Red value    */
#define LTDC_LxCLUTWR_CLUTADD_Pos (24U)
#define LTDC_LxCLUTWR_CLUTADD_Msk (0xFFUL << LTDC_LxCLUTWR_CLUTADD_Pos) /*!< 0xFF000000 */
#define LTDC_LxCLUTWR_CLUTADD     LTDC_LxCLUTWR_CLUTADD_Msk             /*!< CLUT address */

/******************************************************************************/
/*                                                                            */
/*                                     MDMA                                   */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for MDMA_GISR0 register  ****************/
#define MDMA_GISR0_GIF0_Pos  (0U)
#define MDMA_GISR0_GIF0_Msk  (0x1UL << MDMA_GISR0_GIF0_Pos) /*!< 0x00000001 */
#define MDMA_GISR0_GIF0      MDMA_GISR0_GIF0_Msk            /*!< Channel 0 global interrupt flag */
#define MDMA_GISR0_GIF1_Pos  (1U)
#define MDMA_GISR0_GIF1_Msk  (0x1UL << MDMA_GISR0_GIF1_Pos) /*!< 0x00000002 */
#define MDMA_GISR0_GIF1      MDMA_GISR0_GIF1_Msk            /*!< Channel 1 global interrupt flag */
#define MDMA_GISR0_GIF2_Pos  (2U)
#define MDMA_GISR0_GIF2_Msk  (0x1UL << MDMA_GISR0_GIF2_Pos) /*!< 0x00000004 */
#define MDMA_GISR0_GIF2      MDMA_GISR0_GIF2_Msk            /*!< Channel 2 global interrupt flag */
#define MDMA_GISR0_GIF3_Pos  (3U)
#define MDMA_GISR0_GIF3_Msk  (0x1UL << MDMA_GISR0_GIF3_Pos) /*!< 0x00000008 */
#define MDMA_GISR0_GIF3      MDMA_GISR0_GIF3_Msk            /*!< Channel 3 global interrupt flag */
#define MDMA_GISR0_GIF4_Pos  (4U)
#define MDMA_GISR0_GIF4_Msk  (0x1UL << MDMA_GISR0_GIF4_Pos) /*!< 0x00000010 */
#define MDMA_GISR0_GIF4      MDMA_GISR0_GIF4_Msk            /*!< Channel 4 global interrupt flag */
#define MDMA_GISR0_GIF5_Pos  (5U)
#define MDMA_GISR0_GIF5_Msk  (0x1UL << MDMA_GISR0_GIF5_Pos) /*!< 0x00000020 */
#define MDMA_GISR0_GIF5      MDMA_GISR0_GIF5_Msk            /*!< Channel 5 global interrupt flag */
#define MDMA_GISR0_GIF6_Pos  (6U)
#define MDMA_GISR0_GIF6_Msk  (0x1UL << MDMA_GISR0_GIF6_Pos) /*!< 0x00000040 */
#define MDMA_GISR0_GIF6      MDMA_GISR0_GIF6_Msk            /*!< Channel 6 global interrupt flag */
#define MDMA_GISR0_GIF7_Pos  (7U)
#define MDMA_GISR0_GIF7_Msk  (0x1UL << MDMA_GISR0_GIF7_Pos) /*!< 0x00000080 */
#define MDMA_GISR0_GIF7      MDMA_GISR0_GIF7_Msk            /*!< Channel 7 global interrupt flag */
#define MDMA_GISR0_GIF8_Pos  (8U)
#define MDMA_GISR0_GIF8_Msk  (0x1UL << MDMA_GISR0_GIF8_Pos) /*!< 0x00000100 */
#define MDMA_GISR0_GIF8      MDMA_GISR0_GIF8_Msk            /*!< Channel 8 global interrupt flag */
#define MDMA_GISR0_GIF9_Pos  (9U)
#define MDMA_GISR0_GIF9_Msk  (0x1UL << MDMA_GISR0_GIF9_Pos) /*!< 0x00000200 */
#define MDMA_GISR0_GIF9      MDMA_GISR0_GIF9_Msk            /*!< Channel 9 global interrupt flag */
#define MDMA_GISR0_GIF10_Pos (10U)
#define MDMA_GISR0_GIF10_Msk (0x1UL << MDMA_GISR0_GIF10_Pos) /*!< 0x00000400 */
#define MDMA_GISR0_GIF10     MDMA_GISR0_GIF10_Msk            /*!< Channel 10 global interrupt flag */
#define MDMA_GISR0_GIF11_Pos (11U)
#define MDMA_GISR0_GIF11_Msk (0x1UL << MDMA_GISR0_GIF11_Pos) /*!< 0x00000800 */
#define MDMA_GISR0_GIF11     MDMA_GISR0_GIF11_Msk            /*!< Channel 11 global interrupt flag */
#define MDMA_GISR0_GIF12_Pos (12U)
#define MDMA_GISR0_GIF12_Msk (0x1UL << MDMA_GISR0_GIF12_Pos) /*!< 0x00001000 */
#define MDMA_GISR0_GIF12     MDMA_GISR0_GIF12_Msk            /*!< Channel 12 global interrupt flag */
#define MDMA_GISR0_GIF13_Pos (13U)
#define MDMA_GISR0_GIF13_Msk (0x1UL << MDMA_GISR0_GIF13_Pos) /*!< 0x00002000 */
#define MDMA_GISR0_GIF13     MDMA_GISR0_GIF13_Msk            /*!< Channel 13 global interrupt flag */
#define MDMA_GISR0_GIF14_Pos (14U)
#define MDMA_GISR0_GIF14_Msk (0x1UL << MDMA_GISR0_GIF14_Pos) /*!< 0x00004000 */
#define MDMA_GISR0_GIF14     MDMA_GISR0_GIF14_Msk            /*!< Channel 14 global interrupt flag */
#define MDMA_GISR0_GIF15_Pos (15U)
#define MDMA_GISR0_GIF15_Msk (0x1UL << MDMA_GISR0_GIF15_Pos) /*!< 0x00008000 */
#define MDMA_GISR0_GIF15     MDMA_GISR0_GIF15_Msk            /*!< Channel 15 global interrupt flag */

/********************  Bit definition for MDMA_CxISR register  ****************/
#define MDMA_CISR_TEIF_Pos  (0U)
#define MDMA_CISR_TEIF_Msk  (0x1UL << MDMA_CISR_TEIF_Pos) /*!< 0x00000001 */
#define MDMA_CISR_TEIF      MDMA_CISR_TEIF_Msk            /*!< Channel x transfer error interrupt flag */
#define MDMA_CISR_CTCIF_Pos (1U)
#define MDMA_CISR_CTCIF_Msk (0x1UL << MDMA_CISR_CTCIF_Pos) /*!< 0x00000002 */
#define MDMA_CISR_CTCIF     MDMA_CISR_CTCIF_Msk            /*!< Channel x Channel Transfer Complete interrupt flag */
#define MDMA_CISR_BRTIF_Pos (2U)
#define MDMA_CISR_BRTIF_Msk (0x1UL << MDMA_CISR_BRTIF_Pos) /*!< 0x00000004 */
#define MDMA_CISR_BRTIF     MDMA_CISR_BRTIF_Msk /*!< Channel x block repeat transfer complete interrupt flag */
#define MDMA_CISR_BTIF_Pos  (3U)
#define MDMA_CISR_BTIF_Msk  (0x1UL << MDMA_CISR_BTIF_Pos) /*!< 0x00000008 */
#define MDMA_CISR_BTIF      MDMA_CISR_BTIF_Msk            /*!< Channel x block transfer complete interrupt flag */
#define MDMA_CISR_TCIF_Pos  (4U)
#define MDMA_CISR_TCIF_Msk  (0x1UL << MDMA_CISR_TCIF_Pos) /*!< 0x00000010 */
#define MDMA_CISR_TCIF      MDMA_CISR_TCIF_Msk            /*!< Channel x buffer transfer complete interrupt flag */
#define MDMA_CISR_CRQA_Pos  (16U)
#define MDMA_CISR_CRQA_Msk  (0x1UL << MDMA_CISR_CRQA_Pos) /*!< 0x00010000 */
#define MDMA_CISR_CRQA      MDMA_CISR_CRQA_Msk            /*!< Channel x request Active flag */

/********************  Bit definition for MDMA_CxIFCR register  ****************/
#define MDMA_CIFCR_CTEIF_Pos  (0U)
#define MDMA_CIFCR_CTEIF_Msk  (0x1UL << MDMA_CIFCR_CTEIF_Pos) /*!< 0x00000001 */
#define MDMA_CIFCR_CTEIF      MDMA_CIFCR_CTEIF_Msk            /*!< Channel x clear transfer error interrupt flag */
#define MDMA_CIFCR_CCTCIF_Pos (1U)
#define MDMA_CIFCR_CCTCIF_Msk (0x1UL << MDMA_CIFCR_CCTCIF_Pos) /*!< 0x00000002 */
#define MDMA_CIFCR_CCTCIF     MDMA_CIFCR_CCTCIF_Msk /*!< Clear Channel transfer complete interrupt flag for channel x */
#define MDMA_CIFCR_CBRTIF_Pos (2U)
#define MDMA_CIFCR_CBRTIF_Msk (0x1UL << MDMA_CIFCR_CBRTIF_Pos) /*!< 0x00000004 */
#define MDMA_CIFCR_CBRTIF     MDMA_CIFCR_CBRTIF_Msk /*!< Channel x clear block repeat transfer complete interrupt flag */
#define MDMA_CIFCR_CBTIF_Pos  (3U)
#define MDMA_CIFCR_CBTIF_Msk  (0x1UL << MDMA_CIFCR_CBTIF_Pos) /*!< 0x00000008 */
#define MDMA_CIFCR_CBTIF      MDMA_CIFCR_CBTIF_Msk /*!< Channel x Clear block transfer complete interrupt flag */
#define MDMA_CIFCR_CLTCIF_Pos (4U)
#define MDMA_CIFCR_CLTCIF_Msk (0x1UL << MDMA_CIFCR_CLTCIF_Pos) /*!< 0x00000010 */
#define MDMA_CIFCR_CLTCIF     MDMA_CIFCR_CLTCIF_Msk /*!< CLear Transfer buffer Complete Interrupt Flag for channel */

/********************  Bit definition for MDMA_CxESR register  ****************/
#define MDMA_CESR_TEA_Pos  (0U)
#define MDMA_CESR_TEA_Msk  (0x7FUL << MDMA_CESR_TEA_Pos) /*!< 0x0000007F */
#define MDMA_CESR_TEA      MDMA_CESR_TEA_Msk             /*!< Transfer Error Address */
#define MDMA_CESR_TED_Pos  (7U)
#define MDMA_CESR_TED_Msk  (0x1UL << MDMA_CESR_TED_Pos) /*!< 0x00000080 */
#define MDMA_CESR_TED      MDMA_CESR_TED_Msk            /*!< Transfer Error Direction */
#define MDMA_CESR_TELD_Pos (8U)
#define MDMA_CESR_TELD_Msk (0x1UL << MDMA_CESR_TELD_Pos) /*!< 0x00000100 */
#define MDMA_CESR_TELD     MDMA_CESR_TELD_Msk            /*!< Transfer Error Link Data */
#define MDMA_CESR_TEMD_Pos (9U)
#define MDMA_CESR_TEMD_Msk (0x1UL << MDMA_CESR_TEMD_Pos) /*!< 0x00000200 */
#define MDMA_CESR_TEMD     MDMA_CESR_TEMD_Msk            /*!< Transfer Error Mask Data */
#define MDMA_CESR_ASE_Pos  (10U)
#define MDMA_CESR_ASE_Msk  (0x1UL << MDMA_CESR_ASE_Pos) /*!< 0x00000400 */
#define MDMA_CESR_ASE      MDMA_CESR_ASE_Msk            /*!< Address/Size Error       */
#define MDMA_CESR_BSE_Pos  (11U)
#define MDMA_CESR_BSE_Msk  (0x1UL << MDMA_CESR_BSE_Pos) /*!< 0x00000800 */
#define MDMA_CESR_BSE      MDMA_CESR_BSE_Msk            /*!< Block Size Error         */

