Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bit definition for MDMA_CxCR register  ****************/
#define MDMA_CCR_EN_Pos    (0U)
#define MDMA_CCR_EN_Msk    (0x1UL << MDMA_CCR_EN_Pos) /*!< 0x00000001 */
#define MDMA_CCR_EN        MDMA_CCR_EN_Msk            /*!< Channel enable / flag channel ready when read low */
#define MDMA_CCR_TEIE_Pos  (1U)
#define MDMA_CCR_TEIE_Msk  (0x1UL << MDMA_CCR_TEIE_Pos) /*!< 0x00000002 */
#define MDMA_CCR_TEIE      MDMA_CCR_TEIE_Msk            /*!< Transfer error interrupt enable */
#define MDMA_CCR_CTCIE_Pos (2U)
#define MDMA_CCR_CTCIE_Msk (0x1UL << MDMA_CCR_CTCIE_Pos) /*!< 0x00000004 */
#define MDMA_CCR_CTCIE     MDMA_CCR_CTCIE_Msk            /*!< Channel Transfer Complete interrupt enable */
#define MDMA_CCR_BRTIE_Pos (3U)
#define MDMA_CCR_BRTIE_Msk (0x1UL << MDMA_CCR_BRTIE_Pos) /*!< 0x00000008 */
#define MDMA_CCR_BRTIE     MDMA_CCR_BRTIE_Msk            /*!< Block Repeat transfer interrupt enable */
#define MDMA_CCR_BTIE_Pos  (4U)
#define MDMA_CCR_BTIE_Msk  (0x1UL << MDMA_CCR_BTIE_Pos) /*!< 0x00000010 */
#define MDMA_CCR_BTIE      MDMA_CCR_BTIE_Msk            /*!< Block Transfer interrupt enable */
#define MDMA_CCR_TCIE_Pos  (5U)
#define MDMA_CCR_TCIE_Msk  (0x1UL << MDMA_CCR_TCIE_Pos) /*!< 0x00000020 */
#define MDMA_CCR_TCIE      MDMA_CCR_TCIE_Msk            /*!< buffer Transfer Complete interrupt enable */
#define MDMA_CCR_PL_Pos    (6U)
#define MDMA_CCR_PL_Msk    (0x3UL << MDMA_CCR_PL_Pos) /*!< 0x000000C0 */
#define MDMA_CCR_PL        MDMA_CCR_PL_Msk            /*!< Priority level */
#define MDMA_CCR_PL_0      (0x1UL << MDMA_CCR_PL_Pos) /*!< 0x00000040 */
#define MDMA_CCR_PL_1      (0x2UL << MDMA_CCR_PL_Pos) /*!< 0x00000080 */
#define MDMA_CCR_BEX_Pos   (12U)
#define MDMA_CCR_BEX_Msk   (0x1UL << MDMA_CCR_BEX_Pos) /*!< 0x00001000 */
#define MDMA_CCR_BEX       MDMA_CCR_BEX_Msk            /*!< Byte Endianness eXchange */
#define MDMA_CCR_HEX_Pos   (13U)
#define MDMA_CCR_HEX_Msk   (0x1UL << MDMA_CCR_HEX_Pos) /*!< 0x00002000 */
#define MDMA_CCR_HEX       MDMA_CCR_HEX_Msk            /*!< Half word Endianness eXchange */
#define MDMA_CCR_WEX_Pos   (14U)
#define MDMA_CCR_WEX_Msk   (0x1UL << MDMA_CCR_WEX_Pos) /*!< 0x00004000 */
#define MDMA_CCR_WEX       MDMA_CCR_WEX_Msk            /*!< Word Endianness eXchange */
#define MDMA_CCR_SWRQ_Pos  (16U)
#define MDMA_CCR_SWRQ_Msk  (0x1UL << MDMA_CCR_SWRQ_Pos) /*!< 0x00010000 */
#define MDMA_CCR_SWRQ      MDMA_CCR_SWRQ_Msk            /*!< SW ReQuest */

/********************  Bit definition for MDMA_CxTCR register  ****************/
#define MDMA_CTCR_SINC_Pos   (0U)
#define MDMA_CTCR_SINC_Msk   (0x3UL << MDMA_CTCR_SINC_Pos) /*!< 0x00000003 */
#define MDMA_CTCR_SINC       MDMA_CTCR_SINC_Msk            /*!< Source increment mode */
#define MDMA_CTCR_SINC_0     (0x1UL << MDMA_CTCR_SINC_Pos) /*!< 0x00000001 */
#define MDMA_CTCR_SINC_1     (0x2UL << MDMA_CTCR_SINC_Pos) /*!< 0x00000002 */
#define MDMA_CTCR_DINC_Pos   (2U)
#define MDMA_CTCR_DINC_Msk   (0x3UL << MDMA_CTCR_DINC_Pos) /*!< 0x0000000C */
#define MDMA_CTCR_DINC       MDMA_CTCR_DINC_Msk            /*!< Source increment mode */
#define MDMA_CTCR_DINC_0     (0x1UL << MDMA_CTCR_DINC_Pos) /*!< 0x00000004 */
#define MDMA_CTCR_DINC_1     (0x2UL << MDMA_CTCR_DINC_Pos) /*!< 0x00000008 */
#define MDMA_CTCR_SSIZE_Pos  (4U)
#define MDMA_CTCR_SSIZE_Msk  (0x3UL << MDMA_CTCR_SSIZE_Pos) /*!< 0x00000030 */
#define MDMA_CTCR_SSIZE      MDMA_CTCR_SSIZE_Msk            /*!< Source data size */
#define MDMA_CTCR_SSIZE_0    (0x1UL << MDMA_CTCR_SSIZE_Pos) /*!< 0x00000010 */
#define MDMA_CTCR_SSIZE_1    (0x2UL << MDMA_CTCR_SSIZE_Pos) /*!< 0x00000020 */
#define MDMA_CTCR_DSIZE_Pos  (6U)
#define MDMA_CTCR_DSIZE_Msk  (0x3UL << MDMA_CTCR_DSIZE_Pos) /*!< 0x000000C0 */
#define MDMA_CTCR_DSIZE      MDMA_CTCR_DSIZE_Msk            /*!< Destination data size */
#define MDMA_CTCR_DSIZE_0    (0x1UL << MDMA_CTCR_DSIZE_Pos) /*!< 0x00000040 */
#define MDMA_CTCR_DSIZE_1    (0x2UL << MDMA_CTCR_DSIZE_Pos) /*!< 0x00000080 */
#define MDMA_CTCR_SINCOS_Pos (8U)
#define MDMA_CTCR_SINCOS_Msk (0x3UL << MDMA_CTCR_SINCOS_Pos) /*!< 0x00000300 */
#define MDMA_CTCR_SINCOS     MDMA_CTCR_SINCOS_Msk            /*!< Source increment offset size */
#define MDMA_CTCR_SINCOS_0   (0x1UL << MDMA_CTCR_SINCOS_Pos) /*!< 0x00000100 */
#define MDMA_CTCR_SINCOS_1   (0x2UL << MDMA_CTCR_SINCOS_Pos) /*!< 0x00000200 */
#define MDMA_CTCR_DINCOS_Pos (10U)
#define MDMA_CTCR_DINCOS_Msk (0x3UL << MDMA_CTCR_DINCOS_Pos) /*!< 0x00000C00 */
#define MDMA_CTCR_DINCOS     MDMA_CTCR_DINCOS_Msk            /*!< Destination increment offset size */
#define MDMA_CTCR_DINCOS_0   (0x1UL << MDMA_CTCR_DINCOS_Pos) /*!< 0x00000400 */
#define MDMA_CTCR_DINCOS_1   (0x2UL << MDMA_CTCR_DINCOS_Pos) /*!< 0x00000800 */
#define MDMA_CTCR_SBURST_Pos (12U)
#define MDMA_CTCR_SBURST_Msk (0x7UL << MDMA_CTCR_SBURST_Pos) /*!< 0x00007000 */
#define MDMA_CTCR_SBURST     MDMA_CTCR_SBURST_Msk            /*!< Source burst transfer configuration */
#define MDMA_CTCR_SBURST_0   (0x1UL << MDMA_CTCR_SBURST_Pos) /*!< 0x00001000 */
#define MDMA_CTCR_SBURST_1   (0x2UL << MDMA_CTCR_SBURST_Pos) /*!< 0x00002000 */
#define MDMA_CTCR_SBURST_2   (0x4UL << MDMA_CTCR_SBURST_Pos) /*!< 0x00004000 */
#define MDMA_CTCR_DBURST_Pos (15U)
#define MDMA_CTCR_DBURST_Msk (0x7UL << MDMA_CTCR_DBURST_Pos) /*!< 0x00038000 */
#define MDMA_CTCR_DBURST     MDMA_CTCR_DBURST_Msk            /*!< Destination burst transfer configuration */
#define MDMA_CTCR_DBURST_0   (0x1UL << MDMA_CTCR_DBURST_Pos) /*!< 0x00008000 */
#define MDMA_CTCR_DBURST_1   (0x2UL << MDMA_CTCR_DBURST_Pos) /*!< 0x00010000 */
#define MDMA_CTCR_DBURST_2   (0x4UL << MDMA_CTCR_DBURST_Pos) /*!< 0x00020000 */
#define MDMA_CTCR_TLEN_Pos   (18U)
#define MDMA_CTCR_TLEN_Msk   (0x7FUL << MDMA_CTCR_TLEN_Pos) /*!< 0x01FC0000 */
#define MDMA_CTCR_TLEN       MDMA_CTCR_TLEN_Msk             /*!< buffer Transfer Length (number of bytes - 1) */
#define MDMA_CTCR_PKE_Pos    (25U)
#define MDMA_CTCR_PKE_Msk    (0x1UL << MDMA_CTCR_PKE_Pos) /*!< 0x02000000 */
#define MDMA_CTCR_PKE        MDMA_CTCR_PKE_Msk            /*!< PacK Enable */
#define MDMA_CTCR_PAM_Pos    (26U)
#define MDMA_CTCR_PAM_Msk    (0x3UL << MDMA_CTCR_PAM_Pos) /*!< 0x0C000000 */
#define MDMA_CTCR_PAM        MDMA_CTCR_PAM_Msk            /*!< Padding/Alignment Mode */
#define MDMA_CTCR_PAM_0      (0x1UL << MDMA_CTCR_PAM_Pos) /*!< 0x4000000 */
#define MDMA_CTCR_PAM_1      (0x2UL << MDMA_CTCR_PAM_Pos) /*!< 0x8000000 */
#define MDMA_CTCR_TRGM_Pos   (28U)
#define MDMA_CTCR_TRGM_Msk   (0x3UL << MDMA_CTCR_TRGM_Pos) /*!< 0x30000000 */
#define MDMA_CTCR_TRGM       MDMA_CTCR_TRGM_Msk            /*!< Trigger Mode */
#define MDMA_CTCR_TRGM_0     (0x1UL << MDMA_CTCR_TRGM_Pos) /*!< 0x10000000 */
#define MDMA_CTCR_TRGM_1     (0x2UL << MDMA_CTCR_TRGM_Pos) /*!< 0x20000000 */
#define MDMA_CTCR_SWRM_Pos   (30U)
#define MDMA_CTCR_SWRM_Msk   (0x1UL << MDMA_CTCR_SWRM_Pos) /*!< 0x40000000 */
#define MDMA_CTCR_SWRM       MDMA_CTCR_SWRM_Msk            /*!< SW Request Mode */
#define MDMA_CTCR_BWM_Pos    (31U)
#define MDMA_CTCR_BWM_Msk    (0x1UL << MDMA_CTCR_BWM_Pos) /*!< 0x80000000 */
#define MDMA_CTCR_BWM        MDMA_CTCR_BWM_Msk            /*!< Bufferable Write Mode */

