Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bit definition for MDMA_CxBNDTR register  ****************/
#define MDMA_CBNDTR_BNDT_Pos  (0U)
#define MDMA_CBNDTR_BNDT_Msk  (0x1FFFFUL << MDMA_CBNDTR_BNDT_Pos) /*!< 0x0001FFFF */
#define MDMA_CBNDTR_BNDT      MDMA_CBNDTR_BNDT_Msk                /*!< Block Number of data bytes to transfer */
#define MDMA_CBNDTR_BRSUM_Pos (18U)
#define MDMA_CBNDTR_BRSUM_Msk (0x1UL << MDMA_CBNDTR_BRSUM_Pos) /*!< 0x00040000 */
#define MDMA_CBNDTR_BRSUM     MDMA_CBNDTR_BRSUM_Msk            /*!< Block Repeat Source address Update Mode */
#define MDMA_CBNDTR_BRDUM_Pos (19U)
#define MDMA_CBNDTR_BRDUM_Msk (0x1UL << MDMA_CBNDTR_BRDUM_Pos) /*!< 0x00080000 */
#define MDMA_CBNDTR_BRDUM     MDMA_CBNDTR_BRDUM_Msk            /*!< Block Repeat Destination address Update Mode */
#define MDMA_CBNDTR_BRC_Pos   (20U)
#define MDMA_CBNDTR_BRC_Msk   (0xFFFUL << MDMA_CBNDTR_BRC_Pos) /*!< 0xFFF00000 */
#define MDMA_CBNDTR_BRC       MDMA_CBNDTR_BRC_Msk              /*!< Block Repeat Count */

/********************  Bit definition for MDMA_CxSAR register  ****************/
#define MDMA_CSAR_SAR_Pos (0U)
#define MDMA_CSAR_SAR_Msk (0xFFFFFFFFUL << MDMA_CSAR_SAR_Pos) /*!< 0xFFFFFFFF */
#define MDMA_CSAR_SAR     MDMA_CSAR_SAR_Msk                   /*!< Source address */

/********************  Bit definition for MDMA_CxDAR register  ****************/
#define MDMA_CDAR_DAR_Pos (0U)
#define MDMA_CDAR_DAR_Msk (0xFFFFFFFFUL << MDMA_CDAR_DAR_Pos) /*!< 0xFFFFFFFF */
#define MDMA_CDAR_DAR     MDMA_CDAR_DAR_Msk                   /*!< Destination address */

/********************  Bit definition for MDMA_CxBRUR  ************************/
#define MDMA_CBRUR_SUV_Pos (0U)
#define MDMA_CBRUR_SUV_Msk (0xFFFFUL << MDMA_CBRUR_SUV_Pos) /*!< 0x0000FFFF */
#define MDMA_CBRUR_SUV     MDMA_CBRUR_SUV_Msk               /*!< Source address Update Value */
#define MDMA_CBRUR_DUV_Pos (16U)
#define MDMA_CBRUR_DUV_Msk (0xFFFFUL << MDMA_CBRUR_DUV_Pos) /*!< 0xFFFF0000 */
#define MDMA_CBRUR_DUV     MDMA_CBRUR_DUV_Msk               /*!< Destination address Update Value */

/********************  Bit definition for MDMA_CxLAR  *************************/
#define MDMA_CLAR_LAR_Pos (0U)
#define MDMA_CLAR_LAR_Msk (0xFFFFFFFFUL << MDMA_CLAR_LAR_Pos) /*!< 0xFFFFFFFF */
#define MDMA_CLAR_LAR     MDMA_CLAR_LAR_Msk                   /*!< Link Address Register */

/********************  Bit definition for MDMA_CxTBR)  ************************/
#define MDMA_CTBR_TSEL_Pos (0U)
#define MDMA_CTBR_TSEL_Msk (0xFFUL << MDMA_CTBR_TSEL_Pos) /*!< 0x000000FF */
#define MDMA_CTBR_TSEL     MDMA_CTBR_TSEL_Msk             /*!< Trigger SELection */
#define MDMA_CTBR_SBUS_Pos (16U)
#define MDMA_CTBR_SBUS_Msk (0x1UL << MDMA_CTBR_SBUS_Pos) /*!< 0x00010000 */
#define MDMA_CTBR_SBUS     MDMA_CTBR_SBUS_Msk            /*!< Source BUS select */
#define MDMA_CTBR_DBUS_Pos (17U)
#define MDMA_CTBR_DBUS_Msk (0x1UL << MDMA_CTBR_DBUS_Pos) /*!< 0x00020000 */
#define MDMA_CTBR_DBUS     MDMA_CTBR_DBUS_Msk            /*!< Destination BUS select */

/********************  Bit definition for MDMA_CxMAR)  ************************/
#define MDMA_CMAR_MAR_Pos (0U)
#define MDMA_CMAR_MAR_Msk (0xFFFFFFFFUL << MDMA_CMAR_MAR_Pos) /*!< 0xFFFFFFFF */
#define MDMA_CMAR_MAR     MDMA_CMAR_MAR_Msk                   /*!< Mask address */

/********************  Bit definition for MDMA_CxMDR)  ************************/
#define MDMA_CMDR_MDR_Pos (0U)
#define MDMA_CMDR_MDR_Msk (0xFFFFFFFFUL << MDMA_CMDR_MDR_Pos) /*!< 0xFFFFFFFF */
#define MDMA_CMDR_MDR     MDMA_CMDR_MDR_Msk                   /*!< Mask Data */

/******************************************************************************/
/*                                                                            */
/*                         Operational Amplifier (OPAMP)                      */
/*                                                                            */
/******************************************************************************/
/*********************  Bit definition for OPAMPx_CSR register  ***************/
#define OPAMP_CSR_OPAMPxEN_Pos (0U)
#define OPAMP_CSR_OPAMPxEN_Msk (0x1UL << OPAMP_CSR_OPAMPxEN_Pos) /*!< 0x00000001 */
#define OPAMP_CSR_OPAMPxEN     OPAMP_CSR_OPAMPxEN_Msk            /*!< OPAMP enable */
#define OPAMP_CSR_FORCEVP_Pos  (1U)
#define OPAMP_CSR_FORCEVP_Msk  (0x1UL << OPAMP_CSR_FORCEVP_Pos) /*!< 0x00000002 */
#define OPAMP_CSR_FORCEVP      OPAMP_CSR_FORCEVP_Msk            /*!< Force internal reference on VP */

#define OPAMP_CSR_VPSEL_Pos    (2U)
#define OPAMP_CSR_VPSEL_Msk    (0x3UL << OPAMP_CSR_VPSEL_Pos) /*!< 0x0000000C */
#define OPAMP_CSR_VPSEL        OPAMP_CSR_VPSEL_Msk            /*!< Non inverted input selection */
#define OPAMP_CSR_VPSEL_0      (0x1UL << OPAMP_CSR_VPSEL_Pos) /*!< 0x00000004 */
#define OPAMP_CSR_VPSEL_1      (0x2UL << OPAMP_CSR_VPSEL_Pos) /*!< 0x00000008 */

#define OPAMP_CSR_VMSEL_Pos    (5U)
#define OPAMP_CSR_VMSEL_Msk    (0x3UL << OPAMP_CSR_VMSEL_Pos) /*!< 0x00000060 */
#define OPAMP_CSR_VMSEL        OPAMP_CSR_VMSEL_Msk            /*!< Inverting input selection */
#define OPAMP_CSR_VMSEL_0      (0x1UL << OPAMP_CSR_VMSEL_Pos) /*!< 0x00000020 */
#define OPAMP_CSR_VMSEL_1      (0x2UL << OPAMP_CSR_VMSEL_Pos) /*!< 0x00000040 */

#define OPAMP_CSR_OPAHSM_Pos   (8U)
#define OPAMP_CSR_OPAHSM_Msk   (0x1UL << OPAMP_CSR_OPAHSM_Pos) /*!< 0x00000100 */
#define OPAMP_CSR_OPAHSM       OPAMP_CSR_OPAHSM_Msk            /*!< Operational amplifier high speed mode */
#define OPAMP_CSR_CALON_Pos    (11U)
#define OPAMP_CSR_CALON_Msk    (0x1UL << OPAMP_CSR_CALON_Pos) /*!< 0x00000800 */
#define OPAMP_CSR_CALON        OPAMP_CSR_CALON_Msk            /*!< Calibration mode enable */

#define OPAMP_CSR_CALSEL_Pos   (12U)
#define OPAMP_CSR_CALSEL_Msk   (0x3UL << OPAMP_CSR_CALSEL_Pos) /*!< 0x00003000 */
#define OPAMP_CSR_CALSEL       OPAMP_CSR_CALSEL_Msk            /*!< Calibration selection */
#define OPAMP_CSR_CALSEL_0     (0x1UL << OPAMP_CSR_CALSEL_Pos) /*!< 0x00001000 */
#define OPAMP_CSR_CALSEL_1     (0x2UL << OPAMP_CSR_CALSEL_Pos) /*!< 0x00002000 */

