Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define OPAMP_CSR_PGGAIN_Pos   (14U)
#define OPAMP_CSR_PGGAIN_Msk   (0xFUL << OPAMP_CSR_PGGAIN_Pos) /*!< 0x0003C000 */
#define OPAMP_CSR_PGGAIN       OPAMP_CSR_PGGAIN_Msk /*!< Operational amplifier Programmable amplifier gain value */
#define OPAMP_CSR_PGGAIN_0     (0x1UL << OPAMP_CSR_PGGAIN_Pos) /*!< 0x00004000 */
#define OPAMP_CSR_PGGAIN_1     (0x2UL << OPAMP_CSR_PGGAIN_Pos) /*!< 0x00008000 */
#define OPAMP_CSR_PGGAIN_2     (0x4UL << OPAMP_CSR_PGGAIN_Pos) /*!< 0x00010000 */
#define OPAMP_CSR_PGGAIN_3     (0x8UL << OPAMP_CSR_PGGAIN_Pos) /*!< 0x00020000 */

#define OPAMP_CSR_USERTRIM_Pos (18U)
#define OPAMP_CSR_USERTRIM_Msk (0x1UL << OPAMP_CSR_USERTRIM_Pos) /*!< 0x00040000 */
#define OPAMP_CSR_USERTRIM     OPAMP_CSR_USERTRIM_Msk            /*!< User trimming enable */
#define OPAMP_CSR_TSTREF_Pos   (29U)
#define OPAMP_CSR_TSTREF_Msk   (0x1UL << OPAMP_CSR_TSTREF_Pos) /*!< 0x20000000 */
#define OPAMP_CSR_TSTREF       OPAMP_CSR_TSTREF_Msk /*!< OpAmp calibration reference voltage output control */
#define OPAMP_CSR_CALOUT_Pos   (30U)
#define OPAMP_CSR_CALOUT_Msk   (0x1UL << OPAMP_CSR_CALOUT_Pos) /*!< 0x40000000 */
#define OPAMP_CSR_CALOUT       OPAMP_CSR_CALOUT_Msk            /*!< Operational amplifier calibration output */

/*********************  Bit definition for OPAMP1_CSR register  ***************/
#define OPAMP1_CSR_OPAEN_Pos    (0U)
#define OPAMP1_CSR_OPAEN_Msk    (0x1UL << OPAMP1_CSR_OPAEN_Pos) /*!< 0x00000001 */
#define OPAMP1_CSR_OPAEN        OPAMP1_CSR_OPAEN_Msk            /*!< Operational amplifier1 Enable */
#define OPAMP1_CSR_FORCEVP_Pos  (1U)
#define OPAMP1_CSR_FORCEVP_Msk  (0x1UL << OPAMP1_CSR_FORCEVP_Pos) /*!< 0x00000002 */
#define OPAMP1_CSR_FORCEVP      OPAMP1_CSR_FORCEVP_Msk            /*!< Force internal reference on VP */

#define OPAMP1_CSR_VPSEL_Pos    (2U)
#define OPAMP1_CSR_VPSEL_Msk    (0x3UL << OPAMP1_CSR_VPSEL_Pos) /*!< 0x0000000C */
#define OPAMP1_CSR_VPSEL        OPAMP1_CSR_VPSEL_Msk            /*!< Non inverted input selection */
#define OPAMP1_CSR_VPSEL_0      (0x1UL << OPAMP1_CSR_VPSEL_Pos) /*!< 0x00000004 */
#define OPAMP1_CSR_VPSEL_1      (0x2UL << OPAMP1_CSR_VPSEL_Pos) /*!< 0x00000008 */

#define OPAMP1_CSR_VMSEL_Pos    (5U)
#define OPAMP1_CSR_VMSEL_Msk    (0x3UL << OPAMP1_CSR_VMSEL_Pos) /*!< 0x00000060 */
#define OPAMP1_CSR_VMSEL        OPAMP1_CSR_VMSEL_Msk            /*!< Inverting input selection */
#define OPAMP1_CSR_VMSEL_0      (0x1UL << OPAMP1_CSR_VMSEL_Pos) /*!< 0x00000020 */
#define OPAMP1_CSR_VMSEL_1      (0x2UL << OPAMP1_CSR_VMSEL_Pos) /*!< 0x00000040 */

#define OPAMP1_CSR_OPAHSM_Pos   (8U)
#define OPAMP1_CSR_OPAHSM_Msk   (0x1UL << OPAMP1_CSR_OPAHSM_Pos) /*!< 0x00000100 */
#define OPAMP1_CSR_OPAHSM       OPAMP1_CSR_OPAHSM_Msk            /*!< Operational amplifier1 high speed mode */
#define OPAMP1_CSR_CALON_Pos    (11U)
#define OPAMP1_CSR_CALON_Msk    (0x1UL << OPAMP1_CSR_CALON_Pos) /*!< 0x00000800 */
#define OPAMP1_CSR_CALON        OPAMP1_CSR_CALON_Msk            /*!< Calibration mode enable */

#define OPAMP1_CSR_CALSEL_Pos   (12U)
#define OPAMP1_CSR_CALSEL_Msk   (0x3UL << OPAMP1_CSR_CALSEL_Pos) /*!< 0x00003000 */
#define OPAMP1_CSR_CALSEL       OPAMP1_CSR_CALSEL_Msk            /*!< Calibration selection */
#define OPAMP1_CSR_CALSEL_0     (0x1UL << OPAMP1_CSR_CALSEL_Pos) /*!< 0x00001000 */
#define OPAMP1_CSR_CALSEL_1     (0x2UL << OPAMP1_CSR_CALSEL_Pos) /*!< 0x00002000 */

#define OPAMP1_CSR_PGGAIN_Pos   (14U)
#define OPAMP1_CSR_PGGAIN_Msk   (0xFUL << OPAMP1_CSR_PGGAIN_Pos) /*!< 0x0003C000 */
#define OPAMP1_CSR_PGGAIN       OPAMP1_CSR_PGGAIN_Msk /*!< Operational amplifier1 Programmable amplifier gain value */
#define OPAMP1_CSR_PGGAIN_0     (0x1UL << OPAMP1_CSR_PGGAIN_Pos) /*!< 0x00004000 */
#define OPAMP1_CSR_PGGAIN_1     (0x2UL << OPAMP1_CSR_PGGAIN_Pos) /*!< 0x00008000 */
#define OPAMP1_CSR_PGGAIN_2     (0x4UL << OPAMP1_CSR_PGGAIN_Pos) /*!< 0x00010000 */
#define OPAMP1_CSR_PGGAIN_3     (0x8UL << OPAMP1_CSR_PGGAIN_Pos) /*!< 0x00020000 */

#define OPAMP1_CSR_USERTRIM_Pos (18U)
#define OPAMP1_CSR_USERTRIM_Msk (0x1UL << OPAMP1_CSR_USERTRIM_Pos) /*!< 0x00040000 */
#define OPAMP1_CSR_USERTRIM     OPAMP1_CSR_USERTRIM_Msk            /*!< User trimming enable */
#define OPAMP1_CSR_TSTREF_Pos   (29U)
#define OPAMP1_CSR_TSTREF_Msk   (0x1UL << OPAMP1_CSR_TSTREF_Pos) /*!< 0x20000000 */
#define OPAMP1_CSR_TSTREF       OPAMP1_CSR_TSTREF_Msk /*!< OpAmp calibration reference voltage output control */
#define OPAMP1_CSR_CALOUT_Pos   (30U)
#define OPAMP1_CSR_CALOUT_Msk   (0x1UL << OPAMP1_CSR_CALOUT_Pos) /*!< 0x40000000 */
#define OPAMP1_CSR_CALOUT       OPAMP1_CSR_CALOUT_Msk            /*!< Operational amplifier1 calibration output */

/*********************  Bit definition for OPAMP2_CSR register  ***************/
#define OPAMP2_CSR_OPAEN_Pos    (0U)
#define OPAMP2_CSR_OPAEN_Msk    (0x1UL << OPAMP2_CSR_OPAEN_Pos) /*!< 0x00000001 */
#define OPAMP2_CSR_OPAEN        OPAMP2_CSR_OPAEN_Msk            /*!< Operational amplifier2 Enable */
#define OPAMP2_CSR_FORCEVP_Pos  (1U)
#define OPAMP2_CSR_FORCEVP_Msk  (0x1UL << OPAMP2_CSR_FORCEVP_Pos) /*!< 0x00000002 */
#define OPAMP2_CSR_FORCEVP      OPAMP2_CSR_FORCEVP_Msk            /*!< Force internal reference on VP */

#define OPAMP2_CSR_VPSEL_Pos    (2U)
#define OPAMP2_CSR_VPSEL_Msk    (0x3UL << OPAMP2_CSR_VPSEL_Pos) /*!< 0x0000000C */
#define OPAMP2_CSR_VPSEL        OPAMP2_CSR_VPSEL_Msk            /*!< Non inverted input selection */
#define OPAMP2_CSR_VPSEL_0      (0x1UL << OPAMP2_CSR_VPSEL_Pos) /*!< 0x00000004 */
#define OPAMP2_CSR_VPSEL_1      (0x2UL << OPAMP2_CSR_VPSEL_Pos) /*!< 0x00000008 */

#define OPAMP2_CSR_VMSEL_Pos    (5U)
#define OPAMP2_CSR_VMSEL_Msk    (0x3UL << OPAMP2_CSR_VMSEL_Pos) /*!< 0x00000060 */
#define OPAMP2_CSR_VMSEL        OPAMP2_CSR_VMSEL_Msk            /*!< Inverting input selection */
#define OPAMP2_CSR_VMSEL_0      (0x1UL << OPAMP2_CSR_VMSEL_Pos) /*!< 0x00000020 */
#define OPAMP2_CSR_VMSEL_1      (0x2UL << OPAMP2_CSR_VMSEL_Pos) /*!< 0x00000040 */

#define OPAMP2_CSR_OPAHSM_Pos   (8U)
#define OPAMP2_CSR_OPAHSM_Msk   (0x1UL << OPAMP2_CSR_OPAHSM_Pos) /*!< 0x00000100 */
#define OPAMP2_CSR_OPAHSM       OPAMP2_CSR_OPAHSM_Msk            /*!< Operational amplifier2 high speed mode */
#define OPAMP2_CSR_CALON_Pos    (11U)
#define OPAMP2_CSR_CALON_Msk    (0x1UL << OPAMP2_CSR_CALON_Pos) /*!< 0x00000800 */
#define OPAMP2_CSR_CALON        OPAMP2_CSR_CALON_Msk            /*!< Calibration mode enable */

#define OPAMP2_CSR_CALSEL_Pos   (12U)
#define OPAMP2_CSR_CALSEL_Msk   (0x3UL << OPAMP2_CSR_CALSEL_Pos) /*!< 0x00003000 */
#define OPAMP2_CSR_CALSEL       OPAMP2_CSR_CALSEL_Msk            /*!< Calibration selection */
#define OPAMP2_CSR_CALSEL_0     (0x1UL << OPAMP2_CSR_CALSEL_Pos) /*!< 0x00001000 */
#define OPAMP2_CSR_CALSEL_1     (0x2UL << OPAMP2_CSR_CALSEL_Pos) /*!< 0x00002000 */

#define OPAMP2_CSR_PGGAIN_Pos   (14U)
#define OPAMP2_CSR_PGGAIN_Msk   (0xFUL << OPAMP2_CSR_PGGAIN_Pos) /*!< 0x0003C000 */
#define OPAMP2_CSR_PGGAIN       OPAMP2_CSR_PGGAIN_Msk /*!< Operational amplifier2 Programmable amplifier gain value */
#define OPAMP2_CSR_PGGAIN_0     (0x1UL << OPAMP2_CSR_PGGAIN_Pos) /*!< 0x00004000 */
#define OPAMP2_CSR_PGGAIN_1     (0x2UL << OPAMP2_CSR_PGGAIN_Pos) /*!< 0x00008000 */
#define OPAMP2_CSR_PGGAIN_2     (0x4UL << OPAMP2_CSR_PGGAIN_Pos) /*!< 0x00010000 */
#define OPAMP2_CSR_PGGAIN_3     (0x8UL << OPAMP2_CSR_PGGAIN_Pos) /*!< 0x00020000 */

