Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define OPAMP2_CSR_USERTRIM_Pos (18U)
#define OPAMP2_CSR_USERTRIM_Msk (0x1UL << OPAMP2_CSR_USERTRIM_Pos) /*!< 0x00040000 */
#define OPAMP2_CSR_USERTRIM     OPAMP2_CSR_USERTRIM_Msk            /*!< User trimming enable */
#define OPAMP2_CSR_TSTREF_Pos   (29U)
#define OPAMP2_CSR_TSTREF_Msk   (0x1UL << OPAMP2_CSR_TSTREF_Pos) /*!< 0x20000000 */
#define OPAMP2_CSR_TSTREF       OPAMP2_CSR_TSTREF_Msk /*!< OpAmp calibration reference voltage output control */
#define OPAMP2_CSR_CALOUT_Pos   (30U)
#define OPAMP2_CSR_CALOUT_Msk   (0x1UL << OPAMP2_CSR_CALOUT_Pos) /*!< 0x40000000 */
#define OPAMP2_CSR_CALOUT       OPAMP2_CSR_CALOUT_Msk            /*!< Operational amplifier2 calibration output */

/*******************  Bit definition for OPAMP_OTR register  ******************/
#define OPAMP_OTR_TRIMOFFSETN_Pos (0U)
#define OPAMP_OTR_TRIMOFFSETN_Msk (0x1FUL << OPAMP_OTR_TRIMOFFSETN_Pos) /*!< 0x0000001F */
#define OPAMP_OTR_TRIMOFFSETN     OPAMP_OTR_TRIMOFFSETN_Msk             /*!< Trim for NMOS differential pairs */
#define OPAMP_OTR_TRIMOFFSETP_Pos (8U)
#define OPAMP_OTR_TRIMOFFSETP_Msk (0x1FUL << OPAMP_OTR_TRIMOFFSETP_Pos) /*!< 0x00001F00 */
#define OPAMP_OTR_TRIMOFFSETP     OPAMP_OTR_TRIMOFFSETP_Msk             /*!< Trim for PMOS differential pairs */

/*******************  Bit definition for OPAMP1_OTR register  ******************/
#define OPAMP1_OTR_TRIMOFFSETN_Pos (0U)
#define OPAMP1_OTR_TRIMOFFSETN_Msk (0x1FUL << OPAMP1_OTR_TRIMOFFSETN_Pos) /*!< 0x0000001F */
#define OPAMP1_OTR_TRIMOFFSETN     OPAMP1_OTR_TRIMOFFSETN_Msk             /*!< Trim for NMOS differential pairs */
#define OPAMP1_OTR_TRIMOFFSETP_Pos (8U)
#define OPAMP1_OTR_TRIMOFFSETP_Msk (0x1FUL << OPAMP1_OTR_TRIMOFFSETP_Pos) /*!< 0x00001F00 */
#define OPAMP1_OTR_TRIMOFFSETP     OPAMP1_OTR_TRIMOFFSETP_Msk             /*!< Trim for PMOS differential pairs */

/*******************  Bit definition for OPAMP2_OTR register  ******************/
#define OPAMP2_OTR_TRIMOFFSETN_Pos (0U)
#define OPAMP2_OTR_TRIMOFFSETN_Msk (0x1FUL << OPAMP2_OTR_TRIMOFFSETN_Pos) /*!< 0x0000001F */
#define OPAMP2_OTR_TRIMOFFSETN     OPAMP2_OTR_TRIMOFFSETN_Msk             /*!< Trim for NMOS differential pairs */
#define OPAMP2_OTR_TRIMOFFSETP_Pos (8U)
#define OPAMP2_OTR_TRIMOFFSETP_Msk (0x1FUL << OPAMP2_OTR_TRIMOFFSETP_Pos) /*!< 0x00001F00 */
#define OPAMP2_OTR_TRIMOFFSETP     OPAMP2_OTR_TRIMOFFSETP_Msk             /*!< Trim for PMOS differential pairs */

/*******************  Bit definition for OPAMP_HSOTR register  ****************/
#define OPAMP_HSOTR_TRIMHSOFFSETN_Pos (0U)
#define OPAMP_HSOTR_TRIMHSOFFSETN_Msk (0x1FUL << OPAMP_HSOTR_TRIMHSOFFSETN_Pos) /*!< 0x0000001F */
#define OPAMP_HSOTR_TRIMHSOFFSETN     OPAMP_HSOTR_TRIMHSOFFSETN_Msk             /*!< Trim for NMOS differential pairs */
#define OPAMP_HSOTR_TRIMHSOFFSETP_Pos (8U)
#define OPAMP_HSOTR_TRIMHSOFFSETP_Msk (0x1FUL << OPAMP_HSOTR_TRIMHSOFFSETP_Pos) /*!< 0x00001F00 */
#define OPAMP_HSOTR_TRIMHSOFFSETP     OPAMP_HSOTR_TRIMHSOFFSETP_Msk             /*!< Trim for PMOS differential pairs */

/*******************  Bit definition for OPAMP1_HSOTR register  ****************/
#define OPAMP1_HSOTR_TRIMHSOFFSETN_Pos (0U)
#define OPAMP1_HSOTR_TRIMHSOFFSETN_Msk (0x1FUL << OPAMP1_HSOTR_TRIMHSOFFSETN_Pos) /*!< 0x0000001F */
#define OPAMP1_HSOTR_TRIMHSOFFSETN     OPAMP1_HSOTR_TRIMHSOFFSETN_Msk /*!< Trim for NMOS differential pairs */
#define OPAMP1_HSOTR_TRIMHSOFFSETP_Pos (8U)
#define OPAMP1_HSOTR_TRIMHSOFFSETP_Msk (0x1FUL << OPAMP1_HSOTR_TRIMHSOFFSETP_Pos) /*!< 0x00001F00 */
#define OPAMP1_HSOTR_TRIMHSOFFSETP     OPAMP1_HSOTR_TRIMHSOFFSETP_Msk /*!< Trim for PMOS differential pairs */

/*******************  Bit definition for OPAMP2_HSOTR register  ****************/
#define OPAMP2_HSOTR_TRIMHSOFFSETN_Pos (0U)
#define OPAMP2_HSOTR_TRIMHSOFFSETN_Msk (0x1FUL << OPAMP2_HSOTR_TRIMHSOFFSETN_Pos) /*!< 0x0000001F */
#define OPAMP2_HSOTR_TRIMHSOFFSETN     OPAMP2_HSOTR_TRIMHSOFFSETN_Msk /*!< Trim for NMOS differential pairs */
#define OPAMP2_HSOTR_TRIMHSOFFSETP_Pos (8U)
#define OPAMP2_HSOTR_TRIMHSOFFSETP_Msk (0x1FUL << OPAMP2_HSOTR_TRIMHSOFFSETP_Pos) /*!< 0x00001F00 */
#define OPAMP2_HSOTR_TRIMHSOFFSETP     OPAMP2_HSOTR_TRIMHSOFFSETP_Msk /*!< Trim for PMOS differential pairs */

/******************************************************************************/
/*                                                                            */
/*                Parallel Synchronous Slave Interface (PSSI )                */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for PSSI_CR register  *******************/
#define PSSI_CR_OUTEN_Pos    (31U)
#define PSSI_CR_OUTEN_Msk    (0x1UL << PSSI_CR_OUTEN_Pos) /*!< 0x80000000 */
#define PSSI_CR_OUTEN        PSSI_CR_OUTEN_Msk            /*!< Data direction selection */
#define PSSI_CR_DMAEN_Pos    (30U)
#define PSSI_CR_DMAEN_Msk    (0x1UL << PSSI_CR_DMAEN_Pos) /*!< 0x40000000 */
#define PSSI_CR_DMAEN        PSSI_CR_DMAEN_Msk            /*!< DMA enable */
#define PSSI_CR_DERDYCFG_Pos (18U)
#define PSSI_CR_DERDYCFG_Msk (0x7UL << PSSI_CR_DERDYCFG_Pos) /*!< 0x001C0000 */
#define PSSI_CR_DERDYCFG     PSSI_CR_DERDYCFG_Msk            /*!< Data enable and ready configuration */
#define PSSI_CR_ENABLE_Pos   (14U)
#define PSSI_CR_ENABLE_Msk   (0x1UL << PSSI_CR_ENABLE_Pos) /*!< 0x00004000 */
#define PSSI_CR_ENABLE       PSSI_CR_ENABLE_Msk            /*!< PSSI enable */
#define PSSI_CR_EDM_Pos      (10U)
#define PSSI_CR_EDM_Msk      (0x3UL << PSSI_CR_EDM_Pos) /*!< 0x00000C00 */
#define PSSI_CR_EDM          PSSI_CR_EDM_Msk            /*!< Extended data mode */
#define PSSI_CR_RDYPOL_Pos   (8U)
#define PSSI_CR_RDYPOL_Msk   (0x1UL << PSSI_CR_RDYPOL_Pos) /*!< 0x00000C00 */
#define PSSI_CR_RDYPOL       PSSI_CR_RDYPOL_Msk            /*!< Ready polarity */
#define PSSI_CR_DEPOL_Pos    (6U)
#define PSSI_CR_DEPOL_Msk    (0x1UL << PSSI_CR_DEPOL_Pos) /*!< 0x00000C00 */
#define PSSI_CR_DEPOL        PSSI_CR_DEPOL_Msk            /*!<  Data enable polarity */
#define PSSI_CR_CKPOL_Pos    (5U)
#define PSSI_CR_CKPOL_Msk    (0x1UL << PSSI_CR_CKPOL_Pos) /*!< 0x00000C00 */
#define PSSI_CR_CKPOL        PSSI_CR_CKPOL_Msk            /*!< Parallel data clock polarity */
/********************  Bit definition for PSSI_SR register  *******************/
#define PSSI_SR_RTT1B_Pos (3U)
#define PSSI_SR_RTT1B_Msk (0x1UL << PSSI_SR_RTT1B_Pos) /*!< 0x00000008 */
#define PSSI_SR_RTT1B     PSSI_SR_RTT1B_Msk            /*!< Ready to transfer one byte */
#define PSSI_SR_RTT4B_Pos (2U)
#define PSSI_SR_RTT4B_Msk (0x1UL << PSSI_SR_RTT4B_Pos) /*!< 0x00000004 */
#define PSSI_SR_RTT4B     PSSI_SR_RTT4B_Msk            /*!< Ready to transfer four bytes */
/********************  Bit definition for PSSI_RIS register  *******************/
#define PSSI_RIS_OVR_RIS_Pos (1U)
#define PSSI_RIS_OVR_RIS_Msk (0x1UL << PSSI_RIS_OVR_RIS_Pos) /*!< 0x00000002 */
#define PSSI_RIS_OVR_RIS     PSSI_RIS_OVR_RIS_Msk            /*!< Data buffer overrun/underrun raw interrupt status */
/********************  Bit definition for PSSI_IER register  *******************/
#define PSSI_IER_OVR_IE_Pos (1U)
#define PSSI_IER_OVR_IE_Msk (0x1UL << PSSI_IER_OVR_IE_Pos) /*!< 0x00000002 */
#define PSSI_IER_OVR_IE     PSSI_IER_OVR_IE_Msk            /*!< Data buffer overrun/underrun interrupt enable */
/********************  Bit definition for PSSI_MIS register  *******************/
#define PSSI_MIS_OVR_MIS_Pos (1U)
#define PSSI_MIS_OVR_MIS_Msk (0x1UL << PSSI_MIS_OVR_MIS_Pos) /*!< 0x00000002 */
#define PSSI_MIS_OVR_MIS     PSSI_MIS_OVR_MIS_Msk /*!< Data buffer overrun/underrun masked interrupt status */
/********************  Bit definition for PSSI_ICR register  *******************/
#define PSSI_ICR_OVR_ISC_Pos (1U)
#define PSSI_ICR_OVR_ISC_Msk (0x1UL << PSSI_ICR_OVR_ISC_Pos) /*!< 0x00000002 */
#define PSSI_ICR_OVR_ISC     PSSI_ICR_OVR_ISC_Msk            /*!< Data buffer overrun/underrun interrupt status clear */
/********************  Bit definition for PSSI_DR register  *******************/
#define PSSI_DR_DR_Pos (0U)
#define PSSI_DR_DR_Msk (0xFFFFFFFFUL << PSSI_DR_DR_Pos) /*!< 0xFFFFFFF */
#define PSSI_DR_DR     PSSI_DR_DR_Msk                   /*!< Data register  */

/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/
/*************************  NUMBER OF POWER DOMAINS  **************************/
#define POWER_DOMAINS_NUMBER 2U /*!< 2 Domains */

/********************  Bit definition for PWR_CR1 register  *******************/
#define PWR_CR1_SRDRAMSO_Pos (27U)
#define PWR_CR1_SRDRAMSO_Msk (0x1UL << PWR_CR1_SRDRAMSO_Pos) /*!< 0x08000000 */
#define PWR_CR1_SRDRAMSO     PWR_CR1_SRDRAMSO_Msk /*!< SmartRun Domain AHB Memory Shut-Off in DStop/DStop2 Low-Power Mode */
#define PWR_CR1_HSITFSO_Pos  (26U)
#define PWR_CR1_HSITFSO_Msk  (0x1UL << PWR_CR1_HSITFSO_Pos) /*!< 0x04000000 */
#define PWR_CR1_HSITFSO                                                                                                \
  PWR_CR1_HSITFSO_Msk /*!< High-Speed Interfaces USB and FDCAN Memories Shut-off in DStop/DStop2 Mode */
#define PWR_CR1_GFXSO_Pos     (25U)
#define PWR_CR1_GFXSO_Msk     (0x1UL << PWR_CR1_GFXSO_Pos) /*!< 0x02000000 */
#define PWR_CR1_GFXSO         PWR_CR1_GFXSO_Msk /*!< GFXMMU and JPEG Memories Shut-Off in DStop/DStop2 Mode */
#define PWR_CR1_ITCMSO_Pos    (24U)
#define PWR_CR1_ITCMSO_Msk    (0x1UL << PWR_CR1_ITCMSO_Pos) /*!< 0x01000000 */
#define PWR_CR1_ITCMSO        PWR_CR1_ITCMSO_Msk /*!< Instruction TCM and ETM Memories Shut-Off in DStop/DStop2 Mode */
#define PWR_CR1_AHBRAM2SO_Pos (23U)
#define PWR_CR1_AHBRAM2SO_Msk (0x1UL << PWR_CR1_AHBRAM2SO_Pos) /*!< 0x00800000 */
#define PWR_CR1_AHBRAM2SO     PWR_CR1_AHBRAM2SO_Msk            /*!< AHB RAM2 Shut-Off in DStop/DStop2 Mode */
#define PWR_CR1_AHBRAM1SO_Pos (22U)
#define PWR_CR1_AHBRAM1SO_Msk (0x1UL << PWR_CR1_AHBRAM1SO_Pos) /*!< 0x00400000 */
#define PWR_CR1_AHBRAM1SO     PWR_CR1_AHBRAM1SO_Msk            /*!< AHB RAM1 Shut-Off in DStop/DStop2 Mode */
#define PWR_CR1_AXIRAM3SO_Pos (21U)
#define PWR_CR1_AXIRAM3SO_Msk (0x1UL << PWR_CR1_AXIRAM3SO_Pos) /*!< 0x00200000 */
#define PWR_CR1_AXIRAM3SO     PWR_CR1_AXIRAM3SO_Msk            /*!< AXI RAM3 Shut-Off in DStop/DStop2 Mode */
#define PWR_CR1_AXIRAM2SO_Pos (20U)
#define PWR_CR1_AXIRAM2SO_Msk (0x1UL << PWR_CR1_AXIRAM2SO_Pos) /*!< 0x00100000 */
#define PWR_CR1_AXIRAM2SO     PWR_CR1_AXIRAM2SO_Msk            /*!< AXI RAM2 Shut-Off in DStop/DStop2 Mode */
#define PWR_CR1_AXIRAM1SO_Pos (19U)
#define PWR_CR1_AXIRAM1SO_Msk (0x1UL << PWR_CR1_AXIRAM1SO_Pos) /*!< 0x00080000 */
#define PWR_CR1_AXIRAM1SO     PWR_CR1_AXIRAM1SO_Msk            /*!< AXI RAM1 Shut-Off in DStop/DStop2 Mode */
#define PWR_CR1_ALS_Pos       (17U)
#define PWR_CR1_ALS_Msk       (0x3UL << PWR_CR1_ALS_Pos) /*!< 0x00060000 */
#define PWR_CR1_ALS           PWR_CR1_ALS_Msk            /*!< Analog Voltage Detector level selection */
#define PWR_CR1_ALS_0         (0x1UL << PWR_CR1_ALS_Pos) /*!< 0x00020000 */
#define PWR_CR1_ALS_1         (0x2UL << PWR_CR1_ALS_Pos) /*!< 0x00040000 */
#define PWR_CR1_AVDEN_Pos     (16U)
#define PWR_CR1_AVDEN_Msk     (0x1UL << PWR_CR1_AVDEN_Pos) /*!< 0x00010000 */
#define PWR_CR1_AVDEN         PWR_CR1_AVDEN_Msk            /*!< Analog Voltage Detector Enable */
#define PWR_CR1_SVOS_Pos      (14U)
#define PWR_CR1_SVOS_Msk      (0x3UL << PWR_CR1_SVOS_Pos) /*!< 0x0000C000 */
#define PWR_CR1_SVOS          PWR_CR1_SVOS_Msk            /*!< System STOP mode Voltage Scaling selection */
#define PWR_CR1_SVOS_0        (0x1UL << PWR_CR1_SVOS_Pos) /*!< 0x00004000 */
#define PWR_CR1_SVOS_1        (0x2UL << PWR_CR1_SVOS_Pos) /*!< 0x00008000 */
#define PWR_CR1_AVD_READY_Pos (13U)
#define PWR_CR1_AVD_READY_Msk (0x1UL << PWR_CR1_AVD_READY_Pos) /*!< 0x00002000 */
#define PWR_CR1_AVD_READY     PWR_CR1_AVD_READY_Msk            /*!< Analog Voltage Ready. */
#define PWR_CR1_BOOSTE_Pos    (12U)
#define PWR_CR1_BOOSTE_Msk    (0x1UL << PWR_CR1_BOOSTE_Pos) /*!< 0x00001000 */
#define PWR_CR1_BOOSTE        PWR_CR1_BOOSTE_Msk            /*!< Analog Switch VBoost control */
#define PWR_CR1_FLPS_Pos      (9U)
#define PWR_CR1_FLPS_Msk      (0x1UL << PWR_CR1_FLPS_Pos) /*!< 0x00000200 */
#define PWR_CR1_FLPS          PWR_CR1_FLPS_Msk            /*!< Flash low power mode in DSTOP */
#define PWR_CR1_DBP_Pos       (8U)
#define PWR_CR1_DBP_Msk       (0x1UL << PWR_CR1_DBP_Pos) /*!< 0x00000100 */
#define PWR_CR1_DBP           PWR_CR1_DBP_Msk            /*!< Disable Back-up domain Protection */
#define PWR_CR1_PLS_Pos       (5U)
#define PWR_CR1_PLS_Msk       (0x7UL << PWR_CR1_PLS_Pos) /*!< 0x000000E0 */
#define PWR_CR1_PLS           PWR_CR1_PLS_Msk            /*!< Programmable Voltage Detector level selection */
#define PWR_CR1_PLS_0         (0x1UL << PWR_CR1_PLS_Pos) /*!< 0x00000020 */
#define PWR_CR1_PLS_1         (0x2UL << PWR_CR1_PLS_Pos) /*!< 0x00000040 */
#define PWR_CR1_PLS_2         (0x4UL << PWR_CR1_PLS_Pos) /*!< 0x00000080 */
#define PWR_CR1_PVDEN_Pos     (4U)
#define PWR_CR1_PVDEN_Msk     (0x1UL << PWR_CR1_PVDEN_Pos) /*!< 0x00000010 */
#define PWR_CR1_PVDEN         PWR_CR1_PVDEN_Msk            /*!< Programmable Voltage detector enable */
#define PWR_CR1_LPDS_Pos      (0U)
#define PWR_CR1_LPDS_Msk      (0x1UL << PWR_CR1_LPDS_Pos) /*!< 0x00000001 */
#define PWR_CR1_LPDS          PWR_CR1_LPDS_Msk            /*!< Low Power Deepsleep with SVOS3 */

/*!< PVD level configuration */
#define PWR_CR1_PLS_LEV0     (0UL) /*!< PVD level 0 */
#define PWR_CR1_PLS_LEV1_Pos (5U)
#define PWR_CR1_PLS_LEV1_Msk (0x1UL << PWR_CR1_PLS_LEV1_Pos) /*!< 0x00000020 */
#define PWR_CR1_PLS_LEV1     PWR_CR1_PLS_LEV1_Msk            /*!< PVD level 1 */
#define PWR_CR1_PLS_LEV2_Pos (6U)
#define PWR_CR1_PLS_LEV2_Msk (0x1UL << PWR_CR1_PLS_LEV2_Pos) /*!< 0x00000040 */
#define PWR_CR1_PLS_LEV2     PWR_CR1_PLS_LEV2_Msk            /*!< PVD level 2 */
#define PWR_CR1_PLS_LEV3_Pos (5U)
#define PWR_CR1_PLS_LEV3_Msk (0x3UL << PWR_CR1_PLS_LEV3_Pos) /*!< 0x00000060 */
#define PWR_CR1_PLS_LEV3     PWR_CR1_PLS_LEV3_Msk            /*!< PVD level 3 */
#define PWR_CR1_PLS_LEV4_Pos (7U)
#define PWR_CR1_PLS_LEV4_Msk (0x1UL << PWR_CR1_PLS_LEV4_Pos) /*!< 0x00000080 */
#define PWR_CR1_PLS_LEV4     PWR_CR1_PLS_LEV4_Msk            /*!< PVD level 4 */
#define PWR_CR1_PLS_LEV5_Pos (5U)
#define PWR_CR1_PLS_LEV5_Msk (0x5UL << PWR_CR1_PLS_LEV5_Pos) /*!< 0x000000A0 */
#define PWR_CR1_PLS_LEV5     PWR_CR1_PLS_LEV5_Msk            /*!< PVD level 5 */
#define PWR_CR1_PLS_LEV6_Pos (6U)
#define PWR_CR1_PLS_LEV6_Msk (0x3UL << PWR_CR1_PLS_LEV6_Pos) /*!< 0x000000C0 */
#define PWR_CR1_PLS_LEV6     PWR_CR1_PLS_LEV6_Msk            /*!< PVD level 6 */
#define PWR_CR1_PLS_LEV7_Pos (5U)
#define PWR_CR1_PLS_LEV7_Msk (0x7UL << PWR_CR1_PLS_LEV7_Pos) /*!< 0x000000E0 */
#define PWR_CR1_PLS_LEV7     PWR_CR1_PLS_LEV7_Msk            /*!< PVD level 7 */

