Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*!< AVD level configuration */
#define PWR_CR1_ALS_LEV0     (0UL) /*!< AVD level 0 */
#define PWR_CR1_ALS_LEV1_Pos (17U)
#define PWR_CR1_ALS_LEV1_Msk (0x1UL << PWR_CR1_ALS_LEV1_Pos) /*!< 0x00020000 */
#define PWR_CR1_ALS_LEV1     PWR_CR1_ALS_LEV1_Msk            /*!< AVD level 1 */
#define PWR_CR1_ALS_LEV2_Pos (18U)
#define PWR_CR1_ALS_LEV2_Msk (0x1UL << PWR_CR1_ALS_LEV2_Pos) /*!< 0x00040000 */
#define PWR_CR1_ALS_LEV2     PWR_CR1_ALS_LEV2_Msk            /*!< AVD level 2 */
#define PWR_CR1_ALS_LEV3_Pos (17U)
#define PWR_CR1_ALS_LEV3_Msk (0x3UL << PWR_CR1_ALS_LEV3_Pos) /*!< 0x00060000 */
#define PWR_CR1_ALS_LEV3     PWR_CR1_ALS_LEV3_Msk            /*!< AVD level 3 */

/********************  Bit definition for PWR_CSR1 register  ******************/
#define PWR_CSR1_MMCVDO_Pos    (17U)
#define PWR_CSR1_MMCVDO_Msk    (0x1UL << PWR_CSR1_MMCVDO_Pos) /*!< 0x00020000                        */
#define PWR_CSR1_MMCVDO        PWR_CSR1_MMCVDO_Msk            /*!< voltage detector output on VDDMMC */
#define PWR_CSR1_AVDO_Pos      (16U)
#define PWR_CSR1_AVDO_Msk      (0x1UL << PWR_CSR1_AVDO_Pos) /*!< 0x00010000 */
#define PWR_CSR1_AVDO          PWR_CSR1_AVDO_Msk            /*!< Analog Voltage Detect Output */
#define PWR_CSR1_ACTVOS_Pos    (14U)
#define PWR_CSR1_ACTVOS_Msk    (0x3UL << PWR_CSR1_ACTVOS_Pos) /*!< 0x0000C000 */
#define PWR_CSR1_ACTVOS        PWR_CSR1_ACTVOS_Msk            /*!< Current actual used VOS for VDD11 Voltage Scaling */
#define PWR_CSR1_ACTVOS_0      (0x1UL << PWR_CSR1_ACTVOS_Pos) /*!< 0x00004000 */
#define PWR_CSR1_ACTVOS_1      (0x2UL << PWR_CSR1_ACTVOS_Pos) /*!< 0x00008000 */
#define PWR_CSR1_ACTVOSRDY_Pos (13U)
#define PWR_CSR1_ACTVOSRDY_Msk (0x1UL << PWR_CSR1_ACTVOSRDY_Pos) /*!< 0x00002000 */
#define PWR_CSR1_ACTVOSRDY                                                                                             \
  PWR_CSR1_ACTVOSRDY_Msk /*!< Ready bit for current actual used VOS for VDD11 Voltage Scaling  */
#define PWR_CSR1_PVDO_Pos (4U)
#define PWR_CSR1_PVDO_Msk (0x1UL << PWR_CSR1_PVDO_Pos) /*!< 0x00000010 */
#define PWR_CSR1_PVDO     PWR_CSR1_PVDO_Msk            /*!< Programmable Voltage Detect Output */

/********************  Bit definition for PWR_CR2 register  *******************/
#define PWR_CR2_TEMPH_Pos (23U)
#define PWR_CR2_TEMPH_Msk (0x1UL << PWR_CR2_TEMPH_Pos) /*!< 0x00800000 */
#define PWR_CR2_TEMPH     PWR_CR2_TEMPH_Msk            /*!< Monitored temperature level above high threshold */
#define PWR_CR2_TEMPL_Pos (22U)
#define PWR_CR2_TEMPL_Msk (0x1UL << PWR_CR2_TEMPL_Pos) /*!< 0x00400000 */
#define PWR_CR2_TEMPL     PWR_CR2_TEMPL_Msk            /*!< Monitored temperature level above low threshold */
#define PWR_CR2_VBATH_Pos (21U)
#define PWR_CR2_VBATH_Msk (0x1UL << PWR_CR2_VBATH_Pos) /*!< 0x00200000 */
#define PWR_CR2_VBATH     PWR_CR2_VBATH_Msk            /*!< Monitored VBAT level above high threshold */
#define PWR_CR2_VBATL_Pos (20U)
#define PWR_CR2_VBATL_Msk (0x1UL << PWR_CR2_VBATL_Pos) /*!< 0x00100000 */
#define PWR_CR2_VBATL     PWR_CR2_VBATL_Msk            /*!< Monitored VBAT level above low threshold */
#define PWR_CR2_BRRDY_Pos (16U)
#define PWR_CR2_BRRDY_Msk (0x1UL << PWR_CR2_BRRDY_Pos) /*!< 0x00010000 */
#define PWR_CR2_BRRDY     PWR_CR2_BRRDY_Msk            /*!< Backup regulator ready */
#define PWR_CR2_MONEN_Pos (4U)
#define PWR_CR2_MONEN_Msk (0x1UL << PWR_CR2_MONEN_Pos) /*!< 0x00000010 */
#define PWR_CR2_MONEN     PWR_CR2_MONEN_Msk            /*!< VBAT and temperature monitoring enable */
#define PWR_CR2_BREN_Pos  (0U)
#define PWR_CR2_BREN_Msk  (0x1UL << PWR_CR2_BREN_Pos) /*!< 0x00000001 */
#define PWR_CR2_BREN      PWR_CR2_BREN_Msk            /*!< Backup regulator enable */

/********************  Bit definition for PWR_CR3 register  *******************/
#define PWR_CR3_USB33RDY_Pos   (26U)
#define PWR_CR3_USB33RDY_Msk   (0x1UL << PWR_CR3_USB33RDY_Pos) /*!< 0x04000000 */
#define PWR_CR3_USB33RDY       PWR_CR3_USB33RDY_Msk            /*!< USB supply ready */
#define PWR_CR3_USBREGEN_Pos   (25U)
#define PWR_CR3_USBREGEN_Msk   (0x1UL << PWR_CR3_USBREGEN_Pos) /*!< 0x02000000 */
#define PWR_CR3_USBREGEN       PWR_CR3_USBREGEN_Msk            /*!< USB regulator enable */
#define PWR_CR3_USB33DEN_Pos   (24U)
#define PWR_CR3_USB33DEN_Msk   (0x1UL << PWR_CR3_USB33DEN_Pos) /*!< 0x01000000 */
#define PWR_CR3_USB33DEN       PWR_CR3_USB33DEN_Msk            /*!< VDD33_USB voltage level detector enable */
#define PWR_CR3_SMPSEXTRDY_Pos (16U)
#define PWR_CR3_SMPSEXTRDY_Msk (0x1UL << PWR_CR3_SMPSEXTRDY_Pos) /*!< 0x00010000 */
#define PWR_CR3_SMPSEXTRDY     PWR_CR3_SMPSEXTRDY_Msk            /*!< SMPS External supply ready */
#define PWR_CR3_VBRS_Pos       (9U)
#define PWR_CR3_VBRS_Msk       (0x1UL << PWR_CR3_VBRS_Pos) /*!< 0x00000200 */
#define PWR_CR3_VBRS           PWR_CR3_VBRS_Msk            /*!< VBAT charging resistor selection */
#define PWR_CR3_VBE_Pos        (8U)
#define PWR_CR3_VBE_Msk        (0x1UL << PWR_CR3_VBE_Pos) /*!< 0x00000100 */
#define PWR_CR3_VBE            PWR_CR3_VBE_Msk            /*!< VBAT charging enable */
#define PWR_CR3_SMPSLEVEL_Pos  (4U)
#define PWR_CR3_SMPSLEVEL_Msk  (0x3UL << PWR_CR3_SMPSLEVEL_Pos) /*!< 0x00000030 */
#define PWR_CR3_SMPSLEVEL      PWR_CR3_SMPSLEVEL_Msk            /*!< SMPS output Voltage */
#define PWR_CR3_SMPSLEVEL_0    (0x1UL << PWR_CR3_SMPSLEVEL_Pos) /*!< 0x00000010 */
#define PWR_CR3_SMPSLEVEL_1    (0x2UL << PWR_CR3_SMPSLEVEL_Pos) /*!< 0x00000020 */
#define PWR_CR3_SMPSEXTHP_Pos  (3U)
#define PWR_CR3_SMPSEXTHP_Msk  (0x1UL << PWR_CR3_SMPSEXTHP_Pos) /*!< 0x00000008 */
#define PWR_CR3_SMPSEXTHP      PWR_CR3_SMPSEXTHP_Msk            /*!< SMPS forced ON and in High Power MR mode */
#define PWR_CR3_SMPSEN_Pos     (2U)
#define PWR_CR3_SMPSEN_Msk     (0x1UL << PWR_CR3_SMPSEN_Pos) /*!< 0x00000004 */
#define PWR_CR3_SMPSEN         PWR_CR3_SMPSEN_Msk            /*!< SMPS Enable */
#define PWR_CR3_LDOEN_Pos      (1U)
#define PWR_CR3_LDOEN_Msk      (0x1UL << PWR_CR3_LDOEN_Pos) /*!< 0x00000002 */
#define PWR_CR3_LDOEN          PWR_CR3_LDOEN_Msk            /*!< Low Drop Output regulator enable */
#define PWR_CR3_BYPASS_Pos     (0U)
#define PWR_CR3_BYPASS_Msk     (0x1UL << PWR_CR3_BYPASS_Pos) /*!< 0x00000001 */
#define PWR_CR3_BYPASS         PWR_CR3_BYPASS_Msk            /*!< Power Management Unit bypass */

/********************  Bit definition for PWR_CPUCR register  *****************/
#define PWR_CPUCR_RUN_SRD_Pos (11U)
#define PWR_CPUCR_RUN_SRD_Msk (0x1UL << PWR_CPUCR_RUN_SRD_Pos) /*!< 0x00000800 */
#define PWR_CPUCR_RUN_SRD                                                                                              \
  PWR_CPUCR_RUN_SRD_Msk /*!< Keep system SRD domain in RUN mode regardless of the CPU sub-systems modes */
#define PWR_CPUCR_CSSF_Pos     (9U)
#define PWR_CPUCR_CSSF_Msk     (0x1UL << PWR_CPUCR_CSSF_Pos) /*!< 0x00000200 */
#define PWR_CPUCR_CSSF         PWR_CPUCR_CSSF_Msk            /*!< Clear D1 domain CPU1 STANDBY, STOP and HOLD flags */
#define PWR_CPUCR_SBF_Pos      (6U)
#define PWR_CPUCR_SBF_Msk      (0x1UL << PWR_CPUCR_SBF_Pos) /*!< 0x00000040 */
#define PWR_CPUCR_SBF          PWR_CPUCR_SBF_Msk            /*!< System STANDBY Flag */
#define PWR_CPUCR_STOPF_Pos    (5U)
#define PWR_CPUCR_STOPF_Msk    (0x1UL << PWR_CPUCR_STOPF_Pos) /*!< 0x00000020 */
#define PWR_CPUCR_STOPF        PWR_CPUCR_STOPF_Msk            /*!< STOP Flag */
#define PWR_CPUCR_PDDS_SRD_Pos (2U)
#define PWR_CPUCR_PDDS_SRD_Msk (0x1UL << PWR_CPUCR_PDDS_SRD_Pos) /*!< 0x00000004 */
#define PWR_CPUCR_PDDS_SRD     PWR_CPUCR_PDDS_SRD_Msk            /*!< System SRD domain Power Down Deepsleep */
#define PWR_CPUCR_RETDS_CD_Pos (0U)
#define PWR_CPUCR_RETDS_CD_Msk (0x1UL << PWR_CPUCR_RETDS_CD_Pos) /*!< 0x00000001 */
#define PWR_CPUCR_RETDS_CD     PWR_CPUCR_RETDS_CD_Msk            /*!< CD domain Power Down Deepsleep selection */
/********************  Bit definition for PWR_SRDCR register  *****************/
#define PWR_SRDCR_VOS_Pos    (14U)
#define PWR_SRDCR_VOS_Msk    (0x3UL << PWR_SRDCR_VOS_Pos) /*!< 0x0000C000 */
#define PWR_SRDCR_VOS        PWR_SRDCR_VOS_Msk            /*!< Voltage Scaling selection according performance */
#define PWR_SRDCR_VOS_0      (0x1UL << PWR_SRDCR_VOS_Pos) /*!< 0x00004000 */
#define PWR_SRDCR_VOS_1      (0x2UL << PWR_SRDCR_VOS_Pos) /*!< 0x00008000 */
#define PWR_SRDCR_VOSRDY_Pos (13U)
#define PWR_SRDCR_VOSRDY_Msk (0x1UL << PWR_SRDCR_VOSRDY_Pos) /*!< 0x00002000 */
#define PWR_SRDCR_VOSRDY     PWR_SRDCR_VOSRDY_Msk /*!< VOS Ready bit for VDD11 Voltage Scaling output selection */
/******************  Bit definition for PWR_WKUPCR register  ******************/
#define PWR_WKUPCR_WKUPC6_Pos (5U)
#define PWR_WKUPCR_WKUPC6_Msk (0x1UL << PWR_WKUPCR_WKUPC6_Pos) /*!< 0x00000020 */
#define PWR_WKUPCR_WKUPC6     PWR_WKUPCR_WKUPC6_Msk            /*!< Clear Wakeup Pin Flag 6 */
#define PWR_WKUPCR_WKUPC5_Pos (4U)
#define PWR_WKUPCR_WKUPC5_Msk (0x1UL << PWR_WKUPCR_WKUPC5_Pos) /*!< 0x00000010 */
#define PWR_WKUPCR_WKUPC5     PWR_WKUPCR_WKUPC5_Msk            /*!< Clear Wakeup Pin Flag 5 */
#define PWR_WKUPCR_WKUPC4_Pos (3U)
#define PWR_WKUPCR_WKUPC4_Msk (0x1UL << PWR_WKUPCR_WKUPC4_Pos) /*!< 0x00000008 */
#define PWR_WKUPCR_WKUPC4     PWR_WKUPCR_WKUPC4_Msk            /*!< Clear Wakeup Pin Flag 4 */
#define PWR_WKUPCR_WKUPC3_Pos (2U)
#define PWR_WKUPCR_WKUPC3_Msk (0x1UL << PWR_WKUPCR_WKUPC3_Pos) /*!< 0x00000004 */
#define PWR_WKUPCR_WKUPC3     PWR_WKUPCR_WKUPC3_Msk            /*!< Clear Wakeup Pin Flag 3 */
#define PWR_WKUPCR_WKUPC2_Pos (1U)
#define PWR_WKUPCR_WKUPC2_Msk (0x1UL << PWR_WKUPCR_WKUPC2_Pos) /*!< 0x00000002 */
#define PWR_WKUPCR_WKUPC2     PWR_WKUPCR_WKUPC2_Msk            /*!< Clear Wakeup Pin Flag 2 */
#define PWR_WKUPCR_WKUPC1_Pos (0U)
#define PWR_WKUPCR_WKUPC1_Msk (0x1UL << PWR_WKUPCR_WKUPC1_Pos) /*!< 0x00000001 */
#define PWR_WKUPCR_WKUPC1     PWR_WKUPCR_WKUPC1_Msk            /*!< Clear Wakeup Pin Flag 1 */

/********************  Bit definition for PWR_WKUPFR register  ****************/
#define PWR_WKUPFR_WKUPF6_Pos (5U)
#define PWR_WKUPFR_WKUPF6_Msk (0x1UL << PWR_WKUPFR_WKUPF6_Pos) /*!< 0x00000020 */
#define PWR_WKUPFR_WKUPF6     PWR_WKUPFR_WKUPF6_Msk            /*!< Wakeup Pin Flag 6 */
#define PWR_WKUPFR_WKUPF5_Pos (4U)
#define PWR_WKUPFR_WKUPF5_Msk (0x1UL << PWR_WKUPFR_WKUPF5_Pos) /*!< 0x00000010 */
#define PWR_WKUPFR_WKUPF5     PWR_WKUPFR_WKUPF5_Msk            /*!< Wakeup Pin Flag 5 */
#define PWR_WKUPFR_WKUPF4_Pos (3U)
#define PWR_WKUPFR_WKUPF4_Msk (0x1UL << PWR_WKUPFR_WKUPF4_Pos) /*!< 0x00000008 */
#define PWR_WKUPFR_WKUPF4     PWR_WKUPFR_WKUPF4_Msk            /*!< Wakeup Pin Flag 4 */
#define PWR_WKUPFR_WKUPF3_Pos (2U)
#define PWR_WKUPFR_WKUPF3_Msk (0x1UL << PWR_WKUPFR_WKUPF3_Pos) /*!< 0x00000004 */
#define PWR_WKUPFR_WKUPF3     PWR_WKUPFR_WKUPF3_Msk            /*!< Wakeup Pin Flag 3 */
#define PWR_WKUPFR_WKUPF2_Pos (1U)
#define PWR_WKUPFR_WKUPF2_Msk (0x1UL << PWR_WKUPFR_WKUPF2_Pos) /*!< 0x00000002 */
#define PWR_WKUPFR_WKUPF2     PWR_WKUPFR_WKUPF2_Msk            /*!< Wakeup Pin Flag 2 */
#define PWR_WKUPFR_WKUPF1_Pos (0U)
#define PWR_WKUPFR_WKUPF1_Msk (0x1UL << PWR_WKUPFR_WKUPF1_Pos) /*!< 0x00000001 */
#define PWR_WKUPFR_WKUPF1     PWR_WKUPFR_WKUPF1_Msk            /*!< Wakeup Pin Flag 1 */

/******************  Bit definition for PWR_WKUPEPR register  *****************/
#define PWR_WKUPEPR_WKUPPUPD6_Pos (26U)
#define PWR_WKUPEPR_WKUPPUPD6_Msk (0x3UL << PWR_WKUPEPR_WKUPPUPD6_Pos) /*!< 0x0C000000 */
#define PWR_WKUPEPR_WKUPPUPD6     PWR_WKUPEPR_WKUPPUPD6_Msk            /*!< Wakeup Pin pull configuration for WKUP6 */
#define PWR_WKUPEPR_WKUPPUPD6_0   (0x1UL << PWR_WKUPEPR_WKUPPUPD6_Pos) /*!< 0x04000000 */
#define PWR_WKUPEPR_WKUPPUPD6_1   (0x2UL << PWR_WKUPEPR_WKUPPUPD6_Pos) /*!< 0x08000000 */
#define PWR_WKUPEPR_WKUPPUPD5_Pos (24U)
#define PWR_WKUPEPR_WKUPPUPD5_Msk (0x3UL << PWR_WKUPEPR_WKUPPUPD5_Pos) /*!< 0x03000000 */
#define PWR_WKUPEPR_WKUPPUPD5     PWR_WKUPEPR_WKUPPUPD5_Msk            /*!< Wakeup Pin pull configuration for WKUP5 */
#define PWR_WKUPEPR_WKUPPUPD5_0   (0x1UL << PWR_WKUPEPR_WKUPPUPD5_Pos) /*!< 0x01000000 */
#define PWR_WKUPEPR_WKUPPUPD5_1   (0x2UL << PWR_WKUPEPR_WKUPPUPD5_Pos) /*!< 0x02000000 */
#define PWR_WKUPEPR_WKUPPUPD4_Pos (22U)
#define PWR_WKUPEPR_WKUPPUPD4_Msk (0x3UL << PWR_WKUPEPR_WKUPPUPD4_Pos) /*!< 0x00C00000 */
#define PWR_WKUPEPR_WKUPPUPD4     PWR_WKUPEPR_WKUPPUPD4_Msk            /*!< Wakeup Pin pull configuration for WKUP4 */
#define PWR_WKUPEPR_WKUPPUPD4_0   (0x1UL << PWR_WKUPEPR_WKUPPUPD4_Pos) /*!< 0x00400000 */
#define PWR_WKUPEPR_WKUPPUPD4_1   (0x2UL << PWR_WKUPEPR_WKUPPUPD4_Pos) /*!< 0x00800000 */
#define PWR_WKUPEPR_WKUPPUPD3_Pos (20U)
#define PWR_WKUPEPR_WKUPPUPD3_Msk (0x3UL << PWR_WKUPEPR_WKUPPUPD3_Pos) /*!< 0x00300000 */
#define PWR_WKUPEPR_WKUPPUPD3     PWR_WKUPEPR_WKUPPUPD3_Msk            /*!< Wakeup Pin pull configuration for WKUP3 */
#define PWR_WKUPEPR_WKUPPUPD3_0   (0x1UL << PWR_WKUPEPR_WKUPPUPD3_Pos) /*!< 0x00100000 */
#define PWR_WKUPEPR_WKUPPUPD3_1   (0x2UL << PWR_WKUPEPR_WKUPPUPD3_Pos) /*!< 0x00200000 */
#define PWR_WKUPEPR_WKUPPUPD2_Pos (18U)
#define PWR_WKUPEPR_WKUPPUPD2_Msk (0x3UL << PWR_WKUPEPR_WKUPPUPD2_Pos) /*!< 0x000C0000 */
#define PWR_WKUPEPR_WKUPPUPD2     PWR_WKUPEPR_WKUPPUPD2_Msk            /*!< Wakeup Pin pull configuration for WKUP2 */
#define PWR_WKUPEPR_WKUPPUPD2_0   (0x1UL << PWR_WKUPEPR_WKUPPUPD2_Pos) /*!< 0x00040000 */
#define PWR_WKUPEPR_WKUPPUPD2_1   (0x2UL << PWR_WKUPEPR_WKUPPUPD2_Pos) /*!< 0x00080000 */
#define PWR_WKUPEPR_WKUPPUPD1_Pos (16U)
#define PWR_WKUPEPR_WKUPPUPD1_Msk (0x3UL << PWR_WKUPEPR_WKUPPUPD1_Pos) /*!< 0x00030000 */
#define PWR_WKUPEPR_WKUPPUPD1     PWR_WKUPEPR_WKUPPUPD1_Msk            /*!< Wakeup Pin pull configuration for WKUP1 */
#define PWR_WKUPEPR_WKUPPUPD1_0   (0x1UL << PWR_WKUPEPR_WKUPPUPD1_Pos) /*!< 0x00010000 */
#define PWR_WKUPEPR_WKUPPUPD1_1   (0x2UL << PWR_WKUPEPR_WKUPPUPD1_Pos) /*!< 0x00020000 */
#define PWR_WKUPEPR_WKUPP6_Pos    (13U)
#define PWR_WKUPEPR_WKUPP6_Msk    (0x1UL << PWR_WKUPEPR_WKUPP6_Pos) /*!< 0x00002000 */
#define PWR_WKUPEPR_WKUPP6        PWR_WKUPEPR_WKUPP6_Msk            /*!< Wakeup Pin Polarity for WKUP6 */
#define PWR_WKUPEPR_WKUPP5_Pos    (12U)
#define PWR_WKUPEPR_WKUPP5_Msk    (0x1UL << PWR_WKUPEPR_WKUPP5_Pos) /*!< 0x00001000 */
#define PWR_WKUPEPR_WKUPP5        PWR_WKUPEPR_WKUPP5_Msk            /*!< Wakeup Pin Polarity for WKUP5 */
#define PWR_WKUPEPR_WKUPP4_Pos    (11U)
#define PWR_WKUPEPR_WKUPP4_Msk    (0x1UL << PWR_WKUPEPR_WKUPP4_Pos) /*!< 0x00000800 */
#define PWR_WKUPEPR_WKUPP4        PWR_WKUPEPR_WKUPP4_Msk            /*!< Wakeup Pin Polarity for WKUP4 */
#define PWR_WKUPEPR_WKUPP3_Pos    (10U)
#define PWR_WKUPEPR_WKUPP3_Msk    (0x1UL << PWR_WKUPEPR_WKUPP3_Pos) /*!< 0x00000400 */
#define PWR_WKUPEPR_WKUPP3        PWR_WKUPEPR_WKUPP3_Msk            /*!< Wakeup Pin Polarity for WKUP3 */
#define PWR_WKUPEPR_WKUPP2_Pos    (9U)
#define PWR_WKUPEPR_WKUPP2_Msk    (0x1UL << PWR_WKUPEPR_WKUPP2_Pos) /*!< 0x00000200 */
#define PWR_WKUPEPR_WKUPP2        PWR_WKUPEPR_WKUPP2_Msk            /*!< Wakeup Pin Polarity for WKUP2 */
#define PWR_WKUPEPR_WKUPP1_Pos    (8U)
#define PWR_WKUPEPR_WKUPP1_Msk    (0x1UL << PWR_WKUPEPR_WKUPP1_Pos) /*!< 0x00000100 */
#define PWR_WKUPEPR_WKUPP1        PWR_WKUPEPR_WKUPP1_Msk            /*!< Wakeup Pin Polarity for WKUP1 */
#define PWR_WKUPEPR_WKUPEN6_Pos   (5U)
#define PWR_WKUPEPR_WKUPEN6_Msk   (0x1UL << PWR_WKUPEPR_WKUPEN6_Pos) /*!< 0x00000020 */
#define PWR_WKUPEPR_WKUPEN6       PWR_WKUPEPR_WKUPEN6_Msk            /*!< Enable Wakeup Pin WKUP6 */
#define PWR_WKUPEPR_WKUPEN5_Pos   (4U)
#define PWR_WKUPEPR_WKUPEN5_Msk   (0x1UL << PWR_WKUPEPR_WKUPEN5_Pos) /*!< 0x00000010 */
#define PWR_WKUPEPR_WKUPEN5       PWR_WKUPEPR_WKUPEN5_Msk            /*!< Enable Wakeup Pin WKUP5 */
#define PWR_WKUPEPR_WKUPEN4_Pos   (3U)
#define PWR_WKUPEPR_WKUPEN4_Msk   (0x1UL << PWR_WKUPEPR_WKUPEN4_Pos) /*!< 0x00000008 */
#define PWR_WKUPEPR_WKUPEN4       PWR_WKUPEPR_WKUPEN4_Msk            /*!< Enable Wakeup Pin WKUP4 */
#define PWR_WKUPEPR_WKUPEN3_Pos   (2U)
#define PWR_WKUPEPR_WKUPEN3_Msk   (0x1UL << PWR_WKUPEPR_WKUPEN3_Pos) /*!< 0x00000004 */
#define PWR_WKUPEPR_WKUPEN3       PWR_WKUPEPR_WKUPEN3_Msk            /*!< Enable Wakeup Pin WKUP3 */
#define PWR_WKUPEPR_WKUPEN2_Pos   (1U)
#define PWR_WKUPEPR_WKUPEN2_Msk   (0x1UL << PWR_WKUPEPR_WKUPEN2_Pos) /*!< 0x00000002 */
#define PWR_WKUPEPR_WKUPEN2       PWR_WKUPEPR_WKUPEN2_Msk            /*!< Enable Wakeup Pin WKUP2 */
#define PWR_WKUPEPR_WKUPEN1_Pos   (0U)
#define PWR_WKUPEPR_WKUPEN1_Msk   (0x1UL << PWR_WKUPEPR_WKUPEN1_Pos) /*!< 0x00000001 */
#define PWR_WKUPEPR_WKUPEN1       PWR_WKUPEPR_WKUPEN1_Msk            /*!< Enable Wakeup Pin WKUP1 */
#define PWR_WKUPEPR_WKUPEN_Pos    (0U)
#define PWR_WKUPEPR_WKUPEN_Msk    (0x3FUL << PWR_WKUPEPR_WKUPEN_Pos) /*!< 0x0000003F */
#define PWR_WKUPEPR_WKUPEN        PWR_WKUPEPR_WKUPEN_Msk             /*!< Enable all Wakeup Pin */

/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/
/*******************************  RCC VERSION  ********************************/
#define RCC_VER_2_0

/********************  Bit definition for RCC_CR register  ********************/
#define RCC_CR_HSION_Pos    (0U)
#define RCC_CR_HSION_Msk    (0x1UL << RCC_CR_HSION_Pos) /*!< 0x00000001 */
#define RCC_CR_HSION        RCC_CR_HSION_Msk            /*!< Internal High Speed clock enable */
#define RCC_CR_HSIKERON_Pos (1U)
#define RCC_CR_HSIKERON_Msk (0x1UL << RCC_CR_HSIKERON_Pos) /*!< 0x00000002 */
#define RCC_CR_HSIKERON     RCC_CR_HSIKERON_Msk            /*!< Internal High Speed clock enable for some IPs Kernel */
#define RCC_CR_HSIRDY_Pos   (2U)
#define RCC_CR_HSIRDY_Msk   (0x1UL << RCC_CR_HSIRDY_Pos) /*!< 0x00000004 */
#define RCC_CR_HSIRDY       RCC_CR_HSIRDY_Msk            /*!< Internal High Speed clock ready flag */
#define RCC_CR_HSIDIV_Pos   (3U)
#define RCC_CR_HSIDIV_Msk   (0x3UL << RCC_CR_HSIDIV_Pos) /*!< 0x00000018 */
#define RCC_CR_HSIDIV       RCC_CR_HSIDIV_Msk            /*!< Internal High Speed clock divider selection */
#define RCC_CR_HSIDIV_1     (0x0UL << RCC_CR_HSIDIV_Pos) /*!< 0x00000000 */
#define RCC_CR_HSIDIV_2     (0x1UL << RCC_CR_HSIDIV_Pos) /*!< 0x00000008 */
#define RCC_CR_HSIDIV_4     (0x2UL << RCC_CR_HSIDIV_Pos) /*!< 0x00000010 */
#define RCC_CR_HSIDIV_8     (0x3UL << RCC_CR_HSIDIV_Pos) /*!< 0x00000018 */

#define RCC_CR_HSIDIVF_Pos  (5U)
#define RCC_CR_HSIDIVF_Msk  (0x1UL << RCC_CR_HSIDIVF_Pos) /*!< 0x00000020 */
#define RCC_CR_HSIDIVF      RCC_CR_HSIDIVF_Msk            /*!< HSI Divider flag */
#define RCC_CR_CSION_Pos    (7U)
#define RCC_CR_CSION_Msk    (0x1UL << RCC_CR_CSION_Pos) /*!< 0x00000080 */
#define RCC_CR_CSION        RCC_CR_CSION_Msk            /*!< The Internal RC 4MHz oscillator clock enable */
#define RCC_CR_CSIRDY_Pos   (8U)
#define RCC_CR_CSIRDY_Msk   (0x1UL << RCC_CR_CSIRDY_Pos) /*!< 0x00000100 */
#define RCC_CR_CSIRDY       RCC_CR_CSIRDY_Msk            /*!< The Internal RC 4MHz oscillator clock ready */
#define RCC_CR_CSIKERON_Pos (9U)
#define RCC_CR_CSIKERON_Msk (0x1UL << RCC_CR_CSIKERON_Pos) /*!< 0x00000200 */
#define RCC_CR_CSIKERON     RCC_CR_CSIKERON_Msk /*!< Internal RC 4MHz oscillator clock enable for some IPs Kernel */
#define RCC_CR_HSI48ON_Pos  (12U)
#define RCC_CR_HSI48ON_Msk  (0x1UL << RCC_CR_HSI48ON_Pos) /*!< 0x00001000 */
#define RCC_CR_HSI48ON      RCC_CR_HSI48ON_Msk            /*!< HSI48 clock enable clock enable  */
#define RCC_CR_HSI48RDY_Pos (13U)
#define RCC_CR_HSI48RDY_Msk (0x1UL << RCC_CR_HSI48RDY_Pos) /*!< 0x00002000 */
#define RCC_CR_HSI48RDY     RCC_CR_HSI48RDY_Msk            /*!< HSI48 clock ready */

