Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define RCC_CR_CPUCKRDY_Pos (14U)
#define RCC_CR_CPUCKRDY_Msk (0x1UL << RCC_CR_CPUCKRDY_Pos) /*!< 0x00004000 */
#define RCC_CR_CPUCKRDY     RCC_CR_CPUCKRDY_Msk            /*!< CPU domain clocks ready flag  */
#define RCC_CR_CDCKRDY_Pos  (15U)
#define RCC_CR_CDCKRDY_Msk  (0x1UL << RCC_CR_CDCKRDY_Pos) /*!< 0x00008000 */
#define RCC_CR_CDCKRDY      RCC_CR_CDCKRDY_Msk            /*!< CD domain clocks ready flag */

#define RCC_CR_HSEON_Pos    (16U)
#define RCC_CR_HSEON_Msk    (0x1UL << RCC_CR_HSEON_Pos) /*!< 0x00010000 */
#define RCC_CR_HSEON        RCC_CR_HSEON_Msk            /*!< External High Speed clock enable */
#define RCC_CR_HSERDY_Pos   (17U)
#define RCC_CR_HSERDY_Msk   (0x1UL << RCC_CR_HSERDY_Pos) /*!< 0x00020000 */
#define RCC_CR_HSERDY       RCC_CR_HSERDY_Msk            /*!< External High Speed clock ready */
#define RCC_CR_HSEBYP_Pos   (18U)
#define RCC_CR_HSEBYP_Msk   (0x1UL << RCC_CR_HSEBYP_Pos) /*!< 0x00040000 */
#define RCC_CR_HSEBYP       RCC_CR_HSEBYP_Msk            /*!< External High Speed clock Bypass */
#define RCC_CR_CSSHSEON_Pos (19U)
#define RCC_CR_CSSHSEON_Msk (0x1UL << RCC_CR_CSSHSEON_Pos) /*!< 0x00080000 */
#define RCC_CR_CSSHSEON     RCC_CR_CSSHSEON_Msk            /*!< HSE Clock security System enable */

#define RCC_CR_HSEEXT_Pos   (20U)
#define RCC_CR_HSEEXT_Msk   (0x1UL << RCC_CR_HSEEXT_Pos) /*!< 0x00080000 */
#define RCC_CR_HSEEXT       RCC_CR_HSEEXT_Msk            /*!< HSE Clock security System enable */

#define RCC_CR_PLL1ON_Pos   (24U)
#define RCC_CR_PLL1ON_Msk   (0x1UL << RCC_CR_PLL1ON_Pos) /*!< 0x01000000 */
#define RCC_CR_PLL1ON       RCC_CR_PLL1ON_Msk            /*!< System PLL1 clock enable */
#define RCC_CR_PLL1RDY_Pos  (25U)
#define RCC_CR_PLL1RDY_Msk  (0x1UL << RCC_CR_PLL1RDY_Pos) /*!< 0x02000000 */
#define RCC_CR_PLL1RDY      RCC_CR_PLL1RDY_Msk            /*!< System PLL1 clock ready */
#define RCC_CR_PLL2ON_Pos   (26U)
#define RCC_CR_PLL2ON_Msk   (0x1UL << RCC_CR_PLL2ON_Pos) /*!< 0x04000000 */
#define RCC_CR_PLL2ON       RCC_CR_PLL2ON_Msk            /*!< System PLL2 clock enable */
#define RCC_CR_PLL2RDY_Pos  (27U)
#define RCC_CR_PLL2RDY_Msk  (0x1UL << RCC_CR_PLL2RDY_Pos) /*!< 0x08000000 */
#define RCC_CR_PLL2RDY      RCC_CR_PLL2RDY_Msk            /*!< System PLL2 clock ready */
#define RCC_CR_PLL3ON_Pos   (28U)
#define RCC_CR_PLL3ON_Msk   (0x1UL << RCC_CR_PLL3ON_Pos) /*!< 0x10000000 */
#define RCC_CR_PLL3ON       RCC_CR_PLL3ON_Msk            /*!< System PLL3 clock enable */
#define RCC_CR_PLL3RDY_Pos  (29U)
#define RCC_CR_PLL3RDY_Msk  (0x1UL << RCC_CR_PLL3RDY_Pos) /*!< 0x20000000 */
#define RCC_CR_PLL3RDY      RCC_CR_PLL3RDY_Msk            /*!< System PLL3 clock ready */

/*Legacy */
#define RCC_CR_PLLON_Pos  (24U)
#define RCC_CR_PLLON_Msk  (0x1UL << RCC_CR_PLLON_Pos) /*!< 0x01000000 */
#define RCC_CR_PLLON      RCC_CR_PLLON_Msk            /*!< System PLL clock enable */
#define RCC_CR_PLLRDY_Pos (25U)
#define RCC_CR_PLLRDY_Msk (0x1UL << RCC_CR_PLLRDY_Pos) /*!< 0x02000000 */
#define RCC_CR_PLLRDY     RCC_CR_PLLRDY_Msk            /*!< System PLL clock ready */

/********************  Bit definition for RCC_HSICFGR register  ***************/
/*!< HSICAL configuration */
#define RCC_HSICFGR_HSICAL_Pos (0U)
#define RCC_HSICFGR_HSICAL_Msk (0xFFFUL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000FFF */
#define RCC_HSICFGR_HSICAL     RCC_HSICFGR_HSICAL_Msk              /*!< HSICAL[11:0] bits */
#define RCC_HSICFGR_HSICAL_0   (0x001UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000001 */
#define RCC_HSICFGR_HSICAL_1   (0x002UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000002 */
#define RCC_HSICFGR_HSICAL_2   (0x004UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000004 */
#define RCC_HSICFGR_HSICAL_3   (0x008UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000008 */
#define RCC_HSICFGR_HSICAL_4   (0x010UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000010 */
#define RCC_HSICFGR_HSICAL_5   (0x020UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000020 */
#define RCC_HSICFGR_HSICAL_6   (0x040UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000040 */
#define RCC_HSICFGR_HSICAL_7   (0x080UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000080 */
#define RCC_HSICFGR_HSICAL_8   (0x100UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000100 */
#define RCC_HSICFGR_HSICAL_9   (0x200UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000200 */
#define RCC_HSICFGR_HSICAL_10  (0x400UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000400 */
#define RCC_HSICFGR_HSICAL_11  (0x800UL << RCC_HSICFGR_HSICAL_Pos) /*!< 0x00000800 */

/*!< HSITRIM configuration */
#define RCC_HSICFGR_HSITRIM_Pos (24U)
#define RCC_HSICFGR_HSITRIM_Msk (0x7FUL << RCC_HSICFGR_HSITRIM_Pos) /*!< 0x7F000000 */
#define RCC_HSICFGR_HSITRIM     RCC_HSICFGR_HSITRIM_Msk             /*!< HSITRIM[6:0] bits */
#define RCC_HSICFGR_HSITRIM_0   (0x01UL << RCC_HSICFGR_HSITRIM_Pos) /*!< 0x01000000 */
#define RCC_HSICFGR_HSITRIM_1   (0x02UL << RCC_HSICFGR_HSITRIM_Pos) /*!< 0x02000000 */
#define RCC_HSICFGR_HSITRIM_2   (0x04UL << RCC_HSICFGR_HSITRIM_Pos) /*!< 0x04000000 */
#define RCC_HSICFGR_HSITRIM_3   (0x08UL << RCC_HSICFGR_HSITRIM_Pos) /*!< 0x08000000 */
#define RCC_HSICFGR_HSITRIM_4   (0x10UL << RCC_HSICFGR_HSITRIM_Pos) /*!< 0x10000000 */
#define RCC_HSICFGR_HSITRIM_5   (0x20UL << RCC_HSICFGR_HSITRIM_Pos) /*!< 0x20000000 */
#define RCC_HSICFGR_HSITRIM_6   (0x40UL << RCC_HSICFGR_HSITRIM_Pos) /*!< 0x40000000 */

/********************  Bit definition for RCC_CRRCR register  *****************/

/*!< HSI48CAL configuration */
#define RCC_CRRCR_HSI48CAL_Pos (0U)
#define RCC_CRRCR_HSI48CAL_Msk (0x3FFUL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x000003FF */
#define RCC_CRRCR_HSI48CAL     RCC_CRRCR_HSI48CAL_Msk              /*!< HSI48CAL[9:0] bits */
#define RCC_CRRCR_HSI48CAL_0   (0x001UL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000001 */
#define RCC_CRRCR_HSI48CAL_1   (0x002UL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000002 */
#define RCC_CRRCR_HSI48CAL_2   (0x004UL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000004 */
#define RCC_CRRCR_HSI48CAL_3   (0x008UL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000008 */
#define RCC_CRRCR_HSI48CAL_4   (0x010UL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000010 */
#define RCC_CRRCR_HSI48CAL_5   (0x020UL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000020 */
#define RCC_CRRCR_HSI48CAL_6   (0x040UL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000040 */
#define RCC_CRRCR_HSI48CAL_7   (0x080UL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000080 */
#define RCC_CRRCR_HSI48CAL_8   (0x100UL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000100 */
#define RCC_CRRCR_HSI48CAL_9   (0x200UL << RCC_CRRCR_HSI48CAL_Pos) /*!< 0x00000200 */

/********************  Bit definition for RCC_CSICFGR register  *****************/
/*!< CSICAL configuration */
#define RCC_CSICFGR_CSICAL_Pos (0U)
#define RCC_CSICFGR_CSICAL_Msk (0xFFUL << RCC_CSICFGR_CSICAL_Pos) /*!< 0x000000FF */
#define RCC_CSICFGR_CSICAL     RCC_CSICFGR_CSICAL_Msk             /*!< CSICAL[7:0] bits */
#define RCC_CSICFGR_CSICAL_0   (0x01UL << RCC_CSICFGR_CSICAL_Pos) /*!< 0x00000001 */
#define RCC_CSICFGR_CSICAL_1   (0x02UL << RCC_CSICFGR_CSICAL_Pos) /*!< 0x00000002 */
#define RCC_CSICFGR_CSICAL_2   (0x04UL << RCC_CSICFGR_CSICAL_Pos) /*!< 0x00000004 */
#define RCC_CSICFGR_CSICAL_3   (0x08UL << RCC_CSICFGR_CSICAL_Pos) /*!< 0x00000008 */
#define RCC_CSICFGR_CSICAL_4   (0x10UL << RCC_CSICFGR_CSICAL_Pos) /*!< 0x00000010 */
#define RCC_CSICFGR_CSICAL_5   (0x20UL << RCC_CSICFGR_CSICAL_Pos) /*!< 0x00000020 */
#define RCC_CSICFGR_CSICAL_6   (0x40UL << RCC_CSICFGR_CSICAL_Pos) /*!< 0x00000040 */
#define RCC_CSICFGR_CSICAL_7   (0x80UL << RCC_CSICFGR_CSICAL_Pos) /*!< 0x00000080 */

