Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*!< CSITRIM configuration */
#define RCC_CSICFGR_CSITRIM_Pos (24U)
#define RCC_CSICFGR_CSITRIM_Msk (0x3FUL << RCC_CSICFGR_CSITRIM_Pos) /*!< 0x3F000000 */
#define RCC_CSICFGR_CSITRIM     RCC_CSICFGR_CSITRIM_Msk             /*!< CSITRIM[5:0] bits */
#define RCC_CSICFGR_CSITRIM_0   (0x01UL << RCC_CSICFGR_CSITRIM_Pos) /*!< 0x01000000 */
#define RCC_CSICFGR_CSITRIM_1   (0x02UL << RCC_CSICFGR_CSITRIM_Pos) /*!< 0x02000000 */
#define RCC_CSICFGR_CSITRIM_2   (0x04UL << RCC_CSICFGR_CSITRIM_Pos) /*!< 0x04000000 */
#define RCC_CSICFGR_CSITRIM_3   (0x08UL << RCC_CSICFGR_CSITRIM_Pos) /*!< 0x08000000 */
#define RCC_CSICFGR_CSITRIM_4   (0x10UL << RCC_CSICFGR_CSITRIM_Pos) /*!< 0x10000000 */
#define RCC_CSICFGR_CSITRIM_5   (0x20UL << RCC_CSICFGR_CSITRIM_Pos) /*!< 0x20000000 */

/********************  Bit definition for RCC_CFGR register  ******************/
/*!< SW configuration */
#define RCC_CFGR_SW_Pos  (0U)
#define RCC_CFGR_SW_Msk  (0x7UL << RCC_CFGR_SW_Pos) /*!< 0x00000007 */
#define RCC_CFGR_SW      RCC_CFGR_SW_Msk            /*!< SW[2:0] bits (System clock Switch) */
#define RCC_CFGR_SW_0    (0x1UL << RCC_CFGR_SW_Pos) /*!< 0x00000001 */
#define RCC_CFGR_SW_1    (0x2UL << RCC_CFGR_SW_Pos) /*!< 0x00000002 */
#define RCC_CFGR_SW_2    (0x4UL << RCC_CFGR_SW_Pos) /*!< 0x00000004 */

#define RCC_CFGR_SW_HSI  (0x00000000UL) /*!< HSI selection as system clock */
#define RCC_CFGR_SW_CSI  (0x00000001UL) /*!< CSI selection as system clock */
#define RCC_CFGR_SW_HSE  (0x00000002UL) /*!< HSE selection as system clock */
#define RCC_CFGR_SW_PLL1 (0x00000003UL) /*!< PLL1 selection as system clock */

/*!< SWS configuration */
#define RCC_CFGR_SWS_Pos         (3U)
#define RCC_CFGR_SWS_Msk         (0x7UL << RCC_CFGR_SWS_Pos) /*!< 0x00000038 */
#define RCC_CFGR_SWS             RCC_CFGR_SWS_Msk            /*!< SWS[2:0] bits (System Clock Switch Status) */
#define RCC_CFGR_SWS_0           (0x1UL << RCC_CFGR_SWS_Pos) /*!< 0x00000008 */
#define RCC_CFGR_SWS_1           (0x2UL << RCC_CFGR_SWS_Pos) /*!< 0x00000010 */
#define RCC_CFGR_SWS_2           (0x4UL << RCC_CFGR_SWS_Pos) /*!< 0x00000020 */

#define RCC_CFGR_SWS_HSI         (0x00000000UL) /*!< HSI used as system clock */
#define RCC_CFGR_SWS_CSI         (0x00000008UL) /*!< CSI used as system clock */
#define RCC_CFGR_SWS_HSE         (0x00000010UL) /*!< HSE used as system clock */
#define RCC_CFGR_SWS_PLL1        (0x00000018UL) /*!< PLL1 used as system clock */

#define RCC_CFGR_STOPWUCK_Pos    (6U)
#define RCC_CFGR_STOPWUCK_Msk    (0x1UL << RCC_CFGR_STOPWUCK_Pos) /*!< 0x00000040 */
#define RCC_CFGR_STOPWUCK        RCC_CFGR_STOPWUCK_Msk /*!< Wake Up from stop and CSS backup clock selection */

#define RCC_CFGR_STOPKERWUCK_Pos (7U)
#define RCC_CFGR_STOPKERWUCK_Msk (0x1UL << RCC_CFGR_STOPKERWUCK_Pos) /*!< 0x00000080 */
#define RCC_CFGR_STOPKERWUCK     RCC_CFGR_STOPKERWUCK_Msk /*!< Kernel Clock Selection after a Wake Up from STOP */

/*!< RTCPRE configuration */
#define RCC_CFGR_RTCPRE_Pos (8U)
#define RCC_CFGR_RTCPRE_Msk (0x3FUL << RCC_CFGR_RTCPRE_Pos)
#define RCC_CFGR_RTCPRE     RCC_CFGR_RTCPRE_Msk             /*!< 0x00003F00 */
#define RCC_CFGR_RTCPRE_0   (0x1UL << RCC_CFGR_RTCPRE_Pos)  /*!< 0x00000100 */
#define RCC_CFGR_RTCPRE_1   (0x2UL << RCC_CFGR_RTCPRE_Pos)  /*!< 0x00000200 */
#define RCC_CFGR_RTCPRE_2   (0x4UL << RCC_CFGR_RTCPRE_Pos)  /*!< 0x00000400 */
#define RCC_CFGR_RTCPRE_3   (0x8UL << RCC_CFGR_RTCPRE_Pos)  /*!< 0x00000800 */
#define RCC_CFGR_RTCPRE_4   (0x10UL << RCC_CFGR_RTCPRE_Pos) /*!< 0x00001000 */
#define RCC_CFGR_RTCPRE_5   (0x20UL << RCC_CFGR_RTCPRE_Pos) /*!< 0x00002000 */

/*!< TIMPRE configuration */
#define RCC_CFGR_TIMPRE_Pos (15U)
#define RCC_CFGR_TIMPRE_Msk (0x1UL << RCC_CFGR_TIMPRE_Pos)
#define RCC_CFGR_TIMPRE     RCC_CFGR_TIMPRE_Msk /*!< 0x00008000 */

/*!< MCO1 configuration */
#define RCC_CFGR_MCO1_Pos    (22U)
#define RCC_CFGR_MCO1_Msk    (0x7UL << RCC_CFGR_MCO1_Pos)
#define RCC_CFGR_MCO1        RCC_CFGR_MCO1_Msk            /*!< 0x01C00000 */
#define RCC_CFGR_MCO1_0      (0x1UL << RCC_CFGR_MCO1_Pos) /*!< 0x00400000 */
#define RCC_CFGR_MCO1_1      (0x2UL << RCC_CFGR_MCO1_Pos) /*!< 0x00800000 */
#define RCC_CFGR_MCO1_2      (0x4UL << RCC_CFGR_MCO1_Pos) /*!< 0x01000000 */

#define RCC_CFGR_MCO1PRE_Pos (18U)
#define RCC_CFGR_MCO1PRE_Msk (0xFUL << RCC_CFGR_MCO1PRE_Pos)
#define RCC_CFGR_MCO1PRE     RCC_CFGR_MCO1PRE_Msk            /*!< 0x003C0000 */
#define RCC_CFGR_MCO1PRE_0   (0x1UL << RCC_CFGR_MCO1PRE_Pos) /*!< 0x00040000 */
#define RCC_CFGR_MCO1PRE_1   (0x2UL << RCC_CFGR_MCO1PRE_Pos) /*!< 0x00080000 */
#define RCC_CFGR_MCO1PRE_2   (0x4UL << RCC_CFGR_MCO1PRE_Pos) /*!< 0x00100000 */
#define RCC_CFGR_MCO1PRE_3   (0x8UL << RCC_CFGR_MCO1PRE_Pos) /*!< 0x00200000 */

#define RCC_CFGR_MCO2PRE_Pos (25U)
#define RCC_CFGR_MCO2PRE_Msk (0xFUL << RCC_CFGR_MCO2PRE_Pos)
#define RCC_CFGR_MCO2PRE     RCC_CFGR_MCO2PRE_Msk            /*!< 0x1E000000 */
#define RCC_CFGR_MCO2PRE_0   (0x1UL << RCC_CFGR_MCO2PRE_Pos) /*!< 0x02000000 */
#define RCC_CFGR_MCO2PRE_1   (0x2UL << RCC_CFGR_MCO2PRE_Pos) /*!< 0x04000000 */
#define RCC_CFGR_MCO2PRE_2   (0x4UL << RCC_CFGR_MCO2PRE_Pos) /*!< 0x08000000 */
#define RCC_CFGR_MCO2PRE_3   (0x8UL << RCC_CFGR_MCO2PRE_Pos) /*!< 0x10000000 */

#define RCC_CFGR_MCO2_Pos    (29U)
#define RCC_CFGR_MCO2_Msk    (0x7UL << RCC_CFGR_MCO2_Pos)
#define RCC_CFGR_MCO2        RCC_CFGR_MCO2_Msk            /*!< 0xE0000000 */
#define RCC_CFGR_MCO2_0      (0x1UL << RCC_CFGR_MCO2_Pos) /*!< 0x20000000 */
#define RCC_CFGR_MCO2_1      (0x2UL << RCC_CFGR_MCO2_Pos) /*!< 0x40000000 */
#define RCC_CFGR_MCO2_2      (0x4UL << RCC_CFGR_MCO2_Pos) /*!< 0x80000000 */

/********************  Bit definition for RCC_D1CFGR register  ******************/
/*!< D1HPRE configuration */
#define RCC_CDCFGR1_HPRE_Pos        (0U)
#define RCC_CDCFGR1_HPRE_Msk        (0xFUL << RCC_CDCFGR1_HPRE_Pos) /*!< 0x0000000F */
#define RCC_CDCFGR1_HPRE            RCC_CDCFGR1_HPRE_Msk            /*!< HPRE[3:0] bits (AHB3 prescaler) */
#define RCC_CDCFGR1_HPRE_0          (0x1UL << RCC_CDCFGR1_HPRE_Pos) /*!< 0x00000001 */
#define RCC_CDCFGR1_HPRE_1          (0x2UL << RCC_CDCFGR1_HPRE_Pos) /*!< 0x00000002 */
#define RCC_CDCFGR1_HPRE_2          (0x4UL << RCC_CDCFGR1_HPRE_Pos) /*!< 0x00000004 */
#define RCC_CDCFGR1_HPRE_3          (0x8UL << RCC_CDCFGR1_HPRE_Pos) /*!< 0x00000008 */

#define RCC_CDCFGR1_HPRE_DIV1       (0U) /*!< AHB3 Clock not divided */
#define RCC_CDCFGR1_HPRE_DIV2_Pos   (3U)
#define RCC_CDCFGR1_HPRE_DIV2_Msk   (0x1UL << RCC_CDCFGR1_HPRE_DIV2_Pos) /*!< 0x00000008 */
#define RCC_CDCFGR1_HPRE_DIV2       RCC_CDCFGR1_HPRE_DIV2_Msk            /*!< AHB3 Clock divided by 2 */
#define RCC_CDCFGR1_HPRE_DIV4_Pos   (0U)
#define RCC_CDCFGR1_HPRE_DIV4_Msk   (0x9UL << RCC_CDCFGR1_HPRE_DIV4_Pos) /*!< 0x00000009 */
#define RCC_CDCFGR1_HPRE_DIV4       RCC_CDCFGR1_HPRE_DIV4_Msk            /*!< AHB3 Clock divided by 4 */
#define RCC_CDCFGR1_HPRE_DIV8_Pos   (1U)
#define RCC_CDCFGR1_HPRE_DIV8_Msk   (0x5UL << RCC_CDCFGR1_HPRE_DIV8_Pos) /*!< 0x0000000A */
#define RCC_CDCFGR1_HPRE_DIV8       RCC_CDCFGR1_HPRE_DIV8_Msk            /*!< AHB3 Clock divided by 8 */
#define RCC_CDCFGR1_HPRE_DIV16_Pos  (0U)
#define RCC_CDCFGR1_HPRE_DIV16_Msk  (0xBUL << RCC_CDCFGR1_HPRE_DIV16_Pos) /*!< 0x0000000B */
#define RCC_CDCFGR1_HPRE_DIV16      RCC_CDCFGR1_HPRE_DIV16_Msk            /*!< AHB3 Clock divided by 16 */
#define RCC_CDCFGR1_HPRE_DIV64_Pos  (2U)
#define RCC_CDCFGR1_HPRE_DIV64_Msk  (0x3UL << RCC_CDCFGR1_HPRE_DIV64_Pos) /*!< 0x0000000C */
#define RCC_CDCFGR1_HPRE_DIV64      RCC_CDCFGR1_HPRE_DIV64_Msk            /*!< AHB3 Clock divided by 64 */
#define RCC_CDCFGR1_HPRE_DIV128_Pos (0U)
#define RCC_CDCFGR1_HPRE_DIV128_Msk (0xDUL << RCC_CDCFGR1_HPRE_DIV128_Pos) /*!< 0x0000000D */
#define RCC_CDCFGR1_HPRE_DIV128     RCC_CDCFGR1_HPRE_DIV128_Msk            /*!< AHB3 Clock divided by 128 */
#define RCC_CDCFGR1_HPRE_DIV256_Pos (1U)
#define RCC_CDCFGR1_HPRE_DIV256_Msk (0x7UL << RCC_CDCFGR1_HPRE_DIV256_Pos) /*!< 0x0000000E */
#define RCC_CDCFGR1_HPRE_DIV256     RCC_CDCFGR1_HPRE_DIV256_Msk            /*!< AHB3 Clock divided by 256 */
#define RCC_CDCFGR1_HPRE_DIV512_Pos (0U)
#define RCC_CDCFGR1_HPRE_DIV512_Msk (0xFUL << RCC_CDCFGR1_HPRE_DIV512_Pos) /*!< 0x0000000F */
#define RCC_CDCFGR1_HPRE_DIV512     RCC_CDCFGR1_HPRE_DIV512_Msk            /*!< AHB3 Clock divided by 512 */

/*!< D1PPRE configuration */
#define RCC_CDCFGR1_CDPPRE_Pos        (4U)
#define RCC_CDCFGR1_CDPPRE_Msk        (0x7UL << RCC_CDCFGR1_CDPPRE_Pos) /*!< 0x00000070 */
#define RCC_CDCFGR1_CDPPRE            RCC_CDCFGR1_CDPPRE_Msk            /*!< CDPRE[2:0] bits (APB3 prescaler) */
#define RCC_CDCFGR1_CDPPRE_0          (0x1UL << RCC_CDCFGR1_CDPPRE_Pos) /*!< 0x00000010 */
#define RCC_CDCFGR1_CDPPRE_1          (0x2UL << RCC_CDCFGR1_CDPPRE_Pos) /*!< 0x00000020 */
#define RCC_CDCFGR1_CDPPRE_2          (0x4UL << RCC_CDCFGR1_CDPPRE_Pos) /*!< 0x00000040 */

#define RCC_CDCFGR1_CDPPRE_DIV1       (0U) /*!< APB3 clock not divided */
#define RCC_CDCFGR1_CDPPRE_DIV2_Pos   (6U)
#define RCC_CDCFGR1_CDPPRE_DIV2_Msk   (0x1UL << RCC_CDCFGR1_CDPPRE_DIV2_Pos) /*!< 0x00000040 */
#define RCC_CDCFGR1_CDPPRE_DIV2       RCC_CDCFGR1_CDPPRE_DIV2_Msk            /*!< APB3 clock divided by 2 */
#define RCC_CDCFGR1_CDPPRE_DIV4_Pos   (4U)
#define RCC_CDCFGR1_CDPPRE_DIV4_Msk   (0x5UL << RCC_CDCFGR1_CDPPRE_DIV4_Pos) /*!< 0x00000050 */
#define RCC_CDCFGR1_CDPPRE_DIV4       RCC_CDCFGR1_CDPPRE_DIV4_Msk            /*!< APB3 clock divided by 4 */
#define RCC_CDCFGR1_CDPPRE_DIV8_Pos   (5U)
#define RCC_CDCFGR1_CDPPRE_DIV8_Msk   (0x3UL << RCC_CDCFGR1_CDPPRE_DIV8_Pos) /*!< 0x00000060 */
#define RCC_CDCFGR1_CDPPRE_DIV8       RCC_CDCFGR1_CDPPRE_DIV8_Msk            /*!< APB3 clock divided by 8 */
#define RCC_CDCFGR1_CDPPRE_DIV16_Pos  (4U)
#define RCC_CDCFGR1_CDPPRE_DIV16_Msk  (0x7UL << RCC_CDCFGR1_CDPPRE_DIV16_Pos) /*!< 0x00000070 */
#define RCC_CDCFGR1_CDPPRE_DIV16      RCC_CDCFGR1_CDPPRE_DIV16_Msk            /*!< APB3 clock divided by 16 */

#define RCC_CDCFGR1_CDCPRE_Pos        (8U)
#define RCC_CDCFGR1_CDCPRE_Msk        (0xFUL << RCC_CDCFGR1_CDCPRE_Pos) /*!< 0x00000F00 */
#define RCC_CDCFGR1_CDCPRE            RCC_CDCFGR1_CDCPRE_Msk /*!< CDCPRE[2:0] bits (Domain 1 Core prescaler) */
#define RCC_CDCFGR1_CDCPRE_0          (0x1UL << RCC_CDCFGR1_CDCPRE_Pos) /*!< 0x00000100 */
#define RCC_CDCFGR1_CDCPRE_1          (0x2UL << RCC_CDCFGR1_CDCPRE_Pos) /*!< 0x00000200 */
#define RCC_CDCFGR1_CDCPRE_2          (0x4UL << RCC_CDCFGR1_CDCPRE_Pos) /*!< 0x00000400 */
#define RCC_CDCFGR1_CDCPRE_3          (0x8UL << RCC_CDCFGR1_CDCPRE_Pos) /*!< 0x00000800 */

#define RCC_CDCFGR1_CDCPRE_DIV1       (0U) /*!< Domain 1 Core clock not divided */
#define RCC_CDCFGR1_CDCPRE_DIV2_Pos   (11U)
#define RCC_CDCFGR1_CDCPRE_DIV2_Msk   (0x1UL << RCC_CDCFGR1_CDCPRE_DIV2_Pos) /*!< 0x00000800 */
#define RCC_CDCFGR1_CDCPRE_DIV2       RCC_CDCFGR1_CDCPRE_DIV2_Msk            /*!< Domain 1 Core clock divided by 2 */
#define RCC_CDCFGR1_CDCPRE_DIV4_Pos   (8U)
#define RCC_CDCFGR1_CDCPRE_DIV4_Msk   (0x9UL << RCC_CDCFGR1_CDCPRE_DIV4_Pos) /*!< 0x00000900 */
#define RCC_CDCFGR1_CDCPRE_DIV4       RCC_CDCFGR1_CDCPRE_DIV4_Msk            /*!< Domain 1 Core clock divided by 4 */
#define RCC_CDCFGR1_CDCPRE_DIV8_Pos   (9U)
#define RCC_CDCFGR1_CDCPRE_DIV8_Msk   (0x5UL << RCC_CDCFGR1_CDCPRE_DIV8_Pos) /*!< 0x00000A00 */
#define RCC_CDCFGR1_CDCPRE_DIV8       RCC_CDCFGR1_CDCPRE_DIV8_Msk            /*!< Domain 1 Core clock divided by 8 */
#define RCC_CDCFGR1_CDCPRE_DIV16_Pos  (8U)
#define RCC_CDCFGR1_CDCPRE_DIV16_Msk  (0xBUL << RCC_CDCFGR1_CDCPRE_DIV16_Pos) /*!< 0x00000B00 */
#define RCC_CDCFGR1_CDCPRE_DIV16      RCC_CDCFGR1_CDCPRE_DIV16_Msk            /*!< Domain 1 Core clock divided by 16 */
#define RCC_CDCFGR1_CDCPRE_DIV64_Pos  (10U)
#define RCC_CDCFGR1_CDCPRE_DIV64_Msk  (0x3UL << RCC_CDCFGR1_CDCPRE_DIV64_Pos) /*!< 0x00000C00 */
#define RCC_CDCFGR1_CDCPRE_DIV64      RCC_CDCFGR1_CDCPRE_DIV64_Msk            /*!< Domain 1 Core clock divided by 64 */
#define RCC_CDCFGR1_CDCPRE_DIV128_Pos (8U)
#define RCC_CDCFGR1_CDCPRE_DIV128_Msk (0xDUL << RCC_CDCFGR1_CDCPRE_DIV128_Pos) /*!< 0x00000D00 */
#define RCC_CDCFGR1_CDCPRE_DIV128     RCC_CDCFGR1_CDCPRE_DIV128_Msk /*!< Domain 1 Core clock divided by 128 */
#define RCC_CDCFGR1_CDCPRE_DIV256_Pos (9U)
#define RCC_CDCFGR1_CDCPRE_DIV256_Msk (0x7UL << RCC_CDCFGR1_CDCPRE_DIV256_Pos) /*!< 0x00000E00 */
#define RCC_CDCFGR1_CDCPRE_DIV256     RCC_CDCFGR1_CDCPRE_DIV256_Msk /*!< Domain 1 Core clock divided by 256 */
#define RCC_CDCFGR1_CDCPRE_DIV512_Pos (8U)
#define RCC_CDCFGR1_CDCPRE_DIV512_Msk (0xFUL << RCC_CDCFGR1_CDCPRE_DIV512_Pos) /*!< 0x00000F00 */
#define RCC_CDCFGR1_CDCPRE_DIV512     RCC_CDCFGR1_CDCPRE_DIV512_Msk /*!< Domain 1 Core clock divided by 512 */

/********************  Bit definition for RCC_CDCFGR2 register  ******************/
/*!< CDPPRE1 configuration */
#define RCC_CDCFGR2_CDPPRE1_Pos       (4U)
#define RCC_CDCFGR2_CDPPRE1_Msk       (0x7UL << RCC_CDCFGR2_CDPPRE1_Pos) /*!< 0x00000070 */
#define RCC_CDCFGR2_CDPPRE1           RCC_CDCFGR2_CDPPRE1_Msk            /*!< D1PPRE1[2:0] bits (APB1 prescaler) */
#define RCC_CDCFGR2_CDPPRE1_0         (0x1UL << RCC_CDCFGR2_CDPPRE1_Pos) /*!< 0x00000010 */
#define RCC_CDCFGR2_CDPPRE1_1         (0x2UL << RCC_CDCFGR2_CDPPRE1_Pos) /*!< 0x00000020 */
#define RCC_CDCFGR2_CDPPRE1_2         (0x4UL << RCC_CDCFGR2_CDPPRE1_Pos) /*!< 0x00000040 */

#define RCC_CDCFGR2_CDPPRE1_DIV1      (0U) /*!< APB1 clock not divided */
#define RCC_CDCFGR2_CDPPRE1_DIV2_Pos  (6U)
#define RCC_CDCFGR2_CDPPRE1_DIV2_Msk  (0x1UL << RCC_CDCFGR2_CDPPRE1_DIV2_Pos) /*!< 0x00000040 */
#define RCC_CDCFGR2_CDPPRE1_DIV2      RCC_CDCFGR2_CDPPRE1_DIV2_Msk            /*!< APB1 clock divided by 2 */
#define RCC_CDCFGR2_CDPPRE1_DIV4_Pos  (4U)
#define RCC_CDCFGR2_CDPPRE1_DIV4_Msk  (0x5UL << RCC_CDCFGR2_CDPPRE1_DIV4_Pos) /*!< 0x00000050 */
#define RCC_CDCFGR2_CDPPRE1_DIV4      RCC_CDCFGR2_CDPPRE1_DIV4_Msk            /*!< APB1 clock divided by 4 */
#define RCC_CDCFGR2_CDPPRE1_DIV8_Pos  (5U)
#define RCC_CDCFGR2_CDPPRE1_DIV8_Msk  (0x3UL << RCC_CDCFGR2_CDPPRE1_DIV8_Pos) /*!< 0x00000060 */
#define RCC_CDCFGR2_CDPPRE1_DIV8      RCC_CDCFGR2_CDPPRE1_DIV8_Msk            /*!< APB1 clock divided by 8 */
#define RCC_CDCFGR2_CDPPRE1_DIV16_Pos (4U)
#define RCC_CDCFGR2_CDPPRE1_DIV16_Msk (0x7UL << RCC_CDCFGR2_CDPPRE1_DIV16_Pos) /*!< 0x00000070 */
#define RCC_CDCFGR2_CDPPRE1_DIV16     RCC_CDCFGR2_CDPPRE1_DIV16_Msk            /*!< APB1 clock divided by 16 */

/*!< CDPPRE2 configuration */
#define RCC_CDCFGR2_CDPPRE2_Pos       (8U)
#define RCC_CDCFGR2_CDPPRE2_Msk       (0x7UL << RCC_CDCFGR2_CDPPRE2_Pos) /*!< 0x00000700 */
#define RCC_CDCFGR2_CDPPRE2           RCC_CDCFGR2_CDPPRE2_Msk            /*!< CDPPRE2[2:0] bits (APB2 prescaler) */
#define RCC_CDCFGR2_CDPPRE2_0         (0x1UL << RCC_CDCFGR2_CDPPRE2_Pos) /*!< 0x00000100 */
#define RCC_CDCFGR2_CDPPRE2_1         (0x2UL << RCC_CDCFGR2_CDPPRE2_Pos) /*!< 0x00000200 */
#define RCC_CDCFGR2_CDPPRE2_2         (0x4UL << RCC_CDCFGR2_CDPPRE2_Pos) /*!< 0x00000400 */

#define RCC_CDCFGR2_CDPPRE2_DIV1      (0U) /*!< APB2 clock not divided */
#define RCC_CDCFGR2_CDPPRE2_DIV2_Pos  (10U)
#define RCC_CDCFGR2_CDPPRE2_DIV2_Msk  (0x1UL << RCC_CDCFGR2_CDPPRE2_DIV2_Pos) /*!< 0x00000400 */
#define RCC_CDCFGR2_CDPPRE2_DIV2      RCC_CDCFGR2_CDPPRE2_DIV2_Msk            /*!< APB2 clock divided by 2 */
#define RCC_CDCFGR2_CDPPRE2_DIV4_Pos  (8U)
#define RCC_CDCFGR2_CDPPRE2_DIV4_Msk  (0x5UL << RCC_CDCFGR2_CDPPRE2_DIV4_Pos) /*!< 0x00000500 */
#define RCC_CDCFGR2_CDPPRE2_DIV4      RCC_CDCFGR2_CDPPRE2_DIV4_Msk            /*!< APB2 clock divided by 4 */
#define RCC_CDCFGR2_CDPPRE2_DIV8_Pos  (9U)
#define RCC_CDCFGR2_CDPPRE2_DIV8_Msk  (0x3UL << RCC_CDCFGR2_CDPPRE2_DIV8_Pos) /*!< 0x00000600 */
#define RCC_CDCFGR2_CDPPRE2_DIV8      RCC_CDCFGR2_CDPPRE2_DIV8_Msk            /*!< APB2 clock divided by 8 */
#define RCC_CDCFGR2_CDPPRE2_DIV16_Pos (8U)
#define RCC_CDCFGR2_CDPPRE2_DIV16_Msk (0x7UL << RCC_CDCFGR2_CDPPRE2_DIV16_Pos) /*!< 0x00000700 */
#define RCC_CDCFGR2_CDPPRE2_DIV16     RCC_CDCFGR2_CDPPRE2_DIV16_Msk            /*!< APB2 clock divided by 16 */

/********************  Bit definition for RCC_SRDCFGR register  ******************/
/*!< SRDPPRE configuration */
#define RCC_SRDCFGR_SRDPPRE_Pos       (4U)
#define RCC_SRDCFGR_SRDPPRE_Msk       (0x7UL << RCC_SRDCFGR_SRDPPRE_Pos) /*!< 0x00000070 */
#define RCC_SRDCFGR_SRDPPRE           RCC_SRDCFGR_SRDPPRE_Msk            /*!< SRDPPRE1[2:0] bits (APB4 prescaler) */
#define RCC_SRDCFGR_SRDPPRE_0         (0x1UL << RCC_SRDCFGR_SRDPPRE_Pos) /*!< 0x00000010 */
#define RCC_SRDCFGR_SRDPPRE_1         (0x2UL << RCC_SRDCFGR_SRDPPRE_Pos) /*!< 0x00000020 */
#define RCC_SRDCFGR_SRDPPRE_2         (0x4UL << RCC_SRDCFGR_SRDPPRE_Pos) /*!< 0x00000040 */

#define RCC_SRDCFGR_SRDPPRE_DIV1      (0U) /*!< APB4 clock not divided */
#define RCC_SRDCFGR_SRDPPRE_DIV2_Pos  (6U)
#define RCC_SRDCFGR_SRDPPRE_DIV2_Msk  (0x1UL << RCC_SRDCFGR_SRDPPRE_DIV2_Pos) /*!< 0x00000040 */
#define RCC_SRDCFGR_SRDPPRE_DIV2      RCC_SRDCFGR_SRDPPRE_DIV2_Msk            /*!< APB4 clock divided by 2 */
#define RCC_SRDCFGR_SRDPPRE_DIV4_Pos  (4U)
#define RCC_SRDCFGR_SRDPPRE_DIV4_Msk  (0x5UL << RCC_SRDCFGR_SRDPPRE_DIV4_Pos) /*!< 0x00000050 */
#define RCC_SRDCFGR_SRDPPRE_DIV4      RCC_SRDCFGR_SRDPPRE_DIV4_Msk            /*!< APB4 clock divided by 4 */
#define RCC_SRDCFGR_SRDPPRE_DIV8_Pos  (5U)
#define RCC_SRDCFGR_SRDPPRE_DIV8_Msk  (0x3UL << RCC_SRDCFGR_SRDPPRE_DIV8_Pos) /*!< 0x00000060 */
#define RCC_SRDCFGR_SRDPPRE_DIV8      RCC_SRDCFGR_SRDPPRE_DIV8_Msk            /*!< APB4 clock divided by 8 */
#define RCC_SRDCFGR_SRDPPRE_DIV16_Pos (4U)
#define RCC_SRDCFGR_SRDPPRE_DIV16_Msk (0x7UL << RCC_SRDCFGR_SRDPPRE_DIV16_Pos) /*!< 0x00000070 */
#define RCC_SRDCFGR_SRDPPRE_DIV16     RCC_SRDCFGR_SRDPPRE_DIV16_Msk            /*!< APB4 clock divided by 16 */

/********************  Bit definition for RCC_PLLCKSELR register  *************/

#define RCC_PLLCKSELR_PLLSRC_Pos      (0U)
#define RCC_PLLCKSELR_PLLSRC_Msk      (0x3UL << RCC_PLLCKSELR_PLLSRC_Pos) /*!< 0x00000003 */
#define RCC_PLLCKSELR_PLLSRC          RCC_PLLCKSELR_PLLSRC_Msk

