Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bit definition for RCC_PLL2DIVR register  ***************/
#define RCC_PLL2DIVR_N2_Pos (0U)
#define RCC_PLL2DIVR_N2_Msk (0x1FFUL << RCC_PLL2DIVR_N2_Pos) /*!< 0x000001FF */
#define RCC_PLL2DIVR_N2     RCC_PLL2DIVR_N2_Msk
#define RCC_PLL2DIVR_P2_Pos (9U)
#define RCC_PLL2DIVR_P2_Msk (0x7FUL << RCC_PLL2DIVR_P2_Pos) /*!< 0x0000FE00 */
#define RCC_PLL2DIVR_P2     RCC_PLL2DIVR_P2_Msk
#define RCC_PLL2DIVR_Q2_Pos (16U)
#define RCC_PLL2DIVR_Q2_Msk (0x7FUL << RCC_PLL2DIVR_Q2_Pos) /*!< 0x007F0000 */
#define RCC_PLL2DIVR_Q2     RCC_PLL2DIVR_Q2_Msk
#define RCC_PLL2DIVR_R2_Pos (24U)
#define RCC_PLL2DIVR_R2_Msk (0x7FUL << RCC_PLL2DIVR_R2_Pos) /*!< 0x7F000000 */
#define RCC_PLL2DIVR_R2     RCC_PLL2DIVR_R2_Msk

/********************  Bit definition for RCC_PLL2FRACR register  ***************/
#define RCC_PLL2FRACR_FRACN2_Pos (3U)
#define RCC_PLL2FRACR_FRACN2_Msk (0x1FFFUL << RCC_PLL2FRACR_FRACN2_Pos) /*!< 0x0000FFF8 */
#define RCC_PLL2FRACR_FRACN2     RCC_PLL2FRACR_FRACN2_Msk

/********************  Bit definition for RCC_PLL3DIVR register  ***************/
#define RCC_PLL3DIVR_N3_Pos (0U)
#define RCC_PLL3DIVR_N3_Msk (0x1FFUL << RCC_PLL3DIVR_N3_Pos) /*!< 0x000001FF */
#define RCC_PLL3DIVR_N3     RCC_PLL3DIVR_N3_Msk
#define RCC_PLL3DIVR_P3_Pos (9U)
#define RCC_PLL3DIVR_P3_Msk (0x7FUL << RCC_PLL3DIVR_P3_Pos) /*!< 0x0000FE00 */
#define RCC_PLL3DIVR_P3     RCC_PLL3DIVR_P3_Msk
#define RCC_PLL3DIVR_Q3_Pos (16U)
#define RCC_PLL3DIVR_Q3_Msk (0x7FUL << RCC_PLL3DIVR_Q3_Pos) /*!< 0x007F0000 */
#define RCC_PLL3DIVR_Q3     RCC_PLL3DIVR_Q3_Msk
#define RCC_PLL3DIVR_R3_Pos (24U)
#define RCC_PLL3DIVR_R3_Msk (0x7FUL << RCC_PLL3DIVR_R3_Pos) /*!< 0x7F000000 */
#define RCC_PLL3DIVR_R3     RCC_PLL3DIVR_R3_Msk

/********************  Bit definition for RCC_PLL3FRACR register  ***************/
#define RCC_PLL3FRACR_FRACN3_Pos (3U)
#define RCC_PLL3FRACR_FRACN3_Msk (0x1FFFUL << RCC_PLL3FRACR_FRACN3_Pos) /*!< 0x0000FFF8 */
#define RCC_PLL3FRACR_FRACN3     RCC_PLL3FRACR_FRACN3_Msk

/********************  Bit definition for RCC_CDCCIPR register  ***************/
#define RCC_CDCCIPR_FMCSEL_Pos     (0U)
#define RCC_CDCCIPR_FMCSEL_Msk     (0x3UL << RCC_CDCCIPR_FMCSEL_Pos) /*!< 0x00000003 */
#define RCC_CDCCIPR_FMCSEL         RCC_CDCCIPR_FMCSEL_Msk
#define RCC_CDCCIPR_FMCSEL_0       (0x1UL << RCC_CDCCIPR_FMCSEL_Pos) /*!< 0x00000001 */
#define RCC_CDCCIPR_FMCSEL_1       (0x2UL << RCC_CDCCIPR_FMCSEL_Pos) /*!< 0x00000002 */
#define RCC_CDCCIPR_OCTOSPISEL_Pos (4U)
#define RCC_CDCCIPR_OCTOSPISEL_Msk (0x3UL << RCC_CDCCIPR_OCTOSPISEL_Pos) /*!< 0x00000030 */
#define RCC_CDCCIPR_OCTOSPISEL     RCC_CDCCIPR_OCTOSPISEL_Msk
#define RCC_CDCCIPR_OCTOSPISEL_0   (0x1UL << RCC_CDCCIPR_OCTOSPISEL_Pos) /*!< 0x00000010 */
#define RCC_CDCCIPR_OCTOSPISEL_1   (0x2UL << RCC_CDCCIPR_OCTOSPISEL_Pos) /*!< 0x00000020 */
#define RCC_CDCCIPR_SDMMCSEL_Pos   (16U)
#define RCC_CDCCIPR_SDMMCSEL_Msk   (0x1UL << RCC_CDCCIPR_SDMMCSEL_Pos) /*!< 0x00010000 */
#define RCC_CDCCIPR_SDMMCSEL       RCC_CDCCIPR_SDMMCSEL_Msk
#define RCC_CDCCIPR_CKPERSEL_Pos   (28U)
#define RCC_CDCCIPR_CKPERSEL_Msk   (0x3UL << RCC_CDCCIPR_CKPERSEL_Pos) /*!< 0x30000000 */
#define RCC_CDCCIPR_CKPERSEL       RCC_CDCCIPR_CKPERSEL_Msk
#define RCC_CDCCIPR_CKPERSEL_0     (0x1UL << RCC_CDCCIPR_CKPERSEL_Pos) /*!< 0x10000000 */
#define RCC_CDCCIPR_CKPERSEL_1     (0x2UL << RCC_CDCCIPR_CKPERSEL_Pos) /*!< 0x20000000 */

/********************  Bit definition for RCC_CDCCIP1R register  ***************/
#define RCC_CDCCIP1R_SAI1SEL_Pos   (0U)
#define RCC_CDCCIP1R_SAI1SEL_Msk   (0x7UL << RCC_CDCCIP1R_SAI1SEL_Pos) /*!< 0x00000007 */
#define RCC_CDCCIP1R_SAI1SEL       RCC_CDCCIP1R_SAI1SEL_Msk
#define RCC_CDCCIP1R_SAI1SEL_0     (0x1UL << RCC_CDCCIP1R_SAI1SEL_Pos) /*!< 0x00000001 */
#define RCC_CDCCIP1R_SAI1SEL_1     (0x2UL << RCC_CDCCIP1R_SAI1SEL_Pos) /*!< 0x00000002 */
#define RCC_CDCCIP1R_SAI1SEL_2     (0x4UL << RCC_CDCCIP1R_SAI1SEL_Pos) /*!< 0x00000004 */

#define RCC_CDCCIP1R_SAI2ASEL_Pos  (6U)
#define RCC_CDCCIP1R_SAI2ASEL_Msk  (0x7UL << RCC_CDCCIP1R_SAI2ASEL_Pos) /*!< 0x000001C0 */
#define RCC_CDCCIP1R_SAI2ASEL      RCC_CDCCIP1R_SAI2ASEL_Msk
#define RCC_CDCCIP1R_SAI2ASEL_0    (0x1UL << RCC_CDCCIP1R_SAI2ASEL_Pos) /*!< 0x00000040 */
#define RCC_CDCCIP1R_SAI2ASEL_1    (0x2UL << RCC_CDCCIP1R_SAI2ASEL_Pos) /*!< 0x00000080 */
#define RCC_CDCCIP1R_SAI2ASEL_2    (0x4UL << RCC_CDCCIP1R_SAI2ASEL_Pos) /*!< 0x00000100 */

#define RCC_CDCCIP1R_SAI2BSEL_Pos  (9U)
#define RCC_CDCCIP1R_SAI2BSEL_Msk  (0x7UL << RCC_CDCCIP1R_SAI2BSEL_Pos) /*!< 0x00000E00 */
#define RCC_CDCCIP1R_SAI2BSEL      RCC_CDCCIP1R_SAI2BSEL_Msk
#define RCC_CDCCIP1R_SAI2BSEL_0    (0x1UL << RCC_CDCCIP1R_SAI2BSEL_Pos) /*!< 0x00000200 */
#define RCC_CDCCIP1R_SAI2BSEL_1    (0x2UL << RCC_CDCCIP1R_SAI2BSEL_Pos) /*!< 0x00000400 */
#define RCC_CDCCIP1R_SAI2BSEL_2    (0x4UL << RCC_CDCCIP1R_SAI2BSEL_Pos) /*!< 0x00000800 */

#define RCC_CDCCIP1R_SPI123SEL_Pos (12U)
#define RCC_CDCCIP1R_SPI123SEL_Msk (0x7UL << RCC_CDCCIP1R_SPI123SEL_Pos) /*!< 0x00007000 */
#define RCC_CDCCIP1R_SPI123SEL     RCC_CDCCIP1R_SPI123SEL_Msk
#define RCC_CDCCIP1R_SPI123SEL_0   (0x1UL << RCC_CDCCIP1R_SPI123SEL_Pos) /*!< 0x00001000 */
#define RCC_CDCCIP1R_SPI123SEL_1   (0x2UL << RCC_CDCCIP1R_SPI123SEL_Pos) /*!< 0x00002000 */
#define RCC_CDCCIP1R_SPI123SEL_2   (0x4UL << RCC_CDCCIP1R_SPI123SEL_Pos) /*!< 0x00004000 */

#define RCC_CDCCIP1R_SPI45SEL_Pos  (16U)
#define RCC_CDCCIP1R_SPI45SEL_Msk  (0x7UL << RCC_CDCCIP1R_SPI45SEL_Pos) /*!< 0x00070000 */
#define RCC_CDCCIP1R_SPI45SEL      RCC_CDCCIP1R_SPI45SEL_Msk
#define RCC_CDCCIP1R_SPI45SEL_0    (0x1UL << RCC_CDCCIP1R_SPI45SEL_Pos) /*!< 0x00010000 */
#define RCC_CDCCIP1R_SPI45SEL_1    (0x2UL << RCC_CDCCIP1R_SPI45SEL_Pos) /*!< 0x00020000 */
#define RCC_CDCCIP1R_SPI45SEL_2    (0x4UL << RCC_CDCCIP1R_SPI45SEL_Pos) /*!< 0x00040000 */

#define RCC_CDCCIP1R_SPDIFSEL_Pos  (20U)
#define RCC_CDCCIP1R_SPDIFSEL_Msk  (0x3UL << RCC_CDCCIP1R_SPDIFSEL_Pos) /*!< 0x00300000 */
#define RCC_CDCCIP1R_SPDIFSEL      RCC_CDCCIP1R_SPDIFSEL_Msk
#define RCC_CDCCIP1R_SPDIFSEL_0    (0x1UL << RCC_CDCCIP1R_SPDIFSEL_Pos) /*!< 0x00100000 */
#define RCC_CDCCIP1R_SPDIFSEL_1    (0x2UL << RCC_CDCCIP1R_SPDIFSEL_Pos) /*!< 0x00200000 */

#define RCC_CDCCIP1R_DFSDM1SEL_Pos (24U)
#define RCC_CDCCIP1R_DFSDM1SEL_Msk (0x1UL << RCC_CDCCIP1R_DFSDM1SEL_Pos) /*!< 0x01000000 */
#define RCC_CDCCIP1R_DFSDM1SEL     RCC_CDCCIP1R_DFSDM1SEL_Msk

#define RCC_CDCCIP1R_FDCANSEL_Pos  (28U)
#define RCC_CDCCIP1R_FDCANSEL_Msk  (0x3UL << RCC_CDCCIP1R_FDCANSEL_Pos) /*!< 0x30000000 */
#define RCC_CDCCIP1R_FDCANSEL      RCC_CDCCIP1R_FDCANSEL_Msk
#define RCC_CDCCIP1R_FDCANSEL_0    (0x1UL << RCC_CDCCIP1R_FDCANSEL_Pos) /*!< 0x10000000 */
#define RCC_CDCCIP1R_FDCANSEL_1    (0x2UL << RCC_CDCCIP1R_FDCANSEL_Pos) /*!< 0x20000000 */

