Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define RCC_CDCCIP1R_SWPSEL_Pos    (31U)
#define RCC_CDCCIP1R_SWPSEL_Msk    (0x1UL << RCC_CDCCIP1R_SWPSEL_Pos) /*!< 0x80000000 */
#define RCC_CDCCIP1R_SWPSEL        RCC_CDCCIP1R_SWPSEL_Msk

/********************  Bit definition for RCC_CDCCIP2R register  ***************/
#define RCC_CDCCIP2R_USART234578SEL_Pos (0U)
#define RCC_CDCCIP2R_USART234578SEL_Msk (0x7UL << RCC_CDCCIP2R_USART234578SEL_Pos) /*!< 0x00000007 */
#define RCC_CDCCIP2R_USART234578SEL     RCC_CDCCIP2R_USART234578SEL_Msk
#define RCC_CDCCIP2R_USART234578SEL_0   (0x1UL << RCC_CDCCIP2R_USART234578SEL_Pos) /*!< 0x00000001 */
#define RCC_CDCCIP2R_USART234578SEL_1   (0x2UL << RCC_CDCCIP2R_USART234578SEL_Pos) /*!< 0x00000002 */
#define RCC_CDCCIP2R_USART234578SEL_2   (0x4UL << RCC_CDCCIP2R_USART234578SEL_Pos) /*!< 0x00000004 */

#define RCC_CDCCIP2R_USART16910SEL_Pos  (3U)
#define RCC_CDCCIP2R_USART16910SEL_Msk  (0x7UL << RCC_CDCCIP2R_USART16910SEL_Pos) /*!< 0x00000038 */
#define RCC_CDCCIP2R_USART16910SEL      RCC_CDCCIP2R_USART16910SEL_Msk
#define RCC_CDCCIP2R_USART16910SEL_0    (0x1UL << RCC_CDCCIP2R_USART16910SEL_Pos) /*!< 0x00000008 */
#define RCC_CDCCIP2R_USART16910SEL_1    (0x2UL << RCC_CDCCIP2R_USART16910SEL_Pos) /*!< 0x00000010 */
#define RCC_CDCCIP2R_USART16910SEL_2    (0x4UL << RCC_CDCCIP2R_USART16910SEL_Pos) /*!< 0x00000020 */

#define RCC_CDCCIP2R_RNGSEL_Pos         (8U)
#define RCC_CDCCIP2R_RNGSEL_Msk         (0x3UL << RCC_CDCCIP2R_RNGSEL_Pos) /*!< 0x00000300 */
#define RCC_CDCCIP2R_RNGSEL             RCC_CDCCIP2R_RNGSEL_Msk
#define RCC_CDCCIP2R_RNGSEL_0           (0x1UL << RCC_CDCCIP2R_RNGSEL_Pos) /*!< 0x00000100 */
#define RCC_CDCCIP2R_RNGSEL_1           (0x2UL << RCC_CDCCIP2R_RNGSEL_Pos) /*!< 0x00000200 */

#define RCC_CDCCIP2R_I2C123SEL_Pos      (12U)
#define RCC_CDCCIP2R_I2C123SEL_Msk      (0x3UL << RCC_CDCCIP2R_I2C123SEL_Pos) /*!< 0x00003000 */
#define RCC_CDCCIP2R_I2C123SEL          RCC_CDCCIP2R_I2C123SEL_Msk
#define RCC_CDCCIP2R_I2C123SEL_0        (0x1UL << RCC_CDCCIP2R_I2C123SEL_Pos) /*!< 0x00001000 */
#define RCC_CDCCIP2R_I2C123SEL_1        (0x2UL << RCC_CDCCIP2R_I2C123SEL_Pos) /*!< 0x00002000 */

#define RCC_CDCCIP2R_USBSEL_Pos         (20U)
#define RCC_CDCCIP2R_USBSEL_Msk         (0x3UL << RCC_CDCCIP2R_USBSEL_Pos) /*!< 0x00300000 */
#define RCC_CDCCIP2R_USBSEL             RCC_CDCCIP2R_USBSEL_Msk
#define RCC_CDCCIP2R_USBSEL_0           (0x1UL << RCC_CDCCIP2R_USBSEL_Pos) /*!< 0x00100000 */
#define RCC_CDCCIP2R_USBSEL_1           (0x2UL << RCC_CDCCIP2R_USBSEL_Pos) /*!< 0x00200000 */

#define RCC_CDCCIP2R_CECSEL_Pos         (22U)
#define RCC_CDCCIP2R_CECSEL_Msk         (0x3UL << RCC_CDCCIP2R_CECSEL_Pos) /*!< 0x00C00000 */
#define RCC_CDCCIP2R_CECSEL             RCC_CDCCIP2R_CECSEL_Msk
#define RCC_CDCCIP2R_CECSEL_0           (0x1UL << RCC_CDCCIP2R_CECSEL_Pos) /*!< 0x00400000 */
#define RCC_CDCCIP2R_CECSEL_1           (0x2UL << RCC_CDCCIP2R_CECSEL_Pos) /*!< 0x00800000 */

#define RCC_CDCCIP2R_LPTIM1SEL_Pos      (28U)
#define RCC_CDCCIP2R_LPTIM1SEL_Msk      (0x7UL << RCC_CDCCIP2R_LPTIM1SEL_Pos) /*!< 0x70000000 */
#define RCC_CDCCIP2R_LPTIM1SEL          RCC_CDCCIP2R_LPTIM1SEL_Msk
#define RCC_CDCCIP2R_LPTIM1SEL_0        (0x1UL << RCC_CDCCIP2R_LPTIM1SEL_Pos) /*!< 0x10000000 */
#define RCC_CDCCIP2R_LPTIM1SEL_1        (0x2UL << RCC_CDCCIP2R_LPTIM1SEL_Pos) /*!< 0x20000000 */
#define RCC_CDCCIP2R_LPTIM1SEL_2        (0x4UL << RCC_CDCCIP2R_LPTIM1SEL_Pos) /*!< 0x40000000 */

/********************  Bit definition for RCC_SRDCCIPR register  ***************/
#define RCC_SRDCCIPR_LPUART1SEL_Pos (0U)
#define RCC_SRDCCIPR_LPUART1SEL_Msk (0x7UL << RCC_SRDCCIPR_LPUART1SEL_Pos) /*!< 0x00000007 */
#define RCC_SRDCCIPR_LPUART1SEL     RCC_SRDCCIPR_LPUART1SEL_Msk
#define RCC_SRDCCIPR_LPUART1SEL_0   (0x1UL << RCC_SRDCCIPR_LPUART1SEL_Pos) /*!< 0x00000001 */
#define RCC_SRDCCIPR_LPUART1SEL_1   (0x2UL << RCC_SRDCCIPR_LPUART1SEL_Pos) /*!< 0x00000002 */
#define RCC_SRDCCIPR_LPUART1SEL_2   (0x4UL << RCC_SRDCCIPR_LPUART1SEL_Pos) /*!< 0x00000004 */

#define RCC_SRDCCIPR_I2C4SEL_Pos    (8U)
#define RCC_SRDCCIPR_I2C4SEL_Msk    (0x3UL << RCC_SRDCCIPR_I2C4SEL_Pos) /*!< 0x00000300 */
#define RCC_SRDCCIPR_I2C4SEL        RCC_SRDCCIPR_I2C4SEL_Msk
#define RCC_SRDCCIPR_I2C4SEL_0      (0x1UL << RCC_SRDCCIPR_I2C4SEL_Pos) /*!< 0x00000100 */
#define RCC_SRDCCIPR_I2C4SEL_1      (0x2UL << RCC_SRDCCIPR_I2C4SEL_Pos) /*!< 0x00000200 */

#define RCC_SRDCCIPR_LPTIM2SEL_Pos  (10U)
#define RCC_SRDCCIPR_LPTIM2SEL_Msk  (0x7UL << RCC_SRDCCIPR_LPTIM2SEL_Pos) /*!< 0x00001C00 */
#define RCC_SRDCCIPR_LPTIM2SEL      RCC_SRDCCIPR_LPTIM2SEL_Msk
#define RCC_SRDCCIPR_LPTIM2SEL_0    (0x1UL << RCC_SRDCCIPR_LPTIM2SEL_Pos) /*!< 0x00000400 */
#define RCC_SRDCCIPR_LPTIM2SEL_1    (0x2UL << RCC_SRDCCIPR_LPTIM2SEL_Pos) /*!< 0x00000800 */
#define RCC_SRDCCIPR_LPTIM2SEL_2    (0x4UL << RCC_SRDCCIPR_LPTIM2SEL_Pos) /*!< 0x00001000 */

#define RCC_SRDCCIPR_LPTIM3SEL_Pos  (13U)
#define RCC_SRDCCIPR_LPTIM3SEL_Msk  (0x7UL << RCC_SRDCCIPR_LPTIM3SEL_Pos) /*!< 0x0000E000 */
#define RCC_SRDCCIPR_LPTIM3SEL      RCC_SRDCCIPR_LPTIM3SEL_Msk
#define RCC_SRDCCIPR_LPTIM3SEL_0    (0x1UL << RCC_SRDCCIPR_LPTIM3SEL_Pos) /*!< 0x00002000 */
#define RCC_SRDCCIPR_LPTIM3SEL_1    (0x2UL << RCC_SRDCCIPR_LPTIM3SEL_Pos) /*!< 0x00004000 */
#define RCC_SRDCCIPR_LPTIM3SEL_2    (0x4UL << RCC_SRDCCIPR_LPTIM3SEL_Pos) /*!< 0x00008000 */

#define RCC_SRDCCIPR_ADCSEL_Pos     (16U)
#define RCC_SRDCCIPR_ADCSEL_Msk     (0x3UL << RCC_SRDCCIPR_ADCSEL_Pos) /*!< 0x00030000 */
#define RCC_SRDCCIPR_ADCSEL         RCC_SRDCCIPR_ADCSEL_Msk
#define RCC_SRDCCIPR_ADCSEL_0       (0x1UL << RCC_SRDCCIPR_ADCSEL_Pos) /*!< 0x00010000 */
#define RCC_SRDCCIPR_ADCSEL_1       (0x2UL << RCC_SRDCCIPR_ADCSEL_Pos) /*!< 0x00020000 */

#define RCC_SRDCCIPR_DFSDM2SEL_Pos  (27U)
#define RCC_SRDCCIPR_DFSDM2SEL_Msk  (0x1UL << RCC_SRDCCIPR_DFSDM2SEL_Pos) /*!< 0x08000000 */
#define RCC_SRDCCIPR_DFSDM2SEL      RCC_SRDCCIPR_DFSDM2SEL_Msk

#define RCC_SRDCCIPR_SPI6SEL_Pos    (28U)
#define RCC_SRDCCIPR_SPI6SEL_Msk    (0x7UL << RCC_SRDCCIPR_SPI6SEL_Pos) /*!< 0x70000000 */
#define RCC_SRDCCIPR_SPI6SEL        RCC_SRDCCIPR_SPI6SEL_Msk
#define RCC_SRDCCIPR_SPI6SEL_0      (0x1UL << RCC_SRDCCIPR_SPI6SEL_Pos) /*!< 0x10000000 */
#define RCC_SRDCCIPR_SPI6SEL_1      (0x2UL << RCC_SRDCCIPR_SPI6SEL_Pos) /*!< 0x20000000 */
#define RCC_SRDCCIPR_SPI6SEL_2      (0x4UL << RCC_SRDCCIPR_SPI6SEL_Pos) /*!< 0x40000000 */

/********************  Bit definition for RCC_CIER register  ******************/
#define RCC_CIER_LSIRDYIE_Pos   (0U)
#define RCC_CIER_LSIRDYIE_Msk   (0x1UL << RCC_CIER_LSIRDYIE_Pos) /*!< 0x00000001 */
#define RCC_CIER_LSIRDYIE       RCC_CIER_LSIRDYIE_Msk
#define RCC_CIER_LSERDYIE_Pos   (1U)
#define RCC_CIER_LSERDYIE_Msk   (0x1UL << RCC_CIER_LSERDYIE_Pos) /*!< 0x00000002 */
#define RCC_CIER_LSERDYIE       RCC_CIER_LSERDYIE_Msk
#define RCC_CIER_HSIRDYIE_Pos   (2U)
#define RCC_CIER_HSIRDYIE_Msk   (0x1UL << RCC_CIER_HSIRDYIE_Pos) /*!< 0x00000004 */
#define RCC_CIER_HSIRDYIE       RCC_CIER_HSIRDYIE_Msk
#define RCC_CIER_HSERDYIE_Pos   (3U)
#define RCC_CIER_HSERDYIE_Msk   (0x1UL << RCC_CIER_HSERDYIE_Pos) /*!< 0x00000008 */
#define RCC_CIER_HSERDYIE       RCC_CIER_HSERDYIE_Msk
#define RCC_CIER_CSIRDYIE_Pos   (4U)
#define RCC_CIER_CSIRDYIE_Msk   (0x1UL << RCC_CIER_CSIRDYIE_Pos) /*!< 0x00000010 */
#define RCC_CIER_CSIRDYIE       RCC_CIER_CSIRDYIE_Msk
#define RCC_CIER_HSI48RDYIE_Pos (5U)
#define RCC_CIER_HSI48RDYIE_Msk (0x1UL << RCC_CIER_HSI48RDYIE_Pos) /*!< 0x00000020 */
#define RCC_CIER_HSI48RDYIE     RCC_CIER_HSI48RDYIE_Msk
#define RCC_CIER_PLL1RDYIE_Pos  (6U)
#define RCC_CIER_PLL1RDYIE_Msk  (0x1UL << RCC_CIER_PLL1RDYIE_Pos) /*!< 0x00000040 */
#define RCC_CIER_PLL1RDYIE      RCC_CIER_PLL1RDYIE_Msk
#define RCC_CIER_PLL2RDYIE_Pos  (7U)
#define RCC_CIER_PLL2RDYIE_Msk  (0x1UL << RCC_CIER_PLL2RDYIE_Pos) /*!< 0x00000080 */
#define RCC_CIER_PLL2RDYIE      RCC_CIER_PLL2RDYIE_Msk
#define RCC_CIER_PLL3RDYIE_Pos  (8U)
#define RCC_CIER_PLL3RDYIE_Msk  (0x1UL << RCC_CIER_PLL3RDYIE_Pos) /*!< 0x00000100 */
#define RCC_CIER_PLL3RDYIE      RCC_CIER_PLL3RDYIE_Msk
#define RCC_CIER_LSECSSIE_Pos   (9U)
#define RCC_CIER_LSECSSIE_Msk   (0x1UL << RCC_CIER_LSECSSIE_Pos) /*!< 0x00000200 */
#define RCC_CIER_LSECSSIE       RCC_CIER_LSECSSIE_Msk

/********************  Bit definition for RCC_CIFR register  ******************/
#define RCC_CIFR_LSIRDYF_Pos   (0U)
#define RCC_CIFR_LSIRDYF_Msk   (0x1UL << RCC_CIFR_LSIRDYF_Pos) /*!< 0x00000001 */
#define RCC_CIFR_LSIRDYF       RCC_CIFR_LSIRDYF_Msk
#define RCC_CIFR_LSERDYF_Pos   (1U)
#define RCC_CIFR_LSERDYF_Msk   (0x1UL << RCC_CIFR_LSERDYF_Pos) /*!< 0x00000002 */
#define RCC_CIFR_LSERDYF       RCC_CIFR_LSERDYF_Msk
#define RCC_CIFR_HSIRDYF_Pos   (2U)
#define RCC_CIFR_HSIRDYF_Msk   (0x1UL << RCC_CIFR_HSIRDYF_Pos) /*!< 0x00000004 */
#define RCC_CIFR_HSIRDYF       RCC_CIFR_HSIRDYF_Msk
#define RCC_CIFR_HSERDYF_Pos   (3U)
#define RCC_CIFR_HSERDYF_Msk   (0x1UL << RCC_CIFR_HSERDYF_Pos) /*!< 0x00000008 */
#define RCC_CIFR_HSERDYF       RCC_CIFR_HSERDYF_Msk
#define RCC_CIFR_CSIRDYF_Pos   (4U)
#define RCC_CIFR_CSIRDYF_Msk   (0x1UL << RCC_CIFR_CSIRDYF_Pos) /*!< 0x00000010 */
#define RCC_CIFR_CSIRDYF       RCC_CIFR_CSIRDYF_Msk
#define RCC_CIFR_HSI48RDYF_Pos (5U)
#define RCC_CIFR_HSI48RDYF_Msk (0x1UL << RCC_CIFR_HSI48RDYF_Pos) /*!< 0x00000020 */
#define RCC_CIFR_HSI48RDYF     RCC_CIFR_HSI48RDYF_Msk
#define RCC_CIFR_PLLRDYF_Pos   (6U)
#define RCC_CIFR_PLLRDYF_Msk   (0x1UL << RCC_CIFR_PLLRDYF_Pos) /*!< 0x00000040 */
#define RCC_CIFR_PLLRDYF       RCC_CIFR_PLLRDYF_Msk
#define RCC_CIFR_PLL2RDYF_Pos  (7U)
#define RCC_CIFR_PLL2RDYF_Msk  (0x1UL << RCC_CIFR_PLL2RDYF_Pos) /*!< 0x00000080 */
#define RCC_CIFR_PLL2RDYF      RCC_CIFR_PLL2RDYF_Msk
#define RCC_CIFR_PLL3RDYF_Pos  (8U)
#define RCC_CIFR_PLL3RDYF_Msk  (0x1UL << RCC_CIFR_PLL3RDYF_Pos) /*!< 0x00000100 */
#define RCC_CIFR_PLL3RDYF      RCC_CIFR_PLL3RDYF_Msk
#define RCC_CIFR_LSECSSF_Pos   (9U)
#define RCC_CIFR_LSECSSF_Msk   (0x1UL << RCC_CIFR_LSECSSF_Pos) /*!< 0x00000200 */
#define RCC_CIFR_LSECSSF       RCC_CIFR_LSECSSF_Msk
#define RCC_CIFR_HSECSSF_Pos   (10U)
#define RCC_CIFR_HSECSSF_Msk   (0x1UL << RCC_CIFR_HSECSSF_Pos) /*!< 0x00000400 */
#define RCC_CIFR_HSECSSF       RCC_CIFR_HSECSSF_Msk

/********************  Bit definition for RCC_CICR register  ******************/
#define RCC_CICR_LSIRDYC_Pos   (0U)
#define RCC_CICR_LSIRDYC_Msk   (0x1UL << RCC_CICR_LSIRDYC_Pos) /*!< 0x00000001 */
#define RCC_CICR_LSIRDYC       RCC_CICR_LSIRDYC_Msk
#define RCC_CICR_LSERDYC_Pos   (1U)
#define RCC_CICR_LSERDYC_Msk   (0x1UL << RCC_CICR_LSERDYC_Pos) /*!< 0x00000002 */
#define RCC_CICR_LSERDYC       RCC_CICR_LSERDYC_Msk
#define RCC_CICR_HSIRDYC_Pos   (2U)
#define RCC_CICR_HSIRDYC_Msk   (0x1UL << RCC_CICR_HSIRDYC_Pos) /*!< 0x00000004 */
#define RCC_CICR_HSIRDYC       RCC_CICR_HSIRDYC_Msk
#define RCC_CICR_HSERDYC_Pos   (3U)
#define RCC_CICR_HSERDYC_Msk   (0x1UL << RCC_CICR_HSERDYC_Pos) /*!< 0x00000008 */
#define RCC_CICR_HSERDYC       RCC_CICR_HSERDYC_Msk
#define RCC_CICR_CSIRDYC_Pos   (4U)
#define RCC_CICR_CSIRDYC_Msk   (0x1UL << RCC_CICR_CSIRDYC_Pos) /*!< 0x00000010 */
#define RCC_CICR_CSIRDYC       RCC_CICR_CSIRDYC_Msk
#define RCC_CICR_HSI48RDYC_Pos (5U)
#define RCC_CICR_HSI48RDYC_Msk (0x1UL << RCC_CICR_HSI48RDYC_Pos) /*!< 0x00000020 */
#define RCC_CICR_HSI48RDYC     RCC_CICR_HSI48RDYC_Msk
#define RCC_CICR_PLLRDYC_Pos   (6U)
#define RCC_CICR_PLLRDYC_Msk   (0x1UL << RCC_CICR_PLLRDYC_Pos) /*!< 0x00000040 */
#define RCC_CICR_PLLRDYC       RCC_CICR_PLLRDYC_Msk
#define RCC_CICR_PLL2RDYC_Pos  (7U)
#define RCC_CICR_PLL2RDYC_Msk  (0x1UL << RCC_CICR_PLL2RDYC_Pos) /*!< 0x00000080 */
#define RCC_CICR_PLL2RDYC      RCC_CICR_PLL2RDYC_Msk
#define RCC_CICR_PLL3RDYC_Pos  (8U)
#define RCC_CICR_PLL3RDYC_Msk  (0x1UL << RCC_CICR_PLL3RDYC_Pos) /*!< 0x00000100 */
#define RCC_CICR_PLL3RDYC      RCC_CICR_PLL3RDYC_Msk
#define RCC_CICR_LSECSSC_Pos   (9U)
#define RCC_CICR_LSECSSC_Msk   (0x1UL << RCC_CICR_LSECSSC_Pos) /*!< 0x00000200 */
#define RCC_CICR_LSECSSC       RCC_CICR_LSECSSC_Msk
#define RCC_CICR_HSECSSC_Pos   (10U)
#define RCC_CICR_HSECSSC_Msk   (0x1UL << RCC_CICR_HSECSSC_Pos) /*!< 0x00000400 */
#define RCC_CICR_HSECSSC       RCC_CICR_HSECSSC_Msk

/********************  Bit definition for RCC_BDCR register  ******************/
#define RCC_BDCR_LSEON_Pos    (0U)
#define RCC_BDCR_LSEON_Msk    (0x1UL << RCC_BDCR_LSEON_Pos) /*!< 0x00000001 */
#define RCC_BDCR_LSEON        RCC_BDCR_LSEON_Msk
#define RCC_BDCR_LSERDY_Pos   (1U)
#define RCC_BDCR_LSERDY_Msk   (0x1UL << RCC_BDCR_LSERDY_Pos) /*!< 0x00000002 */
#define RCC_BDCR_LSERDY       RCC_BDCR_LSERDY_Msk
#define RCC_BDCR_LSEBYP_Pos   (2U)
#define RCC_BDCR_LSEBYP_Msk   (0x1UL << RCC_BDCR_LSEBYP_Pos) /*!< 0x00000004 */
#define RCC_BDCR_LSEBYP       RCC_BDCR_LSEBYP_Msk

#define RCC_BDCR_LSEDRV_Pos   (3U)
#define RCC_BDCR_LSEDRV_Msk   (0x3UL << RCC_BDCR_LSEDRV_Pos) /*!< 0x00000018 */
#define RCC_BDCR_LSEDRV       RCC_BDCR_LSEDRV_Msk
#define RCC_BDCR_LSEDRV_0     (0x1UL << RCC_BDCR_LSEDRV_Pos) /*!< 0x00000008 */
#define RCC_BDCR_LSEDRV_1     (0x2UL << RCC_BDCR_LSEDRV_Pos) /*!< 0x00000010 */

