Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define RCC_BDCR_LSECSSON_Pos (5U)
#define RCC_BDCR_LSECSSON_Msk (0x1UL << RCC_BDCR_LSECSSON_Pos) /*!< 0x00000020 */
#define RCC_BDCR_LSECSSON     RCC_BDCR_LSECSSON_Msk
#define RCC_BDCR_LSECSSD_Pos  (6U)
#define RCC_BDCR_LSECSSD_Msk  (0x1UL << RCC_BDCR_LSECSSD_Pos) /*!< 0x00000040 */
#define RCC_BDCR_LSECSSD      RCC_BDCR_LSECSSD_Msk
#define RCC_BDCR_LSEEXT_Pos   (7U)
#define RCC_BDCR_LSEEXT_Msk   (0x1UL << RCC_BDCR_LSEEXT_Pos) /*!< 0x00000080 */
#define RCC_BDCR_LSEEXT       RCC_BDCR_LSEEXT_Msk

#define RCC_BDCR_RTCSEL_Pos   (8U)
#define RCC_BDCR_RTCSEL_Msk   (0x3UL << RCC_BDCR_RTCSEL_Pos) /*!< 0x00000300 */
#define RCC_BDCR_RTCSEL       RCC_BDCR_RTCSEL_Msk
#define RCC_BDCR_RTCSEL_0     (0x1UL << RCC_BDCR_RTCSEL_Pos) /*!< 0x00000100 */
#define RCC_BDCR_RTCSEL_1     (0x2UL << RCC_BDCR_RTCSEL_Pos) /*!< 0x00000200 */

#define RCC_BDCR_RTCEN_Pos    (15U)
#define RCC_BDCR_RTCEN_Msk    (0x1UL << RCC_BDCR_RTCEN_Pos) /*!< 0x00008000 */
#define RCC_BDCR_RTCEN        RCC_BDCR_RTCEN_Msk
#define RCC_BDCR_VSWRST_Pos   (16U)
#define RCC_BDCR_VSWRST_Msk   (0x1UL << RCC_BDCR_VSWRST_Pos) /*!< 0x00010000 */
#define RCC_BDCR_VSWRST       RCC_BDCR_VSWRST_Msk
/* Legacy define */
#define RCC_BDCR_BDRST_Pos RCC_BDCR_VSWRST_Pos
#define RCC_BDCR_BDRST_Msk RCC_BDCR_VSWRST_Msk
#define RCC_BDCR_BDRST     RCC_BDCR_VSWRST
/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_Pos  (0U)
#define RCC_CSR_LSION_Msk  (0x1UL << RCC_CSR_LSION_Pos) /*!< 0x00000001 */
#define RCC_CSR_LSION      RCC_CSR_LSION_Msk
#define RCC_CSR_LSIRDY_Pos (1U)
#define RCC_CSR_LSIRDY_Msk (0x1UL << RCC_CSR_LSIRDY_Pos) /*!< 0x00000002 */
#define RCC_CSR_LSIRDY     RCC_CSR_LSIRDY_Msk

/********************  Bit definition for RCC_AHB3ENR register  **************/
#define RCC_AHB3ENR_MDMAEN_Pos   (0U)
#define RCC_AHB3ENR_MDMAEN_Msk   (0x1UL << RCC_AHB3ENR_MDMAEN_Pos) /*!< 0x00000001 */
#define RCC_AHB3ENR_MDMAEN       RCC_AHB3ENR_MDMAEN_Msk
#define RCC_AHB3ENR_DMA2DEN_Pos  (4U)
#define RCC_AHB3ENR_DMA2DEN_Msk  (0x1UL << RCC_AHB3ENR_DMA2DEN_Pos) /*!< 0x00000010 */
#define RCC_AHB3ENR_DMA2DEN      RCC_AHB3ENR_DMA2DEN_Msk
#define RCC_AHB3ENR_JPGDECEN_Pos (5U)
#define RCC_AHB3ENR_JPGDECEN_Msk (0x1UL << RCC_AHB3ENR_JPGDECEN_Pos) /*!< 0x00000020 */
#define RCC_AHB3ENR_JPGDECEN     RCC_AHB3ENR_JPGDECEN_Msk
#define RCC_AHB3ENR_FMCEN_Pos    (12U)
#define RCC_AHB3ENR_FMCEN_Msk    (0x1UL << RCC_AHB3ENR_FMCEN_Pos) /*!< 0x00001000 */
#define RCC_AHB3ENR_FMCEN        RCC_AHB3ENR_FMCEN_Msk
#define RCC_AHB3ENR_OSPI1EN_Pos  (14U)
#define RCC_AHB3ENR_OSPI1EN_Msk  (0x1UL << RCC_AHB3ENR_OSPI1EN_Pos) /*!< 0x00004000 */
#define RCC_AHB3ENR_OSPI1EN      RCC_AHB3ENR_OSPI1EN_Msk
#define RCC_AHB3ENR_SDMMC1EN_Pos (16U)
#define RCC_AHB3ENR_SDMMC1EN_Msk (0x1UL << RCC_AHB3ENR_SDMMC1EN_Pos) /*!< 0x00010000 */
#define RCC_AHB3ENR_SDMMC1EN     RCC_AHB3ENR_SDMMC1EN_Msk
#define RCC_AHB3ENR_OSPI2EN_Pos  (19U)
#define RCC_AHB3ENR_OSPI2EN_Msk  (0x1UL << RCC_AHB3ENR_OSPI2EN_Pos) /*!< 0x00040000 */
#define RCC_AHB3ENR_OSPI2EN      RCC_AHB3ENR_OSPI2EN_Msk
#define RCC_AHB3ENR_IOMNGREN_Pos (21U)
#define RCC_AHB3ENR_IOMNGREN_Msk (0x1UL << RCC_AHB3ENR_IOMNGREN_Pos) /*!< 0x00100000 */
#define RCC_AHB3ENR_IOMNGREN     RCC_AHB3ENR_IOMNGREN_Msk
#define RCC_AHB3ENR_GFXMMUEN_Pos (24U)
#define RCC_AHB3ENR_GFXMMUEN_Msk (0x1UL << RCC_AHB3ENR_GFXMMUEN_Pos) /*!< 0x00800000 */
#define RCC_AHB3ENR_GFXMMUEN     RCC_AHB3ENR_GFXMMUEN_Msk

/********************  Bit definition for RCC_AHB1ENR register  ***************/
#define RCC_AHB1ENR_DMA1EN_Pos          (0U)
#define RCC_AHB1ENR_DMA1EN_Msk          (0x1UL << RCC_AHB1ENR_DMA1EN_Pos) /*!< 0x00000001 */
#define RCC_AHB1ENR_DMA1EN              RCC_AHB1ENR_DMA1EN_Msk
#define RCC_AHB1ENR_DMA2EN_Pos          (1U)
#define RCC_AHB1ENR_DMA2EN_Msk          (0x1UL << RCC_AHB1ENR_DMA2EN_Pos) /*!< 0x00000002 */
#define RCC_AHB1ENR_DMA2EN              RCC_AHB1ENR_DMA2EN_Msk
#define RCC_AHB1ENR_ADC12EN_Pos         (5U)
#define RCC_AHB1ENR_ADC12EN_Msk         (0x1UL << RCC_AHB1ENR_ADC12EN_Pos) /*!< 0x00000020 */
#define RCC_AHB1ENR_ADC12EN             RCC_AHB1ENR_ADC12EN_Msk
#define RCC_AHB1ENR_CRCEN_Pos           (9U)
#define RCC_AHB1ENR_CRCEN_Msk           (0x1UL << RCC_AHB1ENR_CRCEN_Pos) /*!< 0x00000200 */
#define RCC_AHB1ENR_CRCEN               RCC_AHB1ENR_CRCEN_Msk
#define RCC_AHB1ENR_USB1OTGHSEN_Pos     (25U)
#define RCC_AHB1ENR_USB1OTGHSEN_Msk     (0x1UL << RCC_AHB1ENR_USB1OTGHSEN_Pos) /*!< 0x02000000 */
#define RCC_AHB1ENR_USB1OTGHSEN         RCC_AHB1ENR_USB1OTGHSEN_Msk
#define RCC_AHB1ENR_USB1OTGHSULPIEN_Pos (26U)
#define RCC_AHB1ENR_USB1OTGHSULPIEN_Msk (0x1UL << RCC_AHB1ENR_USB1OTGHSULPIEN_Pos) /*!< 0x04000000 */
#define RCC_AHB1ENR_USB1OTGHSULPIEN     RCC_AHB1ENR_USB1OTGHSULPIEN_Msk

/********************  Bit definition for RCC_AHB2ENR register  ***************/
#define RCC_AHB2ENR_DCMI_PSSIEN_Pos (0U)
#define RCC_AHB2ENR_DCMI_PSSIEN_Msk (0x1UL << RCC_AHB2ENR_DCMI_PSSIEN_Pos) /*!< 0x00000001 */
#define RCC_AHB2ENR_DCMI_PSSIEN     RCC_AHB2ENR_DCMI_PSSIEN_Msk
#define RCC_AHB2ENR_HSEMEN_Pos      (2U)
#define RCC_AHB2ENR_HSEMEN_Msk      (0x1UL << RCC_AHB2ENR_HSEMEN_Pos) /*!< 0x00000004 */
#define RCC_AHB2ENR_HSEMEN          RCC_AHB2ENR_HSEMEN_Msk
#define RCC_AHB2ENR_RNGEN_Pos       (6U)
#define RCC_AHB2ENR_RNGEN_Msk       (0x1UL << RCC_AHB2ENR_RNGEN_Pos) /*!< 0x00000040 */
#define RCC_AHB2ENR_RNGEN           RCC_AHB2ENR_RNGEN_Msk
#define RCC_AHB2ENR_SDMMC2EN_Pos    (9U)
#define RCC_AHB2ENR_SDMMC2EN_Msk    (0x1UL << RCC_AHB2ENR_SDMMC2EN_Pos) /*!< 0x00000200 */
#define RCC_AHB2ENR_SDMMC2EN        RCC_AHB2ENR_SDMMC2EN_Msk
#define RCC_AHB2ENR_BDMA1EN_Pos     (11U)
#define RCC_AHB2ENR_BDMA1EN_Msk     (0x1UL << RCC_AHB2ENR_BDMA1EN_Pos) /*!< 0x00000800 */
#define RCC_AHB2ENR_BDMA1EN         RCC_AHB2ENR_BDMA1EN_Msk
#define RCC_AHB2ENR_AHBSRAM1EN_Pos  (29U)
#define RCC_AHB2ENR_AHBSRAM1EN_Msk  (0x1UL << RCC_AHB2ENR_AHBSRAM1EN_Pos) /*!< 0x20000000 */
#define RCC_AHB2ENR_AHBSRAM1EN      RCC_AHB2ENR_AHBSRAM1EN_Msk
#define RCC_AHB2ENR_AHBSRAM2EN_Pos  (30U)
#define RCC_AHB2ENR_AHBSRAM2EN_Msk  (0x1UL << RCC_AHB2ENR_AHBSRAM2EN_Pos) /*!< 0x40000000 */
#define RCC_AHB2ENR_AHBSRAM2EN      RCC_AHB2ENR_AHBSRAM2EN_Msk

