Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/* Legacy define */
#define RCC_AHB2ENR_DCMIEN_Pos RCC_AHB2ENR_DCMI_PSSIEN_Pos
#define RCC_AHB2ENR_DCMIEN_Msk RCC_AHB2ENR_DCMI_PSSIEN_Msk
#define RCC_AHB2ENR_DCMIEN     RCC_AHB2ENR_DCMI_PSSIEN

/********************  Bit definition for RCC_AHB4ENR register  ******************/
#define RCC_AHB4ENR_GPIOAEN_Pos   (0U)
#define RCC_AHB4ENR_GPIOAEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOAEN_Pos) /*!< 0x00000001 */
#define RCC_AHB4ENR_GPIOAEN       RCC_AHB4ENR_GPIOAEN_Msk
#define RCC_AHB4ENR_GPIOBEN_Pos   (1U)
#define RCC_AHB4ENR_GPIOBEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOBEN_Pos) /*!< 0x00000002 */
#define RCC_AHB4ENR_GPIOBEN       RCC_AHB4ENR_GPIOBEN_Msk
#define RCC_AHB4ENR_GPIOCEN_Pos   (2U)
#define RCC_AHB4ENR_GPIOCEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOCEN_Pos) /*!< 0x00000004 */
#define RCC_AHB4ENR_GPIOCEN       RCC_AHB4ENR_GPIOCEN_Msk
#define RCC_AHB4ENR_GPIODEN_Pos   (3U)
#define RCC_AHB4ENR_GPIODEN_Msk   (0x1UL << RCC_AHB4ENR_GPIODEN_Pos) /*!< 0x00000008 */
#define RCC_AHB4ENR_GPIODEN       RCC_AHB4ENR_GPIODEN_Msk
#define RCC_AHB4ENR_GPIOEEN_Pos   (4U)
#define RCC_AHB4ENR_GPIOEEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOEEN_Pos) /*!< 0x00000010 */
#define RCC_AHB4ENR_GPIOEEN       RCC_AHB4ENR_GPIOEEN_Msk
#define RCC_AHB4ENR_GPIOFEN_Pos   (5U)
#define RCC_AHB4ENR_GPIOFEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOFEN_Pos) /*!< 0x00000020 */
#define RCC_AHB4ENR_GPIOFEN       RCC_AHB4ENR_GPIOFEN_Msk
#define RCC_AHB4ENR_GPIOGEN_Pos   (6U)
#define RCC_AHB4ENR_GPIOGEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOGEN_Pos) /*!< 0x00000040 */
#define RCC_AHB4ENR_GPIOGEN       RCC_AHB4ENR_GPIOGEN_Msk
#define RCC_AHB4ENR_GPIOHEN_Pos   (7U)
#define RCC_AHB4ENR_GPIOHEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOHEN_Pos) /*!< 0x00000080 */
#define RCC_AHB4ENR_GPIOHEN       RCC_AHB4ENR_GPIOHEN_Msk
#define RCC_AHB4ENR_GPIOIEN_Pos   (8U)
#define RCC_AHB4ENR_GPIOIEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOIEN_Pos) /*!< 0x00000100 */
#define RCC_AHB4ENR_GPIOIEN       RCC_AHB4ENR_GPIOIEN_Msk
#define RCC_AHB4ENR_GPIOJEN_Pos   (9U)
#define RCC_AHB4ENR_GPIOJEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOJEN_Pos) /*!< 0x00000200 */
#define RCC_AHB4ENR_GPIOJEN       RCC_AHB4ENR_GPIOJEN_Msk
#define RCC_AHB4ENR_GPIOKEN_Pos   (10U)
#define RCC_AHB4ENR_GPIOKEN_Msk   (0x1UL << RCC_AHB4ENR_GPIOKEN_Pos) /*!< 0x00000400 */
#define RCC_AHB4ENR_GPIOKEN       RCC_AHB4ENR_GPIOKEN_Msk
#define RCC_AHB4ENR_BDMA2EN_Pos   (21U)
#define RCC_AHB4ENR_BDMA2EN_Msk   (0x1UL << RCC_AHB4ENR_BDMA2EN_Pos) /*!< 0x00080000 */
#define RCC_AHB4ENR_BDMA2EN       RCC_AHB4ENR_BDMA2EN_Msk
#define RCC_AHB4ENR_BKPRAMEN_Pos  (28U)
#define RCC_AHB4ENR_BKPRAMEN_Msk  (0x1UL << RCC_AHB4ENR_BKPRAMEN_Pos) /*!< 0x10000000 */
#define RCC_AHB4ENR_BKPRAMEN      RCC_AHB4ENR_BKPRAMEN_Msk
#define RCC_AHB4ENR_SRDSRAMEN_Pos (29U)
#define RCC_AHB4ENR_SRDSRAMEN_Msk (0x1UL << RCC_AHB4ENR_SRDSRAMEN_Pos) /*!< 0x20000000 */
#define RCC_AHB4ENR_SRDSRAMEN     RCC_AHB4ENR_SRDSRAMEN_Msk

/********************  Bit definition for RCC_APB3ENR register  ******************/
#define RCC_APB3ENR_LTDCEN_Pos (3U)
#define RCC_APB3ENR_LTDCEN_Msk (0x1UL << RCC_APB3ENR_LTDCEN_Pos) /*!< 0x00000008 */
#define RCC_APB3ENR_LTDCEN     RCC_APB3ENR_LTDCEN_Msk
#define RCC_APB3ENR_WWDGEN_Pos (6U)
#define RCC_APB3ENR_WWDGEN_Msk (0x1UL << RCC_APB3ENR_WWDGEN_Pos) /*!< 0x00000040 */
#define RCC_APB3ENR_WWDGEN     RCC_APB3ENR_WWDGEN_Msk

/* Legacy define */
#define RCC_APB3ENR_WWDG1EN_Pos RCC_APB3ENR_WWDGEN_Pos
#define RCC_APB3ENR_WWDG1EN_Msk RCC_APB3ENR_WWDGEN_Msk
#define RCC_APB3ENR_WWDG1EN     RCC_APB3ENR_WWDGEN
/********************  Bit definition for RCC_APB1LENR register  ******************/

#define RCC_APB1LENR_TIM2EN_Pos    (0U)
#define RCC_APB1LENR_TIM2EN_Msk    (0x1UL << RCC_APB1LENR_TIM2EN_Pos) /*!< 0x00000001 */
#define RCC_APB1LENR_TIM2EN        RCC_APB1LENR_TIM2EN_Msk
#define RCC_APB1LENR_TIM3EN_Pos    (1U)
#define RCC_APB1LENR_TIM3EN_Msk    (0x1UL << RCC_APB1LENR_TIM3EN_Pos) /*!< 0x00000002 */
#define RCC_APB1LENR_TIM3EN        RCC_APB1LENR_TIM3EN_Msk
#define RCC_APB1LENR_TIM4EN_Pos    (2U)
#define RCC_APB1LENR_TIM4EN_Msk    (0x1UL << RCC_APB1LENR_TIM4EN_Pos) /*!< 0x00000004 */
#define RCC_APB1LENR_TIM4EN        RCC_APB1LENR_TIM4EN_Msk
#define RCC_APB1LENR_TIM5EN_Pos    (3U)
#define RCC_APB1LENR_TIM5EN_Msk    (0x1UL << RCC_APB1LENR_TIM5EN_Pos) /*!< 0x00000008 */
#define RCC_APB1LENR_TIM5EN        RCC_APB1LENR_TIM5EN_Msk
#define RCC_APB1LENR_TIM6EN_Pos    (4U)
#define RCC_APB1LENR_TIM6EN_Msk    (0x1UL << RCC_APB1LENR_TIM6EN_Pos) /*!< 0x00000010 */
#define RCC_APB1LENR_TIM6EN        RCC_APB1LENR_TIM6EN_Msk
#define RCC_APB1LENR_TIM7EN_Pos    (5U)
#define RCC_APB1LENR_TIM7EN_Msk    (0x1UL << RCC_APB1LENR_TIM7EN_Pos) /*!< 0x00000020 */
#define RCC_APB1LENR_TIM7EN        RCC_APB1LENR_TIM7EN_Msk
#define RCC_APB1LENR_TIM12EN_Pos   (6U)
#define RCC_APB1LENR_TIM12EN_Msk   (0x1UL << RCC_APB1LENR_TIM12EN_Pos) /*!< 0x00000040 */
#define RCC_APB1LENR_TIM12EN       RCC_APB1LENR_TIM12EN_Msk
#define RCC_APB1LENR_TIM13EN_Pos   (7U)
#define RCC_APB1LENR_TIM13EN_Msk   (0x1UL << RCC_APB1LENR_TIM13EN_Pos) /*!< 0x00000080 */
#define RCC_APB1LENR_TIM13EN       RCC_APB1LENR_TIM13EN_Msk
#define RCC_APB1LENR_TIM14EN_Pos   (8U)
#define RCC_APB1LENR_TIM14EN_Msk   (0x1UL << RCC_APB1LENR_TIM14EN_Pos) /*!< 0x00000100 */
#define RCC_APB1LENR_TIM14EN       RCC_APB1LENR_TIM14EN_Msk
#define RCC_APB1LENR_LPTIM1EN_Pos  (9U)
#define RCC_APB1LENR_LPTIM1EN_Msk  (0x1UL << RCC_APB1LENR_LPTIM1EN_Pos) /*!< 0x00000200 */
#define RCC_APB1LENR_LPTIM1EN      RCC_APB1LENR_LPTIM1EN_Msk

#define RCC_APB1LENR_SPI2EN_Pos    (14U)
#define RCC_APB1LENR_SPI2EN_Msk    (0x1UL << RCC_APB1LENR_SPI2EN_Pos) /*!< 0x00004000 */
#define RCC_APB1LENR_SPI2EN        RCC_APB1LENR_SPI2EN_Msk
#define RCC_APB1LENR_SPI3EN_Pos    (15U)
#define RCC_APB1LENR_SPI3EN_Msk    (0x1UL << RCC_APB1LENR_SPI3EN_Pos) /*!< 0x00008000 */
#define RCC_APB1LENR_SPI3EN        RCC_APB1LENR_SPI3EN_Msk
#define RCC_APB1LENR_SPDIFRXEN_Pos (16U)
#define RCC_APB1LENR_SPDIFRXEN_Msk (0x1UL << RCC_APB1LENR_SPDIFRXEN_Pos) /*!< 0x00010000 */
#define RCC_APB1LENR_SPDIFRXEN     RCC_APB1LENR_SPDIFRXEN_Msk
#define RCC_APB1LENR_USART2EN_Pos  (17U)
#define RCC_APB1LENR_USART2EN_Msk  (0x1UL << RCC_APB1LENR_USART2EN_Pos) /*!< 0x00020000 */
#define RCC_APB1LENR_USART2EN      RCC_APB1LENR_USART2EN_Msk
#define RCC_APB1LENR_USART3EN_Pos  (18U)
#define RCC_APB1LENR_USART3EN_Msk  (0x1UL << RCC_APB1LENR_USART3EN_Pos) /*!< 0x00040000 */
#define RCC_APB1LENR_USART3EN      RCC_APB1LENR_USART3EN_Msk
#define RCC_APB1LENR_UART4EN_Pos   (19U)
#define RCC_APB1LENR_UART4EN_Msk   (0x1UL << RCC_APB1LENR_UART4EN_Pos) /*!< 0x00080000 */
#define RCC_APB1LENR_UART4EN       RCC_APB1LENR_UART4EN_Msk
#define RCC_APB1LENR_UART5EN_Pos   (20U)
#define RCC_APB1LENR_UART5EN_Msk   (0x1UL << RCC_APB1LENR_UART5EN_Pos) /*!< 0x00100000 */
#define RCC_APB1LENR_UART5EN       RCC_APB1LENR_UART5EN_Msk
#define RCC_APB1LENR_I2C1EN_Pos    (21U)
#define RCC_APB1LENR_I2C1EN_Msk    (0x1UL << RCC_APB1LENR_I2C1EN_Pos) /*!< 0x00200000 */
#define RCC_APB1LENR_I2C1EN        RCC_APB1LENR_I2C1EN_Msk
#define RCC_APB1LENR_I2C2EN_Pos    (22U)
#define RCC_APB1LENR_I2C2EN_Msk    (0x1UL << RCC_APB1LENR_I2C2EN_Pos) /*!< 0x00400000 */
#define RCC_APB1LENR_I2C2EN        RCC_APB1LENR_I2C2EN_Msk
#define RCC_APB1LENR_I2C3EN_Pos    (23U)
#define RCC_APB1LENR_I2C3EN_Msk    (0x1UL << RCC_APB1LENR_I2C3EN_Pos) /*!< 0x00800000 */
#define RCC_APB1LENR_I2C3EN        RCC_APB1LENR_I2C3EN_Msk
#define RCC_APB1LENR_CECEN_Pos     (27U)
#define RCC_APB1LENR_CECEN_Msk     (0x1UL << RCC_APB1LENR_CECEN_Pos) /*!< 0x08000000 */
#define RCC_APB1LENR_CECEN         RCC_APB1LENR_CECEN_Msk
#define RCC_APB1LENR_DAC12EN_Pos   (29U)
#define RCC_APB1LENR_DAC12EN_Msk   (0x1UL << RCC_APB1LENR_DAC12EN_Pos) /*!< 0x20000000 */
#define RCC_APB1LENR_DAC12EN       RCC_APB1LENR_DAC12EN_Msk
#define RCC_APB1LENR_UART7EN_Pos   (30U)
#define RCC_APB1LENR_UART7EN_Msk   (0x1UL << RCC_APB1LENR_UART7EN_Pos) /*!< 0x40000000 */
#define RCC_APB1LENR_UART7EN       RCC_APB1LENR_UART7EN_Msk
#define RCC_APB1LENR_UART8EN_Pos   (31U)
#define RCC_APB1LENR_UART8EN_Msk   (0x1UL << RCC_APB1LENR_UART8EN_Pos) /*!< 0x80000000 */
#define RCC_APB1LENR_UART8EN       RCC_APB1LENR_UART8EN_Msk

