Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/* Legacy define */
#define RCC_APB1LENR_HDMICECEN_Pos RCC_APB1LENR_CECEN_Pos
#define RCC_APB1LENR_HDMICECEN_Msk RCC_APB1LENR_CECEN_Msk
#define RCC_APB1LENR_HDMICECEN     RCC_APB1LENR_CECEN
/********************  Bit definition for RCC_APB1HENR register  ******************/
#define RCC_APB1HENR_CRSEN_Pos   (1U)
#define RCC_APB1HENR_CRSEN_Msk   (0x1UL << RCC_APB1HENR_CRSEN_Pos) /*!< 0x00000002 */
#define RCC_APB1HENR_CRSEN       RCC_APB1HENR_CRSEN_Msk
#define RCC_APB1HENR_SWPMIEN_Pos (2U)
#define RCC_APB1HENR_SWPMIEN_Msk (0x1UL << RCC_APB1HENR_SWPMIEN_Pos) /*!< 0x00000004 */
#define RCC_APB1HENR_SWPMIEN     RCC_APB1HENR_SWPMIEN_Msk
#define RCC_APB1HENR_OPAMPEN_Pos (4U)
#define RCC_APB1HENR_OPAMPEN_Msk (0x1UL << RCC_APB1HENR_OPAMPEN_Pos) /*!< 0x00000010 */
#define RCC_APB1HENR_OPAMPEN     RCC_APB1HENR_OPAMPEN_Msk
#define RCC_APB1HENR_MDIOSEN_Pos (5U)
#define RCC_APB1HENR_MDIOSEN_Msk (0x1UL << RCC_APB1HENR_MDIOSEN_Pos) /*!< 0x00000020 */
#define RCC_APB1HENR_MDIOSEN     RCC_APB1HENR_MDIOSEN_Msk
#define RCC_APB1HENR_FDCANEN_Pos (8U)
#define RCC_APB1HENR_FDCANEN_Msk (0x1UL << RCC_APB1HENR_FDCANEN_Pos) /*!< 0x00000100 */
#define RCC_APB1HENR_FDCANEN     RCC_APB1HENR_FDCANEN_Msk

/********************  Bit definition for RCC_APB2ENR register  ******************/
#define RCC_APB2ENR_TIM1EN_Pos    (0U)
#define RCC_APB2ENR_TIM1EN_Msk    (0x1UL << RCC_APB2ENR_TIM1EN_Pos) /*!< 0x00000001 */
#define RCC_APB2ENR_TIM1EN        RCC_APB2ENR_TIM1EN_Msk
#define RCC_APB2ENR_TIM8EN_Pos    (1U)
#define RCC_APB2ENR_TIM8EN_Msk    (0x1UL << RCC_APB2ENR_TIM8EN_Pos) /*!< 0x00000002 */
#define RCC_APB2ENR_TIM8EN        RCC_APB2ENR_TIM8EN_Msk
#define RCC_APB2ENR_USART1EN_Pos  (4U)
#define RCC_APB2ENR_USART1EN_Msk  (0x1UL << RCC_APB2ENR_USART1EN_Pos) /*!< 0x00000010 */
#define RCC_APB2ENR_USART1EN      RCC_APB2ENR_USART1EN_Msk
#define RCC_APB2ENR_USART6EN_Pos  (5U)
#define RCC_APB2ENR_USART6EN_Msk  (0x1UL << RCC_APB2ENR_USART6EN_Pos) /*!< 0x00000020 */
#define RCC_APB2ENR_USART6EN      RCC_APB2ENR_USART6EN_Msk
#define RCC_APB2ENR_UART9EN_Pos   (6U)
#define RCC_APB2ENR_UART9EN_Msk   (0x1UL << RCC_APB2ENR_UART9EN_Pos) /*!< 0x00000040 */
#define RCC_APB2ENR_UART9EN       RCC_APB2ENR_UART9EN_Msk
#define RCC_APB2ENR_USART10EN_Pos (7U)
#define RCC_APB2ENR_USART10EN_Msk (0x1UL << RCC_APB2ENR_USART10EN_Pos) /*!< 0x00000080 */
#define RCC_APB2ENR_USART10EN     RCC_APB2ENR_USART10EN_Msk
#define RCC_APB2ENR_SPI1EN_Pos    (12U)
#define RCC_APB2ENR_SPI1EN_Msk    (0x1UL << RCC_APB2ENR_SPI1EN_Pos) /*!< 0x00001000 */
#define RCC_APB2ENR_SPI1EN        RCC_APB2ENR_SPI1EN_Msk
#define RCC_APB2ENR_SPI4EN_Pos    (13U)
#define RCC_APB2ENR_SPI4EN_Msk    (0x1UL << RCC_APB2ENR_SPI4EN_Pos) /*!< 0x00002000 */
#define RCC_APB2ENR_SPI4EN        RCC_APB2ENR_SPI4EN_Msk
#define RCC_APB2ENR_TIM15EN_Pos   (16U)
#define RCC_APB2ENR_TIM15EN_Msk   (0x1UL << RCC_APB2ENR_TIM15EN_Pos) /*!< 0x00010000 */
#define RCC_APB2ENR_TIM15EN       RCC_APB2ENR_TIM15EN_Msk
#define RCC_APB2ENR_TIM16EN_Pos   (17U)
#define RCC_APB2ENR_TIM16EN_Msk   (0x1UL << RCC_APB2ENR_TIM16EN_Pos) /*!< 0x00020000 */
#define RCC_APB2ENR_TIM16EN       RCC_APB2ENR_TIM16EN_Msk
#define RCC_APB2ENR_TIM17EN_Pos   (18U)
#define RCC_APB2ENR_TIM17EN_Msk   (0x1UL << RCC_APB2ENR_TIM17EN_Pos) /*!< 0x00040000 */
#define RCC_APB2ENR_TIM17EN       RCC_APB2ENR_TIM17EN_Msk
#define RCC_APB2ENR_SPI5EN_Pos    (20U)
#define RCC_APB2ENR_SPI5EN_Msk    (0x1UL << RCC_APB2ENR_SPI5EN_Pos) /*!< 0x00100000 */
#define RCC_APB2ENR_SPI5EN        RCC_APB2ENR_SPI5EN_Msk
#define RCC_APB2ENR_SAI1EN_Pos    (22U)
#define RCC_APB2ENR_SAI1EN_Msk    (0x1UL << RCC_APB2ENR_SAI1EN_Pos) /*!< 0x00400000 */
#define RCC_APB2ENR_SAI1EN        RCC_APB2ENR_SAI1EN_Msk
#define RCC_APB2ENR_SAI2EN_Pos    (23U)
#define RCC_APB2ENR_SAI2EN_Msk    (0x1UL << RCC_APB2ENR_SAI2EN_Pos) /*!< 0x00800000 */
#define RCC_APB2ENR_SAI2EN        RCC_APB2ENR_SAI2EN_Msk
#define RCC_APB2ENR_DFSDM1EN_Pos  (30U)
#define RCC_APB2ENR_DFSDM1EN_Msk  (0x1UL << RCC_APB2ENR_DFSDM1EN_Pos) /*!< 0x40000000 */
#define RCC_APB2ENR_DFSDM1EN      RCC_APB2ENR_DFSDM1EN_Msk

/********************  Bit definition for RCC_APB4ENR register  ******************/
#define RCC_APB4ENR_SYSCFGEN_Pos  (1U)
#define RCC_APB4ENR_SYSCFGEN_Msk  (0x1UL << RCC_APB4ENR_SYSCFGEN_Pos) /*!< 0x00000002 */
#define RCC_APB4ENR_SYSCFGEN      RCC_APB4ENR_SYSCFGEN_Msk
#define RCC_APB4ENR_LPUART1EN_Pos (3U)
#define RCC_APB4ENR_LPUART1EN_Msk (0x1UL << RCC_APB4ENR_LPUART1EN_Pos) /*!< 0x00000008 */
#define RCC_APB4ENR_LPUART1EN     RCC_APB4ENR_LPUART1EN_Msk
#define RCC_APB4ENR_SPI6EN_Pos    (5U)
#define RCC_APB4ENR_SPI6EN_Msk    (0x1UL << RCC_APB4ENR_SPI6EN_Pos) /*!< 0x00000020 */
#define RCC_APB4ENR_SPI6EN        RCC_APB4ENR_SPI6EN_Msk
#define RCC_APB4ENR_I2C4EN_Pos    (7U)
#define RCC_APB4ENR_I2C4EN_Msk    (0x1UL << RCC_APB4ENR_I2C4EN_Pos) /*!< 0x00000080 */
#define RCC_APB4ENR_I2C4EN        RCC_APB4ENR_I2C4EN_Msk
#define RCC_APB4ENR_LPTIM2EN_Pos  (9U)
#define RCC_APB4ENR_LPTIM2EN_Msk  (0x1UL << RCC_APB4ENR_LPTIM2EN_Pos) /*!< 0x00000200 */
#define RCC_APB4ENR_LPTIM2EN      RCC_APB4ENR_LPTIM2EN_Msk
#define RCC_APB4ENR_LPTIM3EN_Pos  (10U)
#define RCC_APB4ENR_LPTIM3EN_Msk  (0x1UL << RCC_APB4ENR_LPTIM3EN_Pos) /*!< 0x00000400 */
#define RCC_APB4ENR_LPTIM3EN      RCC_APB4ENR_LPTIM3EN_Msk
#define RCC_APB4ENR_DAC2EN_Pos    (13U)
#define RCC_APB4ENR_DAC2EN_Msk    (0x1UL << RCC_APB4ENR_DAC2EN_Pos) /*!< 0x00002000 */
#define RCC_APB4ENR_DAC2EN        RCC_APB4ENR_DAC2EN_Msk
#define RCC_APB4ENR_COMP12EN_Pos  (14U)
#define RCC_APB4ENR_COMP12EN_Msk  (0x1UL << RCC_APB4ENR_COMP12EN_Pos) /*!< 0x00004000 */
#define RCC_APB4ENR_COMP12EN      RCC_APB4ENR_COMP12EN_Msk
#define RCC_APB4ENR_VREFEN_Pos    (15U)
#define RCC_APB4ENR_VREFEN_Msk    (0x1UL << RCC_APB4ENR_VREFEN_Pos) /*!< 0x00008000 */
#define RCC_APB4ENR_VREFEN        RCC_APB4ENR_VREFEN_Msk
#define RCC_APB4ENR_RTCAPBEN_Pos  (16U)
#define RCC_APB4ENR_RTCAPBEN_Msk  (0x1UL << RCC_APB4ENR_RTCAPBEN_Pos) /*!< 0x00010000 */
#define RCC_APB4ENR_RTCAPBEN      RCC_APB4ENR_RTCAPBEN_Msk

