Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define RCC_APB4ENR_DTSEN_Pos     (26U)
#define RCC_APB4ENR_DTSEN_Msk     (0x1UL << RCC_APB4ENR_DTSEN_Pos) /*!< 0x04000000 */
#define RCC_APB4ENR_DTSEN         RCC_APB4ENR_DTSEN_Msk
#define RCC_APB4ENR_DFSDM2EN_Pos  (27U)
#define RCC_APB4ENR_DFSDM2EN_Msk  (0x1UL << RCC_APB4ENR_DFSDM2EN_Pos) /*!< 0x08000000 */
#define RCC_APB4ENR_DFSDM2EN      RCC_APB4ENR_DFSDM2EN_Msk

/********************  Bit definition for RCC_AHB3RSTR register  ***************/
#define RCC_AHB3RSTR_MDMARST_Pos   (0U)
#define RCC_AHB3RSTR_MDMARST_Msk   (0x1UL << RCC_AHB3RSTR_MDMARST_Pos) /*!< 0x00000001 */
#define RCC_AHB3RSTR_MDMARST       RCC_AHB3RSTR_MDMARST_Msk
#define RCC_AHB3RSTR_DMA2DRST_Pos  (4U)
#define RCC_AHB3RSTR_DMA2DRST_Msk  (0x1UL << RCC_AHB3RSTR_DMA2DRST_Pos) /*!< 0x00000010 */
#define RCC_AHB3RSTR_DMA2DRST      RCC_AHB3RSTR_DMA2DRST_Msk
#define RCC_AHB3RSTR_JPGDECRST_Pos (5U)
#define RCC_AHB3RSTR_JPGDECRST_Msk (0x1UL << RCC_AHB3RSTR_JPGDECRST_Pos) /*!< 0x00000020 */
#define RCC_AHB3RSTR_JPGDECRST     RCC_AHB3RSTR_JPGDECRST_Msk
#define RCC_AHB3RSTR_FMCRST_Pos    (12U)
#define RCC_AHB3RSTR_FMCRST_Msk    (0x1UL << RCC_AHB3RSTR_FMCRST_Pos) /*!< 0x00001000 */
#define RCC_AHB3RSTR_FMCRST        RCC_AHB3RSTR_FMCRST_Msk
#define RCC_AHB3RSTR_OSPI1RST_Pos  (14U)
#define RCC_AHB3RSTR_OSPI1RST_Msk  (0x1UL << RCC_AHB3RSTR_OSPI1RST_Pos) /*!< 0x00004000 */
#define RCC_AHB3RSTR_OSPI1RST      RCC_AHB3RSTR_OSPI1RST_Msk
#define RCC_AHB3RSTR_SDMMC1RST_Pos (16U)
#define RCC_AHB3RSTR_SDMMC1RST_Msk (0x1UL << RCC_AHB3RSTR_SDMMC1RST_Pos) /*!< 0x00010000 */
#define RCC_AHB3RSTR_SDMMC1RST     RCC_AHB3RSTR_SDMMC1RST_Msk
#define RCC_AHB3RSTR_OSPI2RST_Pos  (19U)
#define RCC_AHB3RSTR_OSPI2RST_Msk  (0x1UL << RCC_AHB3RSTR_OSPI2RST_Pos) /*!< 0x00008000 */
#define RCC_AHB3RSTR_OSPI2RST      RCC_AHB3RSTR_OSPI2RST_Msk
#define RCC_AHB3RSTR_IOMNGRRST_Pos (21U)
#define RCC_AHB3RSTR_IOMNGRRST_Msk (0x1UL << RCC_AHB3RSTR_IOMNGRRST_Pos) /*!< 0x00020000 */
#define RCC_AHB3RSTR_IOMNGRRST     RCC_AHB3RSTR_IOMNGRRST_Msk
#define RCC_AHB3RSTR_GFXMMURST_Pos (24U)
#define RCC_AHB3RSTR_GFXMMURST_Msk (0x1UL << RCC_AHB3RSTR_GFXMMURST_Pos) /*!< 0x00100000 */
#define RCC_AHB3RSTR_GFXMMURST     RCC_AHB3RSTR_GFXMMURST_Msk

/********************  Bit definition for RCC_AHB1RSTR register  ***************/
#define RCC_AHB1RSTR_DMA1RST_Pos      (0U)
#define RCC_AHB1RSTR_DMA1RST_Msk      (0x1UL << RCC_AHB1RSTR_DMA1RST_Pos) /*!< 0x00000001 */
#define RCC_AHB1RSTR_DMA1RST          RCC_AHB1RSTR_DMA1RST_Msk
#define RCC_AHB1RSTR_DMA2RST_Pos      (1U)
#define RCC_AHB1RSTR_DMA2RST_Msk      (0x1UL << RCC_AHB1RSTR_DMA2RST_Pos) /*!< 0x00000002 */
#define RCC_AHB1RSTR_DMA2RST          RCC_AHB1RSTR_DMA2RST_Msk
#define RCC_AHB1RSTR_ADC12RST_Pos     (5U)
#define RCC_AHB1RSTR_ADC12RST_Msk     (0x1UL << RCC_AHB1RSTR_ADC12RST_Pos) /*!< 0x00000020 */
#define RCC_AHB1RSTR_ADC12RST         RCC_AHB1RSTR_ADC12RST_Msk
#define RCC_AHB1RSTR_CRCRST_Pos       (9U)
#define RCC_AHB1RSTR_CRCRST_Msk       (0x1UL << RCC_AHB1RSTR_CRCRST_Pos) /*!< 0x00000200 */
#define RCC_AHB1RSTR_CRCRST           RCC_AHB1RSTR_CRCRST_Msk
#define RCC_AHB1RSTR_USB1OTGHSRST_Pos (25U)
#define RCC_AHB1RSTR_USB1OTGHSRST_Msk (0x1UL << RCC_AHB1RSTR_USB1OTGHSRST_Pos) /*!< 0x02000000 */
#define RCC_AHB1RSTR_USB1OTGHSRST     RCC_AHB1RSTR_USB1OTGHSRST_Msk

/********************  Bit definition for RCC_AHB2RSTR register  ***************/
#define RCC_AHB2RSTR_DCMI_PSSIRST_Pos (0U)
#define RCC_AHB2RSTR_DCMI_PSSIRST_Msk (0x1UL << RCC_AHB2RSTR_DCMI_PSSIRST_Pos) /*!< 0x00000001 */
#define RCC_AHB2RSTR_DCMI_PSSIRST     RCC_AHB2RSTR_DCMI_PSSIRST_Msk
#define RCC_AHB2RSTR_HSEMRST_Pos      (2U)
#define RCC_AHB2RSTR_HSEMRST_Msk      (0x1UL << RCC_AHB2RSTR_HSEMRST_Pos) /*!< 0x00000004 */
#define RCC_AHB2RSTR_HSEMRST          RCC_AHB2RSTR_HSEMRST_Msk
#define RCC_AHB2RSTR_RNGRST_Pos       (6U)
#define RCC_AHB2RSTR_RNGRST_Msk       (0x1UL << RCC_AHB2RSTR_RNGRST_Pos) /*!< 0x00000040 */
#define RCC_AHB2RSTR_RNGRST           RCC_AHB2RSTR_RNGRST_Msk
#define RCC_AHB2RSTR_SDMMC2RST_Pos    (9U)
#define RCC_AHB2RSTR_SDMMC2RST_Msk    (0x1UL << RCC_AHB2RSTR_SDMMC2RST_Pos) /*!< 0x00000200 */
#define RCC_AHB2RSTR_SDMMC2RST        RCC_AHB2RSTR_SDMMC2RST_Msk
#define RCC_AHB2RSTR_BDMA1RST_Pos     (11U)
#define RCC_AHB2RSTR_BDMA1RST_Msk     (0x1UL << RCC_AHB2RSTR_BDMA1RST_Pos) /*!< 0x00000200 */
#define RCC_AHB2RSTR_BDMA1RST         RCC_AHB2RSTR_BDMA1RST_Msk

/* Legacy define */
#define RCC_AHB2RSTR_DCMIRST_Pos RCC_AHB2RSTR_DCMI_PSSIRST_Pos
#define RCC_AHB2RSTR_DCMIRST_Msk RCC_AHB2RSTR_DCMI_PSSIRST_Msk
#define RCC_AHB2RSTR_DCMIRST     RCC_AHB2RSTR_DCMI_PSSIRST
/********************  Bit definition for RCC_AHB4RSTR register  ******************/
#define RCC_AHB4RSTR_GPIOARST_Pos (0U)
#define RCC_AHB4RSTR_GPIOARST_Msk (0x1UL << RCC_AHB4RSTR_GPIOARST_Pos) /*!< 0x00000001 */
#define RCC_AHB4RSTR_GPIOARST     RCC_AHB4RSTR_GPIOARST_Msk
#define RCC_AHB4RSTR_GPIOBRST_Pos (1U)
#define RCC_AHB4RSTR_GPIOBRST_Msk (0x1UL << RCC_AHB4RSTR_GPIOBRST_Pos) /*!< 0x00000002 */
#define RCC_AHB4RSTR_GPIOBRST     RCC_AHB4RSTR_GPIOBRST_Msk
#define RCC_AHB4RSTR_GPIOCRST_Pos (2U)
#define RCC_AHB4RSTR_GPIOCRST_Msk (0x1UL << RCC_AHB4RSTR_GPIOCRST_Pos) /*!< 0x00000004 */
#define RCC_AHB4RSTR_GPIOCRST     RCC_AHB4RSTR_GPIOCRST_Msk
#define RCC_AHB4RSTR_GPIODRST_Pos (3U)
#define RCC_AHB4RSTR_GPIODRST_Msk (0x1UL << RCC_AHB4RSTR_GPIODRST_Pos) /*!< 0x00000008 */
#define RCC_AHB4RSTR_GPIODRST     RCC_AHB4RSTR_GPIODRST_Msk
#define RCC_AHB4RSTR_GPIOERST_Pos (4U)
#define RCC_AHB4RSTR_GPIOERST_Msk (0x1UL << RCC_AHB4RSTR_GPIOERST_Pos) /*!< 0x00000010 */
#define RCC_AHB4RSTR_GPIOERST     RCC_AHB4RSTR_GPIOERST_Msk
#define RCC_AHB4RSTR_GPIOFRST_Pos (5U)
#define RCC_AHB4RSTR_GPIOFRST_Msk (0x1UL << RCC_AHB4RSTR_GPIOFRST_Pos) /*!< 0x00000020 */
#define RCC_AHB4RSTR_GPIOFRST     RCC_AHB4RSTR_GPIOFRST_Msk
#define RCC_AHB4RSTR_GPIOGRST_Pos (6U)
#define RCC_AHB4RSTR_GPIOGRST_Msk (0x1UL << RCC_AHB4RSTR_GPIOGRST_Pos) /*!< 0x00000040 */
#define RCC_AHB4RSTR_GPIOGRST     RCC_AHB4RSTR_GPIOGRST_Msk
#define RCC_AHB4RSTR_GPIOHRST_Pos (7U)
#define RCC_AHB4RSTR_GPIOHRST_Msk (0x1UL << RCC_AHB4RSTR_GPIOHRST_Pos) /*!< 0x00000080 */
#define RCC_AHB4RSTR_GPIOHRST     RCC_AHB4RSTR_GPIOHRST_Msk
#define RCC_AHB4RSTR_GPIOIRST_Pos (8U)
#define RCC_AHB4RSTR_GPIOIRST_Msk (0x1UL << RCC_AHB4RSTR_GPIOIRST_Pos) /*!< 0x00000100 */
#define RCC_AHB4RSTR_GPIOIRST     RCC_AHB4RSTR_GPIOIRST_Msk
#define RCC_AHB4RSTR_GPIOJRST_Pos (9U)
#define RCC_AHB4RSTR_GPIOJRST_Msk (0x1UL << RCC_AHB4RSTR_GPIOJRST_Pos) /*!< 0x00000200 */
#define RCC_AHB4RSTR_GPIOJRST     RCC_AHB4RSTR_GPIOJRST_Msk
#define RCC_AHB4RSTR_GPIOKRST_Pos (10U)
#define RCC_AHB4RSTR_GPIOKRST_Msk (0x1UL << RCC_AHB4RSTR_GPIOKRST_Pos) /*!< 0x00000400 */
#define RCC_AHB4RSTR_GPIOKRST     RCC_AHB4RSTR_GPIOKRST_Msk
#define RCC_AHB4RSTR_BDMA2RST_Pos (21U)
#define RCC_AHB4RSTR_BDMA2RST_Msk (0x1UL << RCC_AHB4RSTR_BDMA2RST_Pos) /*!< 0x00200000 */
#define RCC_AHB4RSTR_BDMA2RST     RCC_AHB4RSTR_BDMA2RST_Msk

/********************  Bit definition for RCC_APB3RSTR register  ******************/
#define RCC_APB3RSTR_LTDCRST_Pos (3U)
#define RCC_APB3RSTR_LTDCRST_Msk (0x1UL << RCC_APB3RSTR_LTDCRST_Pos) /*!< 0x00000008 */
#define RCC_APB3RSTR_LTDCRST     RCC_APB3RSTR_LTDCRST_Msk

/********************  Bit definition for RCC_APB1LRSTR register  ******************/

