Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define RCC_APB1LRSTR_TIM2RST_Pos    (0U)
#define RCC_APB1LRSTR_TIM2RST_Msk    (0x1UL << RCC_APB1LRSTR_TIM2RST_Pos) /*!< 0x00000001 */
#define RCC_APB1LRSTR_TIM2RST        RCC_APB1LRSTR_TIM2RST_Msk
#define RCC_APB1LRSTR_TIM3RST_Pos    (1U)
#define RCC_APB1LRSTR_TIM3RST_Msk    (0x1UL << RCC_APB1LRSTR_TIM3RST_Pos) /*!< 0x00000002 */
#define RCC_APB1LRSTR_TIM3RST        RCC_APB1LRSTR_TIM3RST_Msk
#define RCC_APB1LRSTR_TIM4RST_Pos    (2U)
#define RCC_APB1LRSTR_TIM4RST_Msk    (0x1UL << RCC_APB1LRSTR_TIM4RST_Pos) /*!< 0x00000004 */
#define RCC_APB1LRSTR_TIM4RST        RCC_APB1LRSTR_TIM4RST_Msk
#define RCC_APB1LRSTR_TIM5RST_Pos    (3U)
#define RCC_APB1LRSTR_TIM5RST_Msk    (0x1UL << RCC_APB1LRSTR_TIM5RST_Pos) /*!< 0x00000008 */
#define RCC_APB1LRSTR_TIM5RST        RCC_APB1LRSTR_TIM5RST_Msk
#define RCC_APB1LRSTR_TIM6RST_Pos    (4U)
#define RCC_APB1LRSTR_TIM6RST_Msk    (0x1UL << RCC_APB1LRSTR_TIM6RST_Pos) /*!< 0x00000010 */
#define RCC_APB1LRSTR_TIM6RST        RCC_APB1LRSTR_TIM6RST_Msk
#define RCC_APB1LRSTR_TIM7RST_Pos    (5U)
#define RCC_APB1LRSTR_TIM7RST_Msk    (0x1UL << RCC_APB1LRSTR_TIM7RST_Pos) /*!< 0x00000020 */
#define RCC_APB1LRSTR_TIM7RST        RCC_APB1LRSTR_TIM7RST_Msk
#define RCC_APB1LRSTR_TIM12RST_Pos   (6U)
#define RCC_APB1LRSTR_TIM12RST_Msk   (0x1UL << RCC_APB1LRSTR_TIM12RST_Pos) /*!< 0x00000040 */
#define RCC_APB1LRSTR_TIM12RST       RCC_APB1LRSTR_TIM12RST_Msk
#define RCC_APB1LRSTR_TIM13RST_Pos   (7U)
#define RCC_APB1LRSTR_TIM13RST_Msk   (0x1UL << RCC_APB1LRSTR_TIM13RST_Pos) /*!< 0x00000080 */
#define RCC_APB1LRSTR_TIM13RST       RCC_APB1LRSTR_TIM13RST_Msk
#define RCC_APB1LRSTR_TIM14RST_Pos   (8U)
#define RCC_APB1LRSTR_TIM14RST_Msk   (0x1UL << RCC_APB1LRSTR_TIM14RST_Pos) /*!< 0x00000100 */
#define RCC_APB1LRSTR_TIM14RST       RCC_APB1LRSTR_TIM14RST_Msk
#define RCC_APB1LRSTR_LPTIM1RST_Pos  (9U)
#define RCC_APB1LRSTR_LPTIM1RST_Msk  (0x1UL << RCC_APB1LRSTR_LPTIM1RST_Pos) /*!< 0x00000200 */
#define RCC_APB1LRSTR_LPTIM1RST      RCC_APB1LRSTR_LPTIM1RST_Msk
#define RCC_APB1LRSTR_SPI2RST_Pos    (14U)
#define RCC_APB1LRSTR_SPI2RST_Msk    (0x1UL << RCC_APB1LRSTR_SPI2RST_Pos) /*!< 0x00004000 */
#define RCC_APB1LRSTR_SPI2RST        RCC_APB1LRSTR_SPI2RST_Msk
#define RCC_APB1LRSTR_SPI3RST_Pos    (15U)
#define RCC_APB1LRSTR_SPI3RST_Msk    (0x1UL << RCC_APB1LRSTR_SPI3RST_Pos) /*!< 0x00008000 */
#define RCC_APB1LRSTR_SPI3RST        RCC_APB1LRSTR_SPI3RST_Msk
#define RCC_APB1LRSTR_SPDIFRXRST_Pos (16U)
#define RCC_APB1LRSTR_SPDIFRXRST_Msk (0x1UL << RCC_APB1LRSTR_SPDIFRXRST_Pos) /*!< 0x00010000 */
#define RCC_APB1LRSTR_SPDIFRXRST     RCC_APB1LRSTR_SPDIFRXRST_Msk
#define RCC_APB1LRSTR_USART2RST_Pos  (17U)
#define RCC_APB1LRSTR_USART2RST_Msk  (0x1UL << RCC_APB1LRSTR_USART2RST_Pos) /*!< 0x00020000 */
#define RCC_APB1LRSTR_USART2RST      RCC_APB1LRSTR_USART2RST_Msk
#define RCC_APB1LRSTR_USART3RST_Pos  (18U)
#define RCC_APB1LRSTR_USART3RST_Msk  (0x1UL << RCC_APB1LRSTR_USART3RST_Pos) /*!< 0x00040000 */
#define RCC_APB1LRSTR_USART3RST      RCC_APB1LRSTR_USART3RST_Msk
#define RCC_APB1LRSTR_UART4RST_Pos   (19U)
#define RCC_APB1LRSTR_UART4RST_Msk   (0x1UL << RCC_APB1LRSTR_UART4RST_Pos) /*!< 0x00080000 */
#define RCC_APB1LRSTR_UART4RST       RCC_APB1LRSTR_UART4RST_Msk
#define RCC_APB1LRSTR_UART5RST_Pos   (20U)
#define RCC_APB1LRSTR_UART5RST_Msk   (0x1UL << RCC_APB1LRSTR_UART5RST_Pos) /*!< 0x00100000 */
#define RCC_APB1LRSTR_UART5RST       RCC_APB1LRSTR_UART5RST_Msk
#define RCC_APB1LRSTR_I2C1RST_Pos    (21U)
#define RCC_APB1LRSTR_I2C1RST_Msk    (0x1UL << RCC_APB1LRSTR_I2C1RST_Pos) /*!< 0x00200000 */
#define RCC_APB1LRSTR_I2C1RST        RCC_APB1LRSTR_I2C1RST_Msk
#define RCC_APB1LRSTR_I2C2RST_Pos    (22U)
#define RCC_APB1LRSTR_I2C2RST_Msk    (0x1UL << RCC_APB1LRSTR_I2C2RST_Pos) /*!< 0x00400000 */
#define RCC_APB1LRSTR_I2C2RST        RCC_APB1LRSTR_I2C2RST_Msk
#define RCC_APB1LRSTR_I2C3RST_Pos    (23U)
#define RCC_APB1LRSTR_I2C3RST_Msk    (0x1UL << RCC_APB1LRSTR_I2C3RST_Pos) /*!< 0x00800000 */
#define RCC_APB1LRSTR_I2C3RST        RCC_APB1LRSTR_I2C3RST_Msk
#define RCC_APB1LRSTR_CECRST_Pos     (27U)
#define RCC_APB1LRSTR_CECRST_Msk     (0x1UL << RCC_APB1LRSTR_CECRST_Pos) /*!< 0x08000000 */
#define RCC_APB1LRSTR_CECRST         RCC_APB1LRSTR_CECRST_Msk
#define RCC_APB1LRSTR_DAC12RST_Pos   (29U)
#define RCC_APB1LRSTR_DAC12RST_Msk   (0x1UL << RCC_APB1LRSTR_DAC12RST_Pos) /*!< 0x20000000 */
#define RCC_APB1LRSTR_DAC12RST       RCC_APB1LRSTR_DAC12RST_Msk
#define RCC_APB1LRSTR_UART7RST_Pos   (30U)
#define RCC_APB1LRSTR_UART7RST_Msk   (0x1UL << RCC_APB1LRSTR_UART7RST_Pos) /*!< 0x40000000 */
#define RCC_APB1LRSTR_UART7RST       RCC_APB1LRSTR_UART7RST_Msk
#define RCC_APB1LRSTR_UART8RST_Pos   (31U)
#define RCC_APB1LRSTR_UART8RST_Msk   (0x1UL << RCC_APB1LRSTR_UART8RST_Pos) /*!< 0x80000000 */
#define RCC_APB1LRSTR_UART8RST       RCC_APB1LRSTR_UART8RST_Msk

/* Legacy define */
#define RCC_APB1LRSTR_HDMICECRST_Pos RCC_APB1LRSTR_CECRST_Pos
#define RCC_APB1LRSTR_HDMICECRST_Msk RCC_APB1LRSTR_CECRST_Msk
#define RCC_APB1LRSTR_HDMICECRST     RCC_APB1LRSTR_CECRST
/********************  Bit definition for RCC_APB1HRSTR register  ******************/
#define RCC_APB1HRSTR_CRSRST_Pos   (1U)
#define RCC_APB1HRSTR_CRSRST_Msk   (0x1UL << RCC_APB1HRSTR_CRSRST_Pos) /*!< 0x00000002 */
#define RCC_APB1HRSTR_CRSRST       RCC_APB1HRSTR_CRSRST_Msk
#define RCC_APB1HRSTR_SWPMIRST_Pos (2U)
#define RCC_APB1HRSTR_SWPMIRST_Msk (0x1UL << RCC_APB1HRSTR_SWPMIRST_Pos) /*!< 0x00000004 */
#define RCC_APB1HRSTR_SWPMIRST     RCC_APB1HRSTR_SWPMIRST_Msk
#define RCC_APB1HRSTR_OPAMPRST_Pos (4U)
#define RCC_APB1HRSTR_OPAMPRST_Msk (0x1UL << RCC_APB1HRSTR_OPAMPRST_Pos) /*!< 0x00000010 */
#define RCC_APB1HRSTR_OPAMPRST     RCC_APB1HRSTR_OPAMPRST_Msk
#define RCC_APB1HRSTR_MDIOSRST_Pos (5U)
#define RCC_APB1HRSTR_MDIOSRST_Msk (0x1UL << RCC_APB1HRSTR_MDIOSRST_Pos) /*!< 0x00000020 */
#define RCC_APB1HRSTR_MDIOSRST     RCC_APB1HRSTR_MDIOSRST_Msk
#define RCC_APB1HRSTR_FDCANRST_Pos (8U)
#define RCC_APB1HRSTR_FDCANRST_Msk (0x1UL << RCC_APB1HRSTR_FDCANRST_Pos) /*!< 0x00000100 */
#define RCC_APB1HRSTR_FDCANRST     RCC_APB1HRSTR_FDCANRST_Msk

/********************  Bit definition for RCC_APB2RSTR register  ******************/
#define RCC_APB2RSTR_TIM1RST_Pos    (0U)
#define RCC_APB2RSTR_TIM1RST_Msk    (0x1UL << RCC_APB2RSTR_TIM1RST_Pos) /*!< 0x00000001 */
#define RCC_APB2RSTR_TIM1RST        RCC_APB2RSTR_TIM1RST_Msk
#define RCC_APB2RSTR_TIM8RST_Pos    (1U)
#define RCC_APB2RSTR_TIM8RST_Msk    (0x1UL << RCC_APB2RSTR_TIM8RST_Pos) /*!< 0x00000002 */
#define RCC_APB2RSTR_TIM8RST        RCC_APB2RSTR_TIM8RST_Msk
#define RCC_APB2RSTR_USART1RST_Pos  (4U)
#define RCC_APB2RSTR_USART1RST_Msk  (0x1UL << RCC_APB2RSTR_USART1RST_Pos) /*!< 0x00000010 */
#define RCC_APB2RSTR_USART1RST      RCC_APB2RSTR_USART1RST_Msk
#define RCC_APB2RSTR_USART6RST_Pos  (5U)
#define RCC_APB2RSTR_USART6RST_Msk  (0x1UL << RCC_APB2RSTR_USART6RST_Pos) /*!< 0x00000020 */
#define RCC_APB2RSTR_USART6RST      RCC_APB2RSTR_USART6RST_Msk
#define RCC_APB2RSTR_UART9RST_Pos   (6U)
#define RCC_APB2RSTR_UART9RST_Msk   (0x1UL << RCC_APB2RSTR_UART9RST_Pos) /*!< 0x00000040 */
#define RCC_APB2RSTR_UART9RST       RCC_APB2RSTR_UART9RST_Msk
#define RCC_APB2RSTR_USART10RST_Pos (7U)
#define RCC_APB2RSTR_USART10RST_Msk (0x1UL << RCC_APB2RSTR_USART10RST_Pos) /*!< 0x00000080 */
#define RCC_APB2RSTR_USART10RST     RCC_APB2RSTR_USART10RST_Msk
#define RCC_APB2RSTR_SPI1RST_Pos    (12U)
#define RCC_APB2RSTR_SPI1RST_Msk    (0x1UL << RCC_APB2RSTR_SPI1RST_Pos) /*!< 0x00001000 */
#define RCC_APB2RSTR_SPI1RST        RCC_APB2RSTR_SPI1RST_Msk
#define RCC_APB2RSTR_SPI4RST_Pos    (13U)
#define RCC_APB2RSTR_SPI4RST_Msk    (0x1UL << RCC_APB2RSTR_SPI4RST_Pos) /*!< 0x00002000 */
#define RCC_APB2RSTR_SPI4RST        RCC_APB2RSTR_SPI4RST_Msk
#define RCC_APB2RSTR_TIM15RST_Pos   (16U)
#define RCC_APB2RSTR_TIM15RST_Msk   (0x1UL << RCC_APB2RSTR_TIM15RST_Pos) /*!< 0x00010000 */
#define RCC_APB2RSTR_TIM15RST       RCC_APB2RSTR_TIM15RST_Msk
#define RCC_APB2RSTR_TIM16RST_Pos   (17U)
#define RCC_APB2RSTR_TIM16RST_Msk   (0x1UL << RCC_APB2RSTR_TIM16RST_Pos) /*!< 0x00020000 */
#define RCC_APB2RSTR_TIM16RST       RCC_APB2RSTR_TIM16RST_Msk
#define RCC_APB2RSTR_TIM17RST_Pos   (18U)
#define RCC_APB2RSTR_TIM17RST_Msk   (0x1UL << RCC_APB2RSTR_TIM17RST_Pos) /*!< 0x00040000 */
#define RCC_APB2RSTR_TIM17RST       RCC_APB2RSTR_TIM17RST_Msk
#define RCC_APB2RSTR_SPI5RST_Pos    (20U)
#define RCC_APB2RSTR_SPI5RST_Msk    (0x1UL << RCC_APB2RSTR_SPI5RST_Pos) /*!< 0x00100000 */
#define RCC_APB2RSTR_SPI5RST        RCC_APB2RSTR_SPI5RST_Msk
#define RCC_APB2RSTR_SAI1RST_Pos    (22U)
#define RCC_APB2RSTR_SAI1RST_Msk    (0x1UL << RCC_APB2RSTR_SAI1RST_Pos) /*!< 0x00400000 */
#define RCC_APB2RSTR_SAI1RST        RCC_APB2RSTR_SAI1RST_Msk
#define RCC_APB2RSTR_SAI2RST_Pos    (23U)
#define RCC_APB2RSTR_SAI2RST_Msk    (0x1UL << RCC_APB2RSTR_SAI2RST_Pos) /*!< 0x00800000 */
#define RCC_APB2RSTR_SAI2RST        RCC_APB2RSTR_SAI2RST_Msk
#define RCC_APB2RSTR_DFSDM1RST_Pos  (30U)
#define RCC_APB2RSTR_DFSDM1RST_Msk  (0x1UL << RCC_APB2RSTR_DFSDM1RST_Pos) /*!< 0x10000000 */
#define RCC_APB2RSTR_DFSDM1RST      RCC_APB2RSTR_DFSDM1RST_Msk

/********************  Bit definition for RCC_APB4RSTR register  ******************/
#define RCC_APB4RSTR_SYSCFGRST_Pos  (1U)
#define RCC_APB4RSTR_SYSCFGRST_Msk  (0x1UL << RCC_APB4RSTR_SYSCFGRST_Pos) /*!< 0x00000002 */
#define RCC_APB4RSTR_SYSCFGRST      RCC_APB4RSTR_SYSCFGRST_Msk
#define RCC_APB4RSTR_LPUART1RST_Pos (3U)
#define RCC_APB4RSTR_LPUART1RST_Msk (0x1UL << RCC_APB4RSTR_LPUART1RST_Pos) /*!< 0x00000008 */
#define RCC_APB4RSTR_LPUART1RST     RCC_APB4RSTR_LPUART1RST_Msk
#define RCC_APB4RSTR_SPI6RST_Pos    (5U)
#define RCC_APB4RSTR_SPI6RST_Msk    (0x1UL << RCC_APB4RSTR_SPI6RST_Pos) /*!< 0x00000020 */
#define RCC_APB4RSTR_SPI6RST        RCC_APB4RSTR_SPI6RST_Msk
#define RCC_APB4RSTR_I2C4RST_Pos    (7U)
#define RCC_APB4RSTR_I2C4RST_Msk    (0x1UL << RCC_APB4RSTR_I2C4RST_Pos) /*!< 0x00000080 */
#define RCC_APB4RSTR_I2C4RST        RCC_APB4RSTR_I2C4RST_Msk
#define RCC_APB4RSTR_LPTIM2RST_Pos  (9U)
#define RCC_APB4RSTR_LPTIM2RST_Msk  (0x1UL << RCC_APB4RSTR_LPTIM2RST_Pos) /*!< 0x00000200 */
#define RCC_APB4RSTR_LPTIM2RST      RCC_APB4RSTR_LPTIM2RST_Msk
#define RCC_APB4RSTR_LPTIM3RST_Pos  (10U)
#define RCC_APB4RSTR_LPTIM3RST_Msk  (0x1UL << RCC_APB4RSTR_LPTIM3RST_Pos) /*!< 0x00000400 */
#define RCC_APB4RSTR_LPTIM3RST      RCC_APB4RSTR_LPTIM3RST_Msk
#define RCC_APB4RSTR_DAC2RST_Pos    (13U)
#define RCC_APB4RSTR_DAC2RST_Msk    (0x1UL << RCC_APB4RSTR_DAC2RST_Pos) /*!< 0x00001000 */
#define RCC_APB4RSTR_DAC2RST        RCC_APB4RSTR_DAC2RST_Msk
#define RCC_APB4RSTR_COMP12RST_Pos  (14U)
#define RCC_APB4RSTR_COMP12RST_Msk  (0x1UL << RCC_APB4RSTR_COMP12RST_Pos) /*!< 0x00004000 */
#define RCC_APB4RSTR_COMP12RST      RCC_APB4RSTR_COMP12RST_Msk
#define RCC_APB4RSTR_VREFRST_Pos    (15U)
#define RCC_APB4RSTR_VREFRST_Msk    (0x1UL << RCC_APB4RSTR_VREFRST_Pos) /*!< 0x00008000 */
#define RCC_APB4RSTR_VREFRST        RCC_APB4RSTR_VREFRST_Msk

#define RCC_APB4RSTR_DTSRST_Pos     (26U)
#define RCC_APB4RSTR_DTSRST_Msk     (0x1UL << RCC_APB4RSTR_DTSRST_Pos) /*!< 0x04000000 */
#define RCC_APB4RSTR_DTSRST         RCC_APB4RSTR_DTSRST_Msk
#define RCC_APB4RSTR_DFSDM2RST_Pos  (27U)
#define RCC_APB4RSTR_DFSDM2RST_Msk  (0x1UL << RCC_APB4RSTR_DFSDM2RST_Pos) /*!< 0x08000000 */
#define RCC_APB4RSTR_DFSDM2RST      RCC_APB4RSTR_DFSDM2RST_Msk

/********************  Bit definition for RCC_SRDAMR register  ********************/
#define RCC_SRDAMR_BDMA2AMEN_Pos   (0U)
#define RCC_SRDAMR_BDMA2AMEN_Msk   (0x1UL << RCC_SRDAMR_BDMA2AMEN_Pos) /*!< 0x00000001 */
#define RCC_SRDAMR_BDMA2AMEN       RCC_SRDAMR_BDMA2AMEN_Msk
#define RCC_SRDAMR_GPIOAMEN_Pos    (1U)
#define RCC_SRDAMR_GPIOAMEN_Msk    (0x1UL << RCC_SRDAMR_GPIOAMEN_Pos) /*!< 0x00000001 */
#define RCC_SRDAMR_GPIOAMEN        RCC_SRDAMR_GPIOAMEN_Msk
#define RCC_SRDAMR_LPUART1AMEN_Pos (3U)
#define RCC_SRDAMR_LPUART1AMEN_Msk (0x1UL << RCC_SRDAMR_LPUART1AMEN_Pos) /*!< 0x00000008 */
#define RCC_SRDAMR_LPUART1AMEN     RCC_SRDAMR_LPUART1AMEN_Msk
#define RCC_SRDAMR_SPI6AMEN_Pos    (5U)
#define RCC_SRDAMR_SPI6AMEN_Msk    (0x1UL << RCC_SRDAMR_SPI6AMEN_Pos) /*!< 0x00000020 */
#define RCC_SRDAMR_SPI6AMEN        RCC_SRDAMR_SPI6AMEN_Msk
#define RCC_SRDAMR_I2C4AMEN_Pos    (7U)
#define RCC_SRDAMR_I2C4AMEN_Msk    (0x1UL << RCC_SRDAMR_I2C4AMEN_Pos) /*!< 0x00000080 */
#define RCC_SRDAMR_I2C4AMEN        RCC_SRDAMR_I2C4AMEN_Msk
#define RCC_SRDAMR_LPTIM2AMEN_Pos  (9U)
#define RCC_SRDAMR_LPTIM2AMEN_Msk  (0x1UL << RCC_SRDAMR_LPTIM2AMEN_Pos) /*!< 0x00000200 */
#define RCC_SRDAMR_LPTIM2AMEN      RCC_SRDAMR_LPTIM2AMEN_Msk
#define RCC_SRDAMR_LPTIM3AMEN_Pos  (10U)
#define RCC_SRDAMR_LPTIM3AMEN_Msk  (0x1UL << RCC_SRDAMR_LPTIM3AMEN_Pos) /*!< 0x00000400 */
#define RCC_SRDAMR_LPTIM3AMEN      RCC_SRDAMR_LPTIM3AMEN_Msk
#define RCC_SRDAMR_DAC2AMEN_Pos    (13U)
#define RCC_SRDAMR_DAC2AMEN_Msk    (0x1UL << RCC_SRDAMR_DAC2AMEN_Pos) /*!< 0x00004000 */
#define RCC_SRDAMR_DAC2AMEN        RCC_SRDAMR_DAC2AMEN_Msk
#define RCC_SRDAMR_COMP12AMEN_Pos  (14U)
#define RCC_SRDAMR_COMP12AMEN_Msk  (0x1UL << RCC_SRDAMR_COMP12AMEN_Pos) /*!< 0x00004000 */
#define RCC_SRDAMR_COMP12AMEN      RCC_SRDAMR_COMP12AMEN_Msk
#define RCC_SRDAMR_VREFAMEN_Pos    (15U)
#define RCC_SRDAMR_VREFAMEN_Msk    (0x1UL << RCC_SRDAMR_VREFAMEN_Pos) /*!< 0x00008000 */
#define RCC_SRDAMR_VREFAMEN        RCC_SRDAMR_VREFAMEN_Msk
#define RCC_SRDAMR_RTCAMEN_Pos     (16U)
#define RCC_SRDAMR_RTCAMEN_Msk     (0x1UL << RCC_SRDAMR_RTCAMEN_Pos) /*!< 0x00010000 */
#define RCC_SRDAMR_RTCAMEN         RCC_SRDAMR_RTCAMEN_Msk
#define RCC_SRDAMR_DTSAMEN_Pos     (26U)
#define RCC_SRDAMR_DTSAMEN_Msk     (0x1UL << RCC_SRDAMR_DTSAMEN_Pos) /*!< 0x04000000 */
#define RCC_SRDAMR_DTSAMEN         RCC_SRDAMR_DTSAMEN_Msk
#define RCC_SRDAMR_DFSDM2AMEN_Pos  (27U)
#define RCC_SRDAMR_DFSDM2AMEN_Msk  (0x1UL << RCC_SRDAMR_DFSDM2AMEN_Pos) /*!< 0x20000000 */
#define RCC_SRDAMR_DFSDM2AMEN      RCC_SRDAMR_DFSDM2AMEN_Msk
#define RCC_SRDAMR_BKPRAMAMEN_Pos  (28U)
#define RCC_SRDAMR_BKPRAMAMEN_Msk  (0x1UL << RCC_SRDAMR_BKPRAMAMEN_Pos) /*!< 0x10000000 */
#define RCC_SRDAMR_BKPRAMAMEN      RCC_SRDAMR_BKPRAMAMEN_Msk
#define RCC_SRDAMR_SRDSRAMAMEN_Pos (29U)
#define RCC_SRDAMR_SRDSRAMAMEN_Msk (0x1UL << RCC_SRDAMR_SRDSRAMAMEN_Pos) /*!< 0x20000000 */
#define RCC_SRDAMR_SRDSRAMAMEN     RCC_SRDAMR_SRDSRAMAMEN_Msk
/********************  Bit definition for RCC_CKGAENR register  ********************/
#define RCC_CKGAENR_AXICKG_Pos      (0U)
#define RCC_CKGAENR_AXICKG_Msk      (0x1UL << RCC_CKGAENR_AXICKG_Pos) /*!< 0x00000001 */
#define RCC_CKGAENR_AXICKG          RCC_CKGAENR_AXICKG_Msk
#define RCC_CKGAENR_AHBCKG_Pos      (1U)
#define RCC_CKGAENR_AHBCKG_Msk      (0x1UL << RCC_CKGAENR_AHBCKG_Pos) /*!< 0x00000002 */
#define RCC_CKGAENR_AHBCKG          RCC_CKGAENR_AHBCKG_Msk
#define RCC_CKGAENR_CPUCKG_Pos      (2U)
#define RCC_CKGAENR_CPUCKG_Msk      (0x1UL << RCC_CKGAENR_CPUCKG_Pos) /*!< 0x00000004 */
#define RCC_CKGAENR_CPUCKG          RCC_CKGAENR_CPUCKG_Msk
#define RCC_CKGAENR_SDMMCCKG_Pos    (3U)
#define RCC_CKGAENR_SDMMCCKG_Msk    (0x1UL << RCC_CKGAENR_SDMMCCKG_Pos) /*!< 0x00000008 */
#define RCC_CKGAENR_SDMMCCKG        RCC_CKGAENR_SDMMCCKG_Msk
#define RCC_CKGAENR_MDMACKG_Pos     (4U)
#define RCC_CKGAENR_MDMACKG_Msk     (0x1UL << RCC_CKGAENR_MDMACKG_Pos) /*!< 0x00000010 */
#define RCC_CKGAENR_MDMACKG         RCC_CKGAENR_MDMACKG_Msk
#define RCC_CKGAENR_DMA2DCKG_Pos    (5U)
#define RCC_CKGAENR_DMA2DCKG_Msk    (0x1UL << RCC_CKGAENR_DMA2DCKG_Pos) /*!< 0x00000020 */
#define RCC_CKGAENR_DMA2DCKG        RCC_CKGAENR_DMA2DCKG_Msk
#define RCC_CKGAENR_LTDCCKG_Pos     (6U)
#define RCC_CKGAENR_LTDCCKG_Msk     (0x1UL << RCC_CKGAENR_LTDCCKG_Pos) /*!< 0x00000040 */
#define RCC_CKGAENR_LTDCCKG         RCC_CKGAENR_LTDCCKG_Msk
#define RCC_CKGAENR_GFXMMUMCKG_Pos  (7U)
#define RCC_CKGAENR_GFXMMUMCKG_Msk  (0x1UL << RCC_CKGAENR_GFXMMUMCKG_Pos) /*!< 0x00000080 */
#define RCC_CKGAENR_GFXMMUMCKG      RCC_CKGAENR_GFXMMUMCKG_Msk
#define RCC_CKGAENR_AHB12CKG_Pos    (8U)
#define RCC_CKGAENR_AHB12CKG_Msk    (0x1UL << RCC_CKGAENR_AHB12CKG_Pos) /*!< 0x00000100 */
#define RCC_CKGAENR_AHB12CKG        RCC_CKGAENR_AHB12CKG_Msk
#define RCC_CKGAENR_AHB34CKG_Pos    (9U)
#define RCC_CKGAENR_AHB34CKG_Msk    (0x1UL << RCC_CKGAENR_AHB34CKG_Pos) /*!< 0x00000200 */
#define RCC_CKGAENR_AHB34CKG        RCC_CKGAENR_AHB34CKG_Msk
#define RCC_CKGAENR_FLIFTCKG_Pos    (10U)
#define RCC_CKGAENR_FLIFTCKG_Msk    (0x1UL << RCC_CKGAENR_FLIFTCKG_Pos) /*!< 0x00000400 */
#define RCC_CKGAENR_FLIFTCKG        RCC_CKGAENR_FLIFTCKG_Msk
#define RCC_CKGAENR_OCTOSPI2CKG_Pos (11U)
#define RCC_CKGAENR_OCTOSPI2CKG_Msk (0x1UL << RCC_CKGAENR_OCTOSPI2CKG_Pos) /*!< 0x00000800 */
#define RCC_CKGAENR_OCTOSPI2CKG     RCC_CKGAENR_OCTOSPI2CKG_Msk
#define RCC_CKGAENR_FMCCKG_Pos      (12U)
#define RCC_CKGAENR_FMCCKG_Msk      (0x1UL << RCC_CKGAENR_FMCCKG_Pos) /*!< 0x00001000 */
#define RCC_CKGAENR_FMCCKG          RCC_CKGAENR_FMCCKG_Msk
#define RCC_CKGAENR_OCTOSPI1CKG_Pos (13U)
#define RCC_CKGAENR_OCTOSPI1CKG_Msk (0x1UL << RCC_CKGAENR_OCTOSPI1CKG_Pos) /*!< 0x00002000 */
#define RCC_CKGAENR_OCTOSPI1CKG     RCC_CKGAENR_OCTOSPI1CKG_Msk
#define RCC_CKGAENR_AXIRAM1CKG_Pos  (14U)
#define RCC_CKGAENR_AXIRAM1CKG_Msk  (0x1UL << RCC_CKGAENR_AXIRAM1CKG_Pos) /*!< 0x00004000 */
#define RCC_CKGAENR_AXIRAM1CKG      RCC_CKGAENR_AXIRAM1CKG_Msk
#define RCC_CKGAENR_AXIRAM2CKG_Pos  (15U)
#define RCC_CKGAENR_AXIRAM2CKG_Msk  (0x1UL << RCC_CKGAENR_AXIRAM2CKG_Pos) /*!< 0x00008000 */
#define RCC_CKGAENR_AXIRAM2CKG      RCC_CKGAENR_AXIRAM2CKG_Msk
#define RCC_CKGAENR_AXIRAM3CKG_Pos  (16U)
#define RCC_CKGAENR_AXIRAM3CKG_Msk  (0x1UL << RCC_CKGAENR_AXIRAM3CKG_Pos) /*!< 0x00010000 */
#define RCC_CKGAENR_AXIRAM3CKG      RCC_CKGAENR_AXIRAM3CKG_Msk
#define RCC_CKGAENR_GFXMMUSCKG_Pos  (17U)
#define RCC_CKGAENR_GFXMMUSCKG_Msk  (0x1UL << RCC_CKGAENR_GFXMMUSCKG_Pos) /*!< 0x00020000 */
#define RCC_CKGAENR_GFXMMUSCKG      RCC_CKGAENR_GFXMMUSCKG_Msk
#define RCC_CKGAENR_ECCRAMCKG_Pos   (29U)
#define RCC_CKGAENR_ECCRAMCKG_Msk   (0x1UL << RCC_CKGAENR_ECCRAMCKG_Pos) /*!< 0x20000000 */
#define RCC_CKGAENR_ECCRAMCKG       RCC_CKGAENR_ECCRAMCKG_Msk
#define RCC_CKGAENR_EXTICKG_Pos     (30U)
#define RCC_CKGAENR_EXTICKG_Msk     (0x1UL << RCC_CKGAENR_EXTICKG_Pos) /*!< 0x40000000 */
#define RCC_CKGAENR_EXTICKG         RCC_CKGAENR_EXTICKG_Msk
#define RCC_CKGAENR_JTAGCKG_Pos     (31U)
#define RCC_CKGAENR_JTAGCKG_Msk     (0x1UL << RCC_CKGAENR_JTAGCKG_Pos) /*!< 0x80000008 */
#define RCC_CKGAENR_JTAGCKG         RCC_CKGAENR_JTAGCKG_Msk
/********************  Bit definition for RCC_AHB3LPENR register  **************/
#define RCC_AHB3LPENR_MDMALPEN_Pos     (0U)
#define RCC_AHB3LPENR_MDMALPEN_Msk     (0x1UL << RCC_AHB3LPENR_MDMALPEN_Pos) /*!< 0x00000001 */
#define RCC_AHB3LPENR_MDMALPEN         RCC_AHB3LPENR_MDMALPEN_Msk
#define RCC_AHB3LPENR_DMA2DLPEN_Pos    (4U)
#define RCC_AHB3LPENR_DMA2DLPEN_Msk    (0x1UL << RCC_AHB3LPENR_DMA2DLPEN_Pos) /*!< 0x00000010 */
#define RCC_AHB3LPENR_DMA2DLPEN        RCC_AHB3LPENR_DMA2DLPEN_Msk
#define RCC_AHB3LPENR_JPGDECLPEN_Pos   (5U)
#define RCC_AHB3LPENR_JPGDECLPEN_Msk   (0x1UL << RCC_AHB3LPENR_JPGDECLPEN_Pos) /*!< 0x00000020 */
#define RCC_AHB3LPENR_JPGDECLPEN       RCC_AHB3LPENR_JPGDECLPEN_Msk
#define RCC_AHB3LPENR_FLASHLPEN_Pos    (8U)
#define RCC_AHB3LPENR_FLASHLPEN_Msk    (0x1UL << RCC_AHB3LPENR_FLASHLPEN_Pos) /*!< 0x00000100 */
#define RCC_AHB3LPENR_FLASHLPEN        RCC_AHB3LPENR_FLASHLPEN_Msk
#define RCC_AHB3LPENR_FMCLPEN_Pos      (12U)
#define RCC_AHB3LPENR_FMCLPEN_Msk      (0x1UL << RCC_AHB3LPENR_FMCLPEN_Pos) /*!< 0x00001000 */
#define RCC_AHB3LPENR_FMCLPEN          RCC_AHB3LPENR_FMCLPEN_Msk
#define RCC_AHB3LPENR_OSPI1LPEN_Pos    (14U)
#define RCC_AHB3LPENR_OSPI1LPEN_Msk    (0x1UL << RCC_AHB3LPENR_OSPI1LPEN_Pos) /*!< 0x00004000 */
#define RCC_AHB3LPENR_OSPI1LPEN        RCC_AHB3LPENR_OSPI1LPEN_Msk
#define RCC_AHB3LPENR_SDMMC1LPEN_Pos   (16U)
#define RCC_AHB3LPENR_SDMMC1LPEN_Msk   (0x1UL << RCC_AHB3LPENR_SDMMC1LPEN_Pos) /*!< 0x00010000 */
#define RCC_AHB3LPENR_SDMMC1LPEN       RCC_AHB3LPENR_SDMMC1LPEN_Msk
#define RCC_AHB3LPENR_OSPI2LPEN_Pos    (19U)
#define RCC_AHB3LPENR_OSPI2LPEN_Msk    (0x1UL << RCC_AHB3LPENR_OSPI2LPEN_Pos) /*!< 0x00080000 */
#define RCC_AHB3LPENR_OSPI2LPEN        RCC_AHB3LPENR_OSPI2LPEN_Msk
#define RCC_AHB3LPENR_IOMNGRLPEN_Pos   (21U)
#define RCC_AHB3LPENR_IOMNGRLPEN_Msk   (0x1UL << RCC_AHB3LPENR_IOMNGRLPEN_Pos) /*!< 0x00200000 */
#define RCC_AHB3LPENR_IOMNGRLPEN       RCC_AHB3LPENR_IOMNGRLPEN_Msk
#define RCC_AHB3LPENR_GFXMMULPEN_Pos   (24U)
#define RCC_AHB3LPENR_GFXMMULPEN_Msk   (0x1UL << RCC_AHB3LPENR_GFXMMULPEN_Pos) /*!< 0x01000000 */
#define RCC_AHB3LPENR_GFXMMULPEN       RCC_AHB3LPENR_GFXMMULPEN_Msk
#define RCC_AHB3LPENR_AXISRAM2LPEN_Pos (26U)
#define RCC_AHB3LPENR_AXISRAM2LPEN_Msk (0x1UL << RCC_AHB3LPENR_AXISRAM2LPEN_Pos) /*!< 0x02000000 */
#define RCC_AHB3LPENR_AXISRAM2LPEN     RCC_AHB3LPENR_AXISRAM2LPEN_Msk
#define RCC_AHB3LPENR_AXISRAM3LPEN_Pos (27U)
#define RCC_AHB3LPENR_AXISRAM3LPEN_Msk (0x1UL << RCC_AHB3LPENR_AXISRAM3LPEN_Pos) /*!< 0x04000000 */
#define RCC_AHB3LPENR_AXISRAM3LPEN     RCC_AHB3LPENR_AXISRAM3LPEN_Msk
#define RCC_AHB3LPENR_DTCM1LPEN_Pos    (28U)
#define RCC_AHB3LPENR_DTCM1LPEN_Msk    (0x1UL << RCC_AHB3LPENR_DTCM1LPEN_Pos) /*!< 0x10000000 */
#define RCC_AHB3LPENR_DTCM1LPEN        RCC_AHB3LPENR_DTCM1LPEN_Msk
#define RCC_AHB3LPENR_DTCM2LPEN_Pos    (29U)
#define RCC_AHB3LPENR_DTCM2LPEN_Msk    (0x1UL << RCC_AHB3LPENR_DTCM2LPEN_Pos) /*!< 0x20000000 */
#define RCC_AHB3LPENR_DTCM2LPEN        RCC_AHB3LPENR_DTCM2LPEN_Msk
#define RCC_AHB3LPENR_ITCMLPEN_Pos     (30U)
#define RCC_AHB3LPENR_ITCMLPEN_Msk     (0x1UL << RCC_AHB3LPENR_ITCMLPEN_Pos) /*!< 0x40000000 */
#define RCC_AHB3LPENR_ITCMLPEN         RCC_AHB3LPENR_ITCMLPEN_Msk
#define RCC_AHB3LPENR_AXISRAM1LPEN_Pos (31U)
#define RCC_AHB3LPENR_AXISRAM1LPEN_Msk (0x1UL << RCC_AHB3LPENR_AXISRAM1LPEN_Pos) /*!< 0x80000000 */
#define RCC_AHB3LPENR_AXISRAM1LPEN     RCC_AHB3LPENR_AXISRAM1LPEN_Msk

