Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/* Legacy define */
#define RCC_AHB3LPENR_AXISRAMLPEN_Pos RCC_AHB3LPENR_AXISRAM1LPEN_Pos
#define RCC_AHB3LPENR_AXISRAMLPEN_Msk RCC_AHB3LPENR_AXISRAM1LPEN_Msk
#define RCC_AHB3LPENR_AXISRAMLPEN     RCC_AHB3LPENR_AXISRAM1LPEN
/********************  Bit definition for RCC_AHB1LPENR register  ***************/
#define RCC_AHB1LPENR_DMA1LPEN_Pos          (0U)
#define RCC_AHB1LPENR_DMA1LPEN_Msk          (0x1UL << RCC_AHB1LPENR_DMA1LPEN_Pos) /*!< 0x00000001 */
#define RCC_AHB1LPENR_DMA1LPEN              RCC_AHB1LPENR_DMA1LPEN_Msk
#define RCC_AHB1LPENR_DMA2LPEN_Pos          (1U)
#define RCC_AHB1LPENR_DMA2LPEN_Msk          (0x1UL << RCC_AHB1LPENR_DMA2LPEN_Pos) /*!< 0x00000002 */
#define RCC_AHB1LPENR_DMA2LPEN              RCC_AHB1LPENR_DMA2LPEN_Msk
#define RCC_AHB1LPENR_ADC12LPEN_Pos         (5U)
#define RCC_AHB1LPENR_ADC12LPEN_Msk         (0x1UL << RCC_AHB1LPENR_ADC12LPEN_Pos) /*!< 0x00000020 */
#define RCC_AHB1LPENR_ADC12LPEN             RCC_AHB1LPENR_ADC12LPEN_Msk
#define RCC_AHB1LPENR_CRCLPEN_Pos           (9U)
#define RCC_AHB1LPENR_CRCLPEN_Msk           (0x1UL << RCC_AHB1LPENR_CRCLPEN_Pos) /*!< 0x00008000 */
#define RCC_AHB1LPENR_CRCLPEN               RCC_AHB1LPENR_CRCLPEN_Msk
#define RCC_AHB1LPENR_USB1OTGHSLPEN_Pos     (25U)
#define RCC_AHB1LPENR_USB1OTGHSLPEN_Msk     (0x1UL << RCC_AHB1LPENR_USB1OTGHSLPEN_Pos) /*!< 0x02000000 */
#define RCC_AHB1LPENR_USB1OTGHSLPEN         RCC_AHB1LPENR_USB1OTGHSLPEN_Msk
#define RCC_AHB1LPENR_USB1OTGHSULPILPEN_Pos (26U)
#define RCC_AHB1LPENR_USB1OTGHSULPILPEN_Msk (0x1UL << RCC_AHB1LPENR_USB1OTGHSULPILPEN_Pos) /*!< 0x04000000 */
#define RCC_AHB1LPENR_USB1OTGHSULPILPEN     RCC_AHB1LPENR_USB1OTGHSULPILPEN_Msk

/********************  Bit definition for RCC_AHB2LPENR register  ***************/
#define RCC_AHB2LPENR_DCMI_PSSILPEN_Pos (0U)
#define RCC_AHB2LPENR_DCMI_PSSILPEN_Msk (0x1UL << RCC_AHB2LPENR_DCMI_PSSILPEN_Pos) /*!< 0x00000001 */
#define RCC_AHB2LPENR_DCMI_PSSILPEN     RCC_AHB2LPENR_DCMI_PSSILPEN_Msk
#define RCC_AHB2LPENR_RNGLPEN_Pos       (6U)
#define RCC_AHB2LPENR_RNGLPEN_Msk       (0x1UL << RCC_AHB2LPENR_RNGLPEN_Pos) /*!< 0x00000040 */
#define RCC_AHB2LPENR_RNGLPEN           RCC_AHB2LPENR_RNGLPEN_Msk
#define RCC_AHB2LPENR_SDMMC2LPEN_Pos    (9U)
#define RCC_AHB2LPENR_SDMMC2LPEN_Msk    (0x1UL << RCC_AHB2LPENR_SDMMC2LPEN_Pos) /*!< 0x00000200 */
#define RCC_AHB2LPENR_SDMMC2LPEN        RCC_AHB2LPENR_SDMMC2LPEN_Msk
#define RCC_AHB2LPENR_BDMA1LPEN_Pos     (11U)
#define RCC_AHB2LPENR_BDMA1LPEN_Msk     (0x1UL << RCC_AHB2LPENR_BDMA1LPEN_Pos) /*!< 0x00000800 */
#define RCC_AHB2LPENR_BDMA1LPEN         RCC_AHB2LPENR_BDMA1LPEN_Msk
#define RCC_AHB2LPENR_AHBSRAM1LPEN_Pos  (29U)
#define RCC_AHB2LPENR_AHBSRAM1LPEN_Msk  (0x1UL << RCC_AHB2LPENR_AHBSRAM1LPEN_Pos) /*!< 0x20000000 */
#define RCC_AHB2LPENR_AHBSRAM1LPEN      RCC_AHB2LPENR_AHBSRAM1LPEN_Msk
#define RCC_AHB2LPENR_AHBSRAM2LPEN_Pos  (30U)
#define RCC_AHB2LPENR_AHBSRAM2LPEN_Msk  (0x1UL << RCC_AHB2LPENR_AHBSRAM2LPEN_Pos) /*!< 0x40000000 */
#define RCC_AHB2LPENR_AHBSRAM2LPEN      RCC_AHB2LPENR_AHBSRAM2LPEN_Msk

/* Legacy define */
#define RCC_AHB2LPENR_DFSDMDMALPEN_Pos RCC_AHB2LPENR_BDMA1LPEN_Pos
#define RCC_AHB2LPENR_DFSDMDMALPEN_Msk RCC_AHB2LPENR_BDMA1LPEN_Msk
#define RCC_AHB2LPENR_DFSDMDMALPEN     RCC_AHB2LPENR_BDMA1LPEN
#define RCC_AHB2LPENR_DCMILPEN_Pos     RCC_AHB2LPENR_DCMI_PSSILPEN_Pos
#define RCC_AHB2LPENR_DCMILPEN_Msk     RCC_AHB2LPENR_DCMI_PSSILPEN_Msk
#define RCC_AHB2LPENR_DCMILPEN         RCC_AHB2LPENR_DCMI_PSSILPEN

/********************  Bit definition for RCC_AHB4LPENR register  ******************/
#define RCC_AHB4LPENR_GPIOALPEN_Pos   (0U)
#define RCC_AHB4LPENR_GPIOALPEN_Msk   (0x1UL << RCC_AHB4LPENR_GPIOALPEN_Pos) /*!< 0x00000001 */
#define RCC_AHB4LPENR_GPIOALPEN       RCC_AHB4LPENR_GPIOALPEN_Msk
#define RCC_AHB4LPENR_GPIOBLPEN_Pos   (1U)
#define RCC_AHB4LPENR_GPIOBLPEN_Msk   (0x1UL << RCC_AHB4LPENR_GPIOBLPEN_Pos) /*!< 0x00000002 */
#define RCC_AHB4LPENR_GPIOBLPEN       RCC_AHB4LPENR_GPIOBLPEN_Msk
#define RCC_AHB4LPENR_GPIOCLPEN_Pos   (2U)
#define RCC_AHB4LPENR_GPIOCLPEN_Msk   (0x1UL << RCC_AHB4LPENR_GPIOCLPEN_Pos) /*!< 0x00000004 */
#define RCC_AHB4LPENR_GPIOCLPEN       RCC_AHB4LPENR_GPIOCLPEN_Msk
#define RCC_AHB4LPENR_GPIODLPEN_Pos   (3U)
#define RCC_AHB4LPENR_GPIODLPEN_Msk   (0x1UL << RCC_AHB4LPENR_GPIODLPEN_Pos) /*!< 0x00000008 */
#define RCC_AHB4LPENR_GPIODLPEN       RCC_AHB4LPENR_GPIODLPEN_Msk
#define RCC_AHB4LPENR_GPIOELPEN_Pos   (4U)
#define RCC_AHB4LPENR_GPIOELPEN_Msk   (0x1UL << RCC_AHB4LPENR_GPIOELPEN_Pos) /*!< 0x00000010 */
#define RCC_AHB4LPENR_GPIOELPEN       RCC_AHB4LPENR_GPIOELPEN_Msk
#define RCC_AHB4LPENR_GPIOFLPEN_Pos   (5U)
#define RCC_AHB4LPENR_GPIOFLPEN_Msk   (0x1UL << RCC_AHB4LPENR_GPIOFLPEN_Pos) /*!< 0x00000020 */
#define RCC_AHB4LPENR_GPIOFLPEN       RCC_AHB4LPENR_GPIOFLPEN_Msk
#define RCC_AHB4LPENR_GPIOGLPEN_Pos   (6U)
#define RCC_AHB4LPENR_GPIOGLPEN_Msk   (0x1UL << RCC_AHB4LPENR_GPIOGLPEN_Pos) /*!< 0x00000040 */
#define RCC_AHB4LPENR_GPIOGLPEN       RCC_AHB4LPENR_GPIOGLPEN_Msk
#define RCC_AHB4LPENR_GPIOHLPEN_Pos   (7U)
#define RCC_AHB4LPENR_GPIOHLPEN_Msk   (0x1UL << RCC_AHB4LPENR_GPIOHLPEN_Pos) /*!< 0x00000080 */
#define RCC_AHB4LPENR_GPIOHLPEN       RCC_AHB4LPENR_GPIOHLPEN_Msk
#define RCC_AHB4LPENR_GPIOILPEN_Pos   (8U)
#define RCC_AHB4LPENR_GPIOILPEN_Msk   (0x1UL << RCC_AHB4LPENR_GPIOILPEN_Pos) /*!< 0x00000100 */
#define RCC_AHB4LPENR_GPIOILPEN       RCC_AHB4LPENR_GPIOILPEN_Msk
#define RCC_AHB4LPENR_GPIOJLPEN_Pos   (9U)
#define RCC_AHB4LPENR_GPIOJLPEN_Msk   (0x1UL << RCC_AHB4LPENR_GPIOJLPEN_Pos) /*!< 0x00000200 */
#define RCC_AHB4LPENR_GPIOJLPEN       RCC_AHB4LPENR_GPIOJLPEN_Msk
#define RCC_AHB4LPENR_GPIOKLPEN_Pos   (10U)
#define RCC_AHB4LPENR_GPIOKLPEN_Msk   (0x1UL << RCC_AHB4LPENR_GPIOKLPEN_Pos) /*!< 0x00000400 */
#define RCC_AHB4LPENR_GPIOKLPEN       RCC_AHB4LPENR_GPIOKLPEN_Msk
#define RCC_AHB4LPENR_BDMA2LPEN_Pos   (21U)
#define RCC_AHB4LPENR_BDMA2LPEN_Msk   (0x1UL << RCC_AHB4LPENR_BDMA2LPEN_Pos) /*!< 0x00200000 */
#define RCC_AHB4LPENR_BDMA2LPEN       RCC_AHB4LPENR_BDMA2LPEN_Msk
#define RCC_AHB4LPENR_BKPRAMLPEN_Pos  (28U)
#define RCC_AHB4LPENR_BKPRAMLPEN_Msk  (0x1UL << RCC_AHB4LPENR_BKPRAMLPEN_Pos) /*!< 0x10000000 */
#define RCC_AHB4LPENR_BKPRAMLPEN      RCC_AHB4LPENR_BKPRAMLPEN_Msk
#define RCC_AHB4LPENR_SRDSRAMLPEN_Pos (29U)
#define RCC_AHB4LPENR_SRDSRAMLPEN_Msk (0x1UL << RCC_AHB4LPENR_SRDSRAMLPEN_Pos) /*!< 0x20000000 */
#define RCC_AHB4LPENR_SRDSRAMLPEN     RCC_AHB4LPENR_SRDSRAMLPEN_Msk

/********************  Bit definition for RCC_APB3LPENR register  ******************/
#define RCC_APB3LPENR_LTDCLPEN_Pos (3U)
#define RCC_APB3LPENR_LTDCLPEN_Msk (0x1UL << RCC_APB3LPENR_LTDCLPEN_Pos) /*!< 0x00000008 */
#define RCC_APB3LPENR_LTDCLPEN     RCC_APB3LPENR_LTDCLPEN_Msk
#define RCC_APB3LPENR_WWDGLPEN_Pos (6U)
#define RCC_APB3LPENR_WWDGLPEN_Msk (0x1UL << RCC_APB3LPENR_WWDGLPEN_Pos) /*!< 0x00000040 */
#define RCC_APB3LPENR_WWDGLPEN     RCC_APB3LPENR_WWDGLPEN_Msk

