Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bits definition for RTC_DR register  *******************/
#define RTC_DR_YT_Pos  (20U)
#define RTC_DR_YT_Msk  (0xFUL << RTC_DR_YT_Pos) /*!< 0x00F00000 */
#define RTC_DR_YT      RTC_DR_YT_Msk
#define RTC_DR_YT_0    (0x1UL << RTC_DR_YT_Pos) /*!< 0x00100000 */
#define RTC_DR_YT_1    (0x2UL << RTC_DR_YT_Pos) /*!< 0x00200000 */
#define RTC_DR_YT_2    (0x4UL << RTC_DR_YT_Pos) /*!< 0x00400000 */
#define RTC_DR_YT_3    (0x8UL << RTC_DR_YT_Pos) /*!< 0x00800000 */
#define RTC_DR_YU_Pos  (16U)
#define RTC_DR_YU_Msk  (0xFUL << RTC_DR_YU_Pos) /*!< 0x000F0000 */
#define RTC_DR_YU      RTC_DR_YU_Msk
#define RTC_DR_YU_0    (0x1UL << RTC_DR_YU_Pos) /*!< 0x00010000 */
#define RTC_DR_YU_1    (0x2UL << RTC_DR_YU_Pos) /*!< 0x00020000 */
#define RTC_DR_YU_2    (0x4UL << RTC_DR_YU_Pos) /*!< 0x00040000 */
#define RTC_DR_YU_3    (0x8UL << RTC_DR_YU_Pos) /*!< 0x00080000 */
#define RTC_DR_WDU_Pos (13U)
#define RTC_DR_WDU_Msk (0x7UL << RTC_DR_WDU_Pos) /*!< 0x0000E000 */
#define RTC_DR_WDU     RTC_DR_WDU_Msk
#define RTC_DR_WDU_0   (0x1UL << RTC_DR_WDU_Pos) /*!< 0x00002000 */
#define RTC_DR_WDU_1   (0x2UL << RTC_DR_WDU_Pos) /*!< 0x00004000 */
#define RTC_DR_WDU_2   (0x4UL << RTC_DR_WDU_Pos) /*!< 0x00008000 */
#define RTC_DR_MT_Pos  (12U)
#define RTC_DR_MT_Msk  (0x1UL << RTC_DR_MT_Pos) /*!< 0x00001000 */
#define RTC_DR_MT      RTC_DR_MT_Msk
#define RTC_DR_MU_Pos  (8U)
#define RTC_DR_MU_Msk  (0xFUL << RTC_DR_MU_Pos) /*!< 0x00000F00 */
#define RTC_DR_MU      RTC_DR_MU_Msk
#define RTC_DR_MU_0    (0x1UL << RTC_DR_MU_Pos) /*!< 0x00000100 */
#define RTC_DR_MU_1    (0x2UL << RTC_DR_MU_Pos) /*!< 0x00000200 */
#define RTC_DR_MU_2    (0x4UL << RTC_DR_MU_Pos) /*!< 0x00000400 */
#define RTC_DR_MU_3    (0x8UL << RTC_DR_MU_Pos) /*!< 0x00000800 */
#define RTC_DR_DT_Pos  (4U)
#define RTC_DR_DT_Msk  (0x3UL << RTC_DR_DT_Pos) /*!< 0x00000030 */
#define RTC_DR_DT      RTC_DR_DT_Msk
#define RTC_DR_DT_0    (0x1UL << RTC_DR_DT_Pos) /*!< 0x00000010 */
#define RTC_DR_DT_1    (0x2UL << RTC_DR_DT_Pos) /*!< 0x00000020 */
#define RTC_DR_DU_Pos  (0U)
#define RTC_DR_DU_Msk  (0xFUL << RTC_DR_DU_Pos) /*!< 0x0000000F */
#define RTC_DR_DU      RTC_DR_DU_Msk
#define RTC_DR_DU_0    (0x1UL << RTC_DR_DU_Pos) /*!< 0x00000001 */
#define RTC_DR_DU_1    (0x2UL << RTC_DR_DU_Pos) /*!< 0x00000002 */
#define RTC_DR_DU_2    (0x4UL << RTC_DR_DU_Pos) /*!< 0x00000004 */
#define RTC_DR_DU_3    (0x8UL << RTC_DR_DU_Pos) /*!< 0x00000008 */

/********************  Bits definition for RTC_CR register  *******************/
#define RTC_CR_OUT2EN_Pos        (31U)
#define RTC_CR_OUT2EN_Msk        (0x1UL << RTC_CR_OUT2EN_Pos) /*!< 0x80000000 */
#define RTC_CR_OUT2EN            RTC_CR_OUT2EN_Msk            /*!<RTC_OUT2 output enable */
#define RTC_CR_TAMPALRM_TYPE_Pos (30U)
#define RTC_CR_TAMPALRM_TYPE_Msk (0x1UL << RTC_CR_TAMPALRM_TYPE_Pos) /*!< 0x40000000 */
#define RTC_CR_TAMPALRM_TYPE     RTC_CR_TAMPALRM_TYPE_Msk            /*!<TAMPALARM output type  */
#define RTC_CR_TAMPALRM_PU_Pos   (29U)
#define RTC_CR_TAMPALRM_PU_Msk   (0x1UL << RTC_CR_TAMPALRM_PU_Pos) /*!< 0x20000000 */
#define RTC_CR_TAMPALRM_PU       RTC_CR_TAMPALRM_PU_Msk            /*!<TAMPALARM output pull-up config */
#define RTC_CR_TAMPOE_Pos        (26U)
#define RTC_CR_TAMPOE_Msk        (0x1UL << RTC_CR_TAMPOE_Pos) /*!< 0x04000000 */
#define RTC_CR_TAMPOE            RTC_CR_TAMPOE_Msk            /*!<Tamper detection output enable on TAMPALARM  */
#define RTC_CR_TAMPTS_Pos        (25U)
#define RTC_CR_TAMPTS_Msk        (0x1UL << RTC_CR_TAMPTS_Pos) /*!< 0x02000000 */
#define RTC_CR_TAMPTS            RTC_CR_TAMPTS_Msk            /*!<Activate timestamp on tamper detection event  */
#define RTC_CR_ITSE_Pos          (24U)
#define RTC_CR_ITSE_Msk          (0x1UL << RTC_CR_ITSE_Pos) /*!< 0x01000000 */
#define RTC_CR_ITSE              RTC_CR_ITSE_Msk
#define RTC_CR_COE_Pos           (23U)
#define RTC_CR_COE_Msk           (0x1UL << RTC_CR_COE_Pos) /*!< 0x00800000 */
#define RTC_CR_COE               RTC_CR_COE_Msk
#define RTC_CR_OSEL_Pos          (21U)
#define RTC_CR_OSEL_Msk          (0x3UL << RTC_CR_OSEL_Pos) /*!< 0x00600000 */
#define RTC_CR_OSEL              RTC_CR_OSEL_Msk
#define RTC_CR_OSEL_0            (0x1UL << RTC_CR_OSEL_Pos) /*!< 0x00200000 */
#define RTC_CR_OSEL_1            (0x2UL << RTC_CR_OSEL_Pos) /*!< 0x00400000 */
#define RTC_CR_POL_Pos           (20U)
#define RTC_CR_POL_Msk           (0x1UL << RTC_CR_POL_Pos) /*!< 0x00100000 */
#define RTC_CR_POL               RTC_CR_POL_Msk
#define RTC_CR_COSEL_Pos         (19U)
#define RTC_CR_COSEL_Msk         (0x1UL << RTC_CR_COSEL_Pos) /*!< 0x00080000 */
#define RTC_CR_COSEL             RTC_CR_COSEL_Msk
#define RTC_CR_BKP_Pos           (18U)
#define RTC_CR_BKP_Msk           (0x1UL << RTC_CR_BKP_Pos) /*!< 0x00040000 */
#define RTC_CR_BKP               RTC_CR_BKP_Msk
#define RTC_CR_SUB1H_Pos         (17U)
#define RTC_CR_SUB1H_Msk         (0x1UL << RTC_CR_SUB1H_Pos) /*!< 0x00020000 */
#define RTC_CR_SUB1H             RTC_CR_SUB1H_Msk
#define RTC_CR_ADD1H_Pos         (16U)
#define RTC_CR_ADD1H_Msk         (0x1UL << RTC_CR_ADD1H_Pos) /*!< 0x00010000 */
#define RTC_CR_ADD1H             RTC_CR_ADD1H_Msk
#define RTC_CR_TSIE_Pos          (15U)
#define RTC_CR_TSIE_Msk          (0x1UL << RTC_CR_TSIE_Pos) /*!< 0x00008000 */
#define RTC_CR_TSIE              RTC_CR_TSIE_Msk
#define RTC_CR_WUTIE_Pos         (14U)
#define RTC_CR_WUTIE_Msk         (0x1UL << RTC_CR_WUTIE_Pos) /*!< 0x00004000 */
#define RTC_CR_WUTIE             RTC_CR_WUTIE_Msk
#define RTC_CR_ALRBIE_Pos        (13U)
#define RTC_CR_ALRBIE_Msk        (0x1UL << RTC_CR_ALRBIE_Pos) /*!< 0x00002000 */
#define RTC_CR_ALRBIE            RTC_CR_ALRBIE_Msk
#define RTC_CR_ALRAIE_Pos        (12U)
#define RTC_CR_ALRAIE_Msk        (0x1UL << RTC_CR_ALRAIE_Pos) /*!< 0x00001000 */
#define RTC_CR_ALRAIE            RTC_CR_ALRAIE_Msk
#define RTC_CR_TSE_Pos           (11U)
#define RTC_CR_TSE_Msk           (0x1UL << RTC_CR_TSE_Pos) /*!< 0x00000800 */
#define RTC_CR_TSE               RTC_CR_TSE_Msk
#define RTC_CR_WUTE_Pos          (10U)
#define RTC_CR_WUTE_Msk          (0x1UL << RTC_CR_WUTE_Pos) /*!< 0x00000400 */
#define RTC_CR_WUTE              RTC_CR_WUTE_Msk
#define RTC_CR_ALRBE_Pos         (9U)
#define RTC_CR_ALRBE_Msk         (0x1UL << RTC_CR_ALRBE_Pos) /*!< 0x00000200 */
#define RTC_CR_ALRBE             RTC_CR_ALRBE_Msk
#define RTC_CR_ALRAE_Pos         (8U)
#define RTC_CR_ALRAE_Msk         (0x1UL << RTC_CR_ALRAE_Pos) /*!< 0x00000100 */
#define RTC_CR_ALRAE             RTC_CR_ALRAE_Msk
#define RTC_CR_FMT_Pos           (6U)
#define RTC_CR_FMT_Msk           (0x1UL << RTC_CR_FMT_Pos) /*!< 0x00000040 */
#define RTC_CR_FMT               RTC_CR_FMT_Msk
#define RTC_CR_BYPSHAD_Pos       (5U)
#define RTC_CR_BYPSHAD_Msk       (0x1UL << RTC_CR_BYPSHAD_Pos) /*!< 0x00000020 */
#define RTC_CR_BYPSHAD           RTC_CR_BYPSHAD_Msk
#define RTC_CR_REFCKON_Pos       (4U)
#define RTC_CR_REFCKON_Msk       (0x1UL << RTC_CR_REFCKON_Pos) /*!< 0x00000010 */
#define RTC_CR_REFCKON           RTC_CR_REFCKON_Msk
#define RTC_CR_TSEDGE_Pos        (3U)
#define RTC_CR_TSEDGE_Msk        (0x1UL << RTC_CR_TSEDGE_Pos) /*!< 0x00000008 */
#define RTC_CR_TSEDGE            RTC_CR_TSEDGE_Msk
#define RTC_CR_WUCKSEL_Pos       (0U)
#define RTC_CR_WUCKSEL_Msk       (0x7UL << RTC_CR_WUCKSEL_Pos) /*!< 0x00000007 */
#define RTC_CR_WUCKSEL           RTC_CR_WUCKSEL_Msk
#define RTC_CR_WUCKSEL_0         (0x1UL << RTC_CR_WUCKSEL_Pos) /*!< 0x00000001 */
#define RTC_CR_WUCKSEL_1         (0x2UL << RTC_CR_WUCKSEL_Pos) /*!< 0x00000002 */
#define RTC_CR_WUCKSEL_2         (0x4UL << RTC_CR_WUCKSEL_Pos) /*!< 0x00000004 */

/********************  Bits definition for RTC_ICSR register  ******************/
#define RTC_ICSR_RECALPF_Pos (16U)
#define RTC_ICSR_RECALPF_Msk (0x1UL << RTC_ICSR_RECALPF_Pos) /*!< 0x00010000 */
#define RTC_ICSR_RECALPF     RTC_ICSR_RECALPF_Msk
#define RTC_ICSR_INIT_Pos    (7U)
#define RTC_ICSR_INIT_Msk    (0x1UL << RTC_ICSR_INIT_Pos) /*!< 0x00000080 */
#define RTC_ICSR_INIT        RTC_ICSR_INIT_Msk
#define RTC_ICSR_INITF_Pos   (6U)
#define RTC_ICSR_INITF_Msk   (0x1UL << RTC_ICSR_INITF_Pos) /*!< 0x00000040 */
#define RTC_ICSR_INITF       RTC_ICSR_INITF_Msk
#define RTC_ICSR_RSF_Pos     (5U)
#define RTC_ICSR_RSF_Msk     (0x1UL << RTC_ICSR_RSF_Pos) /*!< 0x00000020 */
#define RTC_ICSR_RSF         RTC_ICSR_RSF_Msk
#define RTC_ICSR_INITS_Pos   (4U)
#define RTC_ICSR_INITS_Msk   (0x1UL << RTC_ICSR_INITS_Pos) /*!< 0x00000010 */
#define RTC_ICSR_INITS       RTC_ICSR_INITS_Msk
#define RTC_ICSR_SHPF_Pos    (3U)
#define RTC_ICSR_SHPF_Msk    (0x1UL << RTC_ICSR_SHPF_Pos) /*!< 0x00000008 */
#define RTC_ICSR_SHPF        RTC_ICSR_SHPF_Msk
#define RTC_ICSR_WUTWF_Pos   (2U)
#define RTC_ICSR_WUTWF_Msk   (0x1UL << RTC_ICSR_WUTWF_Pos) /*!< 0x00000004 */
#define RTC_ICSR_WUTWF       RTC_ICSR_WUTWF_Msk
#define RTC_ICSR_ALRBWF_Pos  (1U)
#define RTC_ICSR_ALRBWF_Msk  (0x1UL << RTC_ICSR_ALRBWF_Pos) /*!< 0x00000002 */
#define RTC_ICSR_ALRBWF      RTC_ICSR_ALRBWF_Msk
#define RTC_ICSR_ALRAWF_Pos  (0U)
#define RTC_ICSR_ALRAWF_Msk  (0x1UL << RTC_ICSR_ALRAWF_Pos) /*!< 0x00000001 */
#define RTC_ICSR_ALRAWF      RTC_ICSR_ALRAWF_Msk

