Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bits definition for TAMP_BKP8R register  ****************/
#define TAMP_BKP8R_Pos (0U)
#define TAMP_BKP8R_Msk (0xFFFFFFFFUL << TAMP_BKP8R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP8R     TAMP_BKP8R_Msk

/********************  Bits definition for TAMP_BKP9R register  ****************/
#define TAMP_BKP9R_Pos (0U)
#define TAMP_BKP9R_Msk (0xFFFFFFFFUL << TAMP_BKP9R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP9R     TAMP_BKP9R_Msk

/********************  Bits definition for TAMP_BKP10R register  ***************/
#define TAMP_BKP10R_Pos (0U)
#define TAMP_BKP10R_Msk (0xFFFFFFFFUL << TAMP_BKP10R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP10R     TAMP_BKP10R_Msk

/********************  Bits definition for TAMP_BKP11R register  ***************/
#define TAMP_BKP11R_Pos (0U)
#define TAMP_BKP11R_Msk (0xFFFFFFFFUL << TAMP_BKP11R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP11R     TAMP_BKP11R_Msk

/********************  Bits definition for TAMP_BKP12R register  ***************/
#define TAMP_BKP12R_Pos (0U)
#define TAMP_BKP12R_Msk (0xFFFFFFFFUL << TAMP_BKP12R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP12R     TAMP_BKP12R_Msk

/********************  Bits definition for TAMP_BKP13R register  ***************/
#define TAMP_BKP13R_Pos (0U)
#define TAMP_BKP13R_Msk (0xFFFFFFFFUL << TAMP_BKP13R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP13R     TAMP_BKP13R_Msk

/********************  Bits definition for TAMP_BKP14R register  ***************/
#define TAMP_BKP14R_Pos (0U)
#define TAMP_BKP14R_Msk (0xFFFFFFFFUL << TAMP_BKP14R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP14R     TAMP_BKP14R_Msk

/********************  Bits definition for TAMP_BKP15R register  ***************/
#define TAMP_BKP15R_Pos (0U)
#define TAMP_BKP15R_Msk (0xFFFFFFFFUL << TAMP_BKP15R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP15R     TAMP_BKP15R_Msk

/********************  Bits definition for TAMP_BKP16R register  ***************/
#define TAMP_BKP16R_Pos (0U)
#define TAMP_BKP16R_Msk (0xFFFFFFFFUL << TAMP_BKP16R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP16R     TAMP_BKP16R_Msk

/********************  Bits definition for TAMP_BKP17R register  ***************/
#define TAMP_BKP17R_Pos (0U)
#define TAMP_BKP17R_Msk (0xFFFFFFFFUL << TAMP_BKP17R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP17R     TAMP_BKP17R_Msk

/********************  Bits definition for TAMP_BKP18R register  ***************/
#define TAMP_BKP18R_Pos (0U)
#define TAMP_BKP18R_Msk (0xFFFFFFFFUL << TAMP_BKP18R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP18R     TAMP_BKP18R_Msk

/********************  Bits definition for TAMP_BKP19R register  ***************/
#define TAMP_BKP19R_Pos (0U)
#define TAMP_BKP19R_Msk (0xFFFFFFFFUL << TAMP_BKP19R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP19R     TAMP_BKP19R_Msk

/********************  Bits definition for TAMP_BKP20R register  ***************/
#define TAMP_BKP20R_Pos (0U)
#define TAMP_BKP20R_Msk (0xFFFFFFFFUL << TAMP_BKP20R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP20R     TAMP_BKP20R_Msk

/********************  Bits definition for TAMP_BKP21R register  ***************/
#define TAMP_BKP21R_Pos (0U)
#define TAMP_BKP21R_Msk (0xFFFFFFFFUL << TAMP_BKP21R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP21R     TAMP_BKP21R_Msk

/********************  Bits definition for TAMP_BKP22R register  ***************/
#define TAMP_BKP22R_Pos (0U)
#define TAMP_BKP22R_Msk (0xFFFFFFFFUL << TAMP_BKP22R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP22R     TAMP_BKP22R_Msk

/********************  Bits definition for TAMP_BKP23R register  ***************/
#define TAMP_BKP23R_Pos (0U)
#define TAMP_BKP23R_Msk (0xFFFFFFFFUL << TAMP_BKP23R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP23R     TAMP_BKP23R_Msk

/********************  Bits definition for TAMP_BKP24R register  ***************/
#define TAMP_BKP24R_Pos (0U)
#define TAMP_BKP24R_Msk (0xFFFFFFFFUL << TAMP_BKP24R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP24R     TAMP_BKP24R_Msk

/********************  Bits definition for TAMP_BKP25R register  ***************/
#define TAMP_BKP25R_Pos (0U)
#define TAMP_BKP25R_Msk (0xFFFFFFFFUL << TAMP_BKP25R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP25R     TAMP_BKP25R_Msk

/********************  Bits definition for TAMP_BKP26R register  ***************/
#define TAMP_BKP26R_Pos (0U)
#define TAMP_BKP26R_Msk (0xFFFFFFFFUL << TAMP_BKP26R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP26R     TAMP_BKP26R_Msk

/********************  Bits definition for TAMP_BKP27R register  ***************/
#define TAMP_BKP27R_Pos (0U)
#define TAMP_BKP27R_Msk (0xFFFFFFFFUL << TAMP_BKP27R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP27R     TAMP_BKP27R_Msk

/********************  Bits definition for TAMP_BKP28R register  ***************/
#define TAMP_BKP28R_Pos (0U)
#define TAMP_BKP28R_Msk (0xFFFFFFFFUL << TAMP_BKP28R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP28R     TAMP_BKP28R_Msk

/********************  Bits definition for TAMP_BKP29R register  ***************/
#define TAMP_BKP29R_Pos (0U)
#define TAMP_BKP29R_Msk (0xFFFFFFFFUL << TAMP_BKP29R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP29R     TAMP_BKP29R_Msk

/********************  Bits definition for TAMP_BKP30R register  ***************/
#define TAMP_BKP30R_Pos (0U)
#define TAMP_BKP30R_Msk (0xFFFFFFFFUL << TAMP_BKP30R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP30R     TAMP_BKP30R_Msk

/********************  Bits definition for TAMP_BKP31R register  ***************/
#define TAMP_BKP31R_Pos (0U)
#define TAMP_BKP31R_Msk (0xFFFFFFFFUL << TAMP_BKP31R_Pos) /*!< 0xFFFFFFFF */
#define TAMP_BKP31R     TAMP_BKP31R_Msk

/******************** Number of backup registers ******************************/
#define TAMP_BKP_NUMBER_Pos (5U)
#define TAMP_BKP_NUMBER_Msk (0x1UL << TAMP_BKP_NUMBER_Pos) /*!< 0x00000080 */
#define TAMP_BKP_NUMBER     TAMP_BKP_NUMBER_Msk            /*!< 32 BKPREG  */

/******************************************************************************/
/*                                                                            */
/*                              SPDIF-RX Interface                            */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for SPDIF_CR register  ******************/
#define SPDIFRX_CR_SPDIFEN_Pos  (0U)
#define SPDIFRX_CR_SPDIFEN_Msk  (0x3UL << SPDIFRX_CR_SPDIFEN_Pos) /*!< 0x00000003 */
#define SPDIFRX_CR_SPDIFEN      SPDIFRX_CR_SPDIFEN_Msk            /*!<Peripheral Block Enable                      */
#define SPDIFRX_CR_RXDMAEN_Pos  (2U)
#define SPDIFRX_CR_RXDMAEN_Msk  (0x1UL << SPDIFRX_CR_RXDMAEN_Pos) /*!< 0x00000004 */
#define SPDIFRX_CR_RXDMAEN      SPDIFRX_CR_RXDMAEN_Msk            /*!<Receiver DMA Enable for data flow            */
#define SPDIFRX_CR_RXSTEO_Pos   (3U)
#define SPDIFRX_CR_RXSTEO_Msk   (0x1UL << SPDIFRX_CR_RXSTEO_Pos) /*!< 0x00000008 */
#define SPDIFRX_CR_RXSTEO       SPDIFRX_CR_RXSTEO_Msk            /*!<Stereo Mode                                  */
#define SPDIFRX_CR_DRFMT_Pos    (4U)
#define SPDIFRX_CR_DRFMT_Msk    (0x3UL << SPDIFRX_CR_DRFMT_Pos) /*!< 0x00000030 */
#define SPDIFRX_CR_DRFMT        SPDIFRX_CR_DRFMT_Msk            /*!<RX Data format                               */
#define SPDIFRX_CR_PMSK_Pos     (6U)
#define SPDIFRX_CR_PMSK_Msk     (0x1UL << SPDIFRX_CR_PMSK_Pos) /*!< 0x00000040 */
#define SPDIFRX_CR_PMSK         SPDIFRX_CR_PMSK_Msk            /*!<Mask Parity error bit                        */
#define SPDIFRX_CR_VMSK_Pos     (7U)
#define SPDIFRX_CR_VMSK_Msk     (0x1UL << SPDIFRX_CR_VMSK_Pos) /*!< 0x00000080 */
#define SPDIFRX_CR_VMSK         SPDIFRX_CR_VMSK_Msk            /*!<Mask of Validity bit                         */
#define SPDIFRX_CR_CUMSK_Pos    (8U)
#define SPDIFRX_CR_CUMSK_Msk    (0x1UL << SPDIFRX_CR_CUMSK_Pos) /*!< 0x00000100 */
#define SPDIFRX_CR_CUMSK        SPDIFRX_CR_CUMSK_Msk            /*!<Mask of channel status and user bits         */
#define SPDIFRX_CR_PTMSK_Pos    (9U)
#define SPDIFRX_CR_PTMSK_Msk    (0x1UL << SPDIFRX_CR_PTMSK_Pos) /*!< 0x00000200 */
#define SPDIFRX_CR_PTMSK        SPDIFRX_CR_PTMSK_Msk            /*!<Mask of Preamble Type bits                   */
#define SPDIFRX_CR_CBDMAEN_Pos  (10U)
#define SPDIFRX_CR_CBDMAEN_Msk  (0x1UL << SPDIFRX_CR_CBDMAEN_Pos) /*!< 0x00000400 */
#define SPDIFRX_CR_CBDMAEN      SPDIFRX_CR_CBDMAEN_Msk            /*!<Control Buffer DMA ENable for control flow   */
#define SPDIFRX_CR_CHSEL_Pos    (11U)
#define SPDIFRX_CR_CHSEL_Msk    (0x1UL << SPDIFRX_CR_CHSEL_Pos) /*!< 0x00000800 */
#define SPDIFRX_CR_CHSEL        SPDIFRX_CR_CHSEL_Msk            /*!<Channel Selection                            */
#define SPDIFRX_CR_NBTR_Pos     (12U)
#define SPDIFRX_CR_NBTR_Msk     (0x3UL << SPDIFRX_CR_NBTR_Pos) /*!< 0x00003000 */
#define SPDIFRX_CR_NBTR         SPDIFRX_CR_NBTR_Msk /*!<Maximum allowed re-tries during synchronization phase */
#define SPDIFRX_CR_WFA_Pos      (14U)
#define SPDIFRX_CR_WFA_Msk      (0x1UL << SPDIFRX_CR_WFA_Pos) /*!< 0x00004000 */
#define SPDIFRX_CR_WFA          SPDIFRX_CR_WFA_Msk            /*!<Wait For Activity     */
#define SPDIFRX_CR_INSEL_Pos    (16U)
#define SPDIFRX_CR_INSEL_Msk    (0x7UL << SPDIFRX_CR_INSEL_Pos) /*!< 0x00070000 */
#define SPDIFRX_CR_INSEL        SPDIFRX_CR_INSEL_Msk            /*!<SPDIF input selection */
#define SPDIFRX_CR_CKSEN_Pos    (20U)
#define SPDIFRX_CR_CKSEN_Msk    (0x1UL << SPDIFRX_CR_CKSEN_Pos) /*!< 0x00100000 */
#define SPDIFRX_CR_CKSEN        SPDIFRX_CR_CKSEN_Msk            /*!<Symbol Clock Enable */
#define SPDIFRX_CR_CKSBKPEN_Pos (21U)
#define SPDIFRX_CR_CKSBKPEN_Msk (0x1UL << SPDIFRX_CR_CKSBKPEN_Pos) /*!< 0x00200000 */
#define SPDIFRX_CR_CKSBKPEN     SPDIFRX_CR_CKSBKPEN_Msk            /*!<Backup Symbol Clock Enable */

/*******************  Bit definition for SPDIFRX_IMR register  *******************/
#define SPDIFRX_IMR_RXNEIE_Pos  (0U)
#define SPDIFRX_IMR_RXNEIE_Msk  (0x1UL << SPDIFRX_IMR_RXNEIE_Pos) /*!< 0x00000001 */
#define SPDIFRX_IMR_RXNEIE      SPDIFRX_IMR_RXNEIE_Msk /*!<RXNE interrupt enable                              */
#define SPDIFRX_IMR_CSRNEIE_Pos (1U)
#define SPDIFRX_IMR_CSRNEIE_Msk (0x1UL << SPDIFRX_IMR_CSRNEIE_Pos) /*!< 0x00000002 */
#define SPDIFRX_IMR_CSRNEIE     SPDIFRX_IMR_CSRNEIE_Msk /*!<Control Buffer Ready Interrupt Enable              */
#define SPDIFRX_IMR_PERRIE_Pos  (2U)
#define SPDIFRX_IMR_PERRIE_Msk  (0x1UL << SPDIFRX_IMR_PERRIE_Pos) /*!< 0x00000004 */
#define SPDIFRX_IMR_PERRIE      SPDIFRX_IMR_PERRIE_Msk /*!<Parity error interrupt enable                      */
#define SPDIFRX_IMR_OVRIE_Pos   (3U)
#define SPDIFRX_IMR_OVRIE_Msk   (0x1UL << SPDIFRX_IMR_OVRIE_Pos) /*!< 0x00000008 */
#define SPDIFRX_IMR_OVRIE       SPDIFRX_IMR_OVRIE_Msk /*!<Overrun error Interrupt Enable                     */
#define SPDIFRX_IMR_SBLKIE_Pos  (4U)
#define SPDIFRX_IMR_SBLKIE_Msk  (0x1UL << SPDIFRX_IMR_SBLKIE_Pos) /*!< 0x00000010 */
#define SPDIFRX_IMR_SBLKIE      SPDIFRX_IMR_SBLKIE_Msk /*!<Synchronization Block Detected Interrupt Enable    */
#define SPDIFRX_IMR_SYNCDIE_Pos (5U)
#define SPDIFRX_IMR_SYNCDIE_Msk (0x1UL << SPDIFRX_IMR_SYNCDIE_Pos) /*!< 0x00000020 */
#define SPDIFRX_IMR_SYNCDIE     SPDIFRX_IMR_SYNCDIE_Msk /*!<Synchronization Done                               */
#define SPDIFRX_IMR_IFEIE_Pos   (6U)
#define SPDIFRX_IMR_IFEIE_Msk   (0x1UL << SPDIFRX_IMR_IFEIE_Pos) /*!< 0x00000040 */
#define SPDIFRX_IMR_IFEIE       SPDIFRX_IMR_IFEIE_Msk /*!<Serial Interface Error Interrupt Enable            */

