Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for SPDIFRX_SR register  *******************/
#define SPDIFRX_SR_RXNE_Pos   (0U)
#define SPDIFRX_SR_RXNE_Msk   (0x1UL << SPDIFRX_SR_RXNE_Pos) /*!< 0x00000001 */
#define SPDIFRX_SR_RXNE       SPDIFRX_SR_RXNE_Msk /*!<Read data register not empty                          */
#define SPDIFRX_SR_CSRNE_Pos  (1U)
#define SPDIFRX_SR_CSRNE_Msk  (0x1UL << SPDIFRX_SR_CSRNE_Pos) /*!< 0x00000002 */
#define SPDIFRX_SR_CSRNE      SPDIFRX_SR_CSRNE_Msk /*!<The Control Buffer register is not empty              */
#define SPDIFRX_SR_PERR_Pos   (2U)
#define SPDIFRX_SR_PERR_Msk   (0x1UL << SPDIFRX_SR_PERR_Pos) /*!< 0x00000004 */
#define SPDIFRX_SR_PERR       SPDIFRX_SR_PERR_Msk /*!<Parity error                                          */
#define SPDIFRX_SR_OVR_Pos    (3U)
#define SPDIFRX_SR_OVR_Msk    (0x1UL << SPDIFRX_SR_OVR_Pos) /*!< 0x00000008 */
#define SPDIFRX_SR_OVR        SPDIFRX_SR_OVR_Msk            /*!<Overrun error                                         */
#define SPDIFRX_SR_SBD_Pos    (4U)
#define SPDIFRX_SR_SBD_Msk    (0x1UL << SPDIFRX_SR_SBD_Pos) /*!< 0x00000010 */
#define SPDIFRX_SR_SBD        SPDIFRX_SR_SBD_Msk            /*!<Synchronization Block Detected                        */
#define SPDIFRX_SR_SYNCD_Pos  (5U)
#define SPDIFRX_SR_SYNCD_Msk  (0x1UL << SPDIFRX_SR_SYNCD_Pos) /*!< 0x00000020 */
#define SPDIFRX_SR_SYNCD      SPDIFRX_SR_SYNCD_Msk /*!<Synchronization Done                                  */
#define SPDIFRX_SR_FERR_Pos   (6U)
#define SPDIFRX_SR_FERR_Msk   (0x1UL << SPDIFRX_SR_FERR_Pos) /*!< 0x00000040 */
#define SPDIFRX_SR_FERR       SPDIFRX_SR_FERR_Msk /*!<Framing error                                         */
#define SPDIFRX_SR_SERR_Pos   (7U)
#define SPDIFRX_SR_SERR_Msk   (0x1UL << SPDIFRX_SR_SERR_Pos) /*!< 0x00000080 */
#define SPDIFRX_SR_SERR       SPDIFRX_SR_SERR_Msk /*!<Synchronization error                                 */
#define SPDIFRX_SR_TERR_Pos   (8U)
#define SPDIFRX_SR_TERR_Msk   (0x1UL << SPDIFRX_SR_TERR_Pos) /*!< 0x00000100 */
#define SPDIFRX_SR_TERR       SPDIFRX_SR_TERR_Msk /*!<Time-out error                                        */
#define SPDIFRX_SR_WIDTH5_Pos (16U)
#define SPDIFRX_SR_WIDTH5_Msk (0x7FFFUL << SPDIFRX_SR_WIDTH5_Pos) /*!< 0x7FFF0000 */
#define SPDIFRX_SR_WIDTH5     SPDIFRX_SR_WIDTH5_Msk /*!<Duration of 5 symbols counted with spdif_clk          */

/*******************  Bit definition for SPDIFRX_IFCR register  *******************/
#define SPDIFRX_IFCR_PERRCF_Pos  (2U)
#define SPDIFRX_IFCR_PERRCF_Msk  (0x1UL << SPDIFRX_IFCR_PERRCF_Pos) /*!< 0x00000004 */
#define SPDIFRX_IFCR_PERRCF      SPDIFRX_IFCR_PERRCF_Msk /*!<Clears the Parity error flag                         */
#define SPDIFRX_IFCR_OVRCF_Pos   (3U)
#define SPDIFRX_IFCR_OVRCF_Msk   (0x1UL << SPDIFRX_IFCR_OVRCF_Pos) /*!< 0x00000008 */
#define SPDIFRX_IFCR_OVRCF       SPDIFRX_IFCR_OVRCF_Msk /*!<Clears the Overrun error flag                        */
#define SPDIFRX_IFCR_SBDCF_Pos   (4U)
#define SPDIFRX_IFCR_SBDCF_Msk   (0x1UL << SPDIFRX_IFCR_SBDCF_Pos) /*!< 0x00000010 */
#define SPDIFRX_IFCR_SBDCF       SPDIFRX_IFCR_SBDCF_Msk /*!<Clears the Synchronization Block Detected flag       */
#define SPDIFRX_IFCR_SYNCDCF_Pos (5U)
#define SPDIFRX_IFCR_SYNCDCF_Msk (0x1UL << SPDIFRX_IFCR_SYNCDCF_Pos) /*!< 0x00000020 */
#define SPDIFRX_IFCR_SYNCDCF     SPDIFRX_IFCR_SYNCDCF_Msk /*!<Clears the Synchronization Done flag                 */

/*******************  Bit definition for SPDIFRX_DR register  (DRFMT = 0b00 case) *******************/
#define SPDIFRX_DR0_DR_Pos (0U)
#define SPDIFRX_DR0_DR_Msk (0xFFFFFFUL << SPDIFRX_DR0_DR_Pos) /*!< 0x00FFFFFF */
#define SPDIFRX_DR0_DR     SPDIFRX_DR0_DR_Msk                 /*!<Data value            */
#define SPDIFRX_DR0_PE_Pos (24U)
#define SPDIFRX_DR0_PE_Msk (0x1UL << SPDIFRX_DR0_PE_Pos) /*!< 0x01000000 */
#define SPDIFRX_DR0_PE     SPDIFRX_DR0_PE_Msk            /*!<Parity Error bit      */
#define SPDIFRX_DR0_V_Pos  (25U)
#define SPDIFRX_DR0_V_Msk  (0x1UL << SPDIFRX_DR0_V_Pos) /*!< 0x02000000 */
#define SPDIFRX_DR0_V      SPDIFRX_DR0_V_Msk            /*!<Validity bit          */
#define SPDIFRX_DR0_U_Pos  (26U)
#define SPDIFRX_DR0_U_Msk  (0x1UL << SPDIFRX_DR0_U_Pos) /*!< 0x04000000 */
#define SPDIFRX_DR0_U      SPDIFRX_DR0_U_Msk            /*!<User bit              */
#define SPDIFRX_DR0_C_Pos  (27U)
#define SPDIFRX_DR0_C_Msk  (0x1UL << SPDIFRX_DR0_C_Pos) /*!< 0x08000000 */
#define SPDIFRX_DR0_C      SPDIFRX_DR0_C_Msk            /*!<Channel Status bit    */
#define SPDIFRX_DR0_PT_Pos (28U)
#define SPDIFRX_DR0_PT_Msk (0x3UL << SPDIFRX_DR0_PT_Pos) /*!< 0x30000000 */
#define SPDIFRX_DR0_PT     SPDIFRX_DR0_PT_Msk            /*!<Preamble Type         */

/*******************  Bit definition for SPDIFRX_DR register  (DRFMT = 0b01 case) *******************/
#define SPDIFRX_DR1_DR_Pos (8U)
#define SPDIFRX_DR1_DR_Msk (0xFFFFFFUL << SPDIFRX_DR1_DR_Pos) /*!< 0xFFFFFF00 */
#define SPDIFRX_DR1_DR     SPDIFRX_DR1_DR_Msk                 /*!<Data value            */
#define SPDIFRX_DR1_PT_Pos (4U)
#define SPDIFRX_DR1_PT_Msk (0x3UL << SPDIFRX_DR1_PT_Pos) /*!< 0x00000030 */
#define SPDIFRX_DR1_PT     SPDIFRX_DR1_PT_Msk            /*!<Preamble Type         */
#define SPDIFRX_DR1_C_Pos  (3U)
#define SPDIFRX_DR1_C_Msk  (0x1UL << SPDIFRX_DR1_C_Pos) /*!< 0x00000008 */
#define SPDIFRX_DR1_C      SPDIFRX_DR1_C_Msk            /*!<Channel Status bit    */
#define SPDIFRX_DR1_U_Pos  (2U)
#define SPDIFRX_DR1_U_Msk  (0x1UL << SPDIFRX_DR1_U_Pos) /*!< 0x00000004 */
#define SPDIFRX_DR1_U      SPDIFRX_DR1_U_Msk            /*!<User bit              */
#define SPDIFRX_DR1_V_Pos  (1U)
#define SPDIFRX_DR1_V_Msk  (0x1UL << SPDIFRX_DR1_V_Pos) /*!< 0x00000002 */
#define SPDIFRX_DR1_V      SPDIFRX_DR1_V_Msk            /*!<Validity bit          */
#define SPDIFRX_DR1_PE_Pos (0U)
#define SPDIFRX_DR1_PE_Msk (0x1UL << SPDIFRX_DR1_PE_Pos) /*!< 0x00000001 */
#define SPDIFRX_DR1_PE     SPDIFRX_DR1_PE_Msk            /*!<Parity Error bit      */

/*******************  Bit definition for SPDIFRX_DR register  (DRFMT = 0b10 case) *******************/
#define SPDIFRX_DR1_DRNL1_Pos (16U)
#define SPDIFRX_DR1_DRNL1_Msk (0xFFFFUL << SPDIFRX_DR1_DRNL1_Pos) /*!< 0xFFFF0000 */
#define SPDIFRX_DR1_DRNL1     SPDIFRX_DR1_DRNL1_Msk               /*!<Data value Channel B      */
#define SPDIFRX_DR1_DRNL2_Pos (0U)
#define SPDIFRX_DR1_DRNL2_Msk (0xFFFFUL << SPDIFRX_DR1_DRNL2_Pos) /*!< 0x0000FFFF */
#define SPDIFRX_DR1_DRNL2     SPDIFRX_DR1_DRNL2_Msk               /*!<Data value Channel A      */

/*******************  Bit definition for SPDIFRX_CSR register   *******************/
#define SPDIFRX_CSR_USR_Pos (0U)
#define SPDIFRX_CSR_USR_Msk (0xFFFFUL << SPDIFRX_CSR_USR_Pos) /*!< 0x0000FFFF */
#define SPDIFRX_CSR_USR     SPDIFRX_CSR_USR_Msk               /*!<User data information           */
#define SPDIFRX_CSR_CS_Pos  (16U)
#define SPDIFRX_CSR_CS_Msk  (0xFFUL << SPDIFRX_CSR_CS_Pos) /*!< 0x00FF0000 */
#define SPDIFRX_CSR_CS      SPDIFRX_CSR_CS_Msk             /*!<Channel A status information    */
#define SPDIFRX_CSR_SOB_Pos (24U)
#define SPDIFRX_CSR_SOB_Msk (0x1UL << SPDIFRX_CSR_SOB_Pos) /*!< 0x01000000 */
#define SPDIFRX_CSR_SOB     SPDIFRX_CSR_SOB_Msk            /*!<Start Of Block                  */

/*******************  Bit definition for SPDIFRX_DIR register    *******************/
#define SPDIFRX_DIR_THI_Pos (0U)
#define SPDIFRX_DIR_THI_Msk (0x1FFFUL << SPDIFRX_DIR_THI_Pos) /*!< 0x00001FFF */
#define SPDIFRX_DIR_THI     SPDIFRX_DIR_THI_Msk               /*!<Threshold LOW      */
#define SPDIFRX_DIR_TLO_Pos (16U)
#define SPDIFRX_DIR_TLO_Msk (0x1FFFUL << SPDIFRX_DIR_TLO_Pos) /*!< 0x1FFF0000 */
#define SPDIFRX_DIR_TLO     SPDIFRX_DIR_TLO_Msk               /*!<Threshold HIGH     */

/*******************  Bit definition for SPDIFRX_VERR register    *******************/
#define SPDIFRX_VERR_MINREV_Pos (0U)
#define SPDIFRX_VERR_MINREV_Msk (0xFUL << SPDIFRX_VERR_MINREV_Pos) /*!< 0x0000000F */
#define SPDIFRX_VERR_MINREV     SPDIFRX_VERR_MINREV_Msk            /*!<SPDIFRX Minor revision     */
#define SPDIFRX_VERR_MAJREV_Pos (4U)
#define SPDIFRX_VERR_MAJREV_Msk (0xFUL << SPDIFRX_VERR_MAJREV_Pos) /*!< 0x000000F0 */
#define SPDIFRX_VERR_MAJREV     SPDIFRX_VERR_MAJREV_Msk            /*!<SPDIFRX Major revision     */

/*******************  Bit definition for SPDIFRX_IDR register    *******************/
#define SPDIFRX_IDR_ID_Pos (0U)
#define SPDIFRX_IDR_ID_Msk (0xFFFFFFFFUL << SPDIFRX_IDR_ID_Pos) /*!< 0xFFFFFFFF */
#define SPDIFRX_IDR_ID     SPDIFRX_IDR_ID_Msk                   /*!<SPDIFRX identifier     */

