Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for SPDIFRX_SIDR register    *******************/
#define SPDIFRX_SIDR_SID_Pos (0U)
#define SPDIFRX_SIDR_SID_Msk (0xFFFFFFFFUL << SPDIFRX_SIDR_SID_Pos) /*!< 0xFFFFFFFF */
#define SPDIFRX_SIDR_SID     SPDIFRX_SIDR_SID_Msk /*!<Size of the memory region allocated to SPDIFRX registers */

/******************************************************************************/
/*                                                                            */
/*                          Serial Audio Interface                            */
/*                                                                            */
/******************************************************************************/
/*******************************  SAI VERSION  ********************************/
#define SAI_VER_V2_1

/********************  Bit definition for SAI_GCR register  *******************/
#define SAI_GCR_SYNCIN_Pos  (0U)
#define SAI_GCR_SYNCIN_Msk  (0x3UL << SAI_GCR_SYNCIN_Pos) /*!< 0x00000003 */
#define SAI_GCR_SYNCIN      SAI_GCR_SYNCIN_Msk            /*!<SYNCIN[1:0] bits (Synchronization Inputs)   */
#define SAI_GCR_SYNCIN_0    (0x1UL << SAI_GCR_SYNCIN_Pos) /*!< 0x00000001 */
#define SAI_GCR_SYNCIN_1    (0x2UL << SAI_GCR_SYNCIN_Pos) /*!< 0x00000002 */

#define SAI_GCR_SYNCOUT_Pos (4U)
#define SAI_GCR_SYNCOUT_Msk (0x3UL << SAI_GCR_SYNCOUT_Pos) /*!< 0x00000030 */
#define SAI_GCR_SYNCOUT     SAI_GCR_SYNCOUT_Msk            /*!<SYNCOUT[1:0] bits (Synchronization Outputs) */
#define SAI_GCR_SYNCOUT_0   (0x1UL << SAI_GCR_SYNCOUT_Pos) /*!< 0x00000010 */
#define SAI_GCR_SYNCOUT_1   (0x2UL << SAI_GCR_SYNCOUT_Pos) /*!< 0x00000020 */

/*******************  Bit definition for SAI_xCR1 register  *******************/
#define SAI_xCR1_MODE_Pos     (0U)
#define SAI_xCR1_MODE_Msk     (0x3UL << SAI_xCR1_MODE_Pos) /*!< 0x00000003 */
#define SAI_xCR1_MODE         SAI_xCR1_MODE_Msk            /*!<MODE[1:0] bits (Audio Block Mode)           */
#define SAI_xCR1_MODE_0       (0x1UL << SAI_xCR1_MODE_Pos) /*!< 0x00000001 */
#define SAI_xCR1_MODE_1       (0x2UL << SAI_xCR1_MODE_Pos) /*!< 0x00000002 */

#define SAI_xCR1_PRTCFG_Pos   (2U)
#define SAI_xCR1_PRTCFG_Msk   (0x3UL << SAI_xCR1_PRTCFG_Pos) /*!< 0x0000000C */
#define SAI_xCR1_PRTCFG       SAI_xCR1_PRTCFG_Msk            /*!<PRTCFG[1:0] bits (Protocol Configuration)   */
#define SAI_xCR1_PRTCFG_0     (0x1UL << SAI_xCR1_PRTCFG_Pos) /*!< 0x00000004 */
#define SAI_xCR1_PRTCFG_1     (0x2UL << SAI_xCR1_PRTCFG_Pos) /*!< 0x00000008 */

#define SAI_xCR1_DS_Pos       (5U)
#define SAI_xCR1_DS_Msk       (0x7UL << SAI_xCR1_DS_Pos) /*!< 0x000000E0 */
#define SAI_xCR1_DS           SAI_xCR1_DS_Msk            /*!<DS[1:0] bits (Data Size) */
#define SAI_xCR1_DS_0         (0x1UL << SAI_xCR1_DS_Pos) /*!< 0x00000020 */
#define SAI_xCR1_DS_1         (0x2UL << SAI_xCR1_DS_Pos) /*!< 0x00000040 */
#define SAI_xCR1_DS_2         (0x4UL << SAI_xCR1_DS_Pos) /*!< 0x00000080 */

#define SAI_xCR1_LSBFIRST_Pos (8U)
#define SAI_xCR1_LSBFIRST_Msk (0x1UL << SAI_xCR1_LSBFIRST_Pos) /*!< 0x00000100 */
#define SAI_xCR1_LSBFIRST     SAI_xCR1_LSBFIRST_Msk            /*!<LSB First Configuration  */
#define SAI_xCR1_CKSTR_Pos    (9U)
#define SAI_xCR1_CKSTR_Msk    (0x1UL << SAI_xCR1_CKSTR_Pos) /*!< 0x00000200 */
#define SAI_xCR1_CKSTR        SAI_xCR1_CKSTR_Msk            /*!<ClocK STRobing edge      */

#define SAI_xCR1_SYNCEN_Pos   (10U)
#define SAI_xCR1_SYNCEN_Msk   (0x3UL << SAI_xCR1_SYNCEN_Pos) /*!< 0x00000C00 */
#define SAI_xCR1_SYNCEN       SAI_xCR1_SYNCEN_Msk            /*!<SYNCEN[1:0](SYNChronization ENable) */
#define SAI_xCR1_SYNCEN_0     (0x1UL << SAI_xCR1_SYNCEN_Pos) /*!< 0x00000400 */
#define SAI_xCR1_SYNCEN_1     (0x2UL << SAI_xCR1_SYNCEN_Pos) /*!< 0x00000800 */

#define SAI_xCR1_MONO_Pos     (12U)
#define SAI_xCR1_MONO_Msk     (0x1UL << SAI_xCR1_MONO_Pos) /*!< 0x00001000 */
#define SAI_xCR1_MONO         SAI_xCR1_MONO_Msk            /*!<Mono mode                  */
#define SAI_xCR1_OUTDRIV_Pos  (13U)
#define SAI_xCR1_OUTDRIV_Msk  (0x1UL << SAI_xCR1_OUTDRIV_Pos) /*!< 0x00002000 */
#define SAI_xCR1_OUTDRIV      SAI_xCR1_OUTDRIV_Msk            /*!<Output Drive               */
#define SAI_xCR1_SAIEN_Pos    (16U)
#define SAI_xCR1_SAIEN_Msk    (0x1UL << SAI_xCR1_SAIEN_Pos) /*!< 0x00010000 */
#define SAI_xCR1_SAIEN        SAI_xCR1_SAIEN_Msk            /*!<Audio Block enable         */
#define SAI_xCR1_DMAEN_Pos    (17U)
#define SAI_xCR1_DMAEN_Msk    (0x1UL << SAI_xCR1_DMAEN_Pos) /*!< 0x00020000 */
#define SAI_xCR1_DMAEN        SAI_xCR1_DMAEN_Msk            /*!<DMA enable                 */
#define SAI_xCR1_NODIV_Pos    (19U)
#define SAI_xCR1_NODIV_Msk    (0x1UL << SAI_xCR1_NODIV_Pos) /*!< 0x00080000 */
#define SAI_xCR1_NODIV        SAI_xCR1_NODIV_Msk            /*!<No Divider Configuration   */

#define SAI_xCR1_MCKDIV_Pos   (20U)
#define SAI_xCR1_MCKDIV_Msk   (0x3FUL << SAI_xCR1_MCKDIV_Pos) /*!< 0x03F00000 */
#define SAI_xCR1_MCKDIV       SAI_xCR1_MCKDIV_Msk             /*!<MCKDIV[5:0] (Master ClocK Divider)  */
#define SAI_xCR1_MCKDIV_0     (0x01UL << SAI_xCR1_MCKDIV_Pos) /*!< 0x00100000 */
#define SAI_xCR1_MCKDIV_1     (0x02UL << SAI_xCR1_MCKDIV_Pos) /*!< 0x00200000 */
#define SAI_xCR1_MCKDIV_2     (0x04UL << SAI_xCR1_MCKDIV_Pos) /*!< 0x00400000 */
#define SAI_xCR1_MCKDIV_3     (0x08UL << SAI_xCR1_MCKDIV_Pos) /*!< 0x00800000 */
#define SAI_xCR1_MCKDIV_4     (0x10UL << SAI_xCR1_MCKDIV_Pos) /*!< 0x01000000 */
#define SAI_xCR1_MCKDIV_5     (0x20UL << SAI_xCR1_MCKDIV_Pos) /*!< 0x02000000 */

#define SAI_xCR1_MCKEN_Pos    (27U)
#define SAI_xCR1_MCKEN_Msk    (0x1UL << SAI_xCR1_MCKEN_Pos) /*!< 0x08000000 */
#define SAI_xCR1_MCKEN        SAI_xCR1_MCKEN_Msk            /*!<Master ClocK enable */

#define SAI_xCR1_OSR_Pos      (26U)
#define SAI_xCR1_OSR_Msk      (0x1UL << SAI_xCR1_OSR_Pos) /*!< 0x04000000 */
#define SAI_xCR1_OSR          SAI_xCR1_OSR_Msk            /*!<OverSampling Ratio for master clock  */

/* Legacy define */
#define SAI_xCR1_NOMCK SAI_xCR1_NODIV

/*******************  Bit definition for SAI_xCR2 register  *******************/
#define SAI_xCR2_FTH_Pos     (0U)
#define SAI_xCR2_FTH_Msk     (0x7UL << SAI_xCR2_FTH_Pos) /*!< 0x00000007 */
#define SAI_xCR2_FTH         SAI_xCR2_FTH_Msk            /*!<FTH[2:0](Fifo THreshold)  */
#define SAI_xCR2_FTH_0       (0x1UL << SAI_xCR2_FTH_Pos) /*!< 0x00000001 */
#define SAI_xCR2_FTH_1       (0x2UL << SAI_xCR2_FTH_Pos) /*!< 0x00000002 */
#define SAI_xCR2_FTH_2       (0x4UL << SAI_xCR2_FTH_Pos) /*!< 0x00000004 */

#define SAI_xCR2_FFLUSH_Pos  (3U)
#define SAI_xCR2_FFLUSH_Msk  (0x1UL << SAI_xCR2_FFLUSH_Pos) /*!< 0x00000008 */
#define SAI_xCR2_FFLUSH      SAI_xCR2_FFLUSH_Msk            /*!<Fifo FLUSH                       */
#define SAI_xCR2_TRIS_Pos    (4U)
#define SAI_xCR2_TRIS_Msk    (0x1UL << SAI_xCR2_TRIS_Pos) /*!< 0x00000010 */
#define SAI_xCR2_TRIS        SAI_xCR2_TRIS_Msk            /*!<TRIState Management on data line */
#define SAI_xCR2_MUTE_Pos    (5U)
#define SAI_xCR2_MUTE_Msk    (0x1UL << SAI_xCR2_MUTE_Pos) /*!< 0x00000020 */
#define SAI_xCR2_MUTE        SAI_xCR2_MUTE_Msk            /*!<Mute mode                        */
#define SAI_xCR2_MUTEVAL_Pos (6U)
#define SAI_xCR2_MUTEVAL_Msk (0x1UL << SAI_xCR2_MUTEVAL_Pos) /*!< 0x00000040 */
#define SAI_xCR2_MUTEVAL     SAI_xCR2_MUTEVAL_Msk            /*!<Muate value                      */

#define SAI_xCR2_MUTECNT_Pos (7U)
#define SAI_xCR2_MUTECNT_Msk (0x3FUL << SAI_xCR2_MUTECNT_Pos) /*!< 0x00001F80 */
#define SAI_xCR2_MUTECNT     SAI_xCR2_MUTECNT_Msk             /*!<MUTECNT[5:0] (MUTE counter) */
#define SAI_xCR2_MUTECNT_0   (0x01UL << SAI_xCR2_MUTECNT_Pos) /*!< 0x00000080 */
#define SAI_xCR2_MUTECNT_1   (0x02UL << SAI_xCR2_MUTECNT_Pos) /*!< 0x00000100 */
#define SAI_xCR2_MUTECNT_2   (0x04UL << SAI_xCR2_MUTECNT_Pos) /*!< 0x00000200 */
#define SAI_xCR2_MUTECNT_3   (0x08UL << SAI_xCR2_MUTECNT_Pos) /*!< 0x00000400 */
#define SAI_xCR2_MUTECNT_4   (0x10UL << SAI_xCR2_MUTECNT_Pos) /*!< 0x00000800 */
#define SAI_xCR2_MUTECNT_5   (0x20UL << SAI_xCR2_MUTECNT_Pos) /*!< 0x00001000 */

#define SAI_xCR2_CPL_Pos     (13U)
#define SAI_xCR2_CPL_Msk     (0x1UL << SAI_xCR2_CPL_Pos) /*!< 0x00002000 */
#define SAI_xCR2_CPL         SAI_xCR2_CPL_Msk            /*!< Complement Bit             */

#define SAI_xCR2_COMP_Pos    (14U)
#define SAI_xCR2_COMP_Msk    (0x3UL << SAI_xCR2_COMP_Pos) /*!< 0x0000C000 */
#define SAI_xCR2_COMP        SAI_xCR2_COMP_Msk            /*!<COMP[1:0] (Companding mode) */
#define SAI_xCR2_COMP_0      (0x1UL << SAI_xCR2_COMP_Pos) /*!< 0x00004000 */
#define SAI_xCR2_COMP_1      (0x2UL << SAI_xCR2_COMP_Pos) /*!< 0x00008000 */

