Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/******************  Bit definition for SDMMC_DCOUNT register  *****************/
#define SDMMC_DCOUNT_DATACOUNT_Pos (0U)
#define SDMMC_DCOUNT_DATACOUNT_Msk (0x1FFFFFFUL << SDMMC_DCOUNT_DATACOUNT_Pos) /*!< 0x01FFFFFF */
#define SDMMC_DCOUNT_DATACOUNT     SDMMC_DCOUNT_DATACOUNT_Msk                  /*!<Data count value */

/******************  Bit definition for SDMMC_STA register  ********************/
#define SDMMC_STA_CCRCFAIL_Pos (0U)
#define SDMMC_STA_CCRCFAIL_Msk (0x1UL << SDMMC_STA_CCRCFAIL_Pos) /*!< 0x00000001 */
#define SDMMC_STA_CCRCFAIL     SDMMC_STA_CCRCFAIL_Msk            /*!<Command response received (CRC check failed)  */
#define SDMMC_STA_DCRCFAIL_Pos (1U)
#define SDMMC_STA_DCRCFAIL_Msk (0x1UL << SDMMC_STA_DCRCFAIL_Pos) /*!< 0x00000002 */
#define SDMMC_STA_DCRCFAIL     SDMMC_STA_DCRCFAIL_Msk            /*!<Data block sent/received (CRC check failed)   */
#define SDMMC_STA_CTIMEOUT_Pos (2U)
#define SDMMC_STA_CTIMEOUT_Msk (0x1UL << SDMMC_STA_CTIMEOUT_Pos) /*!< 0x00000004 */
#define SDMMC_STA_CTIMEOUT     SDMMC_STA_CTIMEOUT_Msk            /*!<Command response timeout                      */
#define SDMMC_STA_DTIMEOUT_Pos (3U)
#define SDMMC_STA_DTIMEOUT_Msk (0x1UL << SDMMC_STA_DTIMEOUT_Pos) /*!< 0x00000008 */
#define SDMMC_STA_DTIMEOUT     SDMMC_STA_DTIMEOUT_Msk            /*!<Data timeout                                  */
#define SDMMC_STA_TXUNDERR_Pos (4U)
#define SDMMC_STA_TXUNDERR_Msk (0x1UL << SDMMC_STA_TXUNDERR_Pos) /*!< 0x00000010 */
#define SDMMC_STA_TXUNDERR     SDMMC_STA_TXUNDERR_Msk            /*!<Transmit FIFO underrun error                  */
#define SDMMC_STA_RXOVERR_Pos  (5U)
#define SDMMC_STA_RXOVERR_Msk  (0x1UL << SDMMC_STA_RXOVERR_Pos) /*!< 0x00000020 */
#define SDMMC_STA_RXOVERR      SDMMC_STA_RXOVERR_Msk            /*!<Received FIFO overrun error                   */
#define SDMMC_STA_CMDREND_Pos  (6U)
#define SDMMC_STA_CMDREND_Msk  (0x1UL << SDMMC_STA_CMDREND_Pos) /*!< 0x00000040 */
#define SDMMC_STA_CMDREND      SDMMC_STA_CMDREND_Msk            /*!<Command response received (CRC check passed)  */
#define SDMMC_STA_CMDSENT_Pos  (7U)
#define SDMMC_STA_CMDSENT_Msk  (0x1UL << SDMMC_STA_CMDSENT_Pos) /*!< 0x00000080 */
#define SDMMC_STA_CMDSENT      SDMMC_STA_CMDSENT_Msk            /*!<Command sent (no response required)           */
#define SDMMC_STA_DATAEND_Pos  (8U)
#define SDMMC_STA_DATAEND_Msk  (0x1UL << SDMMC_STA_DATAEND_Pos) /*!< 0x00000100 */
#define SDMMC_STA_DATAEND      SDMMC_STA_DATAEND_Msk            /*!<Data end (data counter, SDIDCOUNT, is zero)   */
#define SDMMC_STA_DHOLD_Pos    (9U)
#define SDMMC_STA_DHOLD_Msk    (0x1UL << SDMMC_STA_DHOLD_Pos) /*!< 0x00000200 */
#define SDMMC_STA_DHOLD                                                                                                \
  SDMMC_STA_DHOLD_Msk /*!<Data transfer Hold                                                      */
#define SDMMC_STA_DBCKEND_Pos (10U)
#define SDMMC_STA_DBCKEND_Msk (0x1UL << SDMMC_STA_DBCKEND_Pos) /*!< 0x00000400 */
#define SDMMC_STA_DBCKEND     SDMMC_STA_DBCKEND_Msk            /*!<Data block sent/received (CRC check passed)   */
#define SDMMC_STA_DABORT_Pos  (11U)
#define SDMMC_STA_DABORT_Msk  (0x1UL << SDMMC_STA_DABORT_Pos) /*!< 0x00000800 */
#define SDMMC_STA_DABORT                                                                                               \
  SDMMC_STA_DABORT_Msk /*!<Data transfer aborted by CMD12                                          */
#define SDMMC_STA_DPSMACT_Pos (12U)
#define SDMMC_STA_DPSMACT_Msk (0x1UL << SDMMC_STA_DPSMACT_Pos) /*!< 0x00001000 */
#define SDMMC_STA_DPSMACT                                                                                              \
  SDMMC_STA_DPSMACT_Msk /*!<Data path state machine active                                       */
#define SDMMC_STA_CPSMACT_Pos (13U)
#define SDMMC_STA_CPSMACT_Msk (0x1UL << SDMMC_STA_CPSMACT_Pos) /*!< 0x00002000 */
#define SDMMC_STA_CPSMACT                                                                                              \
  SDMMC_STA_CPSMACT_Msk /*!<Command path state machine active                                          */
#define SDMMC_STA_TXFIFOHE_Pos (14U)
#define SDMMC_STA_TXFIFOHE_Msk (0x1UL << SDMMC_STA_TXFIFOHE_Pos) /*!< 0x00004000 */
#define SDMMC_STA_TXFIFOHE                                                                                             \
  SDMMC_STA_TXFIFOHE_Msk /*!<Transmit FIFO Half Empty: at least 8 words can be written into the FIFO */
#define SDMMC_STA_RXFIFOHF_Pos (15U)
#define SDMMC_STA_RXFIFOHF_Msk (0x1UL << SDMMC_STA_RXFIFOHF_Pos) /*!< 0x00008000 */
#define SDMMC_STA_RXFIFOHF     SDMMC_STA_RXFIFOHF_Msk /*!<Receive FIFO Half Full: there are at least 8 words in the FIFO */
#define SDMMC_STA_TXFIFOF_Pos  (16U)
#define SDMMC_STA_TXFIFOF_Msk  (0x1UL << SDMMC_STA_TXFIFOF_Pos) /*!< 0x00010000 */
#define SDMMC_STA_TXFIFOF      SDMMC_STA_TXFIFOF_Msk            /*!<Transmit FIFO full                            */
#define SDMMC_STA_RXFIFOF_Pos  (17U)
#define SDMMC_STA_RXFIFOF_Msk  (0x1UL << SDMMC_STA_RXFIFOF_Pos) /*!< 0x00020000 */
#define SDMMC_STA_RXFIFOF      SDMMC_STA_RXFIFOF_Msk            /*!<Receive FIFO full                             */
#define SDMMC_STA_TXFIFOE_Pos  (18U)
#define SDMMC_STA_TXFIFOE_Msk  (0x1UL << SDMMC_STA_TXFIFOE_Pos) /*!< 0x00040000 */
#define SDMMC_STA_TXFIFOE      SDMMC_STA_TXFIFOE_Msk            /*!<Transmit FIFO empty                           */
#define SDMMC_STA_RXFIFOE_Pos  (19U)
#define SDMMC_STA_RXFIFOE_Msk  (0x1UL << SDMMC_STA_RXFIFOE_Pos) /*!< 0x00080000 */
#define SDMMC_STA_RXFIFOE      SDMMC_STA_RXFIFOE_Msk            /*!<Receive FIFO empty                            */
#define SDMMC_STA_BUSYD0_Pos   (20U)
#define SDMMC_STA_BUSYD0_Msk   (0x1UL << SDMMC_STA_BUSYD0_Pos) /*!< 0x00100000 */
#define SDMMC_STA_BUSYD0                                                                                               \
  SDMMC_STA_BUSYD0_Msk /*!<Inverted value of SDMMC_D0 line (Busy)                                  */
#define SDMMC_STA_BUSYD0END_Pos (21U)
#define SDMMC_STA_BUSYD0END_Msk (0x1UL << SDMMC_STA_BUSYD0END_Pos) /*!< 0x00200000 */
#define SDMMC_STA_BUSYD0END                                                                                            \
  SDMMC_STA_BUSYD0END_Msk /*!<End of SDMMC_D0 Busy following a CMD response detected                  */
#define SDMMC_STA_SDIOIT_Pos (22U)
#define SDMMC_STA_SDIOIT_Msk (0x1UL << SDMMC_STA_SDIOIT_Pos) /*!< 0x00400000 */
#define SDMMC_STA_SDIOIT                                                                                               \
  SDMMC_STA_SDIOIT_Msk /*!<SDIO interrupt received                                                 */
#define SDMMC_STA_ACKFAIL_Pos (23U)
#define SDMMC_STA_ACKFAIL_Msk (0x1UL << SDMMC_STA_ACKFAIL_Pos) /*!< 0x00800000 */
#define SDMMC_STA_ACKFAIL                                                                                              \
  SDMMC_STA_ACKFAIL_Msk /*!<Boot Acknowledgment received (BootAck check fail)                       */
#define SDMMC_STA_ACKTIMEOUT_Pos (24U)
#define SDMMC_STA_ACKTIMEOUT_Msk (0x1UL << SDMMC_STA_ACKTIMEOUT_Pos) /*!< 0x01000000 */
#define SDMMC_STA_ACKTIMEOUT                                                                                           \
  SDMMC_STA_ACKTIMEOUT_Msk /*!<Boot Acknowledgment timeout                                             */
#define SDMMC_STA_VSWEND_Pos (25U)
#define SDMMC_STA_VSWEND_Msk (0x1UL << SDMMC_STA_VSWEND_Pos) /*!< 0x02000000 */
#define SDMMC_STA_VSWEND                                                                                               \
  SDMMC_STA_VSWEND_Msk /*!<Voltage switch critical timing section completion                       */
#define SDMMC_STA_CKSTOP_Pos (26U)
#define SDMMC_STA_CKSTOP_Msk (0x1UL << SDMMC_STA_CKSTOP_Pos) /*!< 0x04000000 */
#define SDMMC_STA_CKSTOP                                                                                               \
  SDMMC_STA_CKSTOP_Msk /*!<SDMMC_CK stopped in Voltage switch procedure                            */
#define SDMMC_STA_IDMATE_Pos (27U)
#define SDMMC_STA_IDMATE_Msk (0x1UL << SDMMC_STA_IDMATE_Pos) /*!< 0x08000000 */
#define SDMMC_STA_IDMATE                                                                                               \
  SDMMC_STA_IDMATE_Msk /*!<IDMA transfer error                                                     */
#define SDMMC_STA_IDMABTC_Pos (28U)
#define SDMMC_STA_IDMABTC_Msk (0x1UL << SDMMC_STA_IDMABTC_Pos) /*!< 0x10000000 */
#define SDMMC_STA_IDMABTC                                                                                              \
  SDMMC_STA_IDMABTC_Msk /*!<IDMA buffer transfer complete                                           */

/*******************  Bit definition for SDMMC_ICR register  *******************/
#define SDMMC_ICR_CCRCFAILC_Pos   (0U)
#define SDMMC_ICR_CCRCFAILC_Msk   (0x1UL << SDMMC_ICR_CCRCFAILC_Pos) /*!< 0x00000001 */
#define SDMMC_ICR_CCRCFAILC       SDMMC_ICR_CCRCFAILC_Msk            /*!<CCRCFAIL flag clear bit */
#define SDMMC_ICR_DCRCFAILC_Pos   (1U)
#define SDMMC_ICR_DCRCFAILC_Msk   (0x1UL << SDMMC_ICR_DCRCFAILC_Pos) /*!< 0x00000002 */
#define SDMMC_ICR_DCRCFAILC       SDMMC_ICR_DCRCFAILC_Msk            /*!<DCRCFAIL flag clear bit */
#define SDMMC_ICR_CTIMEOUTC_Pos   (2U)
#define SDMMC_ICR_CTIMEOUTC_Msk   (0x1UL << SDMMC_ICR_CTIMEOUTC_Pos) /*!< 0x00000004 */
#define SDMMC_ICR_CTIMEOUTC       SDMMC_ICR_CTIMEOUTC_Msk            /*!<CTIMEOUT flag clear bit */
#define SDMMC_ICR_DTIMEOUTC_Pos   (3U)
#define SDMMC_ICR_DTIMEOUTC_Msk   (0x1UL << SDMMC_ICR_DTIMEOUTC_Pos) /*!< 0x00000008 */
#define SDMMC_ICR_DTIMEOUTC       SDMMC_ICR_DTIMEOUTC_Msk            /*!<DTIMEOUT flag clear bit */
#define SDMMC_ICR_TXUNDERRC_Pos   (4U)
#define SDMMC_ICR_TXUNDERRC_Msk   (0x1UL << SDMMC_ICR_TXUNDERRC_Pos) /*!< 0x00000010 */
#define SDMMC_ICR_TXUNDERRC       SDMMC_ICR_TXUNDERRC_Msk            /*!<TXUNDERR flag clear bit */
#define SDMMC_ICR_RXOVERRC_Pos    (5U)
#define SDMMC_ICR_RXOVERRC_Msk    (0x1UL << SDMMC_ICR_RXOVERRC_Pos) /*!< 0x00000020 */
#define SDMMC_ICR_RXOVERRC        SDMMC_ICR_RXOVERRC_Msk            /*!<RXOVERR flag clear bit  */
#define SDMMC_ICR_CMDRENDC_Pos    (6U)
#define SDMMC_ICR_CMDRENDC_Msk    (0x1UL << SDMMC_ICR_CMDRENDC_Pos) /*!< 0x00000040 */
#define SDMMC_ICR_CMDRENDC        SDMMC_ICR_CMDRENDC_Msk            /*!<CMDREND flag clear bit  */
#define SDMMC_ICR_CMDSENTC_Pos    (7U)
#define SDMMC_ICR_CMDSENTC_Msk    (0x1UL << SDMMC_ICR_CMDSENTC_Pos) /*!< 0x00000080 */
#define SDMMC_ICR_CMDSENTC        SDMMC_ICR_CMDSENTC_Msk            /*!<CMDSENT flag clear bit  */
#define SDMMC_ICR_DATAENDC_Pos    (8U)
#define SDMMC_ICR_DATAENDC_Msk    (0x1UL << SDMMC_ICR_DATAENDC_Pos) /*!< 0x00000100 */
#define SDMMC_ICR_DATAENDC        SDMMC_ICR_DATAENDC_Msk            /*!<DATAEND flag clear bit  */
#define SDMMC_ICR_DHOLDC_Pos      (9U)
#define SDMMC_ICR_DHOLDC_Msk      (0x1UL << SDMMC_ICR_DHOLDC_Pos) /*!< 0x00000200 */
#define SDMMC_ICR_DHOLDC          SDMMC_ICR_DHOLDC_Msk            /*!<DHOLD flag clear bit       */
#define SDMMC_ICR_DBCKENDC_Pos    (10U)
#define SDMMC_ICR_DBCKENDC_Msk    (0x1UL << SDMMC_ICR_DBCKENDC_Pos) /*!< 0x00000400 */
#define SDMMC_ICR_DBCKENDC        SDMMC_ICR_DBCKENDC_Msk            /*!<DBCKEND flag clear bit  */
#define SDMMC_ICR_DABORTC_Pos     (11U)
#define SDMMC_ICR_DABORTC_Msk     (0x1UL << SDMMC_ICR_DABORTC_Pos) /*!< 0x00000800 */
#define SDMMC_ICR_DABORTC         SDMMC_ICR_DABORTC_Msk            /*!<DABORTC flag clear bit     */
#define SDMMC_ICR_BUSYD0ENDC_Pos  (21U)
#define SDMMC_ICR_BUSYD0ENDC_Msk  (0x1UL << SDMMC_ICR_BUSYD0ENDC_Pos) /*!< 0x00200000 */
#define SDMMC_ICR_BUSYD0ENDC      SDMMC_ICR_BUSYD0ENDC_Msk            /*!<BUSYD0ENDC flag clear bit  */
#define SDMMC_ICR_SDIOITC_Pos     (22U)
#define SDMMC_ICR_SDIOITC_Msk     (0x1UL << SDMMC_ICR_SDIOITC_Pos) /*!< 0x00400000 */
#define SDMMC_ICR_SDIOITC         SDMMC_ICR_SDIOITC_Msk            /*!<SDIOIT flag clear bit      */
#define SDMMC_ICR_ACKFAILC_Pos    (23U)
#define SDMMC_ICR_ACKFAILC_Msk    (0x1UL << SDMMC_ICR_ACKFAILC_Pos) /*!< 0x00800000 */
#define SDMMC_ICR_ACKFAILC        SDMMC_ICR_ACKFAILC_Msk            /*!<ACKFAILC flag clear bit    */
#define SDMMC_ICR_ACKTIMEOUTC_Pos (24U)
#define SDMMC_ICR_ACKTIMEOUTC_Msk (0x1UL << SDMMC_ICR_ACKTIMEOUTC_Pos) /*!< 0x01000000 */
#define SDMMC_ICR_ACKTIMEOUTC     SDMMC_ICR_ACKTIMEOUTC_Msk            /*!<ACKTIMEOUTC flag clear bit */
#define SDMMC_ICR_VSWENDC_Pos     (25U)
#define SDMMC_ICR_VSWENDC_Msk     (0x1UL << SDMMC_ICR_VSWENDC_Pos) /*!< 0x02000000 */
#define SDMMC_ICR_VSWENDC         SDMMC_ICR_VSWENDC_Msk            /*!<VSWENDC flag clear bit     */
#define SDMMC_ICR_CKSTOPC_Pos     (26U)
#define SDMMC_ICR_CKSTOPC_Msk     (0x1UL << SDMMC_ICR_CKSTOPC_Pos) /*!< 0x04000000 */
#define SDMMC_ICR_CKSTOPC         SDMMC_ICR_CKSTOPC_Msk            /*!<CKSTOPC flag clear bit     */
#define SDMMC_ICR_IDMATEC_Pos     (27U)
#define SDMMC_ICR_IDMATEC_Msk     (0x1UL << SDMMC_ICR_IDMATEC_Pos) /*!< 0x08000000 */
#define SDMMC_ICR_IDMATEC         SDMMC_ICR_IDMATEC_Msk            /*!<IDMATEC flag clear bit     */
#define SDMMC_ICR_IDMABTCC_Pos    (28U)
#define SDMMC_ICR_IDMABTCC_Msk    (0x1UL << SDMMC_ICR_IDMABTCC_Pos) /*!< 0x10000000 */
#define SDMMC_ICR_IDMABTCC        SDMMC_ICR_IDMABTCC_Msk            /*!<IDMABTCC flag clear bit    */

/******************  Bit definition for SDMMC_MASK register  *******************/
#define SDMMC_MASK_CCRCFAILIE_Pos   (0U)
#define SDMMC_MASK_CCRCFAILIE_Msk   (0x1UL << SDMMC_MASK_CCRCFAILIE_Pos) /*!< 0x00000001 */
#define SDMMC_MASK_CCRCFAILIE       SDMMC_MASK_CCRCFAILIE_Msk /*!<Command CRC Fail Interrupt Enable          */
#define SDMMC_MASK_DCRCFAILIE_Pos   (1U)
#define SDMMC_MASK_DCRCFAILIE_Msk   (0x1UL << SDMMC_MASK_DCRCFAILIE_Pos) /*!< 0x00000002 */
#define SDMMC_MASK_DCRCFAILIE       SDMMC_MASK_DCRCFAILIE_Msk /*!<Data CRC Fail Interrupt Enable             */
#define SDMMC_MASK_CTIMEOUTIE_Pos   (2U)
#define SDMMC_MASK_CTIMEOUTIE_Msk   (0x1UL << SDMMC_MASK_CTIMEOUTIE_Pos) /*!< 0x00000004 */
#define SDMMC_MASK_CTIMEOUTIE       SDMMC_MASK_CTIMEOUTIE_Msk /*!<Command TimeOut Interrupt Enable           */
#define SDMMC_MASK_DTIMEOUTIE_Pos   (3U)
#define SDMMC_MASK_DTIMEOUTIE_Msk   (0x1UL << SDMMC_MASK_DTIMEOUTIE_Pos) /*!< 0x00000008 */
#define SDMMC_MASK_DTIMEOUTIE       SDMMC_MASK_DTIMEOUTIE_Msk /*!<Data TimeOut Interrupt Enable              */
#define SDMMC_MASK_TXUNDERRIE_Pos   (4U)
#define SDMMC_MASK_TXUNDERRIE_Msk   (0x1UL << SDMMC_MASK_TXUNDERRIE_Pos) /*!< 0x00000010 */
#define SDMMC_MASK_TXUNDERRIE       SDMMC_MASK_TXUNDERRIE_Msk /*!<Tx FIFO UnderRun Error Interrupt Enable    */
#define SDMMC_MASK_RXOVERRIE_Pos    (5U)
#define SDMMC_MASK_RXOVERRIE_Msk    (0x1UL << SDMMC_MASK_RXOVERRIE_Pos) /*!< 0x00000020 */
#define SDMMC_MASK_RXOVERRIE        SDMMC_MASK_RXOVERRIE_Msk /*!<Rx FIFO OverRun Error Interrupt Enable     */
#define SDMMC_MASK_CMDRENDIE_Pos    (6U)
#define SDMMC_MASK_CMDRENDIE_Msk    (0x1UL << SDMMC_MASK_CMDRENDIE_Pos) /*!< 0x00000040 */
#define SDMMC_MASK_CMDRENDIE        SDMMC_MASK_CMDRENDIE_Msk /*!<Command Response Received Interrupt Enable */
#define SDMMC_MASK_CMDSENTIE_Pos    (7U)
#define SDMMC_MASK_CMDSENTIE_Msk    (0x1UL << SDMMC_MASK_CMDSENTIE_Pos) /*!< 0x00000080 */
#define SDMMC_MASK_CMDSENTIE        SDMMC_MASK_CMDSENTIE_Msk /*!<Command Sent Interrupt Enable              */
#define SDMMC_MASK_DATAENDIE_Pos    (8U)
#define SDMMC_MASK_DATAENDIE_Msk    (0x1UL << SDMMC_MASK_DATAENDIE_Pos) /*!< 0x00000100 */
#define SDMMC_MASK_DATAENDIE        SDMMC_MASK_DATAENDIE_Msk /*!<Data End Interrupt Enable                  */
#define SDMMC_MASK_DHOLDIE_Pos      (9U)
#define SDMMC_MASK_DHOLDIE_Msk      (0x1UL << SDMMC_MASK_DHOLDIE_Pos) /*!< 0x00000200 */
#define SDMMC_MASK_DHOLDIE          SDMMC_MASK_DHOLDIE_Msk            /*!<Data Hold Interrupt Enable                 */
#define SDMMC_MASK_DBCKENDIE_Pos    (10U)
#define SDMMC_MASK_DBCKENDIE_Msk    (0x1UL << SDMMC_MASK_DBCKENDIE_Pos) /*!< 0x00000400 */
#define SDMMC_MASK_DBCKENDIE        SDMMC_MASK_DBCKENDIE_Msk /*!<Data Block End Interrupt Enable            */
#define SDMMC_MASK_DABORTIE_Pos     (11U)
#define SDMMC_MASK_DABORTIE_Msk     (0x1UL << SDMMC_MASK_DABORTIE_Pos) /*!< 0x00000800 */
#define SDMMC_MASK_DABORTIE         SDMMC_MASK_DABORTIE_Msk            /*!<Data transfer aborted interrupt enable     */

#define SDMMC_MASK_TXFIFOHEIE_Pos   (14U)
#define SDMMC_MASK_TXFIFOHEIE_Msk   (0x1UL << SDMMC_MASK_TXFIFOHEIE_Pos) /*!< 0x00004000 */
#define SDMMC_MASK_TXFIFOHEIE       SDMMC_MASK_TXFIFOHEIE_Msk /*!<Tx FIFO Half Empty interrupt Enable        */
#define SDMMC_MASK_RXFIFOHFIE_Pos   (15U)
#define SDMMC_MASK_RXFIFOHFIE_Msk   (0x1UL << SDMMC_MASK_RXFIFOHFIE_Pos) /*!< 0x00008000 */
#define SDMMC_MASK_RXFIFOHFIE       SDMMC_MASK_RXFIFOHFIE_Msk /*!<Rx FIFO Half Full interrupt Enable         */

#define SDMMC_MASK_RXFIFOFIE_Pos    (17U)
#define SDMMC_MASK_RXFIFOFIE_Msk    (0x1UL << SDMMC_MASK_RXFIFOFIE_Pos) /*!< 0x00020000 */
#define SDMMC_MASK_RXFIFOFIE        SDMMC_MASK_RXFIFOFIE_Msk /*!<Rx FIFO Full interrupt Enable              */
#define SDMMC_MASK_TXFIFOEIE_Pos    (18U)
#define SDMMC_MASK_TXFIFOEIE_Msk    (0x1UL << SDMMC_MASK_TXFIFOEIE_Pos) /*!< 0x00040000 */
#define SDMMC_MASK_TXFIFOEIE        SDMMC_MASK_TXFIFOEIE_Msk /*!<Tx FIFO Empty interrupt Enable             */

