Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define SDMMC_MASK_BUSYD0ENDIE_Pos  (21U)
#define SDMMC_MASK_BUSYD0ENDIE_Msk  (0x1UL << SDMMC_MASK_BUSYD0ENDIE_Pos) /*!< 0x00200000 */
#define SDMMC_MASK_BUSYD0ENDIE      SDMMC_MASK_BUSYD0ENDIE_Msk            /*!<BUSYD0ENDIE interrupt Enable */
#define SDMMC_MASK_SDIOITIE_Pos     (22U)
#define SDMMC_MASK_SDIOITIE_Msk     (0x1UL << SDMMC_MASK_SDIOITIE_Pos) /*!< 0x00400000 */
#define SDMMC_MASK_SDIOITIE         SDMMC_MASK_SDIOITIE_Msk /*!<SDMMC Mode Interrupt Received interrupt Enable */
#define SDMMC_MASK_ACKFAILIE_Pos    (23U)
#define SDMMC_MASK_ACKFAILIE_Msk    (0x1UL << SDMMC_MASK_ACKFAILIE_Pos) /*!< 0x00800000 */
#define SDMMC_MASK_ACKFAILIE        SDMMC_MASK_ACKFAILIE_Msk            /*!<Acknowledgment Fail Interrupt Enable */
#define SDMMC_MASK_ACKTIMEOUTIE_Pos (24U)
#define SDMMC_MASK_ACKTIMEOUTIE_Msk (0x1UL << SDMMC_MASK_ACKTIMEOUTIE_Pos) /*!< 0x01000000 */
#define SDMMC_MASK_ACKTIMEOUTIE     SDMMC_MASK_ACKTIMEOUTIE_Msk /*!<Acknowledgment timeout Interrupt Enable */
#define SDMMC_MASK_VSWENDIE_Pos     (25U)
#define SDMMC_MASK_VSWENDIE_Msk     (0x1UL << SDMMC_MASK_VSWENDIE_Pos) /*!< 0x02000000 */
#define SDMMC_MASK_VSWENDIE                                                                                            \
  SDMMC_MASK_VSWENDIE_Msk /*!<Voltage switch critical timing section completion Interrupt Enable */
#define SDMMC_MASK_CKSTOPIE_Pos  (26U)
#define SDMMC_MASK_CKSTOPIE_Msk  (0x1UL << SDMMC_MASK_CKSTOPIE_Pos) /*!< 0x04000000 */
#define SDMMC_MASK_CKSTOPIE      SDMMC_MASK_CKSTOPIE_Msk            /*!<Voltage Switch clock stopped Interrupt Enable */
#define SDMMC_MASK_IDMABTCIE_Pos (28U)
#define SDMMC_MASK_IDMABTCIE_Msk (0x1UL << SDMMC_MASK_IDMABTCIE_Pos) /*!< 0x10000000 */
#define SDMMC_MASK_IDMABTCIE     SDMMC_MASK_IDMABTCIE_Msk /*!<IDMA buffer transfer complete Interrupt Enable */

/*****************  Bit definition for SDMMC_ACKTIME register  *****************/
#define SDMMC_ACKTIME_ACKTIME_Pos (0U)
#define SDMMC_ACKTIME_ACKTIME_Msk (0x1FFFFFFUL << SDMMC_ACKTIME_ACKTIME_Pos) /*!< 0x01FFFFFF */
#define SDMMC_ACKTIME_ACKTIME     SDMMC_ACKTIME_ACKTIME_Msk                  /*!<Boot acknowledgment timeout period */

/******************  Bit definition for SDMMC_FIFO register  *******************/
#define SDMMC_FIFO_FIFODATA_Pos (0U)
#define SDMMC_FIFO_FIFODATA_Msk (0xFFFFFFFFUL << SDMMC_FIFO_FIFODATA_Pos) /*!< 0xFFFFFFFF */
#define SDMMC_FIFO_FIFODATA     SDMMC_FIFO_FIFODATA_Msk                   /*!<Receive and transmit FIFO data */

/******************  Bit definition for SDMMC_IDMACTRL register ****************/
#define SDMMC_IDMA_IDMAEN_Pos    (0U)
#define SDMMC_IDMA_IDMAEN_Msk    (0x1UL << SDMMC_IDMA_IDMAEN_Pos) /*!< 0x00000001 */
#define SDMMC_IDMA_IDMAEN        SDMMC_IDMA_IDMAEN_Msk /*!< Enable the internal DMA of the SDMMC peripheral */
#define SDMMC_IDMA_IDMABMODE_Pos (1U)
#define SDMMC_IDMA_IDMABMODE_Msk (0x1UL << SDMMC_IDMA_IDMABMODE_Pos) /*!< 0x00000002 */
#define SDMMC_IDMA_IDMABMODE     SDMMC_IDMA_IDMABMODE_Msk            /*!< Enable double buffer mode for IDMA */
#define SDMMC_IDMA_IDMABACT_Pos  (2U)
#define SDMMC_IDMA_IDMABACT_Msk  (0x1UL << SDMMC_IDMA_IDMABACT_Pos) /*!< 0x00000004 */
#define SDMMC_IDMA_IDMABACT      SDMMC_IDMA_IDMABACT_Msk /*!< Uses buffer 1 when double buffer mode is selected */

/*****************  Bit definition for SDMMC_IDMABSIZE register  ***************/
#define SDMMC_IDMABSIZE_IDMABNDT_Pos (5U)
#define SDMMC_IDMABSIZE_IDMABNDT_Msk (0xFFUL << SDMMC_IDMABSIZE_IDMABNDT_Pos) /*!< 0x00001FE0 */
#define SDMMC_IDMABSIZE_IDMABNDT     SDMMC_IDMABSIZE_IDMABNDT_Msk             /*!< Number of transfers per buffer */

/*****************  Bit definition for SDMMC_IDMABASE0 register  ***************/
#define SDMMC_IDMABASE0_IDMABASE0 (0xFFFFFFFFU) /*!< Buffer 0 memory base address */

/*****************  Bit definition for SDMMC_IDMABASE1 register  ***************/
#define SDMMC_IDMABASE1_IDMABASE1 (0xFFFFFFFFU) /*!< Buffer 1 memory base address */

/******************************************************************************/
/*                                                                            */
/*                        Delay Block Interface (DLYB)                        */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for DLYB_CR register  ********************/
#define DLYB_CR_DEN_Pos (0U)
#define DLYB_CR_DEN_Msk (0x1UL << DLYB_CR_DEN_Pos) /*!< 0x00000001 */
#define DLYB_CR_DEN     DLYB_CR_DEN_Msk            /*!<Delay Block enable */
#define DLYB_CR_SEN_Pos (1U)
#define DLYB_CR_SEN_Msk (0x1UL << DLYB_CR_SEN_Pos) /*!< 0x00000002 */
#define DLYB_CR_SEN     DLYB_CR_SEN_Msk            /*!<Sampler length enable */

/*******************  Bit definition for DLYB_CFGR register  ********************/
#define DLYB_CFGR_SEL_Pos  (0U)
#define DLYB_CFGR_SEL_Msk  (0xFUL << DLYB_CFGR_SEL_Pos) /*!< 0x0000000F */
#define DLYB_CFGR_SEL      DLYB_CFGR_SEL_Msk            /*!<Select the phase for the Output clock[3:0] */
#define DLYB_CFGR_SEL_0    (0x1UL << DLYB_CFGR_SEL_Pos) /*!< 0x00000001 */
#define DLYB_CFGR_SEL_1    (0x2UL << DLYB_CFGR_SEL_Pos) /*!< 0x00000002 */
#define DLYB_CFGR_SEL_2    (0x3UL << DLYB_CFGR_SEL_Pos) /*!< 0x00000003 */
#define DLYB_CFGR_SEL_3    (0x8UL << DLYB_CFGR_SEL_Pos) /*!< 0x00000008 */

#define DLYB_CFGR_UNIT_Pos (8U)
#define DLYB_CFGR_UNIT_Msk (0x7FUL << DLYB_CFGR_UNIT_Pos) /*!< 0x00007F00 */
#define DLYB_CFGR_UNIT     DLYB_CFGR_UNIT_Msk             /*!<Delay Defines the delay of a Unit delay cell[6:0] */
#define DLYB_CFGR_UNIT_0   (0x01UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00000100 */
#define DLYB_CFGR_UNIT_1   (0x02UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00000200 */
#define DLYB_CFGR_UNIT_2   (0x04UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00000400 */
#define DLYB_CFGR_UNIT_3   (0x08UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00000800 */
#define DLYB_CFGR_UNIT_4   (0x10UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00001000 */
#define DLYB_CFGR_UNIT_5   (0x20UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00002000 */
#define DLYB_CFGR_UNIT_6   (0x40UL << DLYB_CFGR_UNIT_Pos) /*!< 0x00004000 */

#define DLYB_CFGR_LNG_Pos  (16U)
#define DLYB_CFGR_LNG_Msk  (0xFFFUL << DLYB_CFGR_LNG_Pos) /*!< 0x0FFF0000 */
#define DLYB_CFGR_LNG      DLYB_CFGR_LNG_Msk              /*!<Delay line length value[11:0] */
#define DLYB_CFGR_LNG_0    (0x001UL << DLYB_CFGR_LNG_Pos) /*!< 0x00010000 */
#define DLYB_CFGR_LNG_1    (0x002UL << DLYB_CFGR_LNG_Pos) /*!< 0x00020000 */
#define DLYB_CFGR_LNG_2    (0x004UL << DLYB_CFGR_LNG_Pos) /*!< 0x00040000 */
#define DLYB_CFGR_LNG_3    (0x008UL << DLYB_CFGR_LNG_Pos) /*!< 0x00080000 */
#define DLYB_CFGR_LNG_4    (0x010UL << DLYB_CFGR_LNG_Pos) /*!< 0x00100000 */
#define DLYB_CFGR_LNG_5    (0x020UL << DLYB_CFGR_LNG_Pos) /*!< 0x00200000 */
#define DLYB_CFGR_LNG_6    (0x040UL << DLYB_CFGR_LNG_Pos) /*!< 0x00400000 */
#define DLYB_CFGR_LNG_7    (0x080UL << DLYB_CFGR_LNG_Pos) /*!< 0x00800000 */
#define DLYB_CFGR_LNG_8    (0x100UL << DLYB_CFGR_LNG_Pos) /*!< 0x01000000 */
#define DLYB_CFGR_LNG_9    (0x200UL << DLYB_CFGR_LNG_Pos) /*!< 0x02000000 */
#define DLYB_CFGR_LNG_10   (0x400UL << DLYB_CFGR_LNG_Pos) /*!< 0x04000000 */
#define DLYB_CFGR_LNG_11   (0x800UL << DLYB_CFGR_LNG_Pos) /*!< 0x08000000 */

#define DLYB_CFGR_LNGF_Pos (31U)
#define DLYB_CFGR_LNGF_Msk (0x1UL << DLYB_CFGR_LNGF_Pos) /*!< 0x80000000 */
#define DLYB_CFGR_LNGF     DLYB_CFGR_LNGF_Msk            /*!<Length valid flag */

/******************************************************************************/
/*                                                                            */
/*                   Serial Peripheral Interface (SPI/I2S)                    */
/*                                                                            */
/******************************************************************************/
#define SPI_SPI6I2S_SUPPORT /*!<SPI6 I2S support feature */
/*******************  Bit definition for SPI_CR1 register  ********************/
#define SPI_CR1_SPE_Pos      (0U)
#define SPI_CR1_SPE_Msk      (0x1UL << SPI_CR1_SPE_Pos) /*!< 0x00000001 */
#define SPI_CR1_SPE          SPI_CR1_SPE_Msk            /*!<Serial Peripheral Enable                         */
#define SPI_CR1_MASRX_Pos    (8U)
#define SPI_CR1_MASRX_Msk    (0x1UL << SPI_CR1_MASRX_Pos) /*!< 0x00000100 */
#define SPI_CR1_MASRX        SPI_CR1_MASRX_Msk            /*!<Master automatic SUSP in Receive mode            */
#define SPI_CR1_CSTART_Pos   (9U)
#define SPI_CR1_CSTART_Msk   (0x1UL << SPI_CR1_CSTART_Pos) /*!< 0x00000200 */
#define SPI_CR1_CSTART       SPI_CR1_CSTART_Msk            /*!<Master transfer start                            */
#define SPI_CR1_CSUSP_Pos    (10U)
#define SPI_CR1_CSUSP_Msk    (0x1UL << SPI_CR1_CSUSP_Pos) /*!< 0x00000400 */
#define SPI_CR1_CSUSP        SPI_CR1_CSUSP_Msk            /*!<Master SUSPend request                           */
#define SPI_CR1_HDDIR_Pos    (11U)
#define SPI_CR1_HDDIR_Msk    (0x1UL << SPI_CR1_HDDIR_Pos) /*!< 0x00000800 */
#define SPI_CR1_HDDIR        SPI_CR1_HDDIR_Msk            /*!<Rx/Tx direction at Half-duplex mode              */
#define SPI_CR1_SSI_Pos      (12U)
#define SPI_CR1_SSI_Msk      (0x1UL << SPI_CR1_SSI_Pos) /*!< 0x00001000 */
#define SPI_CR1_SSI          SPI_CR1_SSI_Msk            /*!<Internal SS signal input level                   */
#define SPI_CR1_CRC33_17_Pos (13U)
#define SPI_CR1_CRC33_17_Msk (0x1UL << SPI_CR1_CRC33_17_Pos) /*!< 0x00002000 */
#define SPI_CR1_CRC33_17     SPI_CR1_CRC33_17_Msk            /*!<32-bit CRC polynomial configuration              */
#define SPI_CR1_RCRCINI_Pos  (14U)
#define SPI_CR1_RCRCINI_Msk  (0x1UL << SPI_CR1_RCRCINI_Pos) /*!< 0x00004000 */
#define SPI_CR1_RCRCINI      SPI_CR1_RCRCINI_Msk            /*!<CRC init pattern control for receiver            */
#define SPI_CR1_TCRCINI_Pos  (15U)
#define SPI_CR1_TCRCINI_Msk  (0x1UL << SPI_CR1_TCRCINI_Pos) /*!< 0x00008000 */
#define SPI_CR1_TCRCINI      SPI_CR1_TCRCINI_Msk            /*!<CRC init pattern control for transmitter         */
#define SPI_CR1_IOLOCK_Pos   (16U)
#define SPI_CR1_IOLOCK_Msk   (0x1UL << SPI_CR1_IOLOCK_Pos) /*!< 0x00010000 */
#define SPI_CR1_IOLOCK       SPI_CR1_IOLOCK_Msk            /*!<Locking the AF configuration of associated IOs   */

