Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for SPI_TXCRC register  ********************/
#define SPI_TXCRC_TXCRC_Pos (0U)
#define SPI_TXCRC_TXCRC_Msk (0xFFFFFFFFUL << SPI_TXCRC_TXCRC_Pos) /*!< 0xFFFFFFFF */
#define SPI_TXCRC_TXCRC     SPI_TXCRC_TXCRC_Msk                   /* CRCRegister for transmitter */

/*******************  Bit definition for SPI_RXCRC register  ********************/
#define SPI_RXCRC_RXCRC_Pos (0U)
#define SPI_RXCRC_RXCRC_Msk (0xFFFFFFFFUL << SPI_RXCRC_RXCRC_Pos) /*!< 0xFFFFFFFF */
#define SPI_RXCRC_RXCRC     SPI_RXCRC_RXCRC_Msk                   /* CRCRegister for receiver */

/*******************  Bit definition for SPI_UDRDR register  ********************/
#define SPI_UDRDR_UDRDR_Pos (0U)
#define SPI_UDRDR_UDRDR_Msk (0xFFFFFFFFUL << SPI_UDRDR_UDRDR_Pos) /*!< 0xFFFFFFFF */
#define SPI_UDRDR_UDRDR     SPI_UDRDR_UDRDR_Msk                   /* Data at slave underrun condition */

/******************  Bit definition for SPI_I2SCFGR register  *****************/
#define SPI_I2SCFGR_I2SMOD_Pos  (0U)
#define SPI_I2SCFGR_I2SMOD_Msk  (0x1UL << SPI_I2SCFGR_I2SMOD_Pos) /*!< 0x00000001 */
#define SPI_I2SCFGR_I2SMOD      SPI_I2SCFGR_I2SMOD_Msk            /*!<I2S mode selection */
#define SPI_I2SCFGR_I2SCFG_Pos  (1U)
#define SPI_I2SCFGR_I2SCFG_Msk  (0x7UL << SPI_I2SCFGR_I2SCFG_Pos) /*!< 0x0000000E */
#define SPI_I2SCFGR_I2SCFG      SPI_I2SCFGR_I2SCFG_Msk /*!<I2SCFG[2:0] I2S configuration mode                */
#define SPI_I2SCFGR_I2SCFG_0    (0x1UL << SPI_I2SCFGR_I2SCFG_Pos) /*!< 0x00000002 */
#define SPI_I2SCFGR_I2SCFG_1    (0x2UL << SPI_I2SCFGR_I2SCFG_Pos) /*!< 0x00000004 */
#define SPI_I2SCFGR_I2SCFG_2    (0x4UL << SPI_I2SCFGR_I2SCFG_Pos) /*!< 0x00000008 */
#define SPI_I2SCFGR_I2SSTD_Pos  (4U)
#define SPI_I2SCFGR_I2SSTD_Msk  (0x3UL << SPI_I2SCFGR_I2SSTD_Pos) /*!< 0x00000030 */
#define SPI_I2SCFGR_I2SSTD      SPI_I2SCFGR_I2SSTD_Msk /*!<I2SSTD[1:0] I2S standard selection                */
#define SPI_I2SCFGR_I2SSTD_0    (0x1UL << SPI_I2SCFGR_I2SSTD_Pos) /*!< 0x00000010 */
#define SPI_I2SCFGR_I2SSTD_1    (0x2UL << SPI_I2SCFGR_I2SSTD_Pos) /*!< 0x00000020 */
#define SPI_I2SCFGR_PCMSYNC_Pos (7U)
#define SPI_I2SCFGR_PCMSYNC_Msk (0x1UL << SPI_I2SCFGR_PCMSYNC_Pos) /*!< 0x00000080 */
#define SPI_I2SCFGR_PCMSYNC     SPI_I2SCFGR_PCMSYNC_Msk /*!<PCM frame synchronization                         */
#define SPI_I2SCFGR_DATLEN_Pos  (8U)
#define SPI_I2SCFGR_DATLEN_Msk  (0x3UL << SPI_I2SCFGR_DATLEN_Pos) /*!< 0x00000300 */
#define SPI_I2SCFGR_DATLEN      SPI_I2SCFGR_DATLEN_Msk /*!<DATLEN[1:0] Data length to be transferred         */
#define SPI_I2SCFGR_DATLEN_0    (0x1UL << SPI_I2SCFGR_DATLEN_Pos) /*!< 0x00000100 */
#define SPI_I2SCFGR_DATLEN_1    (0x2UL << SPI_I2SCFGR_DATLEN_Pos) /*!< 0x00000200 */
#define SPI_I2SCFGR_CHLEN_Pos   (10U)
#define SPI_I2SCFGR_CHLEN_Msk   (0x1UL << SPI_I2SCFGR_CHLEN_Pos) /*!< 0x00000400 */
#define SPI_I2SCFGR_CHLEN       SPI_I2SCFGR_CHLEN_Msk /*!<Channel length (number of bits per audio channel) */
#define SPI_I2SCFGR_CKPOL_Pos   (11U)
#define SPI_I2SCFGR_CKPOL_Msk   (0x1UL << SPI_I2SCFGR_CKPOL_Pos) /*!< 0x00000800 */
#define SPI_I2SCFGR_CKPOL       SPI_I2SCFGR_CKPOL_Msk /*!<Steady state clock polarity                       */
#define SPI_I2SCFGR_FIXCH_Pos   (12U)
#define SPI_I2SCFGR_FIXCH_Msk   (0x1UL << SPI_I2SCFGR_FIXCH_Pos) /*!< 0x00001000 */
#define SPI_I2SCFGR_FIXCH       SPI_I2SCFGR_FIXCH_Msk /*!<Fixed channel length in SLAVE                     */
#define SPI_I2SCFGR_WSINV_Pos   (13U)
#define SPI_I2SCFGR_WSINV_Msk   (0x1UL << SPI_I2SCFGR_WSINV_Pos) /*!< 0x00002000 */
#define SPI_I2SCFGR_WSINV       SPI_I2SCFGR_WSINV_Msk /*!<Word select inversion                             */
#define SPI_I2SCFGR_DATFMT_Pos  (14U)
#define SPI_I2SCFGR_DATFMT_Msk  (0x1UL << SPI_I2SCFGR_DATFMT_Pos) /*!< 0x00004000 */
#define SPI_I2SCFGR_DATFMT      SPI_I2SCFGR_DATFMT_Msk /*!<Data format                                       */
#define SPI_I2SCFGR_I2SDIV_Pos  (16U)
#define SPI_I2SCFGR_I2SDIV_Msk  (0xFFUL << SPI_I2SCFGR_I2SDIV_Pos) /*!< 0x00FF0000 */
#define SPI_I2SCFGR_I2SDIV      SPI_I2SCFGR_I2SDIV_Msk             /*!<I2S Linear prescaler */
#define SPI_I2SCFGR_ODD_Pos     (24U)
#define SPI_I2SCFGR_ODD_Msk     (0x1UL << SPI_I2SCFGR_ODD_Pos) /*!< 0x01000000 */
#define SPI_I2SCFGR_ODD         SPI_I2SCFGR_ODD_Msk            /*!<Odd factor for the prescaler */
#define SPI_I2SCFGR_MCKOE_Pos   (25U)
#define SPI_I2SCFGR_MCKOE_Msk   (0x1UL << SPI_I2SCFGR_MCKOE_Pos) /*!< 0x02000000 */
#define SPI_I2SCFGR_MCKOE       SPI_I2SCFGR_MCKOE_Msk            /*!<Master Clock Output Enable */

/******************************************************************************/
/*                                                                            */
/*                                 SYSCFG                                     */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for SYSCFG_PMCR register  ******************/
#define SYSCFG_PMCR_I2C1_FMP_Pos    (0U)
#define SYSCFG_PMCR_I2C1_FMP_Msk    (0x1UL << SYSCFG_PMCR_I2C1_FMP_Pos) /*!< 0x00000001 */
#define SYSCFG_PMCR_I2C1_FMP        SYSCFG_PMCR_I2C1_FMP_Msk            /*!< I2C1 Fast mode plus */
#define SYSCFG_PMCR_I2C2_FMP_Pos    (1U)
#define SYSCFG_PMCR_I2C2_FMP_Msk    (0x1UL << SYSCFG_PMCR_I2C2_FMP_Pos) /*!< 0x00000002 */
#define SYSCFG_PMCR_I2C2_FMP        SYSCFG_PMCR_I2C2_FMP_Msk            /*!< I2C2 Fast mode plus */
#define SYSCFG_PMCR_I2C3_FMP_Pos    (2U)
#define SYSCFG_PMCR_I2C3_FMP_Msk    (0x1UL << SYSCFG_PMCR_I2C3_FMP_Pos) /*!< 0x00000004 */
#define SYSCFG_PMCR_I2C3_FMP        SYSCFG_PMCR_I2C3_FMP_Msk            /*!< I2C3 Fast mode plus */
#define SYSCFG_PMCR_I2C4_FMP_Pos    (3U)
#define SYSCFG_PMCR_I2C4_FMP_Msk    (0x1UL << SYSCFG_PMCR_I2C4_FMP_Pos) /*!< 0x00000008 */
#define SYSCFG_PMCR_I2C4_FMP        SYSCFG_PMCR_I2C4_FMP_Msk            /*!< I2C4 Fast mode plus */
#define SYSCFG_PMCR_I2C_PB6_FMP_Pos (4U)
#define SYSCFG_PMCR_I2C_PB6_FMP_Msk (0x1UL << SYSCFG_PMCR_I2C_PB6_FMP_Pos) /*!< 0x00000010 */
#define SYSCFG_PMCR_I2C_PB6_FMP     SYSCFG_PMCR_I2C_PB6_FMP_Msk            /*!< I2C PB6 Fast mode plus */
#define SYSCFG_PMCR_I2C_PB7_FMP_Pos (5U)
#define SYSCFG_PMCR_I2C_PB7_FMP_Msk (0x1UL << SYSCFG_PMCR_I2C_PB7_FMP_Pos) /*!< 0x00000020 */
#define SYSCFG_PMCR_I2C_PB7_FMP     SYSCFG_PMCR_I2C_PB7_FMP_Msk            /*!< I2C PB7 Fast mode plus */
#define SYSCFG_PMCR_I2C_PB8_FMP_Pos (6U)
#define SYSCFG_PMCR_I2C_PB8_FMP_Msk (0x1UL << SYSCFG_PMCR_I2C_PB8_FMP_Pos) /*!< 0x00000040 */
#define SYSCFG_PMCR_I2C_PB8_FMP     SYSCFG_PMCR_I2C_PB8_FMP_Msk            /*!< I2C PB8 Fast mode plus */
#define SYSCFG_PMCR_I2C_PB9_FMP_Pos (7U)
#define SYSCFG_PMCR_I2C_PB9_FMP_Msk (0x1UL << SYSCFG_PMCR_I2C_PB9_FMP_Pos) /*!< 0x00000080 */
#define SYSCFG_PMCR_I2C_PB9_FMP     SYSCFG_PMCR_I2C_PB9_FMP_Msk            /*!< I2C PB9 Fast mode plus */
#define SYSCFG_PMCR_PA0SO_Pos       (24U)
#define SYSCFG_PMCR_PA0SO_Msk       (0x1UL << SYSCFG_PMCR_PA0SO_Pos) /*!< 0x01000000 */
#define SYSCFG_PMCR_PA0SO           SYSCFG_PMCR_PA0SO_Msk            /*!< PA0 Switch Open */
#define SYSCFG_PMCR_PA1SO_Pos       (25U)
#define SYSCFG_PMCR_PA1SO_Msk       (0x1UL << SYSCFG_PMCR_PA1SO_Pos) /*!< 0x02000000 */
#define SYSCFG_PMCR_PA1SO           SYSCFG_PMCR_PA1SO_Msk            /*!< PA1 Switch Open */
#define SYSCFG_PMCR_PC2SO_Pos       (26U)
#define SYSCFG_PMCR_PC2SO_Msk       (0x1UL << SYSCFG_PMCR_PC2SO_Pos) /*!< 0x04000000 */
#define SYSCFG_PMCR_PC2SO           SYSCFG_PMCR_PC2SO_Msk            /*!< PC2 Switch Open */
#define SYSCFG_PMCR_PC3SO_Pos       (27U)
#define SYSCFG_PMCR_PC3SO_Msk       (0x1UL << SYSCFG_PMCR_PC3SO_Pos) /*!< 0x08000000 */
#define SYSCFG_PMCR_PC3SO           SYSCFG_PMCR_PC3SO_Msk            /*!< PC3 Switch Open */

/*****************  Bit definition for SYSCFG_EXTICR1 register  ***************/
#define SYSCFG_EXTICR1_EXTI0_Pos (0U)
#define SYSCFG_EXTICR1_EXTI0_Msk (0xFUL << SYSCFG_EXTICR1_EXTI0_Pos) /*!< 0x0000000F */
#define SYSCFG_EXTICR1_EXTI0     SYSCFG_EXTICR1_EXTI0_Msk            /*!<EXTI 0 configuration */
#define SYSCFG_EXTICR1_EXTI1_Pos (4U)
#define SYSCFG_EXTICR1_EXTI1_Msk (0xFUL << SYSCFG_EXTICR1_EXTI1_Pos) /*!< 0x000000F0 */
#define SYSCFG_EXTICR1_EXTI1     SYSCFG_EXTICR1_EXTI1_Msk            /*!<EXTI 1 configuration */
#define SYSCFG_EXTICR1_EXTI2_Pos (8U)
#define SYSCFG_EXTICR1_EXTI2_Msk (0xFUL << SYSCFG_EXTICR1_EXTI2_Pos) /*!< 0x00000F00 */
#define SYSCFG_EXTICR1_EXTI2     SYSCFG_EXTICR1_EXTI2_Msk            /*!<EXTI 2 configuration */
#define SYSCFG_EXTICR1_EXTI3_Pos (12U)
#define SYSCFG_EXTICR1_EXTI3_Msk (0xFUL << SYSCFG_EXTICR1_EXTI3_Pos) /*!< 0x0000F000 */
#define SYSCFG_EXTICR1_EXTI3     SYSCFG_EXTICR1_EXTI3_Msk            /*!<EXTI 3 configuration */
/**
 * @brief   EXTI0 configuration
 */
#define SYSCFG_EXTICR1_EXTI0_PA (0U)          /*!<PA[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PB (0x00000001U) /*!<PB[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PC (0x00000002U) /*!<PC[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PD (0x00000003U) /*!<PD[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PE (0x00000004U) /*!<PE[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PF (0x00000005U) /*!<PF[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PG (0x00000006U) /*!<PG[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PH (0x00000007U) /*!<PH[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PI (0x00000008U) /*!<PI[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PJ (0x00000009U) /*!<PJ[0] pin */
#define SYSCFG_EXTICR1_EXTI0_PK (0x0000000AU) /*!<PK[0] pin */

/**
 * @brief   EXTI1 configuration
 */
#define SYSCFG_EXTICR1_EXTI1_PA (0U)          /*!<PA[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PB (0x00000010U) /*!<PB[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PC (0x00000020U) /*!<PC[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PD (0x00000030U) /*!<PD[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PE (0x00000040U) /*!<PE[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PF (0x00000050U) /*!<PF[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PG (0x00000060U) /*!<PG[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PH (0x00000070U) /*!<PH[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PI (0x00000080U) /*!<PI[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PJ (0x00000090U) /*!<PJ[1] pin */
#define SYSCFG_EXTICR1_EXTI1_PK (0x000000A0U) /*!<PK[1] pin */
/**
 * @brief   EXTI2 configuration
 */
#define SYSCFG_EXTICR1_EXTI2_PA (0U)          /*!<PA[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PB (0x00000100U) /*!<PB[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PC (0x00000200U) /*!<PC[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PD (0x00000300U) /*!<PD[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PE (0x00000400U) /*!<PE[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PF (0x00000500U) /*!<PF[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PG (0x00000600U) /*!<PG[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PH (0x00000700U) /*!<PH[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PI (0x00000800U) /*!<PI[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PJ (0x00000900U) /*!<PJ[2] pin */
#define SYSCFG_EXTICR1_EXTI2_PK (0x00000A00U) /*!<PK[2] pin */

/**
 * @brief   EXTI3 configuration
 */
#define SYSCFG_EXTICR1_EXTI3_PA (0U)          /*!<PA[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PB (0x00001000U) /*!<PB[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PC (0x00002000U) /*!<PC[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PD (0x00003000U) /*!<PD[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PE (0x00004000U) /*!<PE[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PF (0x00005000U) /*!<PF[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PG (0x00006000U) /*!<PG[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PH (0x00007000U) /*!<PH[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PI (0x00008000U) /*!<PI[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PJ (0x00009000U) /*!<PJ[3] pin */
#define SYSCFG_EXTICR1_EXTI3_PK (0x0000A000U) /*!<PK[3] pin */

