Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for TIM_CCR5 register  *******************/
#define TIM_CCR5_CCR5_Pos  (0U)
#define TIM_CCR5_CCR5_Msk  (0xFFFFFFFFUL << TIM_CCR5_CCR5_Pos) /*!< 0xFFFFFFFF */
#define TIM_CCR5_CCR5      TIM_CCR5_CCR5_Msk                   /*!<Capture/Compare 5 Value */
#define TIM_CCR5_GC5C1_Pos (29U)
#define TIM_CCR5_GC5C1_Msk (0x1UL << TIM_CCR5_GC5C1_Pos) /*!< 0x20000000 */
#define TIM_CCR5_GC5C1     TIM_CCR5_GC5C1_Msk            /*!<Group Channel 5 and Channel 1 */
#define TIM_CCR5_GC5C2_Pos (30U)
#define TIM_CCR5_GC5C2_Msk (0x1UL << TIM_CCR5_GC5C2_Pos) /*!< 0x40000000 */
#define TIM_CCR5_GC5C2     TIM_CCR5_GC5C2_Msk            /*!<Group Channel 5 and Channel 2 */
#define TIM_CCR5_GC5C3_Pos (31U)
#define TIM_CCR5_GC5C3_Msk (0x1UL << TIM_CCR5_GC5C3_Pos) /*!< 0x80000000 */
#define TIM_CCR5_GC5C3     TIM_CCR5_GC5C3_Msk            /*!<Group Channel 5 and Channel 3 */

/*******************  Bit definition for TIM_CCR6 register  *******************/
#define TIM_CCR6_CCR6_Pos (0U)
#define TIM_CCR6_CCR6_Msk (0xFFFFUL << TIM_CCR6_CCR6_Pos) /*!< 0x0000FFFF */
#define TIM_CCR6_CCR6     TIM_CCR6_CCR6_Msk               /*!<Capture/Compare 6 Value */

/*******************  Bit definition for TIM_BDTR register  *******************/
#define TIM_BDTR_DTG_Pos     (0U)
#define TIM_BDTR_DTG_Msk     (0xFFUL << TIM_BDTR_DTG_Pos) /*!< 0x000000FF */
#define TIM_BDTR_DTG         TIM_BDTR_DTG_Msk             /*!<DTG[0:7] bits (Dead-Time Generator set-up) */
#define TIM_BDTR_DTG_0       (0x01UL << TIM_BDTR_DTG_Pos) /*!< 0x00000001 */
#define TIM_BDTR_DTG_1       (0x02UL << TIM_BDTR_DTG_Pos) /*!< 0x00000002 */
#define TIM_BDTR_DTG_2       (0x04UL << TIM_BDTR_DTG_Pos) /*!< 0x00000004 */
#define TIM_BDTR_DTG_3       (0x08UL << TIM_BDTR_DTG_Pos) /*!< 0x00000008 */
#define TIM_BDTR_DTG_4       (0x10UL << TIM_BDTR_DTG_Pos) /*!< 0x00000010 */
#define TIM_BDTR_DTG_5       (0x20UL << TIM_BDTR_DTG_Pos) /*!< 0x00000020 */
#define TIM_BDTR_DTG_6       (0x40UL << TIM_BDTR_DTG_Pos) /*!< 0x00000040 */
#define TIM_BDTR_DTG_7       (0x80UL << TIM_BDTR_DTG_Pos) /*!< 0x00000080 */

#define TIM_BDTR_LOCK_Pos    (8U)
#define TIM_BDTR_LOCK_Msk    (0x3UL << TIM_BDTR_LOCK_Pos) /*!< 0x00000300 */
#define TIM_BDTR_LOCK        TIM_BDTR_LOCK_Msk            /*!<LOCK[1:0] bits (Lock Configuration) */
#define TIM_BDTR_LOCK_0      (0x1UL << TIM_BDTR_LOCK_Pos) /*!< 0x00000100 */
#define TIM_BDTR_LOCK_1      (0x2UL << TIM_BDTR_LOCK_Pos) /*!< 0x00000200 */

#define TIM_BDTR_OSSI_Pos    (10U)
#define TIM_BDTR_OSSI_Msk    (0x1UL << TIM_BDTR_OSSI_Pos) /*!< 0x00000400 */
#define TIM_BDTR_OSSI        TIM_BDTR_OSSI_Msk            /*!<Off-State Selection for Idle mode */
#define TIM_BDTR_OSSR_Pos    (11U)
#define TIM_BDTR_OSSR_Msk    (0x1UL << TIM_BDTR_OSSR_Pos) /*!< 0x00000800 */
#define TIM_BDTR_OSSR        TIM_BDTR_OSSR_Msk            /*!<Off-State Selection for Run mode */
#define TIM_BDTR_BKE_Pos     (12U)
#define TIM_BDTR_BKE_Msk     (0x1UL << TIM_BDTR_BKE_Pos) /*!< 0x00001000 */
#define TIM_BDTR_BKE         TIM_BDTR_BKE_Msk            /*!<Break enable for Break1 */
#define TIM_BDTR_BKP_Pos     (13U)
#define TIM_BDTR_BKP_Msk     (0x1UL << TIM_BDTR_BKP_Pos) /*!< 0x00002000 */
#define TIM_BDTR_BKP         TIM_BDTR_BKP_Msk            /*!<Break Polarity for Break1 */
#define TIM_BDTR_AOE_Pos     (14U)
#define TIM_BDTR_AOE_Msk     (0x1UL << TIM_BDTR_AOE_Pos) /*!< 0x00004000 */
#define TIM_BDTR_AOE         TIM_BDTR_AOE_Msk            /*!<Automatic Output enable */
#define TIM_BDTR_MOE_Pos     (15U)
#define TIM_BDTR_MOE_Msk     (0x1UL << TIM_BDTR_MOE_Pos) /*!< 0x00008000 */
#define TIM_BDTR_MOE         TIM_BDTR_MOE_Msk            /*!<Main Output enable */

#define TIM_BDTR_BKF_Pos     (16U)
#define TIM_BDTR_BKF_Msk     (0xFUL << TIM_BDTR_BKF_Pos) /*!< 0x000F0000 */
#define TIM_BDTR_BKF         TIM_BDTR_BKF_Msk            /*!<Break Filter for Break1 */
#define TIM_BDTR_BK2F_Pos    (20U)
#define TIM_BDTR_BK2F_Msk    (0xFUL << TIM_BDTR_BK2F_Pos) /*!< 0x00F00000 */
#define TIM_BDTR_BK2F        TIM_BDTR_BK2F_Msk            /*!<Break Filter for Break2 */

#define TIM_BDTR_BK2E_Pos    (24U)
#define TIM_BDTR_BK2E_Msk    (0x1UL << TIM_BDTR_BK2E_Pos) /*!< 0x01000000 */
#define TIM_BDTR_BK2E        TIM_BDTR_BK2E_Msk            /*!<Break enable for Break2 */
#define TIM_BDTR_BK2P_Pos    (25U)
#define TIM_BDTR_BK2P_Msk    (0x1UL << TIM_BDTR_BK2P_Pos) /*!< 0x02000000 */
#define TIM_BDTR_BK2P        TIM_BDTR_BK2P_Msk            /*!<Break Polarity for Break2 */
#define TIM_BDTR_BKDSRM_Pos  (26U)
#define TIM_BDTR_BKDSRM_Msk  (0x1UL << TIM_BDTR_BKDSRM_Pos) /*!< 0x04000000 */
#define TIM_BDTR_BKDSRM      TIM_BDTR_BKDSRM_Msk            /*!<Break Disarm */
#define TIM_BDTR_BK2DSRM_Pos (27U)
#define TIM_BDTR_BK2DSRM_Msk (0x1UL << TIM_BDTR_BK2DSRM_Pos) /*!< 0x08000000 */
#define TIM_BDTR_BK2DSRM     TIM_BDTR_BK2DSRM_Msk            /*!<Break2 Disarm */
#define TIM_BDTR_BKBID_Pos   (28U)
#define TIM_BDTR_BKBID_Msk   (0x1UL << TIM_BDTR_BKBID_Pos) /*!< 0x10000000 */
#define TIM_BDTR_BKBID       TIM_BDTR_BKBID_Msk            /*!<Break Bidirectional */
#define TIM_BDTR_BK2BID_Pos  (29U)
#define TIM_BDTR_BK2BID_Msk  (0x1UL << TIM_BDTR_BK2BID_Pos) /*!< 0x20000000 */
#define TIM_BDTR_BK2BID      TIM_BDTR_BK2BID_Msk            /*!<Break2 Bidirectional */

/*******************  Bit definition for TIM_DCR register  ********************/
#define TIM_DCR_DBA_Pos (0U)
#define TIM_DCR_DBA_Msk (0x1FUL << TIM_DCR_DBA_Pos) /*!< 0x0000001F */
#define TIM_DCR_DBA     TIM_DCR_DBA_Msk             /*!<DBA[4:0] bits (DMA Base Address) */
#define TIM_DCR_DBA_0   (0x01UL << TIM_DCR_DBA_Pos) /*!< 0x00000001 */
#define TIM_DCR_DBA_1   (0x02UL << TIM_DCR_DBA_Pos) /*!< 0x00000002 */
#define TIM_DCR_DBA_2   (0x04UL << TIM_DCR_DBA_Pos) /*!< 0x00000004 */
#define TIM_DCR_DBA_3   (0x08UL << TIM_DCR_DBA_Pos) /*!< 0x00000008 */
#define TIM_DCR_DBA_4   (0x10UL << TIM_DCR_DBA_Pos) /*!< 0x00000010 */

#define TIM_DCR_DBL_Pos (8U)
#define TIM_DCR_DBL_Msk (0x1FUL << TIM_DCR_DBL_Pos) /*!< 0x00001F00 */
#define TIM_DCR_DBL     TIM_DCR_DBL_Msk             /*!<DBL[4:0] bits (DMA Burst Length) */
#define TIM_DCR_DBL_0   (0x01UL << TIM_DCR_DBL_Pos) /*!< 0x00000100 */
#define TIM_DCR_DBL_1   (0x02UL << TIM_DCR_DBL_Pos) /*!< 0x00000200 */
#define TIM_DCR_DBL_2   (0x04UL << TIM_DCR_DBL_Pos) /*!< 0x00000400 */
#define TIM_DCR_DBL_3   (0x08UL << TIM_DCR_DBL_Pos) /*!< 0x00000800 */
#define TIM_DCR_DBL_4   (0x10UL << TIM_DCR_DBL_Pos) /*!< 0x00001000 */

/*******************  Bit definition for TIM_DMAR register  *******************/
#define TIM_DMAR_DMAB_Pos (0U)
#define TIM_DMAR_DMAB_Msk (0xFFFFUL << TIM_DMAR_DMAB_Pos) /*!< 0x0000FFFF */
#define TIM_DMAR_DMAB     TIM_DMAR_DMAB_Msk               /*!<DMA register for burst accesses */

/******************  Bit definition for TIM_CCMR3 register  *******************/
#define TIM_CCMR3_OC5FE_Pos (2U)
#define TIM_CCMR3_OC5FE_Msk (0x1UL << TIM_CCMR3_OC5FE_Pos) /*!< 0x00000004 */
#define TIM_CCMR3_OC5FE     TIM_CCMR3_OC5FE_Msk            /*!<Output Compare 5 Fast enable */
#define TIM_CCMR3_OC5PE_Pos (3U)
#define TIM_CCMR3_OC5PE_Msk (0x1UL << TIM_CCMR3_OC5PE_Pos) /*!< 0x00000008 */
#define TIM_CCMR3_OC5PE     TIM_CCMR3_OC5PE_Msk            /*!<Output Compare 5 Preload enable */

#define TIM_CCMR3_OC5M_Pos  (4U)
#define TIM_CCMR3_OC5M_Msk  (0x1007UL << TIM_CCMR3_OC5M_Pos) /*!< 0x00010070 */
#define TIM_CCMR3_OC5M      TIM_CCMR3_OC5M_Msk               /*!<OC5M[3:0] bits (Output Compare 5 Mode) */
#define TIM_CCMR3_OC5M_0    (0x1UL << TIM_CCMR3_OC5M_Pos)    /*!< 0x00000010 */
#define TIM_CCMR3_OC5M_1    (0x2UL << TIM_CCMR3_OC5M_Pos)    /*!< 0x00000020 */
#define TIM_CCMR3_OC5M_2    (0x4UL << TIM_CCMR3_OC5M_Pos)    /*!< 0x00000040 */
#define TIM_CCMR3_OC5M_3    (0x1000UL << TIM_CCMR3_OC5M_Pos) /*!< 0x00010000 */

#define TIM_CCMR3_OC5CE_Pos (7U)
#define TIM_CCMR3_OC5CE_Msk (0x1UL << TIM_CCMR3_OC5CE_Pos) /*!< 0x00000080 */
#define TIM_CCMR3_OC5CE     TIM_CCMR3_OC5CE_Msk            /*!<Output Compare 5 Clear Enable */

#define TIM_CCMR3_OC6FE_Pos (10U)
#define TIM_CCMR3_OC6FE_Msk (0x1UL << TIM_CCMR3_OC6FE_Pos) /*!< 0x00000400 */
#define TIM_CCMR3_OC6FE     TIM_CCMR3_OC6FE_Msk            /*!<Output Compare 4 Fast enable */
#define TIM_CCMR3_OC6PE_Pos (11U)
#define TIM_CCMR3_OC6PE_Msk (0x1UL << TIM_CCMR3_OC6PE_Pos) /*!< 0x00000800 */
#define TIM_CCMR3_OC6PE     TIM_CCMR3_OC6PE_Msk            /*!<Output Compare 4 Preload enable */

#define TIM_CCMR3_OC6M_Pos  (12U)
#define TIM_CCMR3_OC6M_Msk  (0x1007UL << TIM_CCMR3_OC6M_Pos) /*!< 0x01007000 */
#define TIM_CCMR3_OC6M      TIM_CCMR3_OC6M_Msk               /*!<OC4M[3:0] bits (Output Compare 4 Mode) */
#define TIM_CCMR3_OC6M_0    (0x1UL << TIM_CCMR3_OC6M_Pos)    /*!< 0x00001000 */
#define TIM_CCMR3_OC6M_1    (0x2UL << TIM_CCMR3_OC6M_Pos)    /*!< 0x00002000 */
#define TIM_CCMR3_OC6M_2    (0x4UL << TIM_CCMR3_OC6M_Pos)    /*!< 0x00004000 */
#define TIM_CCMR3_OC6M_3    (0x1000UL << TIM_CCMR3_OC6M_Pos) /*!< 0x01000000 */

#define TIM_CCMR3_OC6CE_Pos (15U)
#define TIM_CCMR3_OC6CE_Msk (0x1UL << TIM_CCMR3_OC6CE_Pos) /*!< 0x00008000 */
#define TIM_CCMR3_OC6CE     TIM_CCMR3_OC6CE_Msk            /*!<Output Compare 4 Clear Enable */
/*******************  Bit definition for TIM1_AF1 register  *********************/
#define TIM1_AF1_BKINE_Pos     (0U)
#define TIM1_AF1_BKINE_Msk     (0x1UL << TIM1_AF1_BKINE_Pos) /*!< 0x00000001 */
#define TIM1_AF1_BKINE         TIM1_AF1_BKINE_Msk            /*!<BKINE Break input enable bit */
#define TIM1_AF1_BKCMP1E_Pos   (1U)
#define TIM1_AF1_BKCMP1E_Msk   (0x1UL << TIM1_AF1_BKCMP1E_Pos) /*!< 0x00000002 */
#define TIM1_AF1_BKCMP1E       TIM1_AF1_BKCMP1E_Msk            /*!<BKCMP1E Break Compare1 Enable bit */
#define TIM1_AF1_BKCMP2E_Pos   (2U)
#define TIM1_AF1_BKCMP2E_Msk   (0x1UL << TIM1_AF1_BKCMP2E_Pos) /*!< 0x00000004 */
#define TIM1_AF1_BKCMP2E       TIM1_AF1_BKCMP2E_Msk            /*!<BKCMP1E Break Compare2 Enable bit */
#define TIM1_AF1_BKDF1BK0E_Pos (8U)
#define TIM1_AF1_BKDF1BK0E_Msk (0x1UL << TIM1_AF1_BKDF1BK0E_Pos) /*!< 0x00000100 */
#define TIM1_AF1_BKDF1BK0E     TIM1_AF1_BKDF1BK0E_Msk            /*!<BKDF1BK0E Break input DFSDM Break 0 */
#define TIM1_AF1_BKINP_Pos     (9U)
#define TIM1_AF1_BKINP_Msk     (0x1UL << TIM1_AF1_BKINP_Pos) /*!< 0x00000200 */
#define TIM1_AF1_BKINP         TIM1_AF1_BKINP_Msk            /*!<BRKINP Break input polarity */
#define TIM1_AF1_BKCMP1P_Pos   (10U)
#define TIM1_AF1_BKCMP1P_Msk   (0x1UL << TIM1_AF1_BKCMP1P_Pos) /*!< 0x00000400 */
#define TIM1_AF1_BKCMP1P       TIM1_AF1_BKCMP1P_Msk            /*!<BKCMP1P Break COMP1 input polarity */
#define TIM1_AF1_BKCMP2P_Pos   (11U)
#define TIM1_AF1_BKCMP2P_Msk   (0x1UL << TIM1_AF1_BKCMP2P_Pos) /*!< 0x00000800 */
#define TIM1_AF1_BKCMP2P       TIM1_AF1_BKCMP2P_Msk            /*!<BKCMP2P Break COMP2 input polarity */

#define TIM1_AF1_ETRSEL_Pos    (14U)
#define TIM1_AF1_ETRSEL_Msk    (0xFUL << TIM1_AF1_ETRSEL_Pos) /*!< 0x0003C000 */
#define TIM1_AF1_ETRSEL        TIM1_AF1_ETRSEL_Msk            /*!<ETRSEL[3:0] bits (TIM1 ETRSEL) */
#define TIM1_AF1_ETRSEL_0      (0x1UL << TIM1_AF1_ETRSEL_Pos) /*!< 0x00004000 */
#define TIM1_AF1_ETRSEL_1      (0x2UL << TIM1_AF1_ETRSEL_Pos) /*!< 0x00008000 */
#define TIM1_AF1_ETRSEL_2      (0x4UL << TIM1_AF1_ETRSEL_Pos) /*!< 0x00010000 */
#define TIM1_AF1_ETRSEL_3      (0x8UL << TIM1_AF1_ETRSEL_Pos) /*!< 0x00020000 */

/*******************  Bit definition for TIM1_AF2 register  *********************/
#define TIM1_AF2_BK2INE_Pos    (0U)
#define TIM1_AF2_BK2INE_Msk    (0x1UL << TIM1_AF2_BK2INE_Pos) /*!< 0x00000001 */
#define TIM1_AF2_BK2INE        TIM1_AF2_BK2INE_Msk            /*!<BK2INE Break input 2 enable bit */
#define TIM1_AF2_BK2CMP1E_Pos  (1U)
#define TIM1_AF2_BK2CMP1E_Msk  (0x1UL << TIM1_AF2_BK2CMP1E_Pos) /*!< 0x00000002 */
#define TIM1_AF2_BK2CMP1E      TIM1_AF2_BK2CMP1E_Msk            /*!<BK2CMP1E Break2 Compare1 Enable bit */
#define TIM1_AF2_BK2CMP2E_Pos  (2U)
#define TIM1_AF2_BK2CMP2E_Msk  (0x1UL << TIM1_AF2_BK2CMP2E_Pos) /*!< 0x00000004 */
#define TIM1_AF2_BK2CMP2E      TIM1_AF2_BK2CMP2E_Msk            /*!<BK2CMP1E Break2 Compare2 Enable bit  */
#define TIM1_AF2_BK2DFBK1E_Pos (8U)
#define TIM1_AF2_BK2DFBK1E_Msk (0x1UL << TIM1_AF2_BK2DFBK1E_Pos) /*!< 0x00000100 */
#define TIM1_AF2_BK2DFBK1E     TIM1_AF2_BK2DFBK1E_Msk            /*!<BK2DFBK1E Break input2 DFSDM Break 1 */
#define TIM1_AF2_BK2INP_Pos    (9U)
#define TIM1_AF2_BK2INP_Msk    (0x1UL << TIM1_AF2_BK2INP_Pos) /*!< 0x00000200 */
#define TIM1_AF2_BK2INP        TIM1_AF2_BK2INP_Msk            /*!<BRKINP Break2 input polarity */
#define TIM1_AF2_BK2CMP1P_Pos  (10U)
#define TIM1_AF2_BK2CMP1P_Msk  (0x1UL << TIM1_AF2_BK2CMP1P_Pos) /*!< 0x00000400 */
#define TIM1_AF2_BK2CMP1P      TIM1_AF2_BK2CMP1P_Msk            /*!<BKCMP1P Break2 COMP1 input polarity */
#define TIM1_AF2_BK2CMP2P_Pos  (11U)
#define TIM1_AF2_BK2CMP2P_Msk  (0x1UL << TIM1_AF2_BK2CMP2P_Pos) /*!< 0x00000800 */
#define TIM1_AF2_BK2CMP2P      TIM1_AF2_BK2CMP2P_Msk            /*!<BKCMP2P Break2 COMP2 input polarity */

/*******************  Bit definition for TIM_TISEL register  *********************/
#define TIM_TISEL_TI1SEL_Pos (0U)
#define TIM_TISEL_TI1SEL_Msk (0xFUL << TIM_TISEL_TI1SEL_Pos) /*!< 0x0000000F */
#define TIM_TISEL_TI1SEL     TIM_TISEL_TI1SEL_Msk            /*!<TI1SEL[3:0] bits (TIM TI1 SEL)*/
#define TIM_TISEL_TI1SEL_0   (0x1UL << TIM_TISEL_TI1SEL_Pos) /*!< 0x00000001 */
#define TIM_TISEL_TI1SEL_1   (0x2UL << TIM_TISEL_TI1SEL_Pos) /*!< 0x00000002 */
#define TIM_TISEL_TI1SEL_2   (0x4UL << TIM_TISEL_TI1SEL_Pos) /*!< 0x00000004 */
#define TIM_TISEL_TI1SEL_3   (0x8UL << TIM_TISEL_TI1SEL_Pos) /*!< 0x00000008 */

#define TIM_TISEL_TI2SEL_Pos (8U)
#define TIM_TISEL_TI2SEL_Msk (0xFUL << TIM_TISEL_TI2SEL_Pos) /*!< 0x00000F00 */
#define TIM_TISEL_TI2SEL     TIM_TISEL_TI2SEL_Msk            /*!<TI2SEL[3:0] bits (TIM TI2 SEL)*/
#define TIM_TISEL_TI2SEL_0   (0x1UL << TIM_TISEL_TI2SEL_Pos) /*!< 0x00000100 */
#define TIM_TISEL_TI2SEL_1   (0x2UL << TIM_TISEL_TI2SEL_Pos) /*!< 0x00000200 */
#define TIM_TISEL_TI2SEL_2   (0x4UL << TIM_TISEL_TI2SEL_Pos) /*!< 0x00000400 */
#define TIM_TISEL_TI2SEL_3   (0x8UL << TIM_TISEL_TI2SEL_Pos) /*!< 0x00000800 */

#define TIM_TISEL_TI3SEL_Pos (16U)
#define TIM_TISEL_TI3SEL_Msk (0xFUL << TIM_TISEL_TI3SEL_Pos) /*!< 0x000F0000 */
#define TIM_TISEL_TI3SEL     TIM_TISEL_TI3SEL_Msk            /*!<TI3SEL[3:0] bits (TIM TI3 SEL)*/
#define TIM_TISEL_TI3SEL_0   (0x1UL << TIM_TISEL_TI3SEL_Pos) /*!< 0x00010000 */
#define TIM_TISEL_TI3SEL_1   (0x2UL << TIM_TISEL_TI3SEL_Pos) /*!< 0x00020000 */
#define TIM_TISEL_TI3SEL_2   (0x4UL << TIM_TISEL_TI3SEL_Pos) /*!< 0x00040000 */
#define TIM_TISEL_TI3SEL_3   (0x8UL << TIM_TISEL_TI3SEL_Pos) /*!< 0x00080000 */

#define TIM_TISEL_TI4SEL_Pos (24U)
#define TIM_TISEL_TI4SEL_Msk (0xFUL << TIM_TISEL_TI4SEL_Pos) /*!< 0x0F000000 */
#define TIM_TISEL_TI4SEL     TIM_TISEL_TI4SEL_Msk            /*!<TI4SEL[3:0] bits (TIM TI4 SEL)*/
#define TIM_TISEL_TI4SEL_0   (0x1UL << TIM_TISEL_TI4SEL_Pos) /*!< 0x01000000 */
#define TIM_TISEL_TI4SEL_1   (0x2UL << TIM_TISEL_TI4SEL_Pos) /*!< 0x02000000 */
#define TIM_TISEL_TI4SEL_2   (0x4UL << TIM_TISEL_TI4SEL_Pos) /*!< 0x04000000 */
#define TIM_TISEL_TI4SEL_3   (0x8UL << TIM_TISEL_TI4SEL_Pos) /*!< 0x08000000 */

