Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for TIM8_AF1 register  *********************/
#define TIM8_AF1_BKINE_Pos    (0U)
#define TIM8_AF1_BKINE_Msk    (0x1UL << TIM8_AF1_BKINE_Pos) /*!< 0x00000001 */
#define TIM8_AF1_BKINE        TIM8_AF1_BKINE_Msk            /*!<BKINE Break input enable bit */
#define TIM8_AF1_BKCMP1E_Pos  (1U)
#define TIM8_AF1_BKCMP1E_Msk  (0x1UL << TIM8_AF1_BKCMP1E_Pos) /*!< 0x00000002 */
#define TIM8_AF1_BKCMP1E      TIM8_AF1_BKCMP1E_Msk            /*!<BKCMP1E Break Compare1 Enable bit */
#define TIM8_AF1_BKCMP2E_Pos  (2U)
#define TIM8_AF1_BKCMP2E_Msk  (0x1UL << TIM8_AF1_BKCMP2E_Pos) /*!< 0x00000004 */
#define TIM8_AF1_BKCMP2E      TIM8_AF1_BKCMP2E_Msk            /*!<BKCMP1E Break Compare2 Enable bit  */
#define TIM8_AF1_BKDFBK2E_Pos (8U)
#define TIM8_AF1_BKDFBK2E_Msk (0x1UL << TIM8_AF1_BKDFBK2E_Pos) /*!< 0x00000100 */
#define TIM8_AF1_BKDFBK2E     TIM8_AF1_BKDFBK2E_Msk            /*!<BKDFBK2E Break input DFSDM Break 2 */
#define TIM8_AF1_BKINP_Pos    (9U)
#define TIM8_AF1_BKINP_Msk    (0x1UL << TIM8_AF1_BKINP_Pos) /*!< 0x00000200 */
#define TIM8_AF1_BKINP        TIM8_AF1_BKINP_Msk            /*!<BRKINP Break input polarity */
#define TIM8_AF1_BKCMP1P_Pos  (10U)
#define TIM8_AF1_BKCMP1P_Msk  (0x1UL << TIM8_AF1_BKCMP1P_Pos) /*!< 0x00000400 */
#define TIM8_AF1_BKCMP1P      TIM8_AF1_BKCMP1P_Msk            /*!<BKCMP1P Break COMP1 input polarity */
#define TIM8_AF1_BKCMP2P_Pos  (11U)
#define TIM8_AF1_BKCMP2P_Msk  (0x1UL << TIM8_AF1_BKCMP2P_Pos) /*!< 0x00000800 */
#define TIM8_AF1_BKCMP2P      TIM8_AF1_BKCMP2P_Msk            /*!<BKCMP2P Break COMP2 input polarity */

#define TIM8_AF1_ETRSEL_Pos   (14U)
#define TIM8_AF1_ETRSEL_Msk   (0xFUL << TIM8_AF1_ETRSEL_Pos) /*!< 0x0003C000 */
#define TIM8_AF1_ETRSEL       TIM8_AF1_ETRSEL_Msk            /*!<ETRSEL[3:0] bits (TIM8 ETRSEL) */
#define TIM8_AF1_ETRSEL_0     (0x1UL << TIM8_AF1_ETRSEL_Pos) /*!< 0x00004000 */
#define TIM8_AF1_ETRSEL_1     (0x2UL << TIM8_AF1_ETRSEL_Pos) /*!< 0x00008000 */
#define TIM8_AF1_ETRSEL_2     (0x4UL << TIM8_AF1_ETRSEL_Pos) /*!< 0x00010000 */
#define TIM8_AF1_ETRSEL_3     (0x8UL << TIM8_AF1_ETRSEL_Pos) /*!< 0x00020000 */
/*******************  Bit definition for TIM8_AF2 register  *********************/
#define TIM8_AF2_BK2INE_Pos    (0U)
#define TIM8_AF2_BK2INE_Msk    (0x1UL << TIM8_AF2_BK2INE_Pos) /*!< 0x00000001 */
#define TIM8_AF2_BK2INE        TIM8_AF2_BK2INE_Msk            /*!<BK2INE Break input 2 enable bit */
#define TIM8_AF2_BK2CMP1E_Pos  (1U)
#define TIM8_AF2_BK2CMP1E_Msk  (0x1UL << TIM8_AF2_BK2CMP1E_Pos) /*!< 0x00000002 */
#define TIM8_AF2_BK2CMP1E      TIM8_AF2_BK2CMP1E_Msk            /*!<BK2CMP1E Break2 Compare1 Enable bit */
#define TIM8_AF2_BK2CMP2E_Pos  (2U)
#define TIM8_AF2_BK2CMP2E_Msk  (0x1UL << TIM8_AF2_BK2CMP2E_Pos) /*!< 0x00000004 */
#define TIM8_AF2_BK2CMP2E      TIM8_AF2_BK2CMP2E_Msk            /*!<BK2CMP1E Break2 Compare2 Enable bit  */
#define TIM8_AF2_BK2DFBK3E_Pos (8U)
#define TIM8_AF2_BK2DFBK3E_Msk (0x1UL << TIM8_AF2_BK2DFBK3E_Pos) /*!< 0x00000100 */
#define TIM8_AF2_BK2DFBK3E     TIM8_AF2_BK2DFBK3E_Msk            /*!<BK2DFBK1E Break input2 DFSDM Break 3 */
#define TIM8_AF2_BK2INP_Pos    (9U)
#define TIM8_AF2_BK2INP_Msk    (0x1UL << TIM8_AF2_BK2INP_Pos) /*!< 0x00000200 */
#define TIM8_AF2_BK2INP        TIM8_AF2_BK2INP_Msk            /*!<BRKINP Break2 input polarity */
#define TIM8_AF2_BK2CMP1P_Pos  (10U)
#define TIM8_AF2_BK2CMP1P_Msk  (0x1UL << TIM8_AF2_BK2CMP1P_Pos) /*!< 0x00000400 */
#define TIM8_AF2_BK2CMP1P      TIM8_AF2_BK2CMP1P_Msk            /*!<BKCMP1P Break2 COMP1 input polarity */
#define TIM8_AF2_BK2CMP2P_Pos  (11U)
#define TIM8_AF2_BK2CMP2P_Msk  (0x1UL << TIM8_AF2_BK2CMP2P_Pos) /*!< 0x00000800 */
#define TIM8_AF2_BK2CMP2P      TIM8_AF2_BK2CMP2P_Msk            /*!<BKCMP2P Break2 COMP2 input polarity */

/*******************  Bit definition for TIM2_AF1 register  *********************/
#define TIM2_AF1_ETRSEL_Pos (14U)
#define TIM2_AF1_ETRSEL_Msk (0xFUL << TIM2_AF1_ETRSEL_Pos) /*!< 0x0003C000 */
#define TIM2_AF1_ETRSEL     TIM2_AF1_ETRSEL_Msk            /*!<ETRSEL[3:0] bits (TIM2 ETRSEL) */
#define TIM2_AF1_ETRSEL_0   (0x1UL << TIM2_AF1_ETRSEL_Pos) /*!< 0x00004000 */
#define TIM2_AF1_ETRSEL_1   (0x2UL << TIM2_AF1_ETRSEL_Pos) /*!< 0x00008000 */
#define TIM2_AF1_ETRSEL_2   (0x4UL << TIM2_AF1_ETRSEL_Pos) /*!< 0x00010000 */
#define TIM2_AF1_ETRSEL_3   (0x8UL << TIM2_AF1_ETRSEL_Pos) /*!< 0x00020000 */

/*******************  Bit definition for TIM3_AF1 register  *********************/
#define TIM3_AF1_ETRSEL_Pos (14U)
#define TIM3_AF1_ETRSEL_Msk (0xFUL << TIM3_AF1_ETRSEL_Pos) /*!< 0x0003C000 */
#define TIM3_AF1_ETRSEL     TIM3_AF1_ETRSEL_Msk            /*!<ETRSEL[3:0] bits (TIM3 ETRSEL) */
#define TIM3_AF1_ETRSEL_0   (0x1UL << TIM3_AF1_ETRSEL_Pos) /*!< 0x00004000 */
#define TIM3_AF1_ETRSEL_1   (0x2UL << TIM3_AF1_ETRSEL_Pos) /*!< 0x00008000 */
#define TIM3_AF1_ETRSEL_2   (0x4UL << TIM3_AF1_ETRSEL_Pos) /*!< 0x00010000 */
#define TIM3_AF1_ETRSEL_3   (0x8UL << TIM3_AF1_ETRSEL_Pos) /*!< 0x00020000 */

/*******************  Bit definition for TIM5_AF1 register  *********************/
#define TIM5_AF1_ETRSEL_Pos (14U)
#define TIM5_AF1_ETRSEL_Msk (0xFUL << TIM5_AF1_ETRSEL_Pos) /*!< 0x0003C000 */
#define TIM5_AF1_ETRSEL     TIM5_AF1_ETRSEL_Msk            /*!<ETRSEL[3:0] bits (TIM5 ETRSEL) */
#define TIM5_AF1_ETRSEL_0   (0x1UL << TIM5_AF1_ETRSEL_Pos) /*!< 0x00004000 */
#define TIM5_AF1_ETRSEL_1   (0x2UL << TIM5_AF1_ETRSEL_Pos) /*!< 0x00008000 */
#define TIM5_AF1_ETRSEL_2   (0x4UL << TIM5_AF1_ETRSEL_Pos) /*!< 0x00010000 */
#define TIM5_AF1_ETRSEL_3   (0x8UL << TIM5_AF1_ETRSEL_Pos) /*!< 0x00020000 */

/*******************  Bit definition for TIM15_AF1 register  *********************/
#define TIM15_AF1_BKINE_Pos     (0U)
#define TIM15_AF1_BKINE_Msk     (0x1UL << TIM15_AF1_BKINE_Pos) /*!< 0x00000001 */
#define TIM15_AF1_BKINE         TIM15_AF1_BKINE_Msk            /*!<BKINE Break input enable bit */
#define TIM15_AF1_BKCMP1E_Pos   (1U)
#define TIM15_AF1_BKCMP1E_Msk   (0x1UL << TIM15_AF1_BKCMP1E_Pos) /*!< 0x00000002 */
#define TIM15_AF1_BKCMP1E       TIM15_AF1_BKCMP1E_Msk            /*!<BKCMP1E Break Compare1 Enable bit */
#define TIM15_AF1_BKCMP2E_Pos   (2U)
#define TIM15_AF1_BKCMP2E_Msk   (0x1UL << TIM15_AF1_BKCMP2E_Pos) /*!< 0x00000004 */
#define TIM15_AF1_BKCMP2E       TIM15_AF1_BKCMP2E_Msk            /*!<BKCMP1E Break Compare2 Enable bit  */
#define TIM15_AF1_BKDF1BK2E_Pos (8U)
#define TIM15_AF1_BKDF1BK2E_Msk (0x1UL << TIM15_AF1_BKDF1BK2E_Pos) /*!< 0x00000100 */
#define TIM15_AF1_BKDF1BK2E     TIM15_AF1_BKDF1BK2E_Msk            /*!<BRK dfsdm1_break[0] enable */
#define TIM15_AF1_BKINP_Pos     (9U)
#define TIM15_AF1_BKINP_Msk     (0x1UL << TIM15_AF1_BKINP_Pos) /*!< 0x00000200 */
#define TIM15_AF1_BKINP         TIM15_AF1_BKINP_Msk            /*!<BRKINP Break input polarity */
#define TIM15_AF1_BKCMP1P_Pos   (10U)
#define TIM15_AF1_BKCMP1P_Msk   (0x1UL << TIM15_AF1_BKCMP1P_Pos) /*!< 0x00000400 */
#define TIM15_AF1_BKCMP1P       TIM15_AF1_BKCMP1P_Msk            /*!<BKCMP1P Break COMP1 input polarity */
#define TIM15_AF1_BKCMP2P_Pos   (11U)
#define TIM15_AF1_BKCMP2P_Msk   (0x1UL << TIM15_AF1_BKCMP2P_Pos) /*!< 0x00000800 */
#define TIM15_AF1_BKCMP2P       TIM15_AF1_BKCMP2P_Msk            /*!<BKCMP2P Break COMP2 input polarity */

/*******************  Bit definition for TIM16_ register  *********************/
#define TIM16_AF1_BKINE_Pos     (0U)
#define TIM16_AF1_BKINE_Msk     (0x1UL << TIM16_AF1_BKINE_Pos) /*!< 0x00000001 */
#define TIM16_AF1_BKINE         TIM16_AF1_BKINE_Msk            /*!<BKINE Break input enable bit */
#define TIM16_AF1_BKCMP1E_Pos   (1U)
#define TIM16_AF1_BKCMP1E_Msk   (0x1UL << TIM16_AF1_BKCMP1E_Pos) /*!< 0x00000002 */
#define TIM16_AF1_BKCMP1E       TIM16_AF1_BKCMP1E_Msk            /*!<BKCMP1E Break Compare1 Enable bit */
#define TIM16_AF1_BKCMP2E_Pos   (2U)
#define TIM16_AF1_BKCMP2E_Msk   (0x1UL << TIM16_AF1_BKCMP2E_Pos) /*!< 0x00000004 */
#define TIM16_AF1_BKCMP2E       TIM16_AF1_BKCMP2E_Msk            /*!<BKCMP1E Break Compare2 Enable bit  */
#define TIM16_AF1_BKDF1BK2E_Pos (8U)
#define TIM16_AF1_BKDF1BK2E_Msk (0x1UL << TIM16_AF1_BKDF1BK2E_Pos) /*!< 0x00000100 */
#define TIM16_AF1_BKDF1BK2E     TIM16_AF1_BKDF1BK2E_Msk            /*!<BRK dfsdm1_break[1] enable */
#define TIM16_AF1_BKINP_Pos     (9U)
#define TIM16_AF1_BKINP_Msk     (0x1UL << TIM16_AF1_BKINP_Pos) /*!< 0x00000200 */
#define TIM16_AF1_BKINP         TIM16_AF1_BKINP_Msk            /*!<BRKINP Break input polarity */
#define TIM16_AF1_BKCMP1P_Pos   (10U)
#define TIM16_AF1_BKCMP1P_Msk   (0x1UL << TIM16_AF1_BKCMP1P_Pos) /*!< 0x00000400 */
#define TIM16_AF1_BKCMP1P       TIM16_AF1_BKCMP1P_Msk            /*!<BKCMP1P Break COMP1 input polarity */
#define TIM16_AF1_BKCMP2P_Pos   (11U)
#define TIM16_AF1_BKCMP2P_Msk   (0x1UL << TIM16_AF1_BKCMP2P_Pos) /*!< 0x00000800 */
#define TIM16_AF1_BKCMP2P       TIM16_AF1_BKCMP2P_Msk            /*!<BKCMP2P Break COMP2 input polarity */

/*******************  Bit definition for TIM17_AF1 register  *********************/
#define TIM17_AF1_BKINE_Pos     (0U)
#define TIM17_AF1_BKINE_Msk     (0x1UL << TIM17_AF1_BKINE_Pos) /*!< 0x00000001 */
#define TIM17_AF1_BKINE         TIM17_AF1_BKINE_Msk            /*!<BKINE Break input enable bit */
#define TIM17_AF1_BKCMP1E_Pos   (1U)
#define TIM17_AF1_BKCMP1E_Msk   (0x1UL << TIM17_AF1_BKCMP1E_Pos) /*!< 0x00000002 */
#define TIM17_AF1_BKCMP1E       TIM17_AF1_BKCMP1E_Msk            /*!<BKCMP1E Break Compare1 Enable bit */
#define TIM17_AF1_BKCMP2E_Pos   (2U)
#define TIM17_AF1_BKCMP2E_Msk   (0x1UL << TIM17_AF1_BKCMP2E_Pos) /*!< 0x00000004 */
#define TIM17_AF1_BKCMP2E       TIM17_AF1_BKCMP2E_Msk            /*!<BKCMP1E Break Compare2 Enable bit  */
#define TIM17_AF1_BKDF1BK2E_Pos (8U)
#define TIM17_AF1_BKDF1BK2E_Msk (0x1UL << TIM17_AF1_BKDF1BK2E_Pos) /*!< 0x00000100 */
#define TIM17_AF1_BKDF1BK2E     TIM17_AF1_BKDF1BK2E_Msk            /*!<BRK dfsdm1_break[2] enable */
#define TIM17_AF1_BKINP_Pos     (9U)
#define TIM17_AF1_BKINP_Msk     (0x1UL << TIM17_AF1_BKINP_Pos) /*!< 0x00000200 */
#define TIM17_AF1_BKINP         TIM17_AF1_BKINP_Msk            /*!<BRKINP Break input polarity */
#define TIM17_AF1_BKCMP1P_Pos   (10U)
#define TIM17_AF1_BKCMP1P_Msk   (0x1UL << TIM17_AF1_BKCMP1P_Pos) /*!< 0x00000400 */
#define TIM17_AF1_BKCMP1P       TIM17_AF1_BKCMP1P_Msk            /*!<BKCMP1P Break COMP1 input polarity */
#define TIM17_AF1_BKCMP2P_Pos   (11U)
#define TIM17_AF1_BKCMP2P_Msk   (0x1UL << TIM17_AF1_BKCMP2P_Pos) /*!< 0x00000800 */
#define TIM17_AF1_BKCMP2P       TIM17_AF1_BKCMP2P_Msk            /*!<BKCMP2P Break COMP2 input polarity */

/******************************************************************************/
/*                                                                            */
/*                         Low Power Timer (LPTTIM)                           */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for LPTIM_ISR register  *******************/
#define LPTIM_ISR_CMPM_Pos    (0U)
#define LPTIM_ISR_CMPM_Msk    (0x1UL << LPTIM_ISR_CMPM_Pos) /*!< 0x00000001 */
#define LPTIM_ISR_CMPM        LPTIM_ISR_CMPM_Msk            /*!< Compare match */
#define LPTIM_ISR_ARRM_Pos    (1U)
#define LPTIM_ISR_ARRM_Msk    (0x1UL << LPTIM_ISR_ARRM_Pos) /*!< 0x00000002 */
#define LPTIM_ISR_ARRM        LPTIM_ISR_ARRM_Msk            /*!< Autoreload match */
#define LPTIM_ISR_EXTTRIG_Pos (2U)
#define LPTIM_ISR_EXTTRIG_Msk (0x1UL << LPTIM_ISR_EXTTRIG_Pos) /*!< 0x00000004 */
#define LPTIM_ISR_EXTTRIG     LPTIM_ISR_EXTTRIG_Msk            /*!< External trigger edge event */
#define LPTIM_ISR_CMPOK_Pos   (3U)
#define LPTIM_ISR_CMPOK_Msk   (0x1UL << LPTIM_ISR_CMPOK_Pos) /*!< 0x00000008 */
#define LPTIM_ISR_CMPOK       LPTIM_ISR_CMPOK_Msk            /*!< Compare register update OK */
#define LPTIM_ISR_ARROK_Pos   (4U)
#define LPTIM_ISR_ARROK_Msk   (0x1UL << LPTIM_ISR_ARROK_Pos) /*!< 0x00000010 */
#define LPTIM_ISR_ARROK       LPTIM_ISR_ARROK_Msk            /*!< Autoreload register update OK */
#define LPTIM_ISR_UP_Pos      (5U)
#define LPTIM_ISR_UP_Msk      (0x1UL << LPTIM_ISR_UP_Pos) /*!< 0x00000020 */
#define LPTIM_ISR_UP          LPTIM_ISR_UP_Msk            /*!< Counter direction change down to up */
#define LPTIM_ISR_DOWN_Pos    (6U)
#define LPTIM_ISR_DOWN_Msk    (0x1UL << LPTIM_ISR_DOWN_Pos) /*!< 0x00000040 */
#define LPTIM_ISR_DOWN        LPTIM_ISR_DOWN_Msk            /*!< Counter direction change up to down */

/******************  Bit definition for LPTIM_ICR register  *******************/
#define LPTIM_ICR_CMPMCF_Pos    (0U)
#define LPTIM_ICR_CMPMCF_Msk    (0x1UL << LPTIM_ICR_CMPMCF_Pos) /*!< 0x00000001 */
#define LPTIM_ICR_CMPMCF        LPTIM_ICR_CMPMCF_Msk            /*!< Compare match Clear Flag */
#define LPTIM_ICR_ARRMCF_Pos    (1U)
#define LPTIM_ICR_ARRMCF_Msk    (0x1UL << LPTIM_ICR_ARRMCF_Pos) /*!< 0x00000002 */
#define LPTIM_ICR_ARRMCF        LPTIM_ICR_ARRMCF_Msk            /*!< Autoreload match Clear Flag */
#define LPTIM_ICR_EXTTRIGCF_Pos (2U)
#define LPTIM_ICR_EXTTRIGCF_Msk (0x1UL << LPTIM_ICR_EXTTRIGCF_Pos) /*!< 0x00000004 */
#define LPTIM_ICR_EXTTRIGCF     LPTIM_ICR_EXTTRIGCF_Msk            /*!< External trigger edge event Clear Flag */
#define LPTIM_ICR_CMPOKCF_Pos   (3U)
#define LPTIM_ICR_CMPOKCF_Msk   (0x1UL << LPTIM_ICR_CMPOKCF_Pos) /*!< 0x00000008 */
#define LPTIM_ICR_CMPOKCF       LPTIM_ICR_CMPOKCF_Msk            /*!< Compare register update OK Clear Flag */
#define LPTIM_ICR_ARROKCF_Pos   (4U)
#define LPTIM_ICR_ARROKCF_Msk   (0x1UL << LPTIM_ICR_ARROKCF_Pos) /*!< 0x00000010 */
#define LPTIM_ICR_ARROKCF       LPTIM_ICR_ARROKCF_Msk            /*!< Autoreload register update OK Clear Flag */
#define LPTIM_ICR_UPCF_Pos      (5U)
#define LPTIM_ICR_UPCF_Msk      (0x1UL << LPTIM_ICR_UPCF_Pos) /*!< 0x00000020 */
#define LPTIM_ICR_UPCF          LPTIM_ICR_UPCF_Msk            /*!< Counter direction change down to up Clear Flag */
#define LPTIM_ICR_DOWNCF_Pos    (6U)
#define LPTIM_ICR_DOWNCF_Msk    (0x1UL << LPTIM_ICR_DOWNCF_Pos) /*!< 0x00000040 */
#define LPTIM_ICR_DOWNCF        LPTIM_ICR_DOWNCF_Msk            /*!< Counter direction change up to down Clear Flag */

/******************  Bit definition for LPTIM_IER register ********************/
#define LPTIM_IER_CMPMIE_Pos    (0U)
#define LPTIM_IER_CMPMIE_Msk    (0x1UL << LPTIM_IER_CMPMIE_Pos) /*!< 0x00000001 */
#define LPTIM_IER_CMPMIE        LPTIM_IER_CMPMIE_Msk            /*!< Compare match Interrupt Enable */
#define LPTIM_IER_ARRMIE_Pos    (1U)
#define LPTIM_IER_ARRMIE_Msk    (0x1UL << LPTIM_IER_ARRMIE_Pos) /*!< 0x00000002 */
#define LPTIM_IER_ARRMIE        LPTIM_IER_ARRMIE_Msk            /*!< Autoreload match Interrupt Enable */
#define LPTIM_IER_EXTTRIGIE_Pos (2U)
#define LPTIM_IER_EXTTRIGIE_Msk (0x1UL << LPTIM_IER_EXTTRIGIE_Pos) /*!< 0x00000004 */
#define LPTIM_IER_EXTTRIGIE     LPTIM_IER_EXTTRIGIE_Msk            /*!< External trigger edge event Interrupt Enable */
#define LPTIM_IER_CMPOKIE_Pos   (3U)
#define LPTIM_IER_CMPOKIE_Msk   (0x1UL << LPTIM_IER_CMPOKIE_Pos) /*!< 0x00000008 */
#define LPTIM_IER_CMPOKIE       LPTIM_IER_CMPOKIE_Msk            /*!< Compare register update OK Interrupt Enable */
#define LPTIM_IER_ARROKIE_Pos   (4U)
#define LPTIM_IER_ARROKIE_Msk   (0x1UL << LPTIM_IER_ARROKIE_Pos) /*!< 0x00000010 */
#define LPTIM_IER_ARROKIE       LPTIM_IER_ARROKIE_Msk            /*!< Autoreload register update OK Interrupt Enable */
#define LPTIM_IER_UPIE_Pos      (5U)
#define LPTIM_IER_UPIE_Msk      (0x1UL << LPTIM_IER_UPIE_Pos) /*!< 0x00000020 */
#define LPTIM_IER_UPIE          LPTIM_IER_UPIE_Msk /*!< Counter direction change down to up Interrupt Enable */
#define LPTIM_IER_DOWNIE_Pos    (6U)
#define LPTIM_IER_DOWNIE_Msk    (0x1UL << LPTIM_IER_DOWNIE_Pos) /*!< 0x00000040 */
#define LPTIM_IER_DOWNIE        LPTIM_IER_DOWNIE_Msk /*!< Counter direction change up to down Interrupt Enable */

