Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/******************  Bit definition for LPTIM_CFGR register *******************/
#define LPTIM_CFGR_CKSEL_Pos     (0U)
#define LPTIM_CFGR_CKSEL_Msk     (0x1UL << LPTIM_CFGR_CKSEL_Pos) /*!< 0x00000001 */
#define LPTIM_CFGR_CKSEL         LPTIM_CFGR_CKSEL_Msk            /*!< Clock selector */

#define LPTIM_CFGR_CKPOL_Pos     (1U)
#define LPTIM_CFGR_CKPOL_Msk     (0x3UL << LPTIM_CFGR_CKPOL_Pos) /*!< 0x00000006 */
#define LPTIM_CFGR_CKPOL         LPTIM_CFGR_CKPOL_Msk            /*!< CKPOL[1:0] bits (Clock polarity) */
#define LPTIM_CFGR_CKPOL_0       (0x1UL << LPTIM_CFGR_CKPOL_Pos) /*!< 0x00000002 */
#define LPTIM_CFGR_CKPOL_1       (0x2UL << LPTIM_CFGR_CKPOL_Pos) /*!< 0x00000004 */

#define LPTIM_CFGR_CKFLT_Pos     (3U)
#define LPTIM_CFGR_CKFLT_Msk     (0x3UL << LPTIM_CFGR_CKFLT_Pos) /*!< 0x00000018 */
#define LPTIM_CFGR_CKFLT         LPTIM_CFGR_CKFLT_Msk /*!< CKFLT[1:0] bits (Configurable digital filter for external clock) */
#define LPTIM_CFGR_CKFLT_0       (0x1UL << LPTIM_CFGR_CKFLT_Pos) /*!< 0x00000008 */
#define LPTIM_CFGR_CKFLT_1       (0x2UL << LPTIM_CFGR_CKFLT_Pos) /*!< 0x00000010 */

#define LPTIM_CFGR_TRGFLT_Pos    (6U)
#define LPTIM_CFGR_TRGFLT_Msk    (0x3UL << LPTIM_CFGR_TRGFLT_Pos) /*!< 0x000000C0 */
#define LPTIM_CFGR_TRGFLT        LPTIM_CFGR_TRGFLT_Msk /*!< TRGFLT[1:0] bits (Configurable digital filter for trigger) */
#define LPTIM_CFGR_TRGFLT_0      (0x1UL << LPTIM_CFGR_TRGFLT_Pos) /*!< 0x00000040 */
#define LPTIM_CFGR_TRGFLT_1      (0x2UL << LPTIM_CFGR_TRGFLT_Pos) /*!< 0x00000080 */

#define LPTIM_CFGR_PRESC_Pos     (9U)
#define LPTIM_CFGR_PRESC_Msk     (0x7UL << LPTIM_CFGR_PRESC_Pos) /*!< 0x00000E00 */
#define LPTIM_CFGR_PRESC         LPTIM_CFGR_PRESC_Msk            /*!< PRESC[2:0] bits (Clock prescaler) */
#define LPTIM_CFGR_PRESC_0       (0x1UL << LPTIM_CFGR_PRESC_Pos) /*!< 0x00000200 */
#define LPTIM_CFGR_PRESC_1       (0x2UL << LPTIM_CFGR_PRESC_Pos) /*!< 0x00000400 */
#define LPTIM_CFGR_PRESC_2       (0x4UL << LPTIM_CFGR_PRESC_Pos) /*!< 0x00000800 */

#define LPTIM_CFGR_TRIGSEL_Pos   (13U)
#define LPTIM_CFGR_TRIGSEL_Msk   (0x7UL << LPTIM_CFGR_TRIGSEL_Pos) /*!< 0x0000E000 */
#define LPTIM_CFGR_TRIGSEL       LPTIM_CFGR_TRIGSEL_Msk            /*!< TRIGSEL[2:0]] bits (Trigger selector) */
#define LPTIM_CFGR_TRIGSEL_0     (0x1UL << LPTIM_CFGR_TRIGSEL_Pos) /*!< 0x00002000 */
#define LPTIM_CFGR_TRIGSEL_1     (0x2UL << LPTIM_CFGR_TRIGSEL_Pos) /*!< 0x00004000 */
#define LPTIM_CFGR_TRIGSEL_2     (0x4UL << LPTIM_CFGR_TRIGSEL_Pos) /*!< 0x00008000 */

#define LPTIM_CFGR_TRIGEN_Pos    (17U)
#define LPTIM_CFGR_TRIGEN_Msk    (0x3UL << LPTIM_CFGR_TRIGEN_Pos) /*!< 0x00060000 */
#define LPTIM_CFGR_TRIGEN        LPTIM_CFGR_TRIGEN_Msk            /*!< TRIGEN[1:0] bits (Trigger enable and polarity) */
#define LPTIM_CFGR_TRIGEN_0      (0x1UL << LPTIM_CFGR_TRIGEN_Pos) /*!< 0x00020000 */
#define LPTIM_CFGR_TRIGEN_1      (0x2UL << LPTIM_CFGR_TRIGEN_Pos) /*!< 0x00040000 */

#define LPTIM_CFGR_TIMOUT_Pos    (19U)
#define LPTIM_CFGR_TIMOUT_Msk    (0x1UL << LPTIM_CFGR_TIMOUT_Pos) /*!< 0x00080000 */
#define LPTIM_CFGR_TIMOUT        LPTIM_CFGR_TIMOUT_Msk            /*!< Timout enable */
#define LPTIM_CFGR_WAVE_Pos      (20U)
#define LPTIM_CFGR_WAVE_Msk      (0x1UL << LPTIM_CFGR_WAVE_Pos) /*!< 0x00100000 */
#define LPTIM_CFGR_WAVE          LPTIM_CFGR_WAVE_Msk            /*!< Waveform shape */
#define LPTIM_CFGR_WAVPOL_Pos    (21U)
#define LPTIM_CFGR_WAVPOL_Msk    (0x1UL << LPTIM_CFGR_WAVPOL_Pos) /*!< 0x00200000 */
#define LPTIM_CFGR_WAVPOL        LPTIM_CFGR_WAVPOL_Msk            /*!< Waveform shape polarity */
#define LPTIM_CFGR_PRELOAD_Pos   (22U)
#define LPTIM_CFGR_PRELOAD_Msk   (0x1UL << LPTIM_CFGR_PRELOAD_Pos) /*!< 0x00400000 */
#define LPTIM_CFGR_PRELOAD       LPTIM_CFGR_PRELOAD_Msk            /*!< Reg update mode */
#define LPTIM_CFGR_COUNTMODE_Pos (23U)
#define LPTIM_CFGR_COUNTMODE_Msk (0x1UL << LPTIM_CFGR_COUNTMODE_Pos) /*!< 0x00800000 */
#define LPTIM_CFGR_COUNTMODE     LPTIM_CFGR_COUNTMODE_Msk            /*!< Counter mode enable */
#define LPTIM_CFGR_ENC_Pos       (24U)
#define LPTIM_CFGR_ENC_Msk       (0x1UL << LPTIM_CFGR_ENC_Pos) /*!< 0x01000000 */
#define LPTIM_CFGR_ENC           LPTIM_CFGR_ENC_Msk            /*!< Encoder mode enable */

/******************  Bit definition for LPTIM_CR register  ********************/
#define LPTIM_CR_ENABLE_Pos   (0U)
#define LPTIM_CR_ENABLE_Msk   (0x1UL << LPTIM_CR_ENABLE_Pos) /*!< 0x00000001 */
#define LPTIM_CR_ENABLE       LPTIM_CR_ENABLE_Msk            /*!< LPTIMer enable */
#define LPTIM_CR_SNGSTRT_Pos  (1U)
#define LPTIM_CR_SNGSTRT_Msk  (0x40001UL << LPTIM_CR_SNGSTRT_Pos) /*!< 0x00080002 */
#define LPTIM_CR_SNGSTRT      LPTIM_CR_SNGSTRT_Msk                /*!< Timer start in single mode */
#define LPTIM_CR_CNTSTRT_Pos  (2U)
#define LPTIM_CR_CNTSTRT_Msk  (0x1UL << LPTIM_CR_CNTSTRT_Pos) /*!< 0x00000004 */
#define LPTIM_CR_CNTSTRT      LPTIM_CR_CNTSTRT_Msk            /*!< Timer start in continuous mode */
#define LPTIM_CR_COUNTRST_Pos (3U)
#define LPTIM_CR_COUNTRST_Msk (0x1UL << LPTIM_CR_COUNTRST_Pos) /*!< 0x00000008 */
#define LPTIM_CR_COUNTRST     LPTIM_CR_COUNTRST_Msk            /*!< Timer Counter reset in synchronous mode*/
#define LPTIM_CR_RSTARE_Pos   (4U)
#define LPTIM_CR_RSTARE_Msk   (0x1UL << LPTIM_CR_RSTARE_Pos) /*!< 0x00000010 */
#define LPTIM_CR_RSTARE       LPTIM_CR_RSTARE_Msk /*!< Timer Counter reset after read enable (asynchronously)*/

/******************  Bit definition for LPTIM_CMP register  *******************/
#define LPTIM_CMP_CMP_Pos (0U)
#define LPTIM_CMP_CMP_Msk (0xFFFFUL << LPTIM_CMP_CMP_Pos) /*!< 0x0000FFFF */
#define LPTIM_CMP_CMP     LPTIM_CMP_CMP_Msk               /*!< Compare register */

/******************  Bit definition for LPTIM_ARR register  *******************/
#define LPTIM_ARR_ARR_Pos (0U)
#define LPTIM_ARR_ARR_Msk (0xFFFFUL << LPTIM_ARR_ARR_Pos) /*!< 0x0000FFFF */
#define LPTIM_ARR_ARR     LPTIM_ARR_ARR_Msk               /*!< Auto reload register */

/******************  Bit definition for LPTIM_CNT register  *******************/
#define LPTIM_CNT_CNT_Pos (0U)
#define LPTIM_CNT_CNT_Msk (0xFFFFUL << LPTIM_CNT_CNT_Pos) /*!< 0x0000FFFF */
#define LPTIM_CNT_CNT     LPTIM_CNT_CNT_Msk               /*!< Counter register */

