Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/******************  Bit definition for LPTIM_CFGR2 register  *****************/
#define LPTIM_CFGR2_IN1SEL_Pos (0U)
#define LPTIM_CFGR2_IN1SEL_Msk (0x3UL << LPTIM_CFGR2_IN1SEL_Pos) /*!< 0x00000003 */
#define LPTIM_CFGR2_IN1SEL     LPTIM_CFGR2_IN1SEL_Msk            /*!< IN1SEL[1:0] bits (Remap selection) */
#define LPTIM_CFGR2_IN1SEL_0   (0x1UL << LPTIM_CFGR2_IN1SEL_Pos) /*!< 0x00000001 */
#define LPTIM_CFGR2_IN1SEL_1   (0x2UL << LPTIM_CFGR2_IN1SEL_Pos) /*!< 0x00000002 */
#define LPTIM_CFGR2_IN2SEL_Pos (4U)
#define LPTIM_CFGR2_IN2SEL_Msk (0x3UL << LPTIM_CFGR2_IN2SEL_Pos) /*!< 0x00000030 */
#define LPTIM_CFGR2_IN2SEL     LPTIM_CFGR2_IN2SEL_Msk            /*!< IN2SEL[5:4] bits (Remap selection) */
#define LPTIM_CFGR2_IN2SEL_0   (0x1UL << LPTIM_CFGR2_IN2SEL_Pos) /*!< 0x00000010 */
#define LPTIM_CFGR2_IN2SEL_1   (0x2UL << LPTIM_CFGR2_IN2SEL_Pos) /*!< 0x00000020 */

/******************************************************************************/
/*                                                                            */
/*                                    OCTOSPI                                 */
/*                                                                            */
/******************************************************************************/
/*****************  Bit definition for OCTOSPI_CR register  *******************/
#define OCTOSPI_CR_EN_Pos     (0U)
#define OCTOSPI_CR_EN_Msk     (0x1UL << OCTOSPI_CR_EN_Pos) /*!< 0x00000001 */
#define OCTOSPI_CR_EN         OCTOSPI_CR_EN_Msk            /*!< Enable */
#define OCTOSPI_CR_ABORT_Pos  (1U)
#define OCTOSPI_CR_ABORT_Msk  (0x1UL << OCTOSPI_CR_ABORT_Pos) /*!< 0x00000002 */
#define OCTOSPI_CR_ABORT      OCTOSPI_CR_ABORT_Msk            /*!< Abort request */
#define OCTOSPI_CR_DMAEN_Pos  (2U)
#define OCTOSPI_CR_DMAEN_Msk  (0x1UL << OCTOSPI_CR_DMAEN_Pos) /*!< 0x00000004 */
#define OCTOSPI_CR_DMAEN      OCTOSPI_CR_DMAEN_Msk            /*!< DMA Enable */
#define OCTOSPI_CR_TCEN_Pos   (3U)
#define OCTOSPI_CR_TCEN_Msk   (0x1UL << OCTOSPI_CR_TCEN_Pos) /*!< 0x00000008 */
#define OCTOSPI_CR_TCEN       OCTOSPI_CR_TCEN_Msk            /*!< Timeout Counter Enable */
#define OCTOSPI_CR_DQM_Pos    (6U)
#define OCTOSPI_CR_DQM_Msk    (0x1UL << OCTOSPI_CR_DQM_Pos) /*!< 0x00000040 */
#define OCTOSPI_CR_DQM        OCTOSPI_CR_DQM_Msk            /*!< Dual-Quad Mode */
#define OCTOSPI_CR_FSEL_Pos   (7U)
#define OCTOSPI_CR_FSEL_Msk   (0x1UL << OCTOSPI_CR_FSEL_Pos) /*!< 0x00000080 */
#define OCTOSPI_CR_FSEL       OCTOSPI_CR_FSEL_Msk            /*!< Flash Select */
#define OCTOSPI_CR_FTHRES_Pos (8U)
#define OCTOSPI_CR_FTHRES_Msk (0x1FUL << OCTOSPI_CR_FTHRES_Pos) /*!< 0x00001F00 */
#define OCTOSPI_CR_FTHRES     OCTOSPI_CR_FTHRES_Msk             /*!< FIFO Threshold Level */
#define OCTOSPI_CR_TEIE_Pos   (16U)
#define OCTOSPI_CR_TEIE_Msk   (0x1UL << OCTOSPI_CR_TEIE_Pos) /*!< 0x00010000 */
#define OCTOSPI_CR_TEIE       OCTOSPI_CR_TEIE_Msk            /*!< Transfer Error Interrupt Enable */
#define OCTOSPI_CR_TCIE_Pos   (17U)
#define OCTOSPI_CR_TCIE_Msk   (0x1UL << OCTOSPI_CR_TCIE_Pos) /*!< 0x00020000 */
#define OCTOSPI_CR_TCIE       OCTOSPI_CR_TCIE_Msk            /*!< Transfer Complete Interrupt Enable */
#define OCTOSPI_CR_FTIE_Pos   (18U)
#define OCTOSPI_CR_FTIE_Msk   (0x1UL << OCTOSPI_CR_FTIE_Pos) /*!< 0x00040000 */
#define OCTOSPI_CR_FTIE       OCTOSPI_CR_FTIE_Msk            /*!< FIFO Threshold Interrupt Enable */
#define OCTOSPI_CR_SMIE_Pos   (19U)
#define OCTOSPI_CR_SMIE_Msk   (0x1UL << OCTOSPI_CR_SMIE_Pos) /*!< 0x00080000 */
#define OCTOSPI_CR_SMIE       OCTOSPI_CR_SMIE_Msk            /*!< Status Match Interrupt Enable */
#define OCTOSPI_CR_TOIE_Pos   (20U)
#define OCTOSPI_CR_TOIE_Msk   (0x1UL << OCTOSPI_CR_TOIE_Pos) /*!< 0x00100000 */
#define OCTOSPI_CR_TOIE       OCTOSPI_CR_TOIE_Msk            /*!< TimeOut Interrupt Enable */
#define OCTOSPI_CR_APMS_Pos   (22U)
#define OCTOSPI_CR_APMS_Msk   (0x1UL << OCTOSPI_CR_APMS_Pos) /*!< 0x00400000 */
#define OCTOSPI_CR_APMS       OCTOSPI_CR_APMS_Msk            /*!< Automatic Poll Mode Stop */
#define OCTOSPI_CR_PMM_Pos    (23U)
#define OCTOSPI_CR_PMM_Msk    (0x1UL << OCTOSPI_CR_PMM_Pos) /*!< 0x00800000 */
#define OCTOSPI_CR_PMM        OCTOSPI_CR_PMM_Msk            /*!< Polling Match Mode */
#define OCTOSPI_CR_FMODE_Pos  (28U)
#define OCTOSPI_CR_FMODE_Msk  (0x3UL << OCTOSPI_CR_FMODE_Pos) /*!< 0x30000000 */
#define OCTOSPI_CR_FMODE      OCTOSPI_CR_FMODE_Msk            /*!< Functional Mode */
#define OCTOSPI_CR_FMODE_0    (0x1UL << OCTOSPI_CR_FMODE_Pos) /*!< 0x10000000 */
#define OCTOSPI_CR_FMODE_1    (0x2UL << OCTOSPI_CR_FMODE_Pos) /*!< 0x20000000 */

/****************  Bit definition for OCTOSPI_DCR1 register  ******************/
#define OCTOSPI_DCR1_CKMODE_Pos  (0U)
#define OCTOSPI_DCR1_CKMODE_Msk  (0x1UL << OCTOSPI_DCR1_CKMODE_Pos) /*!< 0x00000001 */
#define OCTOSPI_DCR1_CKMODE      OCTOSPI_DCR1_CKMODE_Msk            /*!< Mode 0 / Mode 3 */
#define OCTOSPI_DCR1_FRCK_Pos    (1U)
#define OCTOSPI_DCR1_FRCK_Msk    (0x1UL << OCTOSPI_DCR1_FRCK_Pos) /*!< 0x00000002 */
#define OCTOSPI_DCR1_FRCK        OCTOSPI_DCR1_FRCK_Msk            /*!< Free Running Clock */
#define OCTOSPI_DCR1_DLYBYP_Pos  (3U)
#define OCTOSPI_DCR1_DLYBYP_Msk  (0x1UL << OCTOSPI_DCR1_DLYBYP_Pos) /*!< 0x00000008 */
#define OCTOSPI_DCR1_DLYBYP      OCTOSPI_DCR1_DLYBYP_Msk            /*!< Delay Block */
#define OCTOSPI_DCR1_CSHT_Pos    (8U)
#define OCTOSPI_DCR1_CSHT_Msk    (0x7UL << OCTOSPI_DCR1_CSHT_Pos) /*!< 0x00000700 */
#define OCTOSPI_DCR1_CSHT        OCTOSPI_DCR1_CSHT_Msk            /*!< Chip Select High Time */
#define OCTOSPI_DCR1_DEVSIZE_Pos (16U)
#define OCTOSPI_DCR1_DEVSIZE_Msk (0x1FUL << OCTOSPI_DCR1_DEVSIZE_Pos) /*!< 0x001F0000 */
#define OCTOSPI_DCR1_DEVSIZE     OCTOSPI_DCR1_DEVSIZE_Msk             /*!< Device Size */
#define OCTOSPI_DCR1_MTYP_Pos    (24U)
#define OCTOSPI_DCR1_MTYP_Msk    (0x7UL << OCTOSPI_DCR1_MTYP_Pos) /*!< 0x07000000 */
#define OCTOSPI_DCR1_MTYP        OCTOSPI_DCR1_MTYP_Msk            /*!< Memory Type */
#define OCTOSPI_DCR1_MTYP_0      (0x1UL << OCTOSPI_DCR1_MTYP_Pos) /*!< 0x01000000 */
#define OCTOSPI_DCR1_MTYP_1      (0x2UL << OCTOSPI_DCR1_MTYP_Pos) /*!< 0x02000000 */
#define OCTOSPI_DCR1_MTYP_2      (0x4UL << OCTOSPI_DCR1_MTYP_Pos) /*!< 0x04000000 */

