Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/* Legacy define */
#define OCTOSPI_DCR1_CKCSHT_Pos (4U)
#define OCTOSPI_DCR1_CKCSHT_Msk (0x7UL << OCTOSPI_DCR1_CKCSHT_Pos) /*!< 0x00000070 */
#define OCTOSPI_DCR1_CKCSHT     OCTOSPI_DCR1_CKCSHT_Msk            /*!< Clocked Chip Select High Time */

/****************  Bit definition for OCTOSPI_DCR2 register  ******************/
#define OCTOSPI_DCR2_PRESCALER_Pos (0U)
#define OCTOSPI_DCR2_PRESCALER_Msk (0xFFUL << OCTOSPI_DCR2_PRESCALER_Pos) /*!< 0x000000FF */
#define OCTOSPI_DCR2_PRESCALER     OCTOSPI_DCR2_PRESCALER_Msk             /*!< Clock prescaler */
#define OCTOSPI_DCR2_WRAPSIZE_Pos  (16U)
#define OCTOSPI_DCR2_WRAPSIZE_Msk  (0x7UL << OCTOSPI_DCR2_WRAPSIZE_Pos) /*!< 0x00070000 */
#define OCTOSPI_DCR2_WRAPSIZE      OCTOSPI_DCR2_WRAPSIZE_Msk            /*!< Wrap Size */
#define OCTOSPI_DCR2_WRAPSIZE_0    (0x1UL << OCTOSPI_DCR2_WRAPSIZE_Pos) /*!< 0x00010000 */
#define OCTOSPI_DCR2_WRAPSIZE_1    (0x2UL << OCTOSPI_DCR2_WRAPSIZE_Pos) /*!< 0x00020000 */
#define OCTOSPI_DCR2_WRAPSIZE_2    (0x4UL << OCTOSPI_DCR2_WRAPSIZE_Pos) /*!< 0x00040000 */

/****************  Bit definition for OCTOSPI_DCR3 register  ******************/
#define OCTOSPI_DCR3_MAXTRAN_Pos (0U)
#define OCTOSPI_DCR3_MAXTRAN_Msk (0xFFUL << OCTOSPI_DCR3_MAXTRAN_Pos) /*!< 0x000000FF */
#define OCTOSPI_DCR3_MAXTRAN     OCTOSPI_DCR3_MAXTRAN_Msk             /*!< Maximum Transfer */
#define OCTOSPI_DCR3_CSBOUND_Pos (16U)
#define OCTOSPI_DCR3_CSBOUND_Msk (0x1FUL << OCTOSPI_DCR3_CSBOUND_Pos) /*!< 0x001F0000 */
#define OCTOSPI_DCR3_CSBOUND     OCTOSPI_DCR3_CSBOUND_Msk             /*!< CS Boundary */

/****************  Bit definition for OCTOSPI_DCR4 register  ******************/
#define OCTOSPI_DCR4_REFRESH_Pos (0U)
#define OCTOSPI_DCR4_REFRESH_Msk (0xFFFFFFFFUL << OCTOSPI_DCR4_REFRESH_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_DCR4_REFRESH     OCTOSPI_DCR4_REFRESH_Msk                   /*!< Refresh rate */

/*****************  Bit definition for OCTOSPI_SR register  *******************/
#define OCTOSPI_SR_TEF_Pos    (0U)
#define OCTOSPI_SR_TEF_Msk    (0x1UL << OCTOSPI_SR_TEF_Pos) /*!< 0x00000001 */
#define OCTOSPI_SR_TEF        OCTOSPI_SR_TEF_Msk            /*!< Transfer Error Flag */
#define OCTOSPI_SR_TCF_Pos    (1U)
#define OCTOSPI_SR_TCF_Msk    (0x1UL << OCTOSPI_SR_TCF_Pos) /*!< 0x00000002 */
#define OCTOSPI_SR_TCF        OCTOSPI_SR_TCF_Msk            /*!< Transfer Complete Flag */
#define OCTOSPI_SR_FTF_Pos    (2U)
#define OCTOSPI_SR_FTF_Msk    (0x1UL << OCTOSPI_SR_FTF_Pos) /*!< 0x00000004 */
#define OCTOSPI_SR_FTF        OCTOSPI_SR_FTF_Msk            /*!< FIFO Threshold Flag */
#define OCTOSPI_SR_SMF_Pos    (3U)
#define OCTOSPI_SR_SMF_Msk    (0x1UL << OCTOSPI_SR_SMF_Pos) /*!< 0x00000008 */
#define OCTOSPI_SR_SMF        OCTOSPI_SR_SMF_Msk            /*!< Status Match Flag */
#define OCTOSPI_SR_TOF_Pos    (4U)
#define OCTOSPI_SR_TOF_Msk    (0x1UL << OCTOSPI_SR_TOF_Pos) /*!< 0x00000010 */
#define OCTOSPI_SR_TOF        OCTOSPI_SR_TOF_Msk            /*!< Timeout Flag */
#define OCTOSPI_SR_BUSY_Pos   (5U)
#define OCTOSPI_SR_BUSY_Msk   (0x1UL << OCTOSPI_SR_BUSY_Pos) /*!< 0x00000020 */
#define OCTOSPI_SR_BUSY       OCTOSPI_SR_BUSY_Msk            /*!< Busy */
#define OCTOSPI_SR_FLEVEL_Pos (8U)
#define OCTOSPI_SR_FLEVEL_Msk (0x3FUL << OCTOSPI_SR_FLEVEL_Pos) /*!< 0x00003F00 */
#define OCTOSPI_SR_FLEVEL     OCTOSPI_SR_FLEVEL_Msk             /*!< FIFO Level */

/****************  Bit definition for OCTOSPI_FCR register  *******************/
#define OCTOSPI_FCR_CTEF_Pos (0U)
#define OCTOSPI_FCR_CTEF_Msk (0x1UL << OCTOSPI_FCR_CTEF_Pos) /*!< 0x00000001 */
#define OCTOSPI_FCR_CTEF     OCTOSPI_FCR_CTEF_Msk            /*!< Clear Transfer Error Flag */
#define OCTOSPI_FCR_CTCF_Pos (1U)
#define OCTOSPI_FCR_CTCF_Msk (0x1UL << OCTOSPI_FCR_CTCF_Pos) /*!< 0x00000002 */
#define OCTOSPI_FCR_CTCF     OCTOSPI_FCR_CTCF_Msk            /*!< Clear Transfer Complete Flag */
#define OCTOSPI_FCR_CSMF_Pos (3U)
#define OCTOSPI_FCR_CSMF_Msk (0x1UL << OCTOSPI_FCR_CSMF_Pos) /*!< 0x00000008 */
#define OCTOSPI_FCR_CSMF     OCTOSPI_FCR_CSMF_Msk            /*!< Clear Status Match Flag */
#define OCTOSPI_FCR_CTOF_Pos (4U)
#define OCTOSPI_FCR_CTOF_Msk (0x1UL << OCTOSPI_FCR_CTOF_Pos) /*!< 0x00000010 */
#define OCTOSPI_FCR_CTOF     OCTOSPI_FCR_CTOF_Msk            /*!< Clear Timeout Flag */

/****************  Bit definition for OCTOSPI_DLR register  *******************/
#define OCTOSPI_DLR_DL_Pos (0U)
#define OCTOSPI_DLR_DL_Msk (0xFFFFFFFFUL << OCTOSPI_DLR_DL_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_DLR_DL     OCTOSPI_DLR_DL_Msk                   /*!< Data Length */

/*****************  Bit definition for OCTOSPI_AR register  *******************/
#define OCTOSPI_AR_ADDRESS_Pos (0U)
#define OCTOSPI_AR_ADDRESS_Msk (0xFFFFFFFFUL << OCTOSPI_AR_ADDRESS_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_AR_ADDRESS     OCTOSPI_AR_ADDRESS_Msk                   /*!< Address */

/*****************  Bit definition for OCTOSPI_DR register  *******************/
#define OCTOSPI_DR_DATA_Pos (0U)
#define OCTOSPI_DR_DATA_Msk (0xFFFFFFFFUL << OCTOSPI_DR_DATA_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_DR_DATA     OCTOSPI_DR_DATA_Msk                   /*!< Data */

/***************  Bit definition for OCTOSPI_PSMKR register  ******************/
#define OCTOSPI_PSMKR_MASK_Pos (0U)
#define OCTOSPI_PSMKR_MASK_Msk (0xFFFFFFFFUL << OCTOSPI_PSMKR_MASK_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_PSMKR_MASK     OCTOSPI_PSMKR_MASK_Msk                   /*!< Status mask */

/***************  Bit definition for OCTOSPI_PSMAR register  ******************/
#define OCTOSPI_PSMAR_MATCH_Pos (0U)
#define OCTOSPI_PSMAR_MATCH_Msk (0xFFFFFFFFUL << OCTOSPI_PSMAR_MATCH_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_PSMAR_MATCH     OCTOSPI_PSMAR_MATCH_Msk                   /*!< Status match */

/****************  Bit definition for OCTOSPI_PIR register  *******************/
#define OCTOSPI_PIR_INTERVAL_Pos (0U)
#define OCTOSPI_PIR_INTERVAL_Msk (0xFFFFUL << OCTOSPI_PIR_INTERVAL_Pos) /*!< 0x0000FFFF */
#define OCTOSPI_PIR_INTERVAL     OCTOSPI_PIR_INTERVAL_Msk               /*!< Polling Interval */

