Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/****************  Bit definition for OCTOSPI_CCR register  *******************/
#define OCTOSPI_CCR_IMODE_Pos  (0U)
#define OCTOSPI_CCR_IMODE_Msk  (0x7UL << OCTOSPI_CCR_IMODE_Pos) /*!< 0x00000007 */
#define OCTOSPI_CCR_IMODE      OCTOSPI_CCR_IMODE_Msk            /*!< Instruction Mode */
#define OCTOSPI_CCR_IMODE_0    (0x1UL << OCTOSPI_CCR_IMODE_Pos) /*!< 0x00000001 */
#define OCTOSPI_CCR_IMODE_1    (0x2UL << OCTOSPI_CCR_IMODE_Pos) /*!< 0x00000002 */
#define OCTOSPI_CCR_IMODE_2    (0x4UL << OCTOSPI_CCR_IMODE_Pos) /*!< 0x00000004 */
#define OCTOSPI_CCR_IDTR_Pos   (3U)
#define OCTOSPI_CCR_IDTR_Msk   (0x1UL << OCTOSPI_CCR_IDTR_Pos) /*!< 0x00000008 */
#define OCTOSPI_CCR_IDTR       OCTOSPI_CCR_IDTR_Msk            /*!< Instruction Double Transfer Rate */
#define OCTOSPI_CCR_ISIZE_Pos  (4U)
#define OCTOSPI_CCR_ISIZE_Msk  (0x3UL << OCTOSPI_CCR_ISIZE_Pos) /*!< 0x00000030 */
#define OCTOSPI_CCR_ISIZE      OCTOSPI_CCR_ISIZE_Msk            /*!< Instruction Size */
#define OCTOSPI_CCR_ISIZE_0    (0x1UL << OCTOSPI_CCR_ISIZE_Pos) /*!< 0x00000010 */
#define OCTOSPI_CCR_ISIZE_1    (0x2UL << OCTOSPI_CCR_ISIZE_Pos) /*!< 0x00000020 */
#define OCTOSPI_CCR_ADMODE_Pos (8U)
#define OCTOSPI_CCR_ADMODE_Msk (0x7UL << OCTOSPI_CCR_ADMODE_Pos) /*!< 0x00000700 */
#define OCTOSPI_CCR_ADMODE     OCTOSPI_CCR_ADMODE_Msk            /*!< Address Mode */
#define OCTOSPI_CCR_ADMODE_0   (0x1UL << OCTOSPI_CCR_ADMODE_Pos) /*!< 0x00000100 */
#define OCTOSPI_CCR_ADMODE_1   (0x2UL << OCTOSPI_CCR_ADMODE_Pos) /*!< 0x00000200 */
#define OCTOSPI_CCR_ADMODE_2   (0x4UL << OCTOSPI_CCR_ADMODE_Pos) /*!< 0x00000400 */
#define OCTOSPI_CCR_ADDTR_Pos  (11U)
#define OCTOSPI_CCR_ADDTR_Msk  (0x1UL << OCTOSPI_CCR_ADDTR_Pos) /*!< 0x00000800 */
#define OCTOSPI_CCR_ADDTR      OCTOSPI_CCR_ADDTR_Msk            /*!< Address Double Transfer Rate */
#define OCTOSPI_CCR_ADSIZE_Pos (12U)
#define OCTOSPI_CCR_ADSIZE_Msk (0x3UL << OCTOSPI_CCR_ADSIZE_Pos) /*!< 0x00003000 */
#define OCTOSPI_CCR_ADSIZE     OCTOSPI_CCR_ADSIZE_Msk            /*!< Address Size */
#define OCTOSPI_CCR_ADSIZE_0   (0x1UL << OCTOSPI_CCR_ADSIZE_Pos) /*!< 0x00001000 */
#define OCTOSPI_CCR_ADSIZE_1   (0x2UL << OCTOSPI_CCR_ADSIZE_Pos) /*!< 0x00002000 */
#define OCTOSPI_CCR_ABMODE_Pos (16U)
#define OCTOSPI_CCR_ABMODE_Msk (0x7UL << OCTOSPI_CCR_ABMODE_Pos) /*!< 0x00070000 */
#define OCTOSPI_CCR_ABMODE     OCTOSPI_CCR_ABMODE_Msk            /*!< Alternate Bytes Mode */
#define OCTOSPI_CCR_ABMODE_0   (0x1UL << OCTOSPI_CCR_ABMODE_Pos) /*!< 0x00010000 */
#define OCTOSPI_CCR_ABMODE_1   (0x2UL << OCTOSPI_CCR_ABMODE_Pos) /*!< 0x00020000 */
#define OCTOSPI_CCR_ABMODE_2   (0x4UL << OCTOSPI_CCR_ABMODE_Pos) /*!< 0x00040000 */
#define OCTOSPI_CCR_ABDTR_Pos  (19U)
#define OCTOSPI_CCR_ABDTR_Msk  (0x1UL << OCTOSPI_CCR_ABDTR_Pos) /*!< 0x00080000 */
#define OCTOSPI_CCR_ABDTR      OCTOSPI_CCR_ABDTR_Msk            /*!< Alternate Bytes Double Transfer Rate */
#define OCTOSPI_CCR_ABSIZE_Pos (20U)
#define OCTOSPI_CCR_ABSIZE_Msk (0x3UL << OCTOSPI_CCR_ABSIZE_Pos) /*!< 0x00300000 */
#define OCTOSPI_CCR_ABSIZE     OCTOSPI_CCR_ABSIZE_Msk            /*!< Alternate Bytes Size */
#define OCTOSPI_CCR_ABSIZE_0   (0x1UL << OCTOSPI_CCR_ABSIZE_Pos) /*!< 0x00100000 */
#define OCTOSPI_CCR_ABSIZE_1   (0x2UL << OCTOSPI_CCR_ABSIZE_Pos) /*!< 0x00200000 */
#define OCTOSPI_CCR_DMODE_Pos  (24U)
#define OCTOSPI_CCR_DMODE_Msk  (0x7UL << OCTOSPI_CCR_DMODE_Pos) /*!< 0x07000000 */
#define OCTOSPI_CCR_DMODE      OCTOSPI_CCR_DMODE_Msk            /*!< Data Mode */
#define OCTOSPI_CCR_DMODE_0    (0x1UL << OCTOSPI_CCR_DMODE_Pos) /*!< 0x01000000 */
#define OCTOSPI_CCR_DMODE_1    (0x2UL << OCTOSPI_CCR_DMODE_Pos) /*!< 0x02000000 */
#define OCTOSPI_CCR_DMODE_2    (0x4UL << OCTOSPI_CCR_DMODE_Pos) /*!< 0x04000000 */
#define OCTOSPI_CCR_DDTR_Pos   (27U)
#define OCTOSPI_CCR_DDTR_Msk   (0x1UL << OCTOSPI_CCR_DDTR_Pos) /*!< 0x08000000 */
#define OCTOSPI_CCR_DDTR       OCTOSPI_CCR_DDTR_Msk            /*!< Data Double Transfer Rate */
#define OCTOSPI_CCR_DQSE_Pos   (29U)
#define OCTOSPI_CCR_DQSE_Msk   (0x1UL << OCTOSPI_CCR_DQSE_Pos) /*!< 0x20000000 */
#define OCTOSPI_CCR_DQSE       OCTOSPI_CCR_DQSE_Msk            /*!< DQS Enable */
#define OCTOSPI_CCR_SIOO_Pos   (31U)
#define OCTOSPI_CCR_SIOO_Msk   (0x1UL << OCTOSPI_CCR_SIOO_Pos) /*!< 0x80000000 */
#define OCTOSPI_CCR_SIOO       OCTOSPI_CCR_SIOO_Msk            /*!< Send Instruction Only Once Mode */

/****************  Bit definition for OCTOSPI_TCR register  *******************/
#define OCTOSPI_TCR_DCYC_Pos   (0U)
#define OCTOSPI_TCR_DCYC_Msk   (0x1FUL << OCTOSPI_TCR_DCYC_Pos) /*!< 0x0000001F */
#define OCTOSPI_TCR_DCYC       OCTOSPI_TCR_DCYC_Msk             /*!< Number of Dummy Cycles */
#define OCTOSPI_TCR_DHQC_Pos   (28U)
#define OCTOSPI_TCR_DHQC_Msk   (0x1UL << OCTOSPI_TCR_DHQC_Pos) /*!< 0x10000000 */
#define OCTOSPI_TCR_DHQC       OCTOSPI_TCR_DHQC_Msk            /*!< Delay Hold Quarter Cycle */
#define OCTOSPI_TCR_SSHIFT_Pos (30U)
#define OCTOSPI_TCR_SSHIFT_Msk (0x1UL << OCTOSPI_TCR_SSHIFT_Pos) /*!< 0x40000000 */
#define OCTOSPI_TCR_SSHIFT     OCTOSPI_TCR_SSHIFT_Msk            /*!< Sample Shift */

/*****************  Bit definition for OCTOSPI_IR register  *******************/
#define OCTOSPI_IR_INSTRUCTION_Pos (0U)
#define OCTOSPI_IR_INSTRUCTION_Msk (0xFFFFFFFFUL << OCTOSPI_IR_INSTRUCTION_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_IR_INSTRUCTION     OCTOSPI_IR_INSTRUCTION_Msk                   /*!< Instruction */

/****************  Bit definition for OCTOSPI_ABR register  *******************/
#define OCTOSPI_ABR_ALTERNATE_Pos (0U)
#define OCTOSPI_ABR_ALTERNATE_Msk (0xFFFFFFFFUL << OCTOSPI_ABR_ALTERNATE_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_ABR_ALTERNATE     OCTOSPI_ABR_ALTERNATE_Msk                   /*!< Alternate Bytes */

/****************  Bit definition for OCTOSPI_LPTR register  ******************/
#define OCTOSPI_LPTR_TIMEOUT_Pos (0U)
#define OCTOSPI_LPTR_TIMEOUT_Msk (0xFFFFUL << OCTOSPI_LPTR_TIMEOUT_Pos) /*!< 0x0000FFFF */
#define OCTOSPI_LPTR_TIMEOUT     OCTOSPI_LPTR_TIMEOUT_Msk               /*!< Timeout period */

/****************  Bit definition for OCTOSPI_WPCCR register  *******************/
#define OCTOSPI_WPCCR_IMODE_Pos  (0U)
#define OCTOSPI_WPCCR_IMODE_Msk  (0x7UL << OCTOSPI_WPCCR_IMODE_Pos) /*!< 0x00000007 */
#define OCTOSPI_WPCCR_IMODE      OCTOSPI_WPCCR_IMODE_Msk            /*!< Instruction Mode */
#define OCTOSPI_WPCCR_IMODE_0    (0x1UL << OCTOSPI_WPCCR_IMODE_Pos) /*!< 0x00000001 */
#define OCTOSPI_WPCCR_IMODE_1    (0x2UL << OCTOSPI_WPCCR_IMODE_Pos) /*!< 0x00000002 */
#define OCTOSPI_WPCCR_IMODE_2    (0x4UL << OCTOSPI_WPCCR_IMODE_Pos) /*!< 0x00000004 */
#define OCTOSPI_WPCCR_IDTR_Pos   (3U)
#define OCTOSPI_WPCCR_IDTR_Msk   (0x1UL << OCTOSPI_WPCCR_IDTR_Pos) /*!< 0x00000008 */
#define OCTOSPI_WPCCR_IDTR       OCTOSPI_WPCCR_IDTR_Msk            /*!< Instruction Double Transfer Rate */
#define OCTOSPI_WPCCR_ISIZE_Pos  (4U)
#define OCTOSPI_WPCCR_ISIZE_Msk  (0x3UL << OCTOSPI_WPCCR_ISIZE_Pos) /*!< 0x00000030 */
#define OCTOSPI_WPCCR_ISIZE      OCTOSPI_WPCCR_ISIZE_Msk            /*!< Instruction Size */
#define OCTOSPI_WPCCR_ISIZE_0    (0x1UL << OCTOSPI_WPCCR_ISIZE_Pos) /*!< 0x00000010 */
#define OCTOSPI_WPCCR_ISIZE_1    (0x2UL << OCTOSPI_WPCCR_ISIZE_Pos) /*!< 0x00000020 */
#define OCTOSPI_WPCCR_ADMODE_Pos (8U)
#define OCTOSPI_WPCCR_ADMODE_Msk (0x7UL << OCTOSPI_WPCCR_ADMODE_Pos) /*!< 0x00000700 */
#define OCTOSPI_WPCCR_ADMODE     OCTOSPI_WPCCR_ADMODE_Msk            /*!< Address Mode */
#define OCTOSPI_WPCCR_ADMODE_0   (0x1UL << OCTOSPI_WPCCR_ADMODE_Pos) /*!< 0x00000100 */
#define OCTOSPI_WPCCR_ADMODE_1   (0x2UL << OCTOSPI_WPCCR_ADMODE_Pos) /*!< 0x00000200 */
#define OCTOSPI_WPCCR_ADMODE_2   (0x4UL << OCTOSPI_WPCCR_ADMODE_Pos) /*!< 0x00000400 */
#define OCTOSPI_WPCCR_ADDTR_Pos  (11U)
#define OCTOSPI_WPCCR_ADDTR_Msk  (0x1UL << OCTOSPI_WPCCR_ADDTR_Pos) /*!< 0x00000800 */
#define OCTOSPI_WPCCR_ADDTR      OCTOSPI_WPCCR_ADDTR_Msk            /*!< Address Double Transfer Rate */
#define OCTOSPI_WPCCR_ADSIZE_Pos (12U)
#define OCTOSPI_WPCCR_ADSIZE_Msk (0x3UL << OCTOSPI_WPCCR_ADSIZE_Pos) /*!< 0x00003000 */
#define OCTOSPI_WPCCR_ADSIZE     OCTOSPI_WPCCR_ADSIZE_Msk            /*!< Address Size */
#define OCTOSPI_WPCCR_ADSIZE_0   (0x1UL << OCTOSPI_WPCCR_ADSIZE_Pos) /*!< 0x00001000 */
#define OCTOSPI_WPCCR_ADSIZE_1   (0x2UL << OCTOSPI_WPCCR_ADSIZE_Pos) /*!< 0x00002000 */
#define OCTOSPI_WPCCR_ABMODE_Pos (16U)
#define OCTOSPI_WPCCR_ABMODE_Msk (0x7UL << OCTOSPI_WPCCR_ABMODE_Pos) /*!< 0x00070000 */
#define OCTOSPI_WPCCR_ABMODE     OCTOSPI_WPCCR_ABMODE_Msk            /*!< Alternate Bytes Mode */
#define OCTOSPI_WPCCR_ABMODE_0   (0x1UL << OCTOSPI_WPCCR_ABMODE_Pos) /*!< 0x00010000 */
#define OCTOSPI_WPCCR_ABMODE_1   (0x2UL << OCTOSPI_WPCCR_ABMODE_Pos) /*!< 0x00020000 */
#define OCTOSPI_WPCCR_ABMODE_2   (0x4UL << OCTOSPI_WPCCR_ABMODE_Pos) /*!< 0x00040000 */
#define OCTOSPI_WPCCR_ABDTR_Pos  (19U)
#define OCTOSPI_WPCCR_ABDTR_Msk  (0x1UL << OCTOSPI_WPCCR_ABDTR_Pos) /*!< 0x00080000 */
#define OCTOSPI_WPCCR_ABDTR      OCTOSPI_WPCCR_ABDTR_Msk            /*!< Alternate Bytes Double Transfer Rate */
#define OCTOSPI_WPCCR_ABSIZE_Pos (20U)
#define OCTOSPI_WPCCR_ABSIZE_Msk (0x3UL << OCTOSPI_WPCCR_ABSIZE_Pos) /*!< 0x00300000 */
#define OCTOSPI_WPCCR_ABSIZE     OCTOSPI_WPCCR_ABSIZE_Msk            /*!< Alternate Bytes Size */
#define OCTOSPI_WPCCR_ABSIZE_0   (0x1UL << OCTOSPI_WPCCR_ABSIZE_Pos) /*!< 0x00100000 */
#define OCTOSPI_WPCCR_ABSIZE_1   (0x2UL << OCTOSPI_WPCCR_ABSIZE_Pos) /*!< 0x00200000 */
#define OCTOSPI_WPCCR_DMODE_Pos  (24U)
#define OCTOSPI_WPCCR_DMODE_Msk  (0x7UL << OCTOSPI_WPCCR_DMODE_Pos) /*!< 0x07000000 */
#define OCTOSPI_WPCCR_DMODE      OCTOSPI_WPCCR_DMODE_Msk            /*!< Data Mode */
#define OCTOSPI_WPCCR_DMODE_0    (0x1UL << OCTOSPI_WPCCR_DMODE_Pos) /*!< 0x01000000 */
#define OCTOSPI_WPCCR_DMODE_1    (0x2UL << OCTOSPI_WPCCR_DMODE_Pos) /*!< 0x02000000 */
#define OCTOSPI_WPCCR_DMODE_2    (0x4UL << OCTOSPI_WPCCR_DMODE_Pos) /*!< 0x04000000 */
#define OCTOSPI_WPCCR_DDTR_Pos   (27U)
#define OCTOSPI_WPCCR_DDTR_Msk   (0x1UL << OCTOSPI_WPCCR_DDTR_Pos) /*!< 0x08000000 */
#define OCTOSPI_WPCCR_DDTR       OCTOSPI_WPCCR_DDTR_Msk            /*!< Data Double Transfer Rate */
#define OCTOSPI_WPCCR_DQSE_Pos   (29U)
#define OCTOSPI_WPCCR_DQSE_Msk   (0x1UL << OCTOSPI_WPCCR_DQSE_Pos) /*!< 0x20000000 */
#define OCTOSPI_WPCCR_DQSE       OCTOSPI_WPCCR_DQSE_Msk            /*!< DQS Enable */
#define OCTOSPI_WPCCR_SIOO_Pos   (31U)
#define OCTOSPI_WPCCR_SIOO_Msk   (0x1UL << OCTOSPI_WPCCR_SIOO_Pos) /*!< 0x80000000 */
#define OCTOSPI_WPCCR_SIOO       OCTOSPI_WPCCR_SIOO_Msk            /*!< Send Instruction Only Once Mode */

/****************  Bit definition for OCTOSPI_WPTCR register  *******************/
#define OCTOSPI_WPTCR_DCYC_Pos   (0U)
#define OCTOSPI_WPTCR_DCYC_Msk   (0x1FUL << OCTOSPI_WPTCR_DCYC_Pos) /*!< 0x0000001F */
#define OCTOSPI_WPTCR_DCYC       OCTOSPI_WPTCR_DCYC_Msk             /*!< Number of Dummy Cycles */
#define OCTOSPI_WPTCR_DHQC_Pos   (28U)
#define OCTOSPI_WPTCR_DHQC_Msk   (0x1UL << OCTOSPI_WPTCR_DHQC_Pos) /*!< 0x10000000 */
#define OCTOSPI_WPTCR_DHQC       OCTOSPI_WPTCR_DHQC_Msk            /*!< Delay Hold Quarter Cycle */
#define OCTOSPI_WPTCR_SSHIFT_Pos (30U)
#define OCTOSPI_WPTCR_SSHIFT_Msk (0x1UL << OCTOSPI_WPTCR_SSHIFT_Pos) /*!< 0x40000000 */
#define OCTOSPI_WPTCR_SSHIFT     OCTOSPI_WPTCR_SSHIFT_Msk            /*!< Sample Shift */

/*****************  Bit definition for OCTOSPI_WPIR register  *******************/
#define OCTOSPI_WPIR_INSTRUCTION_Pos (0U)
#define OCTOSPI_WPIR_INSTRUCTION_Msk (0xFFFFFFFFUL << OCTOSPI_WPIR_INSTRUCTION_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_WPIR_INSTRUCTION     OCTOSPI_WPIR_INSTRUCTION_Msk                   /*!< Instruction */

/****************  Bit definition for OCTOSPI_WPABR register  *******************/
#define OCTOSPI_WPABR_ALTERNATE_Pos (0U)
#define OCTOSPI_WPABR_ALTERNATE_Msk (0xFFFFFFFFUL << OCTOSPI_WPABR_ALTERNATE_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_WPABR_ALTERNATE     OCTOSPI_WPABR_ALTERNATE_Msk                   /*!< Alternate Bytes */

/****************  Bit definition for OCTOSPI_WCCR register  ******************/
#define OCTOSPI_WCCR_IMODE_Pos  (0U)
#define OCTOSPI_WCCR_IMODE_Msk  (0x7UL << OCTOSPI_WCCR_IMODE_Pos) /*!< 0x00000007 */
#define OCTOSPI_WCCR_IMODE      OCTOSPI_WCCR_IMODE_Msk            /*!< Instruction Mode */
#define OCTOSPI_WCCR_IMODE_0    (0x1UL << OCTOSPI_WCCR_IMODE_Pos) /*!< 0x00000001 */
#define OCTOSPI_WCCR_IMODE_1    (0x2UL << OCTOSPI_WCCR_IMODE_Pos) /*!< 0x00000002 */
#define OCTOSPI_WCCR_IMODE_2    (0x4UL << OCTOSPI_WCCR_IMODE_Pos) /*!< 0x00000004 */
#define OCTOSPI_WCCR_IDTR_Pos   (3U)
#define OCTOSPI_WCCR_IDTR_Msk   (0x1UL << OCTOSPI_WCCR_IDTR_Pos) /*!< 0x00000008 */
#define OCTOSPI_WCCR_IDTR       OCTOSPI_WCCR_IDTR_Msk            /*!< Instruction Double Transfer Rate */
#define OCTOSPI_WCCR_ISIZE_Pos  (4U)
#define OCTOSPI_WCCR_ISIZE_Msk  (0x3UL << OCTOSPI_WCCR_ISIZE_Pos) /*!< 0x00000030 */
#define OCTOSPI_WCCR_ISIZE      OCTOSPI_WCCR_ISIZE_Msk            /*!< Instruction Size */
#define OCTOSPI_WCCR_ISIZE_0    (0x1UL << OCTOSPI_WCCR_ISIZE_Pos) /*!< 0x00000010 */
#define OCTOSPI_WCCR_ISIZE_1    (0x2UL << OCTOSPI_WCCR_ISIZE_Pos) /*!< 0x00000020 */
#define OCTOSPI_WCCR_ADMODE_Pos (8U)
#define OCTOSPI_WCCR_ADMODE_Msk (0x7UL << OCTOSPI_WCCR_ADMODE_Pos) /*!< 0x00000700 */
#define OCTOSPI_WCCR_ADMODE     OCTOSPI_WCCR_ADMODE_Msk            /*!< Address Mode */
#define OCTOSPI_WCCR_ADMODE_0   (0x1UL << OCTOSPI_WCCR_ADMODE_Pos) /*!< 0x00000100 */
#define OCTOSPI_WCCR_ADMODE_1   (0x2UL << OCTOSPI_WCCR_ADMODE_Pos) /*!< 0x00000200 */
#define OCTOSPI_WCCR_ADMODE_2   (0x4UL << OCTOSPI_WCCR_ADMODE_Pos) /*!< 0x00000400 */
#define OCTOSPI_WCCR_ADDTR_Pos  (11U)
#define OCTOSPI_WCCR_ADDTR_Msk  (0x1UL << OCTOSPI_WCCR_ADDTR_Pos) /*!< 0x00000800 */
#define OCTOSPI_WCCR_ADDTR      OCTOSPI_WCCR_ADDTR_Msk            /*!< Address Double Transfer Rate */
#define OCTOSPI_WCCR_ADSIZE_Pos (12U)
#define OCTOSPI_WCCR_ADSIZE_Msk (0x3UL << OCTOSPI_WCCR_ADSIZE_Pos) /*!< 0x00003000 */
#define OCTOSPI_WCCR_ADSIZE     OCTOSPI_WCCR_ADSIZE_Msk            /*!< Address Size */
#define OCTOSPI_WCCR_ADSIZE_0   (0x1UL << OCTOSPI_WCCR_ADSIZE_Pos) /*!< 0x00001000 */
#define OCTOSPI_WCCR_ADSIZE_1   (0x2UL << OCTOSPI_WCCR_ADSIZE_Pos) /*!< 0x00002000 */
#define OCTOSPI_WCCR_ABMODE_Pos (16U)
#define OCTOSPI_WCCR_ABMODE_Msk (0x7UL << OCTOSPI_WCCR_ABMODE_Pos) /*!< 0x00070000 */
#define OCTOSPI_WCCR_ABMODE     OCTOSPI_WCCR_ABMODE_Msk            /*!< Alternate Bytes Mode */
#define OCTOSPI_WCCR_ABMODE_0   (0x1UL << OCTOSPI_WCCR_ABMODE_Pos) /*!< 0x00010000 */
#define OCTOSPI_WCCR_ABMODE_1   (0x2UL << OCTOSPI_WCCR_ABMODE_Pos) /*!< 0x00020000 */
#define OCTOSPI_WCCR_ABMODE_2   (0x4UL << OCTOSPI_WCCR_ABMODE_Pos) /*!< 0x00040000 */
#define OCTOSPI_WCCR_ABDTR_Pos  (19U)
#define OCTOSPI_WCCR_ABDTR_Msk  (0x1UL << OCTOSPI_WCCR_ABDTR_Pos) /*!< 0x00080000 */
#define OCTOSPI_WCCR_ABDTR      OCTOSPI_WCCR_ABDTR_Msk            /*!< Alternate Bytes Double Transfer Rate */
#define OCTOSPI_WCCR_ABSIZE_Pos (20U)
#define OCTOSPI_WCCR_ABSIZE_Msk (0x3UL << OCTOSPI_WCCR_ABSIZE_Pos) /*!< 0x00300000 */
#define OCTOSPI_WCCR_ABSIZE     OCTOSPI_WCCR_ABSIZE_Msk            /*!< Alternate Bytes Size */
#define OCTOSPI_WCCR_ABSIZE_0   (0x1UL << OCTOSPI_WCCR_ABSIZE_Pos) /*!< 0x00100000 */
#define OCTOSPI_WCCR_ABSIZE_1   (0x2UL << OCTOSPI_WCCR_ABSIZE_Pos) /*!< 0x00200000 */
#define OCTOSPI_WCCR_DMODE_Pos  (24U)
#define OCTOSPI_WCCR_DMODE_Msk  (0x7UL << OCTOSPI_WCCR_DMODE_Pos) /*!< 0x07000000 */
#define OCTOSPI_WCCR_DMODE      OCTOSPI_WCCR_DMODE_Msk            /*!< Data Mode */
#define OCTOSPI_WCCR_DMODE_0    (0x1UL << OCTOSPI_WCCR_DMODE_Pos) /*!< 0x01000000 */
#define OCTOSPI_WCCR_DMODE_1    (0x2UL << OCTOSPI_WCCR_DMODE_Pos) /*!< 0x02000000 */
#define OCTOSPI_WCCR_DMODE_2    (0x4UL << OCTOSPI_WCCR_DMODE_Pos) /*!< 0x04000000 */
#define OCTOSPI_WCCR_DDTR_Pos   (27U)
#define OCTOSPI_WCCR_DDTR_Msk   (0x1UL << OCTOSPI_WCCR_DDTR_Pos) /*!< 0x08000000 */
#define OCTOSPI_WCCR_DDTR       OCTOSPI_WCCR_DDTR_Msk            /*!< Data Double Transfer Rate */
#define OCTOSPI_WCCR_DQSE_Pos   (29U)
#define OCTOSPI_WCCR_DQSE_Msk   (0x1UL << OCTOSPI_WCCR_DQSE_Pos) /*!< 0x20000000 */
#define OCTOSPI_WCCR_DQSE       OCTOSPI_WCCR_DQSE_Msk            /*!< DQS Enable */
#define OCTOSPI_WCCR_SIOO_Pos   (31U)
#define OCTOSPI_WCCR_SIOO_Msk   (0x1UL << OCTOSPI_WCCR_SIOO_Pos) /*!< 0x80000000 */
#define OCTOSPI_WCCR_SIOO       OCTOSPI_WCCR_SIOO_Msk            /*!< Send Instruction Only Once Mode */

/****************  Bit definition for OCTOSPI_WTCR register  ******************/
#define OCTOSPI_WTCR_DCYC_Pos (0U)
#define OCTOSPI_WTCR_DCYC_Msk (0x1FUL << OCTOSPI_WTCR_DCYC_Pos) /*!< 0x0000001F */
#define OCTOSPI_WTCR_DCYC     OCTOSPI_WTCR_DCYC_Msk             /*!< Number of Dummy Cycles */

