Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/****************  Bit definition for OCTOSPI_WIR register  *******************/
#define OCTOSPI_WIR_INSTRUCTION_Pos (0U)
#define OCTOSPI_WIR_INSTRUCTION_Msk (0xFFFFFFFFUL << OCTOSPI_WIR_INSTRUCTION_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_WIR_INSTRUCTION     OCTOSPI_WIR_INSTRUCTION_Msk                   /*!< Instruction */

/****************  Bit definition for OCTOSPI_WABR register  ******************/
#define OCTOSPI_WABR_ALTERNATE_Pos (0U)
#define OCTOSPI_WABR_ALTERNATE_Msk (0xFFFFFFFFUL << OCTOSPI_WABR_ALTERNATE_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_WABR_ALTERNATE     OCTOSPI_WABR_ALTERNATE_Msk                   /*!< Alternate Bytes */

/****************  Bit definition for OCTOSPI_HLCR register  ******************/
#define OCTOSPI_HLCR_LM_Pos   (0U)
#define OCTOSPI_HLCR_LM_Msk   (0x1UL << OCTOSPI_HLCR_LM_Pos) /*!< 0x00000001 */
#define OCTOSPI_HLCR_LM       OCTOSPI_HLCR_LM_Msk            /*!< Latency Mode */
#define OCTOSPI_HLCR_WZL_Pos  (1U)
#define OCTOSPI_HLCR_WZL_Msk  (0x1UL << OCTOSPI_HLCR_WZL_Pos) /*!< 0x00000002 */
#define OCTOSPI_HLCR_WZL      OCTOSPI_HLCR_WZL_Msk            /*!< Write Zero Latency */
#define OCTOSPI_HLCR_TACC_Pos (8U)
#define OCTOSPI_HLCR_TACC_Msk (0xFFUL << OCTOSPI_HLCR_TACC_Pos) /*!< 0x0000FF00 */
#define OCTOSPI_HLCR_TACC     OCTOSPI_HLCR_TACC_Msk             /*!< Access Time */
#define OCTOSPI_HLCR_TRWR_Pos (16U)
#define OCTOSPI_HLCR_TRWR_Msk (0xFFUL << OCTOSPI_HLCR_TRWR_Pos) /*!< 0x00FF0000 */
#define OCTOSPI_HLCR_TRWR     OCTOSPI_HLCR_TRWR_Msk             /*!< Read Write Recovery Time */

/****************  Bit definition for OCTOSPI_VER register  *******************/
#define OCTOSPI_VER_VER_Pos (0U)
#define OCTOSPI_VER_VER_Msk (0xFFUL << OCTOSPI_VER_VER_Pos) /*!< 0x000000FF */
#define OCTOSPI_VER_VER     OCTOSPI_VER_VER_Msk             /*!< Version */

/*****************  Bit definition for OCTOSPI_ID register  *******************/
#define OCTOSPI_ID_ID_Pos (0U)
#define OCTOSPI_ID_ID_Msk (0xFFFFFFFFUL << OCTOSPI_ID_ID_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_ID_ID     OCTOSPI_ID_ID_Msk                   /*!< Identification */

/****************  Bit definition for OCTOSPI_MID register  *******************/
#define OCTOSPI_MID_MID_Pos (0U)
#define OCTOSPI_MID_MID_Msk (0xFFFFFFFFUL << OCTOSPI_MID_MID_Pos) /*!< 0xFFFFFFFF */
#define OCTOSPI_MID_MID     OCTOSPI_MID_MID_Msk                   /*!< Magic ID */

/******************************************************************************/
/*                                                                            */
/*                                  OCTOSPIM                                  */
/*                                                                            */
/******************************************************************************/

/***************  Bit definition for OCTOSPIM_CR register  ********************/
#define OCTOSPIM_CR_MUXEN_Pos        (0U)
#define OCTOSPIM_CR_MUXEN_Msk        (0x1UL << OCTOSPIM_CR_MUXEN_Pos) /*!< 0x00000001 */
#define OCTOSPIM_CR_MUXEN            OCTOSPIM_CR_MUXEN_Msk            /*!< Multiplexed mode enable */
#define OCTOSPIM_CR_REQ2ACK_TIME_Pos (16U)
#define OCTOSPIM_CR_REQ2ACK_TIME_Msk (0xFFUL << OCTOSPIM_CR_REQ2ACK_TIME_Pos) /*!< 0x00FF0000 */
#define OCTOSPIM_CR_REQ2ACK_TIME     OCTOSPIM_CR_REQ2ACK_TIME_Msk             /*!< REQ to ACK time */

/***************  Bit definition for OCTOSPIM_PCR register  *******************/
#define OCTOSPIM_PCR_CLKEN_Pos  (0U)
#define OCTOSPIM_PCR_CLKEN_Msk  (0x1UL << OCTOSPIM_PCR_CLKEN_Pos) /*!< 0x00000001 */
#define OCTOSPIM_PCR_CLKEN      OCTOSPIM_PCR_CLKEN_Msk            /*!< CLK/CLKn Enable for Port n */
#define OCTOSPIM_PCR_CLKSRC_Pos (1U)
#define OCTOSPIM_PCR_CLKSRC_Msk (0x1UL << OCTOSPIM_PCR_CLKSRC_Pos) /*!< 0x00000002 */
#define OCTOSPIM_PCR_CLKSRC     OCTOSPIM_PCR_CLKSRC_Msk            /*!< CLK/CLKn Source for Port n */
#define OCTOSPIM_PCR_DQSEN_Pos  (4U)
#define OCTOSPIM_PCR_DQSEN_Msk  (0x1UL << OCTOSPIM_PCR_DQSEN_Pos) /*!< 0x00000010 */
#define OCTOSPIM_PCR_DQSEN      OCTOSPIM_PCR_DQSEN_Msk            /*!< DQS Enable for Port n */
#define OCTOSPIM_PCR_DQSSRC_Pos (5U)
#define OCTOSPIM_PCR_DQSSRC_Msk (0x1UL << OCTOSPIM_PCR_DQSSRC_Pos) /*!< 0x00000020 */
#define OCTOSPIM_PCR_DQSSRC     OCTOSPIM_PCR_DQSSRC_Msk            /*!< DQS Source for Port n */
#define OCTOSPIM_PCR_NCSEN_Pos  (8U)
#define OCTOSPIM_PCR_NCSEN_Msk  (0x1UL << OCTOSPIM_PCR_NCSEN_Pos) /*!< 0x00000100 */
#define OCTOSPIM_PCR_NCSEN      OCTOSPIM_PCR_NCSEN_Msk            /*!< nCS Enable for Port n */
#define OCTOSPIM_PCR_NCSSRC_Pos (9U)
#define OCTOSPIM_PCR_NCSSRC_Msk (0x1UL << OCTOSPIM_PCR_NCSSRC_Pos) /*!< 0x00000200 */
#define OCTOSPIM_PCR_NCSSRC     OCTOSPIM_PCR_NCSSRC_Msk            /*!< nCS Source for Port n */
#define OCTOSPIM_PCR_IOLEN_Pos  (16U)
#define OCTOSPIM_PCR_IOLEN_Msk  (0x1UL << OCTOSPIM_PCR_IOLEN_Pos) /*!< 0x00010000 */
#define OCTOSPIM_PCR_IOLEN      OCTOSPIM_PCR_IOLEN_Msk            /*!< IO[3:0] Enable for Port n */
#define OCTOSPIM_PCR_IOLSRC_Pos (17U)
#define OCTOSPIM_PCR_IOLSRC_Msk (0x3UL << OCTOSPIM_PCR_IOLSRC_Pos) /*!< 0x00060000 */
#define OCTOSPIM_PCR_IOLSRC     OCTOSPIM_PCR_IOLSRC_Msk            /*!< IO[3:0] Source for Port n */
#define OCTOSPIM_PCR_IOLSRC_0   (0x1UL << OCTOSPIM_PCR_IOLSRC_Pos) /*!< 0x00020000 */
#define OCTOSPIM_PCR_IOLSRC_1   (0x2UL << OCTOSPIM_PCR_IOLSRC_Pos) /*!< 0x00040000 */
#define OCTOSPIM_PCR_IOHEN_Pos  (24U)
#define OCTOSPIM_PCR_IOHEN_Msk  (0x1UL << OCTOSPIM_PCR_IOHEN_Pos) /*!< 0x01000000 */
#define OCTOSPIM_PCR_IOHEN      OCTOSPIM_PCR_IOHEN_Msk            /*!< IO[7:4] Enable for Port n */
#define OCTOSPIM_PCR_IOHSRC_Pos (25U)
#define OCTOSPIM_PCR_IOHSRC_Msk (0x3UL << OCTOSPIM_PCR_IOHSRC_Pos) /*!< 0x06000000 */
#define OCTOSPIM_PCR_IOHSRC     OCTOSPIM_PCR_IOHSRC_Msk            /*!< IO[7:4] Source for Port n */
#define OCTOSPIM_PCR_IOHSRC_0   (0x1UL << OCTOSPIM_PCR_IOHSRC_Pos) /*!< 0x02000000 */
#define OCTOSPIM_PCR_IOHSRC_1   (0x2UL << OCTOSPIM_PCR_IOHSRC_Pos) /*!< 0x04000000 */
/******************************************************************************/
/*                                                                            */
/*                      Analog Comparators (COMP)                             */
/*                                                                            */
/******************************************************************************/

