Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for COMP_SR register  ********************/
#define COMP_SR_C1VAL_Pos (0U)
#define COMP_SR_C1VAL_Msk (0x1UL << COMP_SR_C1VAL_Pos) /*!< 0x00000001 */
#define COMP_SR_C1VAL     COMP_SR_C1VAL_Msk
#define COMP_SR_C2VAL_Pos (1U)
#define COMP_SR_C2VAL_Msk (0x1UL << COMP_SR_C2VAL_Pos) /*!< 0x00000002 */
#define COMP_SR_C2VAL     COMP_SR_C2VAL_Msk
#define COMP_SR_C1IF_Pos  (16U)
#define COMP_SR_C1IF_Msk  (0x1UL << COMP_SR_C1IF_Pos) /*!< 0x00010000 */
#define COMP_SR_C1IF      COMP_SR_C1IF_Msk
#define COMP_SR_C2IF_Pos  (17U)
#define COMP_SR_C2IF_Msk  (0x1UL << COMP_SR_C2IF_Pos) /*!< 0x00020000 */
#define COMP_SR_C2IF      COMP_SR_C2IF_Msk
/*******************  Bit definition for COMP_ICFR register  ********************/
#define COMP_ICFR_C1IF_Pos (16U)
#define COMP_ICFR_C1IF_Msk (0x1UL << COMP_ICFR_C1IF_Pos) /*!< 0x00010000 */
#define COMP_ICFR_C1IF     COMP_ICFR_C1IF_Msk
#define COMP_ICFR_C2IF_Pos (17U)
#define COMP_ICFR_C2IF_Msk (0x1UL << COMP_ICFR_C2IF_Pos) /*!< 0x00020000 */
#define COMP_ICFR_C2IF     COMP_ICFR_C2IF_Msk
/*******************  Bit definition for COMP_OR register  ********************/
#define COMP_OR_AFOPA6_Pos  (0U)
#define COMP_OR_AFOPA6_Msk  (0x1UL << COMP_OR_AFOPA6_Pos) /*!< 0x00000001 */
#define COMP_OR_AFOPA6      COMP_OR_AFOPA6_Msk
#define COMP_OR_AFOPA8_Pos  (1U)
#define COMP_OR_AFOPA8_Msk  (0x1UL << COMP_OR_AFOPA8_Pos) /*!< 0x00000002 */
#define COMP_OR_AFOPA8      COMP_OR_AFOPA8_Msk
#define COMP_OR_AFOPB12_Pos (2U)
#define COMP_OR_AFOPB12_Msk (0x1UL << COMP_OR_AFOPB12_Pos) /*!< 0x00000004 */
#define COMP_OR_AFOPB12     COMP_OR_AFOPB12_Msk
#define COMP_OR_AFOPE6_Pos  (3U)
#define COMP_OR_AFOPE6_Msk  (0x1UL << COMP_OR_AFOPE6_Pos) /*!< 0x00000008 */
#define COMP_OR_AFOPE6      COMP_OR_AFOPE6_Msk
#define COMP_OR_AFOPE15_Pos (4U)
#define COMP_OR_AFOPE15_Msk (0x1UL << COMP_OR_AFOPE15_Pos) /*!< 0x00000010 */
#define COMP_OR_AFOPE15     COMP_OR_AFOPE15_Msk
#define COMP_OR_AFOPG2_Pos  (5U)
#define COMP_OR_AFOPG2_Msk  (0x1UL << COMP_OR_AFOPG2_Pos) /*!< 0x00000020 */
#define COMP_OR_AFOPG2      COMP_OR_AFOPG2_Msk
#define COMP_OR_AFOPG3_Pos  (6U)
#define COMP_OR_AFOPG3_Msk  (0x1UL << COMP_OR_AFOPG3_Pos) /*!< 0x00000040 */
#define COMP_OR_AFOPG3      COMP_OR_AFOPG3_Msk
#define COMP_OR_AFOPG4_Pos  (7U)
#define COMP_OR_AFOPG4_Msk  (0x1UL << COMP_OR_AFOPG4_Pos) /*!< 0x00000080 */
#define COMP_OR_AFOPG4      COMP_OR_AFOPG4_Msk
#define COMP_OR_AFOPI1_Pos  (8U)
#define COMP_OR_AFOPI1_Msk  (0x1UL << COMP_OR_AFOPI1_Pos) /*!< 0x00000100 */
#define COMP_OR_AFOPI1      COMP_OR_AFOPI1_Msk
#define COMP_OR_AFOPI4_Pos  (9U)
#define COMP_OR_AFOPI4_Msk  (0x1UL << COMP_OR_AFOPI4_Pos) /*!< 0x00000200 */
#define COMP_OR_AFOPI4      COMP_OR_AFOPI4_Msk
#define COMP_OR_AFOPK2_Pos  (10U)
#define COMP_OR_AFOPK2_Msk  (0x1UL << COMP_OR_AFOPK2_Pos) /*!< 0x00000400 */
#define COMP_OR_AFOPK2      COMP_OR_AFOPK2_Msk

/*!< ******************  Bit definition for COMP_CFGRx register  ********************/
#define COMP_CFGRx_EN_Pos       (0U)
#define COMP_CFGRx_EN_Msk       (0x1UL << COMP_CFGRx_EN_Pos) /*!< 0x00000001 */
#define COMP_CFGRx_EN           COMP_CFGRx_EN_Msk            /*!< COMPx enable bit                     */
#define COMP_CFGRx_BRGEN_Pos    (1U)
#define COMP_CFGRx_BRGEN_Msk    (0x1UL << COMP_CFGRx_BRGEN_Pos) /*!< 0x00000002 */
#define COMP_CFGRx_BRGEN        COMP_CFGRx_BRGEN_Msk            /*!< COMPx Scaler bridge enable           */
#define COMP_CFGRx_SCALEN_Pos   (2U)
#define COMP_CFGRx_SCALEN_Msk   (0x1UL << COMP_CFGRx_SCALEN_Pos) /*!< 0x00000004 */
#define COMP_CFGRx_SCALEN       COMP_CFGRx_SCALEN_Msk            /*!< COMPx Voltage scaler enable bit      */
#define COMP_CFGRx_POLARITY_Pos (3U)
#define COMP_CFGRx_POLARITY_Msk (0x1UL << COMP_CFGRx_POLARITY_Pos) /*!< 0x00000008 */
#define COMP_CFGRx_POLARITY     COMP_CFGRx_POLARITY_Msk            /*!< COMPx  polarity selection bit        */
#define COMP_CFGRx_WINMODE_Pos  (4U)
#define COMP_CFGRx_WINMODE_Msk  (0x1UL << COMP_CFGRx_WINMODE_Pos) /*!< 0x00000010 */
#define COMP_CFGRx_WINMODE      COMP_CFGRx_WINMODE_Msk            /*!< COMPx Windows mode selection bit     */
#define COMP_CFGRx_ITEN_Pos     (6U)
#define COMP_CFGRx_ITEN_Msk     (0x1UL << COMP_CFGRx_ITEN_Pos) /*!< 0x00000040 */
#define COMP_CFGRx_ITEN         COMP_CFGRx_ITEN_Msk            /*!< COMPx  interrupt enable              */
#define COMP_CFGRx_HYST_Pos     (8U)
#define COMP_CFGRx_HYST_Msk     (0x3UL << COMP_CFGRx_HYST_Pos) /*!< 0x00000300 */
#define COMP_CFGRx_HYST         COMP_CFGRx_HYST_Msk            /*!< COMPx  hysteresis selection bits     */
#define COMP_CFGRx_HYST_0       (0x1UL << COMP_CFGRx_HYST_Pos) /*!< 0x00000100 */
#define COMP_CFGRx_HYST_1       (0x2UL << COMP_CFGRx_HYST_Pos) /*!< 0x00000200 */
#define COMP_CFGRx_PWRMODE_Pos  (12U)
#define COMP_CFGRx_PWRMODE_Msk  (0x3UL << COMP_CFGRx_PWRMODE_Pos) /*!< 0x00003000 */
#define COMP_CFGRx_PWRMODE      COMP_CFGRx_PWRMODE_Msk            /*!< COMPx Power Mode of the comparator   */
#define COMP_CFGRx_PWRMODE_0    (0x1UL << COMP_CFGRx_PWRMODE_Pos) /*!< 0x00001000 */
#define COMP_CFGRx_PWRMODE_1    (0x2UL << COMP_CFGRx_PWRMODE_Pos) /*!< 0x00002000 */
#define COMP_CFGRx_INMSEL_Pos   (16U)
#define COMP_CFGRx_INMSEL_Msk   (0xFUL << COMP_CFGRx_INMSEL_Pos) /*!< 0x000F0000 */
#define COMP_CFGRx_INMSEL       COMP_CFGRx_INMSEL_Msk            /*!< COMPx  input minus selection bit  */
#define COMP_CFGRx_INMSEL_0     (0x1UL << COMP_CFGRx_INMSEL_Pos) /*!< 0x00010000 */
#define COMP_CFGRx_INMSEL_1     (0x2UL << COMP_CFGRx_INMSEL_Pos) /*!< 0x00020000 */
#define COMP_CFGRx_INMSEL_2     (0x4UL << COMP_CFGRx_INMSEL_Pos) /*!< 0x00040000 */
#define COMP_CFGRx_INMSEL_3     (0x8UL << COMP_CFGRx_INMSEL_Pos) /*!< 0x00080000 */
#define COMP_CFGRx_INPSEL_Pos   (20U)
#define COMP_CFGRx_INPSEL_Msk   (0x1UL << COMP_CFGRx_INPSEL_Pos) /*!< 0x00100000 */
#define COMP_CFGRx_INPSEL       COMP_CFGRx_INPSEL_Msk            /*!< COMPx  input plus selection bit       */
#define COMP_CFGRx_INP2SEL_Pos  (22U)
#define COMP_CFGRx_INP2SEL_Msk  (0x1UL << COMP_CFGRx_INP2SEL_Pos) /*!< 0x00400000 */
#define COMP_CFGRx_INP2SEL      COMP_CFGRx_INP2SEL_Msk            /*!< COMPx  input plus 2 selection bit     */
#define COMP_CFGRx_BLANKING_Pos (24U)
#define COMP_CFGRx_BLANKING_Msk (0xFUL << COMP_CFGRx_BLANKING_Pos) /*!< 0x0F000000 */
#define COMP_CFGRx_BLANKING     COMP_CFGRx_BLANKING_Msk            /*!< COMPx  blanking source selection bits */
#define COMP_CFGRx_BLANKING_0   (0x1UL << COMP_CFGRx_BLANKING_Pos) /*!< 0x01000000 */
#define COMP_CFGRx_BLANKING_1   (0x2UL << COMP_CFGRx_BLANKING_Pos) /*!< 0x02000000 */
#define COMP_CFGRx_BLANKING_2   (0x4UL << COMP_CFGRx_BLANKING_Pos) /*!< 0x04000000 */
#define COMP_CFGRx_LOCK_Pos     (31U)
#define COMP_CFGRx_LOCK_Msk     (0x1UL << COMP_CFGRx_LOCK_Pos) /*!< 0x80000000 */
#define COMP_CFGRx_LOCK         COMP_CFGRx_LOCK_Msk            /*!< COMPx Lock Bit                        */

/******************************************************************************/
/*                                                                            */
/*      Universal Synchronous Asynchronous Receiver Transmitter (USART)       */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for USART_CR1 register  *******************/
#define USART_CR1_UE_Pos             (0U)
#define USART_CR1_UE_Msk             (0x1UL << USART_CR1_UE_Pos) /*!< 0x00000001 */
#define USART_CR1_UE                 USART_CR1_UE_Msk            /*!< USART Enable */
#define USART_CR1_UESM_Pos           (1U)
#define USART_CR1_UESM_Msk           (0x1UL << USART_CR1_UESM_Pos) /*!< 0x00000002 */
#define USART_CR1_UESM               USART_CR1_UESM_Msk            /*!< USART Enable in STOP Mode */
#define USART_CR1_RE_Pos             (2U)
#define USART_CR1_RE_Msk             (0x1UL << USART_CR1_RE_Pos) /*!< 0x00000004 */
#define USART_CR1_RE                 USART_CR1_RE_Msk            /*!< Receiver Enable */
#define USART_CR1_TE_Pos             (3U)
#define USART_CR1_TE_Msk             (0x1UL << USART_CR1_TE_Pos) /*!< 0x00000008 */
#define USART_CR1_TE                 USART_CR1_TE_Msk            /*!< Transmitter Enable */
#define USART_CR1_IDLEIE_Pos         (4U)
#define USART_CR1_IDLEIE_Msk         (0x1UL << USART_CR1_IDLEIE_Pos) /*!< 0x00000010 */
#define USART_CR1_IDLEIE             USART_CR1_IDLEIE_Msk            /*!< IDLE Interrupt Enable */
#define USART_CR1_RXNEIE_RXFNEIE_Pos (5U)
#define USART_CR1_RXNEIE_RXFNEIE_Msk (0x1UL << USART_CR1_RXNEIE_RXFNEIE_Pos) /*!< 0x00000020 */
#define USART_CR1_RXNEIE_RXFNEIE     USART_CR1_RXNEIE_RXFNEIE_Msk /*!< RXNE and RX FIFO Not Empty Interrupt Enable */
#define USART_CR1_TCIE_Pos           (6U)
#define USART_CR1_TCIE_Msk           (0x1UL << USART_CR1_TCIE_Pos) /*!< 0x00000040 */
#define USART_CR1_TCIE               USART_CR1_TCIE_Msk            /*!< Transmission Complete Interrupt Enable */
#define USART_CR1_TXEIE_TXFNFIE_Pos  (7U)
#define USART_CR1_TXEIE_TXFNFIE_Msk  (0x1UL << USART_CR1_TXEIE_TXFNFIE_Pos) /*!< 0x00000080 */
#define USART_CR1_TXEIE_TXFNFIE      USART_CR1_TXEIE_TXFNFIE_Msk /*!< TXE and TX FIFO Not Full Interrupt Enable */
#define USART_CR1_PEIE_Pos           (8U)
#define USART_CR1_PEIE_Msk           (0x1UL << USART_CR1_PEIE_Pos) /*!< 0x00000100 */
#define USART_CR1_PEIE               USART_CR1_PEIE_Msk            /*!< PE Interrupt Enable */
#define USART_CR1_PS_Pos             (9U)
#define USART_CR1_PS_Msk             (0x1UL << USART_CR1_PS_Pos) /*!< 0x00000200 */
#define USART_CR1_PS                 USART_CR1_PS_Msk            /*!< Parity Selection */
#define USART_CR1_PCE_Pos            (10U)
#define USART_CR1_PCE_Msk            (0x1UL << USART_CR1_PCE_Pos) /*!< 0x00000400 */
#define USART_CR1_PCE                USART_CR1_PCE_Msk            /*!< Parity Control Enable */
#define USART_CR1_WAKE_Pos           (11U)
#define USART_CR1_WAKE_Msk           (0x1UL << USART_CR1_WAKE_Pos) /*!< 0x00000800 */
#define USART_CR1_WAKE               USART_CR1_WAKE_Msk            /*!< Receiver Wakeup method */
#define USART_CR1_M_Pos              (12U)
#define USART_CR1_M_Msk              (0x10001UL << USART_CR1_M_Pos) /*!< 0x10001000 */
#define USART_CR1_M                  USART_CR1_M_Msk                /*!< Word length */
#define USART_CR1_M0_Pos             (12U)
#define USART_CR1_M0_Msk             (0x1UL << USART_CR1_M0_Pos) /*!< 0x00001000 */
#define USART_CR1_M0                 USART_CR1_M0_Msk            /*!< Word length - Bit 0 */
#define USART_CR1_MME_Pos            (13U)
#define USART_CR1_MME_Msk            (0x1UL << USART_CR1_MME_Pos) /*!< 0x00002000 */
#define USART_CR1_MME                USART_CR1_MME_Msk            /*!< Mute Mode Enable */
#define USART_CR1_CMIE_Pos           (14U)
#define USART_CR1_CMIE_Msk           (0x1UL << USART_CR1_CMIE_Pos) /*!< 0x00004000 */
#define USART_CR1_CMIE               USART_CR1_CMIE_Msk            /*!< Character match interrupt enable */
#define USART_CR1_OVER8_Pos          (15U)
#define USART_CR1_OVER8_Msk          (0x1UL << USART_CR1_OVER8_Pos) /*!< 0x00008000 */
#define USART_CR1_OVER8              USART_CR1_OVER8_Msk            /*!< Oversampling by 8-bit or 16-bit mode */
#define USART_CR1_DEDT_Pos           (16U)
#define USART_CR1_DEDT_Msk           (0x1FUL << USART_CR1_DEDT_Pos) /*!< 0x001F0000 */
#define USART_CR1_DEDT               USART_CR1_DEDT_Msk /*!< DEDT[4:0] bits (Driver Enable Deassertion Time) */
#define USART_CR1_DEDT_0             (0x01UL << USART_CR1_DEDT_Pos) /*!< 0x00010000 */
#define USART_CR1_DEDT_1             (0x02UL << USART_CR1_DEDT_Pos) /*!< 0x00020000 */
#define USART_CR1_DEDT_2             (0x04UL << USART_CR1_DEDT_Pos) /*!< 0x00040000 */
#define USART_CR1_DEDT_3             (0x08UL << USART_CR1_DEDT_Pos) /*!< 0x00080000 */
#define USART_CR1_DEDT_4             (0x10UL << USART_CR1_DEDT_Pos) /*!< 0x00100000 */
#define USART_CR1_DEAT_Pos           (21U)
#define USART_CR1_DEAT_Msk           (0x1FUL << USART_CR1_DEAT_Pos) /*!< 0x03E00000 */
#define USART_CR1_DEAT               USART_CR1_DEAT_Msk /*!< DEAT[4:0] bits (Driver Enable Assertion Time) */
#define USART_CR1_DEAT_0             (0x01UL << USART_CR1_DEAT_Pos) /*!< 0x00200000 */
#define USART_CR1_DEAT_1             (0x02UL << USART_CR1_DEAT_Pos) /*!< 0x00400000 */
#define USART_CR1_DEAT_2             (0x04UL << USART_CR1_DEAT_Pos) /*!< 0x00800000 */
#define USART_CR1_DEAT_3             (0x08UL << USART_CR1_DEAT_Pos) /*!< 0x01000000 */
#define USART_CR1_DEAT_4             (0x10UL << USART_CR1_DEAT_Pos) /*!< 0x02000000 */
#define USART_CR1_RTOIE_Pos          (26U)
#define USART_CR1_RTOIE_Msk          (0x1UL << USART_CR1_RTOIE_Pos) /*!< 0x04000000 */
#define USART_CR1_RTOIE              USART_CR1_RTOIE_Msk            /*!< Receive Time Out interrupt enable */
#define USART_CR1_EOBIE_Pos          (27U)
#define USART_CR1_EOBIE_Msk          (0x1UL << USART_CR1_EOBIE_Pos) /*!< 0x08000000 */
#define USART_CR1_EOBIE              USART_CR1_EOBIE_Msk            /*!< End of Block interrupt enable */
#define USART_CR1_M1_Pos             (28U)
#define USART_CR1_M1_Msk             (0x1UL << USART_CR1_M1_Pos) /*!< 0x10000000 */
#define USART_CR1_M1                 USART_CR1_M1_Msk            /*!< Word length - Bit 1 */
#define USART_CR1_FIFOEN_Pos         (29U)
#define USART_CR1_FIFOEN_Msk         (0x1UL << USART_CR1_FIFOEN_Pos) /*!< 0x20000000 */
#define USART_CR1_FIFOEN             USART_CR1_FIFOEN_Msk            /*!< FIFO mode enable */
#define USART_CR1_TXFEIE_Pos         (30U)
#define USART_CR1_TXFEIE_Msk         (0x1UL << USART_CR1_TXFEIE_Pos) /*!< 0x40000000 */
#define USART_CR1_TXFEIE             USART_CR1_TXFEIE_Msk            /*!< TXFIFO empty interrupt enable */
#define USART_CR1_RXFFIE_Pos         (31U)
#define USART_CR1_RXFFIE_Msk         (0x1UL << USART_CR1_RXFFIE_Pos) /*!< 0x80000000 */
#define USART_CR1_RXFFIE             USART_CR1_RXFFIE_Msk            /*!< RXFIFO Full interrupt enable */

