Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/* Legacy define */
#define USART_CR1_RXNEIE USART_CR1_RXNEIE_RXFNEIE
#define USART_CR1_TXEIE  USART_CR1_TXEIE_TXFNFIE

/******************  Bit definition for USART_CR2 register  *******************/
#define USART_CR2_SLVEN_Pos    (0U)
#define USART_CR2_SLVEN_Msk    (0x1UL << USART_CR2_SLVEN_Pos) /*!< 0x00000001 */
#define USART_CR2_SLVEN        USART_CR2_SLVEN_Msk            /*!< Synchronous Slave mode Enable */
#define USART_CR2_DIS_NSS_Pos  (3U)
#define USART_CR2_DIS_NSS_Msk  (0x1UL << USART_CR2_DIS_NSS_Pos) /*!< 0x00000008 */
#define USART_CR2_DIS_NSS      USART_CR2_DIS_NSS_Msk            /*!< Negative Slave Select (NSS) pin management */
#define USART_CR2_ADDM7_Pos    (4U)
#define USART_CR2_ADDM7_Msk    (0x1UL << USART_CR2_ADDM7_Pos) /*!< 0x00000010 */
#define USART_CR2_ADDM7        USART_CR2_ADDM7_Msk            /*!< 7-bit or 4-bit Address Detection */
#define USART_CR2_LBDL_Pos     (5U)
#define USART_CR2_LBDL_Msk     (0x1UL << USART_CR2_LBDL_Pos) /*!< 0x00000020 */
#define USART_CR2_LBDL         USART_CR2_LBDL_Msk            /*!< LIN Break Detection Length */
#define USART_CR2_LBDIE_Pos    (6U)
#define USART_CR2_LBDIE_Msk    (0x1UL << USART_CR2_LBDIE_Pos) /*!< 0x00000040 */
#define USART_CR2_LBDIE        USART_CR2_LBDIE_Msk            /*!< LIN Break Detection Interrupt Enable */
#define USART_CR2_LBCL_Pos     (8U)
#define USART_CR2_LBCL_Msk     (0x1UL << USART_CR2_LBCL_Pos) /*!< 0x00000100 */
#define USART_CR2_LBCL         USART_CR2_LBCL_Msk            /*!< Last Bit Clock pulse */
#define USART_CR2_CPHA_Pos     (9U)
#define USART_CR2_CPHA_Msk     (0x1UL << USART_CR2_CPHA_Pos) /*!< 0x00000200 */
#define USART_CR2_CPHA         USART_CR2_CPHA_Msk            /*!< Clock Phase */
#define USART_CR2_CPOL_Pos     (10U)
#define USART_CR2_CPOL_Msk     (0x1UL << USART_CR2_CPOL_Pos) /*!< 0x00000400 */
#define USART_CR2_CPOL         USART_CR2_CPOL_Msk            /*!< Clock Polarity */
#define USART_CR2_CLKEN_Pos    (11U)
#define USART_CR2_CLKEN_Msk    (0x1UL << USART_CR2_CLKEN_Pos) /*!< 0x00000800 */
#define USART_CR2_CLKEN        USART_CR2_CLKEN_Msk            /*!< Clock Enable */
#define USART_CR2_STOP_Pos     (12U)
#define USART_CR2_STOP_Msk     (0x3UL << USART_CR2_STOP_Pos) /*!< 0x00003000 */
#define USART_CR2_STOP         USART_CR2_STOP_Msk            /*!< STOP[1:0] bits (STOP bits) */
#define USART_CR2_STOP_0       (0x1UL << USART_CR2_STOP_Pos) /*!< 0x00001000 */
#define USART_CR2_STOP_1       (0x2UL << USART_CR2_STOP_Pos) /*!< 0x00002000 */
#define USART_CR2_LINEN_Pos    (14U)
#define USART_CR2_LINEN_Msk    (0x1UL << USART_CR2_LINEN_Pos) /*!< 0x00004000 */
#define USART_CR2_LINEN        USART_CR2_LINEN_Msk            /*!< LIN mode enable */
#define USART_CR2_SWAP_Pos     (15U)
#define USART_CR2_SWAP_Msk     (0x1UL << USART_CR2_SWAP_Pos) /*!< 0x00008000 */
#define USART_CR2_SWAP         USART_CR2_SWAP_Msk            /*!< SWAP TX/RX pins */
#define USART_CR2_RXINV_Pos    (16U)
#define USART_CR2_RXINV_Msk    (0x1UL << USART_CR2_RXINV_Pos) /*!< 0x00010000 */
#define USART_CR2_RXINV        USART_CR2_RXINV_Msk            /*!< RX pin active level inversion */
#define USART_CR2_TXINV_Pos    (17U)
#define USART_CR2_TXINV_Msk    (0x1UL << USART_CR2_TXINV_Pos) /*!< 0x00020000 */
#define USART_CR2_TXINV        USART_CR2_TXINV_Msk            /*!< TX pin active level inversion */
#define USART_CR2_DATAINV_Pos  (18U)
#define USART_CR2_DATAINV_Msk  (0x1UL << USART_CR2_DATAINV_Pos) /*!< 0x00040000 */
#define USART_CR2_DATAINV      USART_CR2_DATAINV_Msk            /*!< Binary data inversion */
#define USART_CR2_MSBFIRST_Pos (19U)
#define USART_CR2_MSBFIRST_Msk (0x1UL << USART_CR2_MSBFIRST_Pos) /*!< 0x00080000 */
#define USART_CR2_MSBFIRST     USART_CR2_MSBFIRST_Msk            /*!< Most Significant Bit First */
#define USART_CR2_ABREN_Pos    (20U)
#define USART_CR2_ABREN_Msk    (0x1UL << USART_CR2_ABREN_Pos) /*!< 0x00100000 */
#define USART_CR2_ABREN        USART_CR2_ABREN_Msk            /*!< Auto Baud-Rate Enable*/
#define USART_CR2_ABRMODE_Pos  (21U)
#define USART_CR2_ABRMODE_Msk  (0x3UL << USART_CR2_ABRMODE_Pos) /*!< 0x00600000 */
#define USART_CR2_ABRMODE      USART_CR2_ABRMODE_Msk            /*!< ABRMOD[1:0] bits (Auto Baud-Rate Mode) */
#define USART_CR2_ABRMODE_0    (0x1UL << USART_CR2_ABRMODE_Pos) /*!< 0x00200000 */
#define USART_CR2_ABRMODE_1    (0x2UL << USART_CR2_ABRMODE_Pos) /*!< 0x00400000 */
#define USART_CR2_RTOEN_Pos    (23U)
#define USART_CR2_RTOEN_Msk    (0x1UL << USART_CR2_RTOEN_Pos) /*!< 0x00800000 */
#define USART_CR2_RTOEN        USART_CR2_RTOEN_Msk            /*!< Receiver Time-Out enable */
#define USART_CR2_ADD_Pos      (24U)
#define USART_CR2_ADD_Msk      (0xFFUL << USART_CR2_ADD_Pos) /*!< 0xFF000000 */
#define USART_CR2_ADD          USART_CR2_ADD_Msk             /*!< Address of the USART node */

/******************  Bit definition for USART_CR3 register  *******************/
#define USART_CR3_EIE_Pos     (0U)
#define USART_CR3_EIE_Msk     (0x1UL << USART_CR3_EIE_Pos) /*!< 0x00000001 */
#define USART_CR3_EIE         USART_CR3_EIE_Msk            /*!< Error Interrupt Enable */
#define USART_CR3_IREN_Pos    (1U)
#define USART_CR3_IREN_Msk    (0x1UL << USART_CR3_IREN_Pos) /*!< 0x00000002 */
#define USART_CR3_IREN        USART_CR3_IREN_Msk            /*!< IrDA mode Enable */
#define USART_CR3_IRLP_Pos    (2U)
#define USART_CR3_IRLP_Msk    (0x1UL << USART_CR3_IRLP_Pos) /*!< 0x00000004 */
#define USART_CR3_IRLP        USART_CR3_IRLP_Msk            /*!< IrDA Low-Power */
#define USART_CR3_HDSEL_Pos   (3U)
#define USART_CR3_HDSEL_Msk   (0x1UL << USART_CR3_HDSEL_Pos) /*!< 0x00000008 */
#define USART_CR3_HDSEL       USART_CR3_HDSEL_Msk            /*!< Half-Duplex Selection */
#define USART_CR3_NACK_Pos    (4U)
#define USART_CR3_NACK_Msk    (0x1UL << USART_CR3_NACK_Pos) /*!< 0x00000010 */
#define USART_CR3_NACK        USART_CR3_NACK_Msk            /*!< SmartCard NACK enable */
#define USART_CR3_SCEN_Pos    (5U)
#define USART_CR3_SCEN_Msk    (0x1UL << USART_CR3_SCEN_Pos) /*!< 0x00000020 */
#define USART_CR3_SCEN        USART_CR3_SCEN_Msk            /*!< SmartCard mode enable */
#define USART_CR3_DMAR_Pos    (6U)
#define USART_CR3_DMAR_Msk    (0x1UL << USART_CR3_DMAR_Pos) /*!< 0x00000040 */
#define USART_CR3_DMAR        USART_CR3_DMAR_Msk            /*!< DMA Enable Receiver */
#define USART_CR3_DMAT_Pos    (7U)
#define USART_CR3_DMAT_Msk    (0x1UL << USART_CR3_DMAT_Pos) /*!< 0x00000080 */
#define USART_CR3_DMAT        USART_CR3_DMAT_Msk            /*!< DMA Enable Transmitter */
#define USART_CR3_RTSE_Pos    (8U)
#define USART_CR3_RTSE_Msk    (0x1UL << USART_CR3_RTSE_Pos) /*!< 0x00000100 */
#define USART_CR3_RTSE        USART_CR3_RTSE_Msk            /*!< RTS Enable */
#define USART_CR3_CTSE_Pos    (9U)
#define USART_CR3_CTSE_Msk    (0x1UL << USART_CR3_CTSE_Pos) /*!< 0x00000200 */
#define USART_CR3_CTSE        USART_CR3_CTSE_Msk            /*!< CTS Enable */
#define USART_CR3_CTSIE_Pos   (10U)
#define USART_CR3_CTSIE_Msk   (0x1UL << USART_CR3_CTSIE_Pos) /*!< 0x00000400 */
#define USART_CR3_CTSIE       USART_CR3_CTSIE_Msk            /*!< CTS Interrupt Enable */
#define USART_CR3_ONEBIT_Pos  (11U)
#define USART_CR3_ONEBIT_Msk  (0x1UL << USART_CR3_ONEBIT_Pos) /*!< 0x00000800 */
#define USART_CR3_ONEBIT      USART_CR3_ONEBIT_Msk            /*!< One sample bit method enable */
#define USART_CR3_OVRDIS_Pos  (12U)
#define USART_CR3_OVRDIS_Msk  (0x1UL << USART_CR3_OVRDIS_Pos) /*!< 0x00001000 */
#define USART_CR3_OVRDIS      USART_CR3_OVRDIS_Msk            /*!< Overrun Disable */
#define USART_CR3_DDRE_Pos    (13U)
#define USART_CR3_DDRE_Msk    (0x1UL << USART_CR3_DDRE_Pos) /*!< 0x00002000 */
#define USART_CR3_DDRE        USART_CR3_DDRE_Msk            /*!< DMA Disable on Reception Error */
#define USART_CR3_DEM_Pos     (14U)
#define USART_CR3_DEM_Msk     (0x1UL << USART_CR3_DEM_Pos) /*!< 0x00004000 */
#define USART_CR3_DEM         USART_CR3_DEM_Msk            /*!< Driver Enable Mode */
#define USART_CR3_DEP_Pos     (15U)
#define USART_CR3_DEP_Msk     (0x1UL << USART_CR3_DEP_Pos) /*!< 0x00008000 */
#define USART_CR3_DEP         USART_CR3_DEP_Msk            /*!< Driver Enable Polarity Selection */
#define USART_CR3_SCARCNT_Pos (17U)
#define USART_CR3_SCARCNT_Msk (0x7UL << USART_CR3_SCARCNT_Pos) /*!< 0x000E0000 */
#define USART_CR3_SCARCNT     USART_CR3_SCARCNT_Msk            /*!< SCARCNT[2:0] bits (SmartCard Auto-Retry Count) */
#define USART_CR3_SCARCNT_0   (0x1UL << USART_CR3_SCARCNT_Pos) /*!< 0x00020000 */
#define USART_CR3_SCARCNT_1   (0x2UL << USART_CR3_SCARCNT_Pos) /*!< 0x00040000 */
#define USART_CR3_SCARCNT_2   (0x4UL << USART_CR3_SCARCNT_Pos) /*!< 0x00080000 */
#define USART_CR3_WUS_Pos     (20U)
#define USART_CR3_WUS_Msk     (0x3UL << USART_CR3_WUS_Pos) /*!< 0x00300000 */
#define USART_CR3_WUS         USART_CR3_WUS_Msk            /*!< WUS[1:0] bits (Wake UP Interrupt Flag Selection) */
#define USART_CR3_WUS_0       (0x1UL << USART_CR3_WUS_Pos) /*!< 0x00100000 */
#define USART_CR3_WUS_1       (0x2UL << USART_CR3_WUS_Pos) /*!< 0x00200000 */
#define USART_CR3_WUFIE_Pos   (22U)
#define USART_CR3_WUFIE_Msk   (0x1UL << USART_CR3_WUFIE_Pos) /*!< 0x00400000 */
#define USART_CR3_WUFIE       USART_CR3_WUFIE_Msk            /*!< Wake Up Interrupt Enable */
#define USART_CR3_TXFTIE_Pos  (23U)
#define USART_CR3_TXFTIE_Msk  (0x1UL << USART_CR3_TXFTIE_Pos) /*!< 0x00800000 */
#define USART_CR3_TXFTIE      USART_CR3_TXFTIE_Msk            /*!< TXFIFO threshold interrupt enable */
#define USART_CR3_TCBGTIE_Pos (24U)
#define USART_CR3_TCBGTIE_Msk (0x1UL << USART_CR3_TCBGTIE_Pos) /*!< 0x01000000 */
#define USART_CR3_TCBGTIE     USART_CR3_TCBGTIE_Msk /*!< Transmission Complete before guard time, interrupt enable */
#define USART_CR3_RXFTCFG_Pos (25U)
#define USART_CR3_RXFTCFG_Msk (0x7UL << USART_CR3_RXFTCFG_Pos) /*!< 0x0E000000 */
#define USART_CR3_RXFTCFG     USART_CR3_RXFTCFG_Msk            /*!< RXFTCFG [2:0]Receive FIFO threshold configuration */
#define USART_CR3_RXFTCFG_0   (0x1UL << USART_CR3_RXFTCFG_Pos) /*!< 0x02000000 */
#define USART_CR3_RXFTCFG_1   (0x2UL << USART_CR3_RXFTCFG_Pos) /*!< 0x04000000 */
#define USART_CR3_RXFTCFG_2   (0x4UL << USART_CR3_RXFTCFG_Pos) /*!< 0x08000000 */
#define USART_CR3_RXFTIE_Pos  (28U)
#define USART_CR3_RXFTIE_Msk  (0x1UL << USART_CR3_RXFTIE_Pos) /*!< 0x10000000 */
#define USART_CR3_RXFTIE      USART_CR3_RXFTIE_Msk            /*!< RXFIFO threshold interrupt enable */
#define USART_CR3_TXFTCFG_Pos (29U)
#define USART_CR3_TXFTCFG_Msk (0x7UL << USART_CR3_TXFTCFG_Pos) /*!< 0xE0000000 */
#define USART_CR3_TXFTCFG     USART_CR3_TXFTCFG_Msk            /*!< TXFIFO [2:0] threshold configuration */
#define USART_CR3_TXFTCFG_0   (0x1UL << USART_CR3_TXFTCFG_Pos) /*!< 0x20000000 */
#define USART_CR3_TXFTCFG_1   (0x2UL << USART_CR3_TXFTCFG_Pos) /*!< 0x40000000 */
#define USART_CR3_TXFTCFG_2   (0x4UL << USART_CR3_TXFTCFG_Pos) /*!< 0x80000000 */

