Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for USART_ICR register  ******************/
#define USART_ICR_PECF_Pos    (0U)
#define USART_ICR_PECF_Msk    (0x1UL << USART_ICR_PECF_Pos) /*!< 0x00000001 */
#define USART_ICR_PECF        USART_ICR_PECF_Msk            /*!< Parity Error Clear Flag */
#define USART_ICR_FECF_Pos    (1U)
#define USART_ICR_FECF_Msk    (0x1UL << USART_ICR_FECF_Pos) /*!< 0x00000002 */
#define USART_ICR_FECF        USART_ICR_FECF_Msk            /*!< Framing Error Clear Flag */
#define USART_ICR_NECF_Pos    (2U)
#define USART_ICR_NECF_Msk    (0x1UL << USART_ICR_NECF_Pos) /*!< 0x00000004 */
#define USART_ICR_NECF        USART_ICR_NECF_Msk            /*!< Noise detected Clear Flag */
#define USART_ICR_ORECF_Pos   (3U)
#define USART_ICR_ORECF_Msk   (0x1UL << USART_ICR_ORECF_Pos) /*!< 0x00000008 */
#define USART_ICR_ORECF       USART_ICR_ORECF_Msk            /*!< OverRun Error Clear Flag */
#define USART_ICR_IDLECF_Pos  (4U)
#define USART_ICR_IDLECF_Msk  (0x1UL << USART_ICR_IDLECF_Pos) /*!< 0x00000010 */
#define USART_ICR_IDLECF      USART_ICR_IDLECF_Msk            /*!< IDLE line detected Clear Flag */
#define USART_ICR_TXFECF_Pos  (5U)
#define USART_ICR_TXFECF_Msk  (0x1UL << USART_ICR_TXFECF_Pos) /*!< 0x00000020 */
#define USART_ICR_TXFECF      USART_ICR_TXFECF_Msk            /*!< TXFIFO empty clear flag */
#define USART_ICR_TCCF_Pos    (6U)
#define USART_ICR_TCCF_Msk    (0x1UL << USART_ICR_TCCF_Pos) /*!< 0x00000040 */
#define USART_ICR_TCCF        USART_ICR_TCCF_Msk            /*!< Transmission Complete Clear Flag */
#define USART_ICR_TCBGTCF_Pos (7U)
#define USART_ICR_TCBGTCF_Msk (0x1UL << USART_ICR_TCBGTCF_Pos) /*!< 0x00000080 */
#define USART_ICR_TCBGTCF     USART_ICR_TCBGTCF_Msk /*!< Transmission complete before guard time Clear Flag */
#define USART_ICR_LBDCF_Pos   (8U)
#define USART_ICR_LBDCF_Msk   (0x1UL << USART_ICR_LBDCF_Pos) /*!< 0x00000100 */
#define USART_ICR_LBDCF       USART_ICR_LBDCF_Msk            /*!< LIN Break Detection Clear Flag */
#define USART_ICR_CTSCF_Pos   (9U)
#define USART_ICR_CTSCF_Msk   (0x1UL << USART_ICR_CTSCF_Pos) /*!< 0x00000200 */
#define USART_ICR_CTSCF       USART_ICR_CTSCF_Msk            /*!< CTS Interrupt Clear Flag */
#define USART_ICR_RTOCF_Pos   (11U)
#define USART_ICR_RTOCF_Msk   (0x1UL << USART_ICR_RTOCF_Pos) /*!< 0x00000800 */
#define USART_ICR_RTOCF       USART_ICR_RTOCF_Msk            /*!< Receiver Time Out Clear Flag */
#define USART_ICR_EOBCF_Pos   (12U)
#define USART_ICR_EOBCF_Msk   (0x1UL << USART_ICR_EOBCF_Pos) /*!< 0x00001000 */
#define USART_ICR_EOBCF       USART_ICR_EOBCF_Msk            /*!< End Of Block Clear Flag */
#define USART_ICR_UDRCF_Pos   (13U)
#define USART_ICR_UDRCF_Msk   (0x1UL << USART_ICR_UDRCF_Pos) /*!< 0x00002000 */
#define USART_ICR_UDRCF       USART_ICR_UDRCF_Msk            /*!< SPI slave underrun clear flag */
#define USART_ICR_CMCF_Pos    (17U)
#define USART_ICR_CMCF_Msk    (0x1UL << USART_ICR_CMCF_Pos) /*!< 0x00020000 */
#define USART_ICR_CMCF        USART_ICR_CMCF_Msk            /*!< Character Match Clear Flag */
#define USART_ICR_WUCF_Pos    (20U)
#define USART_ICR_WUCF_Msk    (0x1UL << USART_ICR_WUCF_Pos) /*!< 0x00100000 */
#define USART_ICR_WUCF        USART_ICR_WUCF_Msk            /*!< Wake Up from stop mode Clear Flag */

/*******************  Bit definition for USART_RDR register  ******************/
#define USART_RDR_RDR_Pos (0U)
#define USART_RDR_RDR_Msk (0x1FFUL << USART_RDR_RDR_Pos) /*!< 0x000001FF */
#define USART_RDR_RDR     USART_RDR_RDR_Msk              /*!< RDR[8:0] bits (Receive Data value) */

/*******************  Bit definition for USART_TDR register  ******************/
#define USART_TDR_TDR_Pos (0U)
#define USART_TDR_TDR_Msk (0x1FFUL << USART_TDR_TDR_Pos) /*!< 0x000001FF */
#define USART_TDR_TDR     USART_TDR_TDR_Msk              /*!< TDR[8:0] bits (Transmit Data value) */

/*******************  Bit definition for USART_PRESC register  ******************/
#define USART_PRESC_PRESCALER_Pos (0U)
#define USART_PRESC_PRESCALER_Msk (0xFUL << USART_PRESC_PRESCALER_Pos) /*!< 0x0000000F */
#define USART_PRESC_PRESCALER     USART_PRESC_PRESCALER_Msk            /*!< PRESCALER[3:0] bits (Clock prescaler) */
#define USART_PRESC_PRESCALER_0   (0x1UL << USART_PRESC_PRESCALER_Pos) /*!< 0x00000001 */
#define USART_PRESC_PRESCALER_1   (0x2UL << USART_PRESC_PRESCALER_Pos) /*!< 0x00000002 */
#define USART_PRESC_PRESCALER_2   (0x4UL << USART_PRESC_PRESCALER_Pos) /*!< 0x00000004 */
#define USART_PRESC_PRESCALER_3   (0x8UL << USART_PRESC_PRESCALER_Pos) /*!< 0x00000008 */

/******************************************************************************/
/*                                                                            */
/*           Single Wire Protocol Master Interface (SWPMI)                    */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for SWPMI_CR register   ********************/
#define SWPMI_CR_RXDMA_Pos  (0U)
#define SWPMI_CR_RXDMA_Msk  (0x1UL << SWPMI_CR_RXDMA_Pos) /*!< 0x00000001 */
#define SWPMI_CR_RXDMA      SWPMI_CR_RXDMA_Msk            /*!<Reception DMA enable                                 */
#define SWPMI_CR_TXDMA_Pos  (1U)
#define SWPMI_CR_TXDMA_Msk  (0x1UL << SWPMI_CR_TXDMA_Pos) /*!< 0x00000002 */
#define SWPMI_CR_TXDMA      SWPMI_CR_TXDMA_Msk            /*!<Transmission DMA enable                              */
#define SWPMI_CR_RXMODE_Pos (2U)
#define SWPMI_CR_RXMODE_Msk (0x1UL << SWPMI_CR_RXMODE_Pos) /*!< 0x00000004 */
#define SWPMI_CR_RXMODE     SWPMI_CR_RXMODE_Msk            /*!<Reception buffering mode                             */
#define SWPMI_CR_TXMODE_Pos (3U)
#define SWPMI_CR_TXMODE_Msk (0x1UL << SWPMI_CR_TXMODE_Pos) /*!< 0x00000008 */
#define SWPMI_CR_TXMODE     SWPMI_CR_TXMODE_Msk            /*!<Transmission buffering mode                          */
#define SWPMI_CR_LPBK_Pos   (4U)
#define SWPMI_CR_LPBK_Msk   (0x1UL << SWPMI_CR_LPBK_Pos) /*!< 0x00000010 */
#define SWPMI_CR_LPBK       SWPMI_CR_LPBK_Msk            /*!<Loopback mode enable                                 */
#define SWPMI_CR_SWPACT_Pos (5U)
#define SWPMI_CR_SWPACT_Msk (0x1UL << SWPMI_CR_SWPACT_Pos) /*!< 0x00000020 */
#define SWPMI_CR_SWPACT     SWPMI_CR_SWPACT_Msk            /*!<Single wire protocol master interface activate       */
#define SWPMI_CR_DEACT_Pos  (10U)
#define SWPMI_CR_DEACT_Msk  (0x1UL << SWPMI_CR_DEACT_Pos) /*!< 0x00000400 */
#define SWPMI_CR_DEACT      SWPMI_CR_DEACT_Msk            /*!<Single wire protocol master interface deactivate     */
#define SWPMI_CR_SWPEN_Pos  (11U)
#define SWPMI_CR_SWPEN_Msk  (0x1UL << SWPMI_CR_SWPEN_Pos) /*!< 0x00000800 */
#define SWPMI_CR_SWPEN      SWPMI_CR_SWPEN_Msk            /*!<Single wire protocol master transceiver enable       */

