Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for SWPMI_BRR register  ********************/
#define SWPMI_BRR_BR_Pos (0U)
#define SWPMI_BRR_BR_Msk (0xFFUL << SWPMI_BRR_BR_Pos) /*!< 0x000000FF */
#define SWPMI_BRR_BR     SWPMI_BRR_BR_Msk             /*!<BR[7:0] bits (Bitrate prescaler) */

/*******************  Bit definition for SWPMI_ISR register  ********************/
#define SWPMI_ISR_RXBFF_Pos  (0U)
#define SWPMI_ISR_RXBFF_Msk  (0x1UL << SWPMI_ISR_RXBFF_Pos) /*!< 0x00000001 */
#define SWPMI_ISR_RXBFF      SWPMI_ISR_RXBFF_Msk            /*!<Receive buffer full flag        */
#define SWPMI_ISR_TXBEF_Pos  (1U)
#define SWPMI_ISR_TXBEF_Msk  (0x1UL << SWPMI_ISR_TXBEF_Pos) /*!< 0x00000002 */
#define SWPMI_ISR_TXBEF      SWPMI_ISR_TXBEF_Msk            /*!<Transmit buffer empty flag      */
#define SWPMI_ISR_RXBERF_Pos (2U)
#define SWPMI_ISR_RXBERF_Msk (0x1UL << SWPMI_ISR_RXBERF_Pos) /*!< 0x00000004 */
#define SWPMI_ISR_RXBERF     SWPMI_ISR_RXBERF_Msk            /*!<Receive CRC error flag          */
#define SWPMI_ISR_RXOVRF_Pos (3U)
#define SWPMI_ISR_RXOVRF_Msk (0x1UL << SWPMI_ISR_RXOVRF_Pos) /*!< 0x00000008 */
#define SWPMI_ISR_RXOVRF     SWPMI_ISR_RXOVRF_Msk            /*!<Receive overrun error flag      */
#define SWPMI_ISR_TXUNRF_Pos (4U)
#define SWPMI_ISR_TXUNRF_Msk (0x1UL << SWPMI_ISR_TXUNRF_Pos) /*!< 0x00000010 */
#define SWPMI_ISR_TXUNRF     SWPMI_ISR_TXUNRF_Msk            /*!<Transmit underrun error flag    */
#define SWPMI_ISR_RXNE_Pos   (5U)
#define SWPMI_ISR_RXNE_Msk   (0x1UL << SWPMI_ISR_RXNE_Pos) /*!< 0x00000020 */
#define SWPMI_ISR_RXNE       SWPMI_ISR_RXNE_Msk            /*!<Receive data register not empty */
#define SWPMI_ISR_TXE_Pos    (6U)
#define SWPMI_ISR_TXE_Msk    (0x1UL << SWPMI_ISR_TXE_Pos) /*!< 0x00000040 */
#define SWPMI_ISR_TXE        SWPMI_ISR_TXE_Msk            /*!<Transmit data register empty    */
#define SWPMI_ISR_TCF_Pos    (7U)
#define SWPMI_ISR_TCF_Msk    (0x1UL << SWPMI_ISR_TCF_Pos) /*!< 0x00000080 */
#define SWPMI_ISR_TCF        SWPMI_ISR_TCF_Msk            /*!<Transfer complete flag          */
#define SWPMI_ISR_SRF_Pos    (8U)
#define SWPMI_ISR_SRF_Msk    (0x1UL << SWPMI_ISR_SRF_Pos) /*!< 0x00000100 */
#define SWPMI_ISR_SRF        SWPMI_ISR_SRF_Msk            /*!<Slave resume flag               */
#define SWPMI_ISR_SUSP_Pos   (9U)
#define SWPMI_ISR_SUSP_Msk   (0x1UL << SWPMI_ISR_SUSP_Pos) /*!< 0x00000200 */
#define SWPMI_ISR_SUSP       SWPMI_ISR_SUSP_Msk            /*!<SUSPEND flag                    */
#define SWPMI_ISR_DEACTF_Pos (10U)
#define SWPMI_ISR_DEACTF_Msk (0x1UL << SWPMI_ISR_DEACTF_Pos) /*!< 0x00000400 */
#define SWPMI_ISR_DEACTF     SWPMI_ISR_DEACTF_Msk            /*!<DEACTIVATED flag                */
#define SWPMI_ISR_RDYF_Pos   (11U)
#define SWPMI_ISR_RDYF_Msk   (0x1UL << SWPMI_ISR_RDYF_Pos) /*!< 0x00000800 */
#define SWPMI_ISR_RDYF       SWPMI_ISR_RDYF_Msk            /*!<Transceiver ready flag          */

/*******************  Bit definition for SWPMI_ICR register  ********************/
#define SWPMI_ICR_CRXBFF_Pos  (0U)
#define SWPMI_ICR_CRXBFF_Msk  (0x1UL << SWPMI_ICR_CRXBFF_Pos) /*!< 0x00000001 */
#define SWPMI_ICR_CRXBFF      SWPMI_ICR_CRXBFF_Msk            /*!<Clear receive buffer full flag       */
#define SWPMI_ICR_CTXBEF_Pos  (1U)
#define SWPMI_ICR_CTXBEF_Msk  (0x1UL << SWPMI_ICR_CTXBEF_Pos) /*!< 0x00000002 */
#define SWPMI_ICR_CTXBEF      SWPMI_ICR_CTXBEF_Msk            /*!<Clear transmit buffer empty flag     */
#define SWPMI_ICR_CRXBERF_Pos (2U)
#define SWPMI_ICR_CRXBERF_Msk (0x1UL << SWPMI_ICR_CRXBERF_Pos) /*!< 0x00000004 */
#define SWPMI_ICR_CRXBERF     SWPMI_ICR_CRXBERF_Msk            /*!<Clear receive CRC error flag         */
#define SWPMI_ICR_CRXOVRF_Pos (3U)
#define SWPMI_ICR_CRXOVRF_Msk (0x1UL << SWPMI_ICR_CRXOVRF_Pos) /*!< 0x00000008 */
#define SWPMI_ICR_CRXOVRF     SWPMI_ICR_CRXOVRF_Msk            /*!<Clear receive overrun error flag     */
#define SWPMI_ICR_CTXUNRF_Pos (4U)
#define SWPMI_ICR_CTXUNRF_Msk (0x1UL << SWPMI_ICR_CTXUNRF_Pos) /*!< 0x00000010 */
#define SWPMI_ICR_CTXUNRF     SWPMI_ICR_CTXUNRF_Msk            /*!<Clear transmit underrun error flag   */
#define SWPMI_ICR_CTCF_Pos    (7U)
#define SWPMI_ICR_CTCF_Msk    (0x1UL << SWPMI_ICR_CTCF_Pos) /*!< 0x00000080 */
#define SWPMI_ICR_CTCF        SWPMI_ICR_CTCF_Msk            /*!<Clear transfer complete flag         */
#define SWPMI_ICR_CSRF_Pos    (8U)
#define SWPMI_ICR_CSRF_Msk    (0x1UL << SWPMI_ICR_CSRF_Pos) /*!< 0x00000100 */
#define SWPMI_ICR_CSRF        SWPMI_ICR_CSRF_Msk            /*!<Clear slave resume flag              */
#define SWPMI_ICR_CRDYF_Pos   (11U)
#define SWPMI_ICR_CRDYF_Msk   (0x1UL << SWPMI_ICR_CRDYF_Pos) /*!< 0x00000800 */
#define SWPMI_ICR_CRDYF       SWPMI_ICR_CRDYF_Msk            /*!<Clear transceiver ready flag         */

/*******************  Bit definition for SWPMI_IER register  ********************/
#define SWPMI_IER_RXBFIE_Pos  (0U)
#define SWPMI_IER_RXBFIE_Msk  (0x1UL << SWPMI_IER_RXBFIE_Pos) /*!< 0x00000001 */
#define SWPMI_IER_RXBFIE      SWPMI_IER_RXBFIE_Msk            /*!<Receive buffer full interrupt enable        */
#define SWPMI_IER_TXBEIE_Pos  (1U)
#define SWPMI_IER_TXBEIE_Msk  (0x1UL << SWPMI_IER_TXBEIE_Pos) /*!< 0x00000002 */
#define SWPMI_IER_TXBEIE      SWPMI_IER_TXBEIE_Msk            /*!<Transmit buffer empty interrupt enable      */
#define SWPMI_IER_RXBERIE_Pos (2U)
#define SWPMI_IER_RXBERIE_Msk (0x1UL << SWPMI_IER_RXBERIE_Pos) /*!< 0x00000004 */
#define SWPMI_IER_RXBERIE     SWPMI_IER_RXBERIE_Msk            /*!<Receive CRC error interrupt enable          */
#define SWPMI_IER_RXOVRIE_Pos (3U)
#define SWPMI_IER_RXOVRIE_Msk (0x1UL << SWPMI_IER_RXOVRIE_Pos) /*!< 0x00000008 */
#define SWPMI_IER_RXOVRIE     SWPMI_IER_RXOVRIE_Msk            /*!<Receive overrun error interrupt enable      */
#define SWPMI_IER_TXUNRIE_Pos (4U)
#define SWPMI_IER_TXUNRIE_Msk (0x1UL << SWPMI_IER_TXUNRIE_Pos) /*!< 0x00000010 */
#define SWPMI_IER_TXUNRIE     SWPMI_IER_TXUNRIE_Msk            /*!<Transmit underrun error interrupt enable    */
#define SWPMI_IER_RIE_Pos     (5U)
#define SWPMI_IER_RIE_Msk     (0x1UL << SWPMI_IER_RIE_Pos) /*!< 0x00000020 */
#define SWPMI_IER_RIE         SWPMI_IER_RIE_Msk            /*!<Receive interrupt enable                    */
#define SWPMI_IER_TIE_Pos     (6U)
#define SWPMI_IER_TIE_Msk     (0x1UL << SWPMI_IER_TIE_Pos) /*!< 0x00000040 */
#define SWPMI_IER_TIE         SWPMI_IER_TIE_Msk            /*!<Transmit interrupt enable                   */
#define SWPMI_IER_TCIE_Pos    (7U)
#define SWPMI_IER_TCIE_Msk    (0x1UL << SWPMI_IER_TCIE_Pos) /*!< 0x00000080 */
#define SWPMI_IER_TCIE        SWPMI_IER_TCIE_Msk            /*!<Transmit complete interrupt enable          */
#define SWPMI_IER_SRIE_Pos    (8U)
#define SWPMI_IER_SRIE_Msk    (0x1UL << SWPMI_IER_SRIE_Pos) /*!< 0x00000100 */
#define SWPMI_IER_SRIE        SWPMI_IER_SRIE_Msk            /*!<Slave resume interrupt enable               */
#define SWPMI_IER_RDYIE_Pos   (11U)
#define SWPMI_IER_RDYIE_Msk   (0x1UL << SWPMI_IER_RDYIE_Pos) /*!< 0x00000800 */
#define SWPMI_IER_RDYIE       SWPMI_IER_RDYIE_Msk            /*!<Transceiver ready interrupt enable          */

/*******************  Bit definition for SWPMI_RFL register  ********************/
#define SWPMI_RFL_RFL_Pos (0U)
#define SWPMI_RFL_RFL_Msk (0x1FUL << SWPMI_RFL_RFL_Pos) /*!< 0x0000001F */
#define SWPMI_RFL_RFL     SWPMI_RFL_RFL_Msk             /*!<RFL[4:0] bits (Receive Frame length) */
#define SWPMI_RFL_RFL_0_1                                                                                              \
  (0x00000003U) /*!<RFL[1:0] bits (number of relevant bytes for the last SWPMI_RDR register read.) */

/*******************  Bit definition for SWPMI_TDR register  ********************/
#define SWPMI_TDR_TD_Pos (0U)
#define SWPMI_TDR_TD_Msk (0xFFFFFFFFUL << SWPMI_TDR_TD_Pos) /*!< 0xFFFFFFFF */
#define SWPMI_TDR_TD     SWPMI_TDR_TD_Msk                   /*!<Transmit Data Register         */

