Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for SWPMI_RDR register  ********************/
#define SWPMI_RDR_RD_Pos (0U)
#define SWPMI_RDR_RD_Msk (0xFFFFFFFFUL << SWPMI_RDR_RD_Pos) /*!< 0xFFFFFFFF */
#define SWPMI_RDR_RD     SWPMI_RDR_RD_Msk                   /*!<Receive Data Register           */

/*******************  Bit definition for SWPMI_OR register  ********************/
#define SWPMI_OR_TBYP_Pos  (0U)
#define SWPMI_OR_TBYP_Msk  (0x1UL << SWPMI_OR_TBYP_Pos) /*!< 0x00000001 */
#define SWPMI_OR_TBYP      SWPMI_OR_TBYP_Msk            /*!<SWP Transceiver Bypass */
#define SWPMI_OR_CLASS_Pos (1U)
#define SWPMI_OR_CLASS_Msk (0x1UL << SWPMI_OR_CLASS_Pos) /*!< 0x00000002 */
#define SWPMI_OR_CLASS     SWPMI_OR_CLASS_Msk            /*!<SWP CLASS selection */

/******************************************************************************/
/*                                                                            */
/*                            Window WATCHDOG                                 */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for WWDG_CR register  ********************/
#define WWDG_CR_T_Pos    (0U)
#define WWDG_CR_T_Msk    (0x7FUL << WWDG_CR_T_Pos) /*!< 0x0000007F */
#define WWDG_CR_T        WWDG_CR_T_Msk             /*!<T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define WWDG_CR_T_0      (0x01UL << WWDG_CR_T_Pos) /*!< 0x00000001 */
#define WWDG_CR_T_1      (0x02UL << WWDG_CR_T_Pos) /*!< 0x00000002 */
#define WWDG_CR_T_2      (0x04UL << WWDG_CR_T_Pos) /*!< 0x00000004 */
#define WWDG_CR_T_3      (0x08UL << WWDG_CR_T_Pos) /*!< 0x00000008 */
#define WWDG_CR_T_4      (0x10UL << WWDG_CR_T_Pos) /*!< 0x00000010 */
#define WWDG_CR_T_5      (0x20UL << WWDG_CR_T_Pos) /*!< 0x00000020 */
#define WWDG_CR_T_6      (0x40UL << WWDG_CR_T_Pos) /*!< 0x00000040 */

#define WWDG_CR_WDGA_Pos (7U)
#define WWDG_CR_WDGA_Msk (0x1UL << WWDG_CR_WDGA_Pos) /*!< 0x00000080 */
#define WWDG_CR_WDGA     WWDG_CR_WDGA_Msk            /*!<Activation bit */

/*******************  Bit definition for WWDG_CFR register  *******************/
#define WWDG_CFR_W_Pos     (0U)
#define WWDG_CFR_W_Msk     (0x7FUL << WWDG_CFR_W_Pos) /*!< 0x0000007F */
#define WWDG_CFR_W         WWDG_CFR_W_Msk             /*!<W[6:0] bits (7-bit window value) */
#define WWDG_CFR_W_0       (0x01UL << WWDG_CFR_W_Pos) /*!< 0x00000001 */
#define WWDG_CFR_W_1       (0x02UL << WWDG_CFR_W_Pos) /*!< 0x00000002 */
#define WWDG_CFR_W_2       (0x04UL << WWDG_CFR_W_Pos) /*!< 0x00000004 */
#define WWDG_CFR_W_3       (0x08UL << WWDG_CFR_W_Pos) /*!< 0x00000008 */
#define WWDG_CFR_W_4       (0x10UL << WWDG_CFR_W_Pos) /*!< 0x00000010 */
#define WWDG_CFR_W_5       (0x20UL << WWDG_CFR_W_Pos) /*!< 0x00000020 */
#define WWDG_CFR_W_6       (0x40UL << WWDG_CFR_W_Pos) /*!< 0x00000040 */

#define WWDG_CFR_EWI_Pos   (9U)
#define WWDG_CFR_EWI_Msk   (0x1UL << WWDG_CFR_EWI_Pos) /*!< 0x00000200 */
#define WWDG_CFR_EWI       WWDG_CFR_EWI_Msk            /*!<Early Wakeup Interrupt */

#define WWDG_CFR_WDGTB_Pos (11U)
#define WWDG_CFR_WDGTB_Msk (0x7UL << WWDG_CFR_WDGTB_Pos) /*!< 0x00003800 */
#define WWDG_CFR_WDGTB     WWDG_CFR_WDGTB_Msk            /*!<WDGTB[2:0] bits (Timer Base) */
#define WWDG_CFR_WDGTB_0   (0x1UL << WWDG_CFR_WDGTB_Pos) /*!< 0x00000800 */
#define WWDG_CFR_WDGTB_1   (0x2UL << WWDG_CFR_WDGTB_Pos) /*!< 0x00001000 */
#define WWDG_CFR_WDGTB_2   (0x4UL << WWDG_CFR_WDGTB_Pos) /*!< 0x00002000 */

/*******************  Bit definition for WWDG_SR register  ********************/
#define WWDG_SR_EWIF_Pos (0U)
#define WWDG_SR_EWIF_Msk (0x1UL << WWDG_SR_EWIF_Pos) /*!< 0x00000001 */
#define WWDG_SR_EWIF     WWDG_SR_EWIF_Msk            /*!<Early Wakeup Interrupt Flag */

/******************************************************************************/
/*                                                                            */
/*                                DBG                                         */
/*                                                                            */
/******************************************************************************/
/*********************************  DEVICE ID  ********************************/
#define STM32H7_DEV_ID 0x480UL

/********************  Bit definition for DBGMCU_IDCODE register  *************/
#define DBGMCU_IDCODE_DEV_ID_Pos (0U)
#define DBGMCU_IDCODE_DEV_ID_Msk (0xFFFUL << DBGMCU_IDCODE_DEV_ID_Pos) /*!< 0x00000FFF */
#define DBGMCU_IDCODE_DEV_ID     DBGMCU_IDCODE_DEV_ID_Msk
#define DBGMCU_IDCODE_REV_ID_Pos (16U)
#define DBGMCU_IDCODE_REV_ID_Msk (0xFFFFUL << DBGMCU_IDCODE_REV_ID_Pos) /*!< 0xFFFF0000 */
#define DBGMCU_IDCODE_REV_ID     DBGMCU_IDCODE_REV_ID_Msk

/********************  Bit definition for DBGMCU_CR register  *****************/
#define DBGMCU_CR_DBG_SLEEPCD_Pos   (0U)
#define DBGMCU_CR_DBG_SLEEPCD_Msk   (0x1UL << DBGMCU_CR_DBG_SLEEPCD_Pos) /*!< 0x00000001 */
#define DBGMCU_CR_DBG_SLEEPCD       DBGMCU_CR_DBG_SLEEPCD_Msk
#define DBGMCU_CR_DBG_STOPCD_Pos    (1U)
#define DBGMCU_CR_DBG_STOPCD_Msk    (0x1UL << DBGMCU_CR_DBG_STOPCD_Pos) /*!< 0x00000002 */
#define DBGMCU_CR_DBG_STOPCD        DBGMCU_CR_DBG_STOPCD_Msk
#define DBGMCU_CR_DBG_STANDBYCD_Pos (2U)
#define DBGMCU_CR_DBG_STANDBYCD_Msk (0x1UL << DBGMCU_CR_DBG_STANDBYCD_Pos) /*!< 0x00000004 */
#define DBGMCU_CR_DBG_STANDBYCD     DBGMCU_CR_DBG_STANDBYCD_Msk

/* Legacy defines */
#define DBGMCU_CR_DBG_SLEEPD1_Pos    DBGMCU_CR_DBG_SLEEPCD_Pos
#define DBGMCU_CR_DBG_SLEEPD1_Msk    DBGMCU_CR_DBG_SLEEPCD_Msk
#define DBGMCU_CR_DBG_SLEEPD1        DBGMCU_CR_DBG_SLEEPCD
#define DBGMCU_CR_DBG_STOPD1_Pos     DBGMCU_CR_DBG_STOPCD_Pos
#define DBGMCU_CR_DBG_STOPD1_Msk     DBGMCU_CR_DBG_STOPCD_Msk
#define DBGMCU_CR_DBG_STOPD1         DBGMCU_CR_DBG_STOPCD
#define DBGMCU_CR_DBG_STANDBYD1_Pos  DBGMCU_CR_DBG_STANDBYCD_Pos
#define DBGMCU_CR_DBG_STANDBYD1_Msk  DBGMCU_CR_DBG_STANDBYCD_Msk
#define DBGMCU_CR_DBG_STANDBYD1      DBGMCU_CR_DBG_STANDBYCD
#define DBGMCU_CR_DBG_STOPSRD_Pos    (7U)
#define DBGMCU_CR_DBG_STOPSRD_Msk    (0x1UL << DBGMCU_CR_DBG_STOPSRD_Pos) /*!< 0x00000080 */
#define DBGMCU_CR_DBG_STOPSRD        DBGMCU_CR_DBG_STOPSRD_Msk
#define DBGMCU_CR_DBG_STANDBYSRD_Pos (8U)
#define DBGMCU_CR_DBG_STANDBYSRD_Msk (0x1UL << DBGMCU_CR_DBG_STANDBYSRD_Pos) /*!< 0x00000100 */
#define DBGMCU_CR_DBG_STANDBYSRD     DBGMCU_CR_DBG_STANDBYSRD_Msk

