Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/*******************  Bit definition for RAMECC_CR register  ******************/
#define RAMECC_CR_ECCELEN_Pos   (5U)
#define RAMECC_CR_ECCELEN_Msk   (0x1UL << RAMECC_CR_ECCELEN_Pos) /*!< 0x00000020 */
#define RAMECC_CR_ECCELEN       RAMECC_CR_ECCELEN_Msk            /*!< ECC error latching enable */
#define RAMECC_CR_ECCDEBWIE_Pos (4U)
#define RAMECC_CR_ECCDEBWIE_Msk (0x1UL << RAMECC_CR_ECCDEBWIE_Pos) /*!< 0x00000010 */
#define RAMECC_CR_ECCDEBWIE     RAMECC_CR_ECCDEBWIE_Msk /*!< ECC double error on byte write (BW) interrupt enable */
#define RAMECC_CR_ECCDEIE_Pos   (3U)
#define RAMECC_CR_ECCDEIE_Msk   (0x1UL << RAMECC_CR_ECCDEIE_Pos) /*!< 0x00000008 */
#define RAMECC_CR_ECCDEIE       RAMECC_CR_ECCDEIE_Msk            /*!< ECC double error interrupt enable */
#define RAMECC_CR_ECCSEIE_Pos   (2U)
#define RAMECC_CR_ECCSEIE_Msk   (0x1UL << RAMECC_CR_ECCSEIE_Pos) /*!< 0x00000004 */
#define RAMECC_CR_ECCSEIE       RAMECC_CR_ECCSEIE_Msk            /*!< ECC single error interrupt enable */

/*******************  Bit definition for RAMECC_SR register  ******************/
#define RAMECC_SR_DEBWDF_Pos (2U)
#define RAMECC_SR_DEBWDF_Msk (0x1UL << RAMECC_SR_DEBWDF_Pos) /*!< 0x00000004 */
#define RAMECC_SR_DEBWDF     RAMECC_SR_DEBWDF_Msk            /*!< ECC double error on byte write (BW) detected flag */
#define RAMECC_SR_DEDF_Pos   (1U)
#define RAMECC_SR_DEDF_Msk   (0x1UL << RAMECC_SR_DEDF_Pos) /*!< 0x00000002 */
#define RAMECC_SR_DEDF       RAMECC_SR_DEDF_Msk            /*!< ECC double error detected flag */
#define RAMECC_SR_SEDCF_Pos  (0U)
#define RAMECC_SR_SEDCF_Msk  (0x1UL << RAMECC_SR_SEDCF_Pos) /*!< 0x00000001 */
#define RAMECC_SR_SEDCF      RAMECC_SR_SEDCF_Msk            /*!< ECC single error detected and corrected flag */

/******************  Bit definition for RAMECC_FAR register  ******************/
#define RAMECC_FAR_FADD_Pos (0U)
#define RAMECC_FAR_FADD_Msk (0xFFFFFFFFUL << RAMECC_FAR_FADD_Pos) /*!< 0xFFFFFFFF */
#define RAMECC_FAR_FADD     RAMECC_FAR_FADD_Msk                   /*!< ECC error failing address */

/******************  Bit definition for RAMECC_FDRL register  *****************/
#define RAMECC_FAR_FDATAL_Pos (0U)
#define RAMECC_FAR_FDATAL_Msk (0xFFFFFFFFUL << RAMECC_FAR_FDATAL_Pos) /*!< 0xFFFFFFFF */
#define RAMECC_FAR_FDATAL     RAMECC_FAR_FDATAL_Msk                   /*!< ECC error failing address */

/******************  Bit definition for RAMECC_FDRH register  *****************/
#define RAMECC_FAR_FDATAH_Pos (0U)
#define RAMECC_FAR_FDATAH_Msk (0xFFFFFFFFUL << RAMECC_FAR_FDATAH_Pos) /*!< 0xFFFFFFFF */
#define RAMECC_FAR_FDATAH     RAMECC_FAR_FDATAH_Msk                   /* Failing data high (64-bit memory) */

/*****************  Bit definition for RAMECC_FECR register  ******************/
#define RAMECC_FECR_FEC_Pos (0U)
#define RAMECC_FECR_FEC_Msk (0xFFFFFFFFUL << RAMECC_FECR_FEC_Pos) /*!< 0xFFFFFFFF */
#define RAMECC_FECR_FEC     RAMECC_FECR_FEC_Msk                   /*!< Failing error code */

/******************************************************************************/
/*                                                                            */
/*                                MDIOS                                        */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition for MDIOS_CR register  *******************/
#define MDIOS_CR_EN_Pos           (0U)
#define MDIOS_CR_EN_Msk           (0x1UL << MDIOS_CR_EN_Pos) /*!< 0x00000001 */
#define MDIOS_CR_EN               MDIOS_CR_EN_Msk            /*!<  MDIOS slave peripheral enable */
#define MDIOS_CR_WRIE_Pos         (1U)
#define MDIOS_CR_WRIE_Msk         (0x1UL << MDIOS_CR_WRIE_Pos) /*!< 0x00000002 */
#define MDIOS_CR_WRIE             MDIOS_CR_WRIE_Msk            /*!<  MDIOS slave register write interrupt enable. */
#define MDIOS_CR_RDIE_Pos         (2U)
#define MDIOS_CR_RDIE_Msk         (0x1UL << MDIOS_CR_RDIE_Pos) /*!< 0x00000004 */
#define MDIOS_CR_RDIE             MDIOS_CR_RDIE_Msk            /*!<  MDIOS slave register read interrupt enable. */
#define MDIOS_CR_EIE_Pos          (3U)
#define MDIOS_CR_EIE_Msk          (0x1UL << MDIOS_CR_EIE_Pos) /*!< 0x00000008 */
#define MDIOS_CR_EIE              MDIOS_CR_EIE_Msk            /*!<  MDIOS slave register error interrupt enable. */
#define MDIOS_CR_DPC_Pos          (7U)
#define MDIOS_CR_DPC_Msk          (0x1UL << MDIOS_CR_DPC_Pos) /*!< 0x00000080 */
#define MDIOS_CR_DPC              MDIOS_CR_DPC_Msk            /*!<  MDIOS slave disable preamble check. */
#define MDIOS_CR_PORT_ADDRESS_Pos (8U)
#define MDIOS_CR_PORT_ADDRESS_Msk (0x1FUL << MDIOS_CR_PORT_ADDRESS_Pos) /*!< 0x00001F00 */
#define MDIOS_CR_PORT_ADDRESS     MDIOS_CR_PORT_ADDRESS_Msk             /*!<  MDIOS slave port address mask. */
#define MDIOS_CR_PORT_ADDRESS_0   (0x01UL << MDIOS_CR_PORT_ADDRESS_Pos) /*!< 0x00000100 */
#define MDIOS_CR_PORT_ADDRESS_1   (0x02UL << MDIOS_CR_PORT_ADDRESS_Pos) /*!< 0x00000200 */
#define MDIOS_CR_PORT_ADDRESS_2   (0x04UL << MDIOS_CR_PORT_ADDRESS_Pos) /*!< 0x00000400 */
#define MDIOS_CR_PORT_ADDRESS_3   (0x08UL << MDIOS_CR_PORT_ADDRESS_Pos) /*!< 0x00000800 */
#define MDIOS_CR_PORT_ADDRESS_4   (0x10UL << MDIOS_CR_PORT_ADDRESS_Pos) /*!< 0x00001000 */

/********************  Bit definition for MDIOS_SR register  *******************/
#define MDIOS_SR_PERF_Pos (0U)
#define MDIOS_SR_PERF_Msk (0x1UL << MDIOS_SR_PERF_Pos) /*!< 0x00000001 */
#define MDIOS_SR_PERF     MDIOS_SR_PERF_Msk            /*!<  MDIOS slave turnaround error flag*/
#define MDIOS_SR_SERF_Pos (1U)
#define MDIOS_SR_SERF_Msk (0x1UL << MDIOS_SR_SERF_Pos) /*!< 0x00000002 */
#define MDIOS_SR_SERF     MDIOS_SR_SERF_Msk            /*!<  MDIOS slave start error flag */
#define MDIOS_SR_TERF_Pos (2U)
#define MDIOS_SR_TERF_Msk (0x1UL << MDIOS_SR_TERF_Pos) /*!< 0x00000004 */
#define MDIOS_SR_TERF     MDIOS_SR_TERF_Msk            /*!<  MDIOS slave preamble error flag */

/********************  Bit definition for MDIOS_CLRFR register  *******************/
#define MDIOS_SR_CPERF_Pos (0U)
#define MDIOS_SR_CPERF_Msk (0x1UL << MDIOS_SR_CPERF_Pos) /*!< 0x00000001 */
#define MDIOS_SR_CPERF     MDIOS_SR_CPERF_Msk            /*!<  MDIOS slave Clear the turnaround error flag */
#define MDIOS_SR_CSERF_Pos (1U)
#define MDIOS_SR_CSERF_Msk (0x1UL << MDIOS_SR_CSERF_Pos) /*!< 0x00000002 */
#define MDIOS_SR_CSERF     MDIOS_SR_CSERF_Msk            /*!<  MDIOS slave Clear the start error flag */
#define MDIOS_SR_CTERF_Pos (2U)
#define MDIOS_SR_CTERF_Msk (0x1UL << MDIOS_SR_CTERF_Pos) /*!< 0x00000004 */
#define MDIOS_SR_CTERF     MDIOS_SR_CTERF_Msk            /*!<  MDIOS slave Clear the preamble error flag */

/******************************************************************************/
/*                                                                            */
/*                                       USB_OTG                              */
/*                                                                            */
/******************************************************************************/
/********************  Bit definition forUSB_OTG_GOTGCTL register  ********************/
#define USB_OTG_GOTGCTL_SRQSCS_Pos    (0U)
#define USB_OTG_GOTGCTL_SRQSCS_Msk    (0x1UL << USB_OTG_GOTGCTL_SRQSCS_Pos) /*!< 0x00000001 */
#define USB_OTG_GOTGCTL_SRQSCS        USB_OTG_GOTGCTL_SRQSCS_Msk            /*!< Session request success */
#define USB_OTG_GOTGCTL_SRQ_Pos       (1U)
#define USB_OTG_GOTGCTL_SRQ_Msk       (0x1UL << USB_OTG_GOTGCTL_SRQ_Pos) /*!< 0x00000002 */
#define USB_OTG_GOTGCTL_SRQ           USB_OTG_GOTGCTL_SRQ_Msk            /*!< Session request */
#define USB_OTG_GOTGCTL_VBVALOEN_Pos  (2U)
#define USB_OTG_GOTGCTL_VBVALOEN_Msk  (0x1UL << USB_OTG_GOTGCTL_VBVALOEN_Pos) /*!< 0x00000004 */
#define USB_OTG_GOTGCTL_VBVALOEN      USB_OTG_GOTGCTL_VBVALOEN_Msk            /*!< VBUS valid override enable */
#define USB_OTG_GOTGCTL_VBVALOVAL_Pos (3U)
#define USB_OTG_GOTGCTL_VBVALOVAL_Msk (0x1UL << USB_OTG_GOTGCTL_VBVALOVAL_Pos) /*!< 0x00000008 */
#define USB_OTG_GOTGCTL_VBVALOVAL     USB_OTG_GOTGCTL_VBVALOVAL_Msk            /*!< VBUS valid override value */
#define USB_OTG_GOTGCTL_AVALOEN_Pos   (4U)
#define USB_OTG_GOTGCTL_AVALOEN_Msk   (0x1UL << USB_OTG_GOTGCTL_AVALOEN_Pos) /*!< 0x00000010 */
#define USB_OTG_GOTGCTL_AVALOEN       USB_OTG_GOTGCTL_AVALOEN_Msk /*!< A-peripheral session valid override enable */
#define USB_OTG_GOTGCTL_AVALOVAL_Pos  (5U)
#define USB_OTG_GOTGCTL_AVALOVAL_Msk  (0x1UL << USB_OTG_GOTGCTL_AVALOVAL_Pos) /*!< 0x00000020 */
#define USB_OTG_GOTGCTL_AVALOVAL      USB_OTG_GOTGCTL_AVALOVAL_Msk /*!< A-peripheral session valid override value */
#define USB_OTG_GOTGCTL_BVALOEN_Pos   (6U)
#define USB_OTG_GOTGCTL_BVALOEN_Msk   (0x1UL << USB_OTG_GOTGCTL_BVALOEN_Pos) /*!< 0x00000040 */
#define USB_OTG_GOTGCTL_BVALOEN       USB_OTG_GOTGCTL_BVALOEN_Msk /*!< B-peripheral session valid override enable */
#define USB_OTG_GOTGCTL_BVALOVAL_Pos  (7U)
#define USB_OTG_GOTGCTL_BVALOVAL_Msk  (0x1UL << USB_OTG_GOTGCTL_BVALOVAL_Pos) /*!< 0x00000080 */
#define USB_OTG_GOTGCTL_BVALOVAL      USB_OTG_GOTGCTL_BVALOVAL_Msk /*!< B-peripheral session valid override value  */
#define USB_OTG_GOTGCTL_HNGSCS_Pos    (8U)
#define USB_OTG_GOTGCTL_HNGSCS_Msk    (0x1UL << USB_OTG_GOTGCTL_HNGSCS_Pos) /*!< 0x00000100 */
#define USB_OTG_GOTGCTL_HNGSCS        USB_OTG_GOTGCTL_HNGSCS_Msk            /*!< Host set HNP enable */
#define USB_OTG_GOTGCTL_HNPRQ_Pos     (9U)
#define USB_OTG_GOTGCTL_HNPRQ_Msk     (0x1UL << USB_OTG_GOTGCTL_HNPRQ_Pos) /*!< 0x00000200 */
#define USB_OTG_GOTGCTL_HNPRQ         USB_OTG_GOTGCTL_HNPRQ_Msk            /*!< HNP request */
#define USB_OTG_GOTGCTL_HSHNPEN_Pos   (10U)
#define USB_OTG_GOTGCTL_HSHNPEN_Msk   (0x1UL << USB_OTG_GOTGCTL_HSHNPEN_Pos) /*!< 0x00000400 */
#define USB_OTG_GOTGCTL_HSHNPEN       USB_OTG_GOTGCTL_HSHNPEN_Msk            /*!< Host set HNP enable */
#define USB_OTG_GOTGCTL_DHNPEN_Pos    (11U)
#define USB_OTG_GOTGCTL_DHNPEN_Msk    (0x1UL << USB_OTG_GOTGCTL_DHNPEN_Pos) /*!< 0x00000800 */
#define USB_OTG_GOTGCTL_DHNPEN        USB_OTG_GOTGCTL_DHNPEN_Msk            /*!< Device HNP enabled */
#define USB_OTG_GOTGCTL_EHEN_Pos      (12U)
#define USB_OTG_GOTGCTL_EHEN_Msk      (0x1UL << USB_OTG_GOTGCTL_EHEN_Pos) /*!< 0x00001000 */
#define USB_OTG_GOTGCTL_EHEN          USB_OTG_GOTGCTL_EHEN_Msk            /*!< Embedded host enable */
#define USB_OTG_GOTGCTL_CIDSTS_Pos    (16U)
#define USB_OTG_GOTGCTL_CIDSTS_Msk    (0x1UL << USB_OTG_GOTGCTL_CIDSTS_Pos) /*!< 0x00010000 */
#define USB_OTG_GOTGCTL_CIDSTS        USB_OTG_GOTGCTL_CIDSTS_Msk            /*!< Connector ID status */
#define USB_OTG_GOTGCTL_DBCT_Pos      (17U)
#define USB_OTG_GOTGCTL_DBCT_Msk      (0x1UL << USB_OTG_GOTGCTL_DBCT_Pos) /*!< 0x00020000 */
#define USB_OTG_GOTGCTL_DBCT          USB_OTG_GOTGCTL_DBCT_Msk            /*!< Long/short debounce time */
#define USB_OTG_GOTGCTL_ASVLD_Pos     (18U)
#define USB_OTG_GOTGCTL_ASVLD_Msk     (0x1UL << USB_OTG_GOTGCTL_ASVLD_Pos) /*!< 0x00040000 */
#define USB_OTG_GOTGCTL_ASVLD         USB_OTG_GOTGCTL_ASVLD_Msk            /*!< A-session valid  */
#define USB_OTG_GOTGCTL_BSESVLD_Pos   (19U)
#define USB_OTG_GOTGCTL_BSESVLD_Msk   (0x1UL << USB_OTG_GOTGCTL_BSESVLD_Pos) /*!< 0x00080000 */
#define USB_OTG_GOTGCTL_BSESVLD       USB_OTG_GOTGCTL_BSESVLD_Msk            /*!< B-session valid */
#define USB_OTG_GOTGCTL_OTGVER_Pos    (20U)
#define USB_OTG_GOTGCTL_OTGVER_Msk    (0x1UL << USB_OTG_GOTGCTL_OTGVER_Pos) /*!< 0x00100000 */
#define USB_OTG_GOTGCTL_OTGVER        USB_OTG_GOTGCTL_OTGVER_Msk            /*!< OTG version  */
#define USB_OTG_GOTGCTL_CURMOD_Pos    (21U)
#define USB_OTG_GOTGCTL_CURMOD_Msk    (0x1UL << USB_OTG_GOTGCTL_CURMOD_Pos) /*!< 0x00200000 */
#define USB_OTG_GOTGCTL_CURMOD        USB_OTG_GOTGCTL_CURMOD_Msk            /*!< Current mode of operation */

/********************  Bit definition forUSB_OTG_HCFG register  ********************/

#define USB_OTG_HCFG_FSLSPCS_Pos (0U)
#define USB_OTG_HCFG_FSLSPCS_Msk (0x3UL << USB_OTG_HCFG_FSLSPCS_Pos) /*!< 0x00000003 */
#define USB_OTG_HCFG_FSLSPCS     USB_OTG_HCFG_FSLSPCS_Msk            /*!< FS/LS PHY clock select  */
#define USB_OTG_HCFG_FSLSPCS_0   (0x1UL << USB_OTG_HCFG_FSLSPCS_Pos) /*!< 0x00000001 */
#define USB_OTG_HCFG_FSLSPCS_1   (0x2UL << USB_OTG_HCFG_FSLSPCS_Pos) /*!< 0x00000002 */
#define USB_OTG_HCFG_FSLSS_Pos   (2U)
#define USB_OTG_HCFG_FSLSS_Msk   (0x1UL << USB_OTG_HCFG_FSLSS_Pos) /*!< 0x00000004 */
#define USB_OTG_HCFG_FSLSS       USB_OTG_HCFG_FSLSS_Msk            /*!< FS- and LS-only support */

/********************  Bit definition forUSB_OTG_DCFG register  ********************/

#define USB_OTG_DCFG_DSPD_Pos      (0U)
#define USB_OTG_DCFG_DSPD_Msk      (0x3UL << USB_OTG_DCFG_DSPD_Pos) /*!< 0x00000003 */
#define USB_OTG_DCFG_DSPD          USB_OTG_DCFG_DSPD_Msk            /*!< Device speed */
#define USB_OTG_DCFG_DSPD_0        (0x1UL << USB_OTG_DCFG_DSPD_Pos) /*!< 0x00000001 */
#define USB_OTG_DCFG_DSPD_1        (0x2UL << USB_OTG_DCFG_DSPD_Pos) /*!< 0x00000002 */
#define USB_OTG_DCFG_NZLSOHSK_Pos  (2U)
#define USB_OTG_DCFG_NZLSOHSK_Msk  (0x1UL << USB_OTG_DCFG_NZLSOHSK_Pos) /*!< 0x00000004 */
#define USB_OTG_DCFG_NZLSOHSK      USB_OTG_DCFG_NZLSOHSK_Msk            /*!< Nonzero-length status OUT handshake */

