Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define USB_OTG_DCFG_DAD_Pos       (4U)
#define USB_OTG_DCFG_DAD_Msk       (0x7FUL << USB_OTG_DCFG_DAD_Pos) /*!< 0x000007F0 */
#define USB_OTG_DCFG_DAD           USB_OTG_DCFG_DAD_Msk             /*!< Device address */
#define USB_OTG_DCFG_DAD_0         (0x01UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000010 */
#define USB_OTG_DCFG_DAD_1         (0x02UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000020 */
#define USB_OTG_DCFG_DAD_2         (0x04UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000040 */
#define USB_OTG_DCFG_DAD_3         (0x08UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000080 */
#define USB_OTG_DCFG_DAD_4         (0x10UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000100 */
#define USB_OTG_DCFG_DAD_5         (0x20UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000200 */
#define USB_OTG_DCFG_DAD_6         (0x40UL << USB_OTG_DCFG_DAD_Pos) /*!< 0x00000400 */

#define USB_OTG_DCFG_PFIVL_Pos     (11U)
#define USB_OTG_DCFG_PFIVL_Msk     (0x3UL << USB_OTG_DCFG_PFIVL_Pos) /*!< 0x00001800 */
#define USB_OTG_DCFG_PFIVL         USB_OTG_DCFG_PFIVL_Msk            /*!< Periodic (micro)frame interval */
#define USB_OTG_DCFG_PFIVL_0       (0x1UL << USB_OTG_DCFG_PFIVL_Pos) /*!< 0x00000800 */
#define USB_OTG_DCFG_PFIVL_1       (0x2UL << USB_OTG_DCFG_PFIVL_Pos) /*!< 0x00001000 */

#define USB_OTG_DCFG_XCVRDLY_Pos   (14U)
#define USB_OTG_DCFG_XCVRDLY_Msk   (0x1UL << USB_OTG_DCFG_XCVRDLY_Pos) /*!< 0x00004000 */
#define USB_OTG_DCFG_XCVRDLY       USB_OTG_DCFG_XCVRDLY_Msk            /*!< Transceiver delay */

#define USB_OTG_DCFG_ERRATIM_Pos   (15U)
#define USB_OTG_DCFG_ERRATIM_Msk   (0x1UL << USB_OTG_DCFG_ERRATIM_Pos) /*!< 0x00008000 */
#define USB_OTG_DCFG_ERRATIM       USB_OTG_DCFG_ERRATIM_Msk            /*!< Erratic error interrupt mask */

#define USB_OTG_DCFG_PERSCHIVL_Pos (24U)
#define USB_OTG_DCFG_PERSCHIVL_Msk (0x3UL << USB_OTG_DCFG_PERSCHIVL_Pos) /*!< 0x03000000 */
#define USB_OTG_DCFG_PERSCHIVL     USB_OTG_DCFG_PERSCHIVL_Msk            /*!< Periodic scheduling interval */
#define USB_OTG_DCFG_PERSCHIVL_0   (0x1UL << USB_OTG_DCFG_PERSCHIVL_Pos) /*!< 0x01000000 */
#define USB_OTG_DCFG_PERSCHIVL_1   (0x2UL << USB_OTG_DCFG_PERSCHIVL_Pos) /*!< 0x02000000 */

/********************  Bit definition forUSB_OTG_PCGCR register  ********************/
#define USB_OTG_PCGCR_STPPCLK_Pos  (0U)
#define USB_OTG_PCGCR_STPPCLK_Msk  (0x1UL << USB_OTG_PCGCR_STPPCLK_Pos) /*!< 0x00000001 */
#define USB_OTG_PCGCR_STPPCLK      USB_OTG_PCGCR_STPPCLK_Msk            /*!< Stop PHY clock */
#define USB_OTG_PCGCR_GATEHCLK_Pos (1U)
#define USB_OTG_PCGCR_GATEHCLK_Msk (0x1UL << USB_OTG_PCGCR_GATEHCLK_Pos) /*!< 0x00000002 */
#define USB_OTG_PCGCR_GATEHCLK     USB_OTG_PCGCR_GATEHCLK_Msk            /*!< Gate HCLK */
#define USB_OTG_PCGCR_PHYSUSP_Pos  (4U)
#define USB_OTG_PCGCR_PHYSUSP_Msk  (0x1UL << USB_OTG_PCGCR_PHYSUSP_Pos) /*!< 0x00000010 */
#define USB_OTG_PCGCR_PHYSUSP      USB_OTG_PCGCR_PHYSUSP_Msk            /*!< PHY suspended */

/********************  Bit definition forUSB_OTG_GOTGINT register  ********************/
#define USB_OTG_GOTGINT_SEDET_Pos   (2U)
#define USB_OTG_GOTGINT_SEDET_Msk   (0x1UL << USB_OTG_GOTGINT_SEDET_Pos) /*!< 0x00000004 */
#define USB_OTG_GOTGINT_SEDET       USB_OTG_GOTGINT_SEDET_Msk            /*!< Session end detected                   */
#define USB_OTG_GOTGINT_SRSSCHG_Pos (8U)
#define USB_OTG_GOTGINT_SRSSCHG_Msk (0x1UL << USB_OTG_GOTGINT_SRSSCHG_Pos) /*!< 0x00000100 */
#define USB_OTG_GOTGINT_SRSSCHG     USB_OTG_GOTGINT_SRSSCHG_Msk /*!< Session request success status change  */
#define USB_OTG_GOTGINT_HNSSCHG_Pos (9U)
#define USB_OTG_GOTGINT_HNSSCHG_Msk (0x1UL << USB_OTG_GOTGINT_HNSSCHG_Pos) /*!< 0x00000200 */
#define USB_OTG_GOTGINT_HNSSCHG     USB_OTG_GOTGINT_HNSSCHG_Msk /*!< Host negotiation success status change */
#define USB_OTG_GOTGINT_HNGDET_Pos  (17U)
#define USB_OTG_GOTGINT_HNGDET_Msk  (0x1UL << USB_OTG_GOTGINT_HNGDET_Pos) /*!< 0x00020000 */
#define USB_OTG_GOTGINT_HNGDET      USB_OTG_GOTGINT_HNGDET_Msk            /*!< Host negotiation detected              */
#define USB_OTG_GOTGINT_ADTOCHG_Pos (18U)
#define USB_OTG_GOTGINT_ADTOCHG_Msk (0x1UL << USB_OTG_GOTGINT_ADTOCHG_Pos) /*!< 0x00040000 */
#define USB_OTG_GOTGINT_ADTOCHG     USB_OTG_GOTGINT_ADTOCHG_Msk /*!< A-device timeout change                */
#define USB_OTG_GOTGINT_DBCDNE_Pos  (19U)
#define USB_OTG_GOTGINT_DBCDNE_Msk  (0x1UL << USB_OTG_GOTGINT_DBCDNE_Pos) /*!< 0x00080000 */
#define USB_OTG_GOTGINT_DBCDNE      USB_OTG_GOTGINT_DBCDNE_Msk            /*!< Debounce done                          */

/********************  Bit definition forUSB_OTG_DCTL register  ********************/
#define USB_OTG_DCTL_RWUSIG_Pos      (0U)
#define USB_OTG_DCTL_RWUSIG_Msk      (0x1UL << USB_OTG_DCTL_RWUSIG_Pos) /*!< 0x00000001 */
#define USB_OTG_DCTL_RWUSIG          USB_OTG_DCTL_RWUSIG_Msk            /*!< Remote wakeup signaling */
#define USB_OTG_DCTL_SDIS_Pos        (1U)
#define USB_OTG_DCTL_SDIS_Msk        (0x1UL << USB_OTG_DCTL_SDIS_Pos) /*!< 0x00000002 */
#define USB_OTG_DCTL_SDIS            USB_OTG_DCTL_SDIS_Msk            /*!< Soft disconnect         */
#define USB_OTG_DCTL_GINSTS_Pos      (2U)
#define USB_OTG_DCTL_GINSTS_Msk      (0x1UL << USB_OTG_DCTL_GINSTS_Pos) /*!< 0x00000004 */
#define USB_OTG_DCTL_GINSTS          USB_OTG_DCTL_GINSTS_Msk            /*!< Global IN NAK status    */
#define USB_OTG_DCTL_GONSTS_Pos      (3U)
#define USB_OTG_DCTL_GONSTS_Msk      (0x1UL << USB_OTG_DCTL_GONSTS_Pos) /*!< 0x00000008 */
#define USB_OTG_DCTL_GONSTS          USB_OTG_DCTL_GONSTS_Msk            /*!< Global OUT NAK status   */

#define USB_OTG_DCTL_TCTL_Pos        (4U)
#define USB_OTG_DCTL_TCTL_Msk        (0x7UL << USB_OTG_DCTL_TCTL_Pos) /*!< 0x00000070 */
#define USB_OTG_DCTL_TCTL            USB_OTG_DCTL_TCTL_Msk            /*!< Test control */
#define USB_OTG_DCTL_TCTL_0          (0x1UL << USB_OTG_DCTL_TCTL_Pos) /*!< 0x00000010 */
#define USB_OTG_DCTL_TCTL_1          (0x2UL << USB_OTG_DCTL_TCTL_Pos) /*!< 0x00000020 */
#define USB_OTG_DCTL_TCTL_2          (0x4UL << USB_OTG_DCTL_TCTL_Pos) /*!< 0x00000040 */
#define USB_OTG_DCTL_SGINAK_Pos      (7U)
#define USB_OTG_DCTL_SGINAK_Msk      (0x1UL << USB_OTG_DCTL_SGINAK_Pos) /*!< 0x00000080 */
#define USB_OTG_DCTL_SGINAK          USB_OTG_DCTL_SGINAK_Msk            /*!< Set global IN NAK         */
#define USB_OTG_DCTL_CGINAK_Pos      (8U)
#define USB_OTG_DCTL_CGINAK_Msk      (0x1UL << USB_OTG_DCTL_CGINAK_Pos) /*!< 0x00000100 */
#define USB_OTG_DCTL_CGINAK          USB_OTG_DCTL_CGINAK_Msk            /*!< Clear global IN NAK       */
#define USB_OTG_DCTL_SGONAK_Pos      (9U)
#define USB_OTG_DCTL_SGONAK_Msk      (0x1UL << USB_OTG_DCTL_SGONAK_Pos) /*!< 0x00000200 */
#define USB_OTG_DCTL_SGONAK          USB_OTG_DCTL_SGONAK_Msk            /*!< Set global OUT NAK        */
#define USB_OTG_DCTL_CGONAK_Pos      (10U)
#define USB_OTG_DCTL_CGONAK_Msk      (0x1UL << USB_OTG_DCTL_CGONAK_Pos) /*!< 0x00000400 */
#define USB_OTG_DCTL_CGONAK          USB_OTG_DCTL_CGONAK_Msk            /*!< Clear global OUT NAK      */
#define USB_OTG_DCTL_POPRGDNE_Pos    (11U)
#define USB_OTG_DCTL_POPRGDNE_Msk    (0x1UL << USB_OTG_DCTL_POPRGDNE_Pos) /*!< 0x00000800 */
#define USB_OTG_DCTL_POPRGDNE        USB_OTG_DCTL_POPRGDNE_Msk            /*!< Power-on programming done */
#define USB_OTG_DCTL_ENCONTONBNA_Pos (17U)
#define USB_OTG_DCTL_ENCONTONBNA_Msk (0x1UL << USB_OTG_DCTL_ENCONTONBNA_Pos) /*!< 0x00020000 */
#define USB_OTG_DCTL_ENCONTONBNA     USB_OTG_DCTL_ENCONTONBNA_Msk            /*!< Enable continue on BNA */
#define USB_OTG_DCTL_DSBESLRJCT_Pos  (18U)
#define USB_OTG_DCTL_DSBESLRJCT_Msk  (0x1UL << USB_OTG_DCTL_DSBESLRJCT_Pos) /*!< 0x00040000 */
#define USB_OTG_DCTL_DSBESLRJCT      USB_OTG_DCTL_DSBESLRJCT_Msk            /*!< Deep sleep BESL reject */

/********************  Bit definition forUSB_OTG_HFIR register  ********************/
#define USB_OTG_HFIR_FRIVL_Pos (0U)
#define USB_OTG_HFIR_FRIVL_Msk (0xFFFFUL << USB_OTG_HFIR_FRIVL_Pos) /*!< 0x0000FFFF */
#define USB_OTG_HFIR_FRIVL     USB_OTG_HFIR_FRIVL_Msk               /*!< Frame interval */

