Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bit definition forUSB_OTG_HFNUM register  ********************/
#define USB_OTG_HFNUM_FRNUM_Pos (0U)
#define USB_OTG_HFNUM_FRNUM_Msk (0xFFFFUL << USB_OTG_HFNUM_FRNUM_Pos) /*!< 0x0000FFFF */
#define USB_OTG_HFNUM_FRNUM     USB_OTG_HFNUM_FRNUM_Msk               /*!< Frame number         */
#define USB_OTG_HFNUM_FTREM_Pos (16U)
#define USB_OTG_HFNUM_FTREM_Msk (0xFFFFUL << USB_OTG_HFNUM_FTREM_Pos) /*!< 0xFFFF0000 */
#define USB_OTG_HFNUM_FTREM     USB_OTG_HFNUM_FTREM_Msk               /*!< Frame time remaining */

/********************  Bit definition forUSB_OTG_DSTS register  ********************/
#define USB_OTG_DSTS_SUSPSTS_Pos (0U)
#define USB_OTG_DSTS_SUSPSTS_Msk (0x1UL << USB_OTG_DSTS_SUSPSTS_Pos) /*!< 0x00000001 */
#define USB_OTG_DSTS_SUSPSTS     USB_OTG_DSTS_SUSPSTS_Msk            /*!< Suspend status   */

#define USB_OTG_DSTS_ENUMSPD_Pos (1U)
#define USB_OTG_DSTS_ENUMSPD_Msk (0x3UL << USB_OTG_DSTS_ENUMSPD_Pos) /*!< 0x00000006 */
#define USB_OTG_DSTS_ENUMSPD     USB_OTG_DSTS_ENUMSPD_Msk            /*!< Enumerated speed */
#define USB_OTG_DSTS_ENUMSPD_0   (0x1UL << USB_OTG_DSTS_ENUMSPD_Pos) /*!< 0x00000002 */
#define USB_OTG_DSTS_ENUMSPD_1   (0x2UL << USB_OTG_DSTS_ENUMSPD_Pos) /*!< 0x00000004 */
#define USB_OTG_DSTS_EERR_Pos    (3U)
#define USB_OTG_DSTS_EERR_Msk    (0x1UL << USB_OTG_DSTS_EERR_Pos) /*!< 0x00000008 */
#define USB_OTG_DSTS_EERR        USB_OTG_DSTS_EERR_Msk            /*!< Erratic error     */
#define USB_OTG_DSTS_FNSOF_Pos   (8U)
#define USB_OTG_DSTS_FNSOF_Msk   (0x3FFFUL << USB_OTG_DSTS_FNSOF_Pos) /*!< 0x003FFF00 */
#define USB_OTG_DSTS_FNSOF       USB_OTG_DSTS_FNSOF_Msk               /*!< Frame number of the received SOF */

/********************  Bit definition forUSB_OTG_GAHBCFG register  ********************/
#define USB_OTG_GAHBCFG_GINT_Pos     (0U)
#define USB_OTG_GAHBCFG_GINT_Msk     (0x1UL << USB_OTG_GAHBCFG_GINT_Pos) /*!< 0x00000001 */
#define USB_OTG_GAHBCFG_GINT         USB_OTG_GAHBCFG_GINT_Msk            /*!< Global interrupt mask */

#define USB_OTG_GAHBCFG_HBSTLEN_Pos  (1U)
#define USB_OTG_GAHBCFG_HBSTLEN_Msk  (0xFUL << USB_OTG_GAHBCFG_HBSTLEN_Pos) /*!< 0x0000001E */
#define USB_OTG_GAHBCFG_HBSTLEN      USB_OTG_GAHBCFG_HBSTLEN_Msk            /*!< Burst length/type */
#define USB_OTG_GAHBCFG_HBSTLEN_0    (0x0UL << USB_OTG_GAHBCFG_HBSTLEN_Pos) /*!< Single */
#define USB_OTG_GAHBCFG_HBSTLEN_1    (0x1UL << USB_OTG_GAHBCFG_HBSTLEN_Pos) /*!< INCR */
#define USB_OTG_GAHBCFG_HBSTLEN_2    (0x3UL << USB_OTG_GAHBCFG_HBSTLEN_Pos) /*!< INCR4 */
#define USB_OTG_GAHBCFG_HBSTLEN_3    (0x5UL << USB_OTG_GAHBCFG_HBSTLEN_Pos) /*!< INCR8 */
#define USB_OTG_GAHBCFG_HBSTLEN_4    (0x7UL << USB_OTG_GAHBCFG_HBSTLEN_Pos) /*!< INCR16 */
#define USB_OTG_GAHBCFG_DMAEN_Pos    (5U)
#define USB_OTG_GAHBCFG_DMAEN_Msk    (0x1UL << USB_OTG_GAHBCFG_DMAEN_Pos) /*!< 0x00000020 */
#define USB_OTG_GAHBCFG_DMAEN        USB_OTG_GAHBCFG_DMAEN_Msk            /*!< DMA enable */
#define USB_OTG_GAHBCFG_TXFELVL_Pos  (7U)
#define USB_OTG_GAHBCFG_TXFELVL_Msk  (0x1UL << USB_OTG_GAHBCFG_TXFELVL_Pos) /*!< 0x00000080 */
#define USB_OTG_GAHBCFG_TXFELVL      USB_OTG_GAHBCFG_TXFELVL_Msk            /*!< TxFIFO empty level */
#define USB_OTG_GAHBCFG_PTXFELVL_Pos (8U)
#define USB_OTG_GAHBCFG_PTXFELVL_Msk (0x1UL << USB_OTG_GAHBCFG_PTXFELVL_Pos) /*!< 0x00000100 */
#define USB_OTG_GAHBCFG_PTXFELVL     USB_OTG_GAHBCFG_PTXFELVL_Msk            /*!< Periodic TxFIFO empty level */

/********************  Bit definition forUSB_OTG_GUSBCFG register  ********************/

#define USB_OTG_GUSBCFG_TOCAL_Pos  (0U)
#define USB_OTG_GUSBCFG_TOCAL_Msk  (0x7UL << USB_OTG_GUSBCFG_TOCAL_Pos) /*!< 0x00000007 */
#define USB_OTG_GUSBCFG_TOCAL      USB_OTG_GUSBCFG_TOCAL_Msk            /*!< FS timeout calibration */
#define USB_OTG_GUSBCFG_TOCAL_0    (0x1UL << USB_OTG_GUSBCFG_TOCAL_Pos) /*!< 0x00000001 */
#define USB_OTG_GUSBCFG_TOCAL_1    (0x2UL << USB_OTG_GUSBCFG_TOCAL_Pos) /*!< 0x00000002 */
#define USB_OTG_GUSBCFG_TOCAL_2    (0x4UL << USB_OTG_GUSBCFG_TOCAL_Pos) /*!< 0x00000004 */
#define USB_OTG_GUSBCFG_PHYSEL_Pos (6U)
#define USB_OTG_GUSBCFG_PHYSEL_Msk (0x1UL << USB_OTG_GUSBCFG_PHYSEL_Pos) /*!< 0x00000040 */
#define USB_OTG_GUSBCFG_PHYSEL                                                                                         \
  USB_OTG_GUSBCFG_PHYSEL_Msk /*!< USB 2.0 high-speed ULPI PHY or USB 1.1 full-speed serial transceiver select */
#define USB_OTG_GUSBCFG_SRPCAP_Pos     (8U)
#define USB_OTG_GUSBCFG_SRPCAP_Msk     (0x1UL << USB_OTG_GUSBCFG_SRPCAP_Pos) /*!< 0x00000100 */
#define USB_OTG_GUSBCFG_SRPCAP         USB_OTG_GUSBCFG_SRPCAP_Msk            /*!< SRP-capable */
#define USB_OTG_GUSBCFG_HNPCAP_Pos     (9U)
#define USB_OTG_GUSBCFG_HNPCAP_Msk     (0x1UL << USB_OTG_GUSBCFG_HNPCAP_Pos) /*!< 0x00000200 */
#define USB_OTG_GUSBCFG_HNPCAP         USB_OTG_GUSBCFG_HNPCAP_Msk            /*!< HNP-capable */

#define USB_OTG_GUSBCFG_TRDT_Pos       (10U)
#define USB_OTG_GUSBCFG_TRDT_Msk       (0xFUL << USB_OTG_GUSBCFG_TRDT_Pos) /*!< 0x00003C00 */
#define USB_OTG_GUSBCFG_TRDT           USB_OTG_GUSBCFG_TRDT_Msk            /*!< USB turnaround time */
#define USB_OTG_GUSBCFG_TRDT_0         (0x1UL << USB_OTG_GUSBCFG_TRDT_Pos) /*!< 0x00000400 */
#define USB_OTG_GUSBCFG_TRDT_1         (0x2UL << USB_OTG_GUSBCFG_TRDT_Pos) /*!< 0x00000800 */
#define USB_OTG_GUSBCFG_TRDT_2         (0x4UL << USB_OTG_GUSBCFG_TRDT_Pos) /*!< 0x00001000 */
#define USB_OTG_GUSBCFG_TRDT_3         (0x8UL << USB_OTG_GUSBCFG_TRDT_Pos) /*!< 0x00002000 */
#define USB_OTG_GUSBCFG_PHYLPCS_Pos    (15U)
#define USB_OTG_GUSBCFG_PHYLPCS_Msk    (0x1UL << USB_OTG_GUSBCFG_PHYLPCS_Pos) /*!< 0x00008000 */
#define USB_OTG_GUSBCFG_PHYLPCS        USB_OTG_GUSBCFG_PHYLPCS_Msk            /*!< PHY Low-power clock select */
#define USB_OTG_GUSBCFG_ULPIFSLS_Pos   (17U)
#define USB_OTG_GUSBCFG_ULPIFSLS_Msk   (0x1UL << USB_OTG_GUSBCFG_ULPIFSLS_Pos) /*!< 0x00020000 */
#define USB_OTG_GUSBCFG_ULPIFSLS       USB_OTG_GUSBCFG_ULPIFSLS_Msk            /*!< ULPI FS/LS select               */
#define USB_OTG_GUSBCFG_ULPIAR_Pos     (18U)
#define USB_OTG_GUSBCFG_ULPIAR_Msk     (0x1UL << USB_OTG_GUSBCFG_ULPIAR_Pos) /*!< 0x00040000 */
#define USB_OTG_GUSBCFG_ULPIAR         USB_OTG_GUSBCFG_ULPIAR_Msk            /*!< ULPI Auto-resume                */
#define USB_OTG_GUSBCFG_ULPICSM_Pos    (19U)
#define USB_OTG_GUSBCFG_ULPICSM_Msk    (0x1UL << USB_OTG_GUSBCFG_ULPICSM_Pos) /*!< 0x00080000 */
#define USB_OTG_GUSBCFG_ULPICSM        USB_OTG_GUSBCFG_ULPICSM_Msk            /*!< ULPI Clock SuspendM             */
#define USB_OTG_GUSBCFG_ULPIEVBUSD_Pos (20U)
#define USB_OTG_GUSBCFG_ULPIEVBUSD_Msk (0x1UL << USB_OTG_GUSBCFG_ULPIEVBUSD_Pos) /*!< 0x00100000 */
#define USB_OTG_GUSBCFG_ULPIEVBUSD     USB_OTG_GUSBCFG_ULPIEVBUSD_Msk            /*!< ULPI External VBUS Drive        */
#define USB_OTG_GUSBCFG_ULPIEVBUSI_Pos (21U)
#define USB_OTG_GUSBCFG_ULPIEVBUSI_Msk (0x1UL << USB_OTG_GUSBCFG_ULPIEVBUSI_Pos) /*!< 0x00200000 */
#define USB_OTG_GUSBCFG_ULPIEVBUSI     USB_OTG_GUSBCFG_ULPIEVBUSI_Msk            /*!< ULPI external VBUS indicator    */
#define USB_OTG_GUSBCFG_TSDPS_Pos      (22U)
#define USB_OTG_GUSBCFG_TSDPS_Msk      (0x1UL << USB_OTG_GUSBCFG_TSDPS_Pos) /*!< 0x00400000 */
#define USB_OTG_GUSBCFG_TSDPS          USB_OTG_GUSBCFG_TSDPS_Msk            /*!< TermSel DLine pulsing selection */
#define USB_OTG_GUSBCFG_PCCI_Pos       (23U)
#define USB_OTG_GUSBCFG_PCCI_Msk       (0x1UL << USB_OTG_GUSBCFG_PCCI_Pos) /*!< 0x00800000 */
#define USB_OTG_GUSBCFG_PCCI           USB_OTG_GUSBCFG_PCCI_Msk            /*!< Indicator complement            */
#define USB_OTG_GUSBCFG_PTCI_Pos       (24U)
#define USB_OTG_GUSBCFG_PTCI_Msk       (0x1UL << USB_OTG_GUSBCFG_PTCI_Pos) /*!< 0x01000000 */
#define USB_OTG_GUSBCFG_PTCI           USB_OTG_GUSBCFG_PTCI_Msk            /*!< Indicator pass through          */
#define USB_OTG_GUSBCFG_ULPIIPD_Pos    (25U)
#define USB_OTG_GUSBCFG_ULPIIPD_Msk    (0x1UL << USB_OTG_GUSBCFG_ULPIIPD_Pos) /*!< 0x02000000 */
#define USB_OTG_GUSBCFG_ULPIIPD        USB_OTG_GUSBCFG_ULPIIPD_Msk            /*!< ULPI interface protect disable  */
#define USB_OTG_GUSBCFG_FHMOD_Pos      (29U)
#define USB_OTG_GUSBCFG_FHMOD_Msk      (0x1UL << USB_OTG_GUSBCFG_FHMOD_Pos) /*!< 0x20000000 */
#define USB_OTG_GUSBCFG_FHMOD          USB_OTG_GUSBCFG_FHMOD_Msk            /*!< Forced host mode                */
#define USB_OTG_GUSBCFG_FDMOD_Pos      (30U)
#define USB_OTG_GUSBCFG_FDMOD_Msk      (0x1UL << USB_OTG_GUSBCFG_FDMOD_Pos) /*!< 0x40000000 */
#define USB_OTG_GUSBCFG_FDMOD          USB_OTG_GUSBCFG_FDMOD_Msk            /*!< Forced peripheral mode          */
#define USB_OTG_GUSBCFG_CTXPKT_Pos     (31U)
#define USB_OTG_GUSBCFG_CTXPKT_Msk     (0x1UL << USB_OTG_GUSBCFG_CTXPKT_Pos) /*!< 0x80000000 */
#define USB_OTG_GUSBCFG_CTXPKT                                                                                         \
  USB_OTG_GUSBCFG_CTXPKT_Msk /*!< Corrupt Tx packet for debug propose only; must be kept at reset value */

/********************  Bit definition forUSB_OTG_GRSTCTL register  ********************/
#define USB_OTG_GRSTCTL_CSRST_Pos   (0U)
#define USB_OTG_GRSTCTL_CSRST_Msk   (0x1UL << USB_OTG_GRSTCTL_CSRST_Pos) /*!< 0x00000001 */
#define USB_OTG_GRSTCTL_CSRST       USB_OTG_GRSTCTL_CSRST_Msk            /*!< Core soft reset          */
#define USB_OTG_GRSTCTL_HSRST_Pos   (1U)
#define USB_OTG_GRSTCTL_HSRST_Msk   (0x1UL << USB_OTG_GRSTCTL_HSRST_Pos) /*!< 0x00000002 */
#define USB_OTG_GRSTCTL_HSRST       USB_OTG_GRSTCTL_HSRST_Msk            /*!< HCLK soft reset          */
#define USB_OTG_GRSTCTL_FCRST_Pos   (2U)
#define USB_OTG_GRSTCTL_FCRST_Msk   (0x1UL << USB_OTG_GRSTCTL_FCRST_Pos) /*!< 0x00000004 */
#define USB_OTG_GRSTCTL_FCRST       USB_OTG_GRSTCTL_FCRST_Msk            /*!< Host frame counter reset */
#define USB_OTG_GRSTCTL_RXFFLSH_Pos (4U)
#define USB_OTG_GRSTCTL_RXFFLSH_Msk (0x1UL << USB_OTG_GRSTCTL_RXFFLSH_Pos) /*!< 0x00000010 */
#define USB_OTG_GRSTCTL_RXFFLSH     USB_OTG_GRSTCTL_RXFFLSH_Msk            /*!< RxFIFO flush             */
#define USB_OTG_GRSTCTL_TXFFLSH_Pos (5U)
#define USB_OTG_GRSTCTL_TXFFLSH_Msk (0x1UL << USB_OTG_GRSTCTL_TXFFLSH_Pos) /*!< 0x00000020 */
#define USB_OTG_GRSTCTL_TXFFLSH     USB_OTG_GRSTCTL_TXFFLSH_Msk            /*!< TxFIFO flush             */

#define USB_OTG_GRSTCTL_TXFNUM_Pos  (6U)
#define USB_OTG_GRSTCTL_TXFNUM_Msk  (0x1FUL << USB_OTG_GRSTCTL_TXFNUM_Pos) /*!< 0x000007C0 */
#define USB_OTG_GRSTCTL_TXFNUM      USB_OTG_GRSTCTL_TXFNUM_Msk             /*!< TxFIFO number */
#define USB_OTG_GRSTCTL_TXFNUM_0    (0x01UL << USB_OTG_GRSTCTL_TXFNUM_Pos) /*!< 0x00000040 */
#define USB_OTG_GRSTCTL_TXFNUM_1    (0x02UL << USB_OTG_GRSTCTL_TXFNUM_Pos) /*!< 0x00000080 */
#define USB_OTG_GRSTCTL_TXFNUM_2    (0x04UL << USB_OTG_GRSTCTL_TXFNUM_Pos) /*!< 0x00000100 */
#define USB_OTG_GRSTCTL_TXFNUM_3    (0x08UL << USB_OTG_GRSTCTL_TXFNUM_Pos) /*!< 0x00000200 */
#define USB_OTG_GRSTCTL_TXFNUM_4    (0x10UL << USB_OTG_GRSTCTL_TXFNUM_Pos) /*!< 0x00000400 */
#define USB_OTG_GRSTCTL_DMAREQ_Pos  (30U)
#define USB_OTG_GRSTCTL_DMAREQ_Msk  (0x1UL << USB_OTG_GRSTCTL_DMAREQ_Pos) /*!< 0x40000000 */
#define USB_OTG_GRSTCTL_DMAREQ      USB_OTG_GRSTCTL_DMAREQ_Msk            /*!< DMA request signal */
#define USB_OTG_GRSTCTL_AHBIDL_Pos  (31U)
#define USB_OTG_GRSTCTL_AHBIDL_Msk  (0x1UL << USB_OTG_GRSTCTL_AHBIDL_Pos) /*!< 0x80000000 */
#define USB_OTG_GRSTCTL_AHBIDL      USB_OTG_GRSTCTL_AHBIDL_Msk            /*!< AHB master idle */

/********************  Bit definition forUSB_OTG_DIEPMSK register  ********************/
#define USB_OTG_DIEPMSK_XFRCM_Pos     (0U)
#define USB_OTG_DIEPMSK_XFRCM_Msk     (0x1UL << USB_OTG_DIEPMSK_XFRCM_Pos) /*!< 0x00000001 */
#define USB_OTG_DIEPMSK_XFRCM         USB_OTG_DIEPMSK_XFRCM_Msk /*!< Transfer completed interrupt mask                 */
#define USB_OTG_DIEPMSK_EPDM_Pos      (1U)
#define USB_OTG_DIEPMSK_EPDM_Msk      (0x1UL << USB_OTG_DIEPMSK_EPDM_Pos) /*!< 0x00000002 */
#define USB_OTG_DIEPMSK_EPDM          USB_OTG_DIEPMSK_EPDM_Msk /*!< Endpoint disabled interrupt mask                  */
#define USB_OTG_DIEPMSK_TOM_Pos       (3U)
#define USB_OTG_DIEPMSK_TOM_Msk       (0x1UL << USB_OTG_DIEPMSK_TOM_Pos) /*!< 0x00000008 */
#define USB_OTG_DIEPMSK_TOM           USB_OTG_DIEPMSK_TOM_Msk /*!< Timeout condition mask (nonisochronous endpoints) */
#define USB_OTG_DIEPMSK_ITTXFEMSK_Pos (4U)
#define USB_OTG_DIEPMSK_ITTXFEMSK_Msk (0x1UL << USB_OTG_DIEPMSK_ITTXFEMSK_Pos) /*!< 0x00000010 */
#define USB_OTG_DIEPMSK_ITTXFEMSK                                                                                      \
  USB_OTG_DIEPMSK_ITTXFEMSK_Msk /*!< IN token received when TxFIFO empty mask          */
#define USB_OTG_DIEPMSK_INEPNMM_Pos (5U)
#define USB_OTG_DIEPMSK_INEPNMM_Msk (0x1UL << USB_OTG_DIEPMSK_INEPNMM_Pos) /*!< 0x00000020 */
#define USB_OTG_DIEPMSK_INEPNMM     USB_OTG_DIEPMSK_INEPNMM_Msk /*!< IN token received with EP mismatch mask           */
#define USB_OTG_DIEPMSK_INEPNEM_Pos (6U)
#define USB_OTG_DIEPMSK_INEPNEM_Msk (0x1UL << USB_OTG_DIEPMSK_INEPNEM_Pos) /*!< 0x00000040 */
#define USB_OTG_DIEPMSK_INEPNEM     USB_OTG_DIEPMSK_INEPNEM_Msk /*!< IN endpoint NAK effective mask                    */
#define USB_OTG_DIEPMSK_TXFURM_Pos  (8U)
#define USB_OTG_DIEPMSK_TXFURM_Msk  (0x1UL << USB_OTG_DIEPMSK_TXFURM_Pos) /*!< 0x00000100 */
#define USB_OTG_DIEPMSK_TXFURM      USB_OTG_DIEPMSK_TXFURM_Msk /*!< FIFO underrun mask                                */
#define USB_OTG_DIEPMSK_BIM_Pos     (9U)
#define USB_OTG_DIEPMSK_BIM_Msk     (0x1UL << USB_OTG_DIEPMSK_BIM_Pos) /*!< 0x00000200 */
#define USB_OTG_DIEPMSK_BIM         USB_OTG_DIEPMSK_BIM_Msk /*!< BNA interrupt mask                                */

