Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bit definition forUSB_OTG_HPTXSTS register  ********************/
#define USB_OTG_HPTXSTS_PTXFSAVL_Pos (0U)
#define USB_OTG_HPTXSTS_PTXFSAVL_Msk (0xFFFFUL << USB_OTG_HPTXSTS_PTXFSAVL_Pos) /*!< 0x0000FFFF */
#define USB_OTG_HPTXSTS_PTXFSAVL     USB_OTG_HPTXSTS_PTXFSAVL_Msk /*!< Periodic transmit data FIFO space available     */

#define USB_OTG_HPTXSTS_PTXQSAV_Pos  (16U)
#define USB_OTG_HPTXSTS_PTXQSAV_Msk  (0xFFUL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00FF0000 */
#define USB_OTG_HPTXSTS_PTXQSAV      USB_OTG_HPTXSTS_PTXQSAV_Msk /*!< Periodic transmit request queue space available */
#define USB_OTG_HPTXSTS_PTXQSAV_0    (0x01UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00010000 */
#define USB_OTG_HPTXSTS_PTXQSAV_1    (0x02UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00020000 */
#define USB_OTG_HPTXSTS_PTXQSAV_2    (0x04UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00040000 */
#define USB_OTG_HPTXSTS_PTXQSAV_3    (0x08UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00080000 */
#define USB_OTG_HPTXSTS_PTXQSAV_4    (0x10UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00100000 */
#define USB_OTG_HPTXSTS_PTXQSAV_5    (0x20UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00200000 */
#define USB_OTG_HPTXSTS_PTXQSAV_6    (0x40UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00400000 */
#define USB_OTG_HPTXSTS_PTXQSAV_7    (0x80UL << USB_OTG_HPTXSTS_PTXQSAV_Pos) /*!< 0x00800000 */

#define USB_OTG_HPTXSTS_PTXQTOP_Pos  (24U)
#define USB_OTG_HPTXSTS_PTXQTOP_Msk  (0xFFUL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0xFF000000 */
#define USB_OTG_HPTXSTS_PTXQTOP      USB_OTG_HPTXSTS_PTXQTOP_Msk /*!< Top of the periodic transmit request queue */
#define USB_OTG_HPTXSTS_PTXQTOP_0    (0x01UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x01000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_1    (0x02UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x02000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_2    (0x04UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x04000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_3    (0x08UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x08000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_4    (0x10UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x10000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_5    (0x20UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x20000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_6    (0x40UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x40000000 */
#define USB_OTG_HPTXSTS_PTXQTOP_7    (0x80UL << USB_OTG_HPTXSTS_PTXQTOP_Pos) /*!< 0x80000000 */

/********************  Bit definition forUSB_OTG_HAINT register  ********************/
#define USB_OTG_HAINT_HAINT_Pos (0U)
#define USB_OTG_HAINT_HAINT_Msk (0xFFFFUL << USB_OTG_HAINT_HAINT_Pos) /*!< 0x0000FFFF */
#define USB_OTG_HAINT_HAINT     USB_OTG_HAINT_HAINT_Msk               /*!< Channel interrupts */

/********************  Bit definition forUSB_OTG_DOEPMSK register  ********************/
#define USB_OTG_DOEPMSK_XFRCM_Pos   (0U)
#define USB_OTG_DOEPMSK_XFRCM_Msk   (0x1UL << USB_OTG_DOEPMSK_XFRCM_Pos) /*!< 0x00000001 */
#define USB_OTG_DOEPMSK_XFRCM       USB_OTG_DOEPMSK_XFRCM_Msk            /*!< Transfer completed interrupt mask */
#define USB_OTG_DOEPMSK_EPDM_Pos    (1U)
#define USB_OTG_DOEPMSK_EPDM_Msk    (0x1UL << USB_OTG_DOEPMSK_EPDM_Pos) /*!< 0x00000002 */
#define USB_OTG_DOEPMSK_EPDM        USB_OTG_DOEPMSK_EPDM_Msk /*!< Endpoint disabled interrupt mask               */
#define USB_OTG_DOEPMSK_AHBERRM_Pos (2U)
#define USB_OTG_DOEPMSK_AHBERRM_Msk (0x1UL << USB_OTG_DOEPMSK_AHBERRM_Pos) /*!< 0x00000004 */
#define USB_OTG_DOEPMSK_AHBERRM                                                                                        \
  USB_OTG_DOEPMSK_AHBERRM_Msk /*!< OUT transaction AHB Error interrupt mask               */
#define USB_OTG_DOEPMSK_STUPM_Pos    (3U)
#define USB_OTG_DOEPMSK_STUPM_Msk    (0x1UL << USB_OTG_DOEPMSK_STUPM_Pos) /*!< 0x00000008 */
#define USB_OTG_DOEPMSK_STUPM        USB_OTG_DOEPMSK_STUPM_Msk /*!< SETUP phase done mask                          */
#define USB_OTG_DOEPMSK_OTEPDM_Pos   (4U)
#define USB_OTG_DOEPMSK_OTEPDM_Msk   (0x1UL << USB_OTG_DOEPMSK_OTEPDM_Pos) /*!< 0x00000010 */
#define USB_OTG_DOEPMSK_OTEPDM       USB_OTG_DOEPMSK_OTEPDM_Msk /*!< OUT token received when endpoint disabled mask */
#define USB_OTG_DOEPMSK_OTEPSPRM_Pos (5U)
#define USB_OTG_DOEPMSK_OTEPSPRM_Msk (0x1UL << USB_OTG_DOEPMSK_OTEPSPRM_Pos) /*!< 0x00000020 */
#define USB_OTG_DOEPMSK_OTEPSPRM     USB_OTG_DOEPMSK_OTEPSPRM_Msk /*!< Status Phase Received mask                     */
#define USB_OTG_DOEPMSK_B2BSTUP_Pos  (6U)
#define USB_OTG_DOEPMSK_B2BSTUP_Msk  (0x1UL << USB_OTG_DOEPMSK_B2BSTUP_Pos) /*!< 0x00000040 */
#define USB_OTG_DOEPMSK_B2BSTUP      USB_OTG_DOEPMSK_B2BSTUP_Msk /*!< Back-to-back SETUP packets received mask       */
#define USB_OTG_DOEPMSK_OPEM_Pos     (8U)
#define USB_OTG_DOEPMSK_OPEM_Msk     (0x1UL << USB_OTG_DOEPMSK_OPEM_Pos) /*!< 0x00000100 */
#define USB_OTG_DOEPMSK_OPEM         USB_OTG_DOEPMSK_OPEM_Msk /*!< OUT packet error mask                          */
#define USB_OTG_DOEPMSK_BOIM_Pos     (9U)
#define USB_OTG_DOEPMSK_BOIM_Msk     (0x1UL << USB_OTG_DOEPMSK_BOIM_Pos) /*!< 0x00000200 */
#define USB_OTG_DOEPMSK_BOIM         USB_OTG_DOEPMSK_BOIM_Msk /*!< BNA interrupt mask                             */
#define USB_OTG_DOEPMSK_BERRM_Pos    (12U)
#define USB_OTG_DOEPMSK_BERRM_Msk    (0x1UL << USB_OTG_DOEPMSK_BERRM_Pos) /*!< 0x00001000 */
#define USB_OTG_DOEPMSK_BERRM        USB_OTG_DOEPMSK_BERRM_Msk /*!< Babble error interrupt mask               */
#define USB_OTG_DOEPMSK_NAKM_Pos     (13U)
#define USB_OTG_DOEPMSK_NAKM_Msk     (0x1UL << USB_OTG_DOEPMSK_NAKM_Pos) /*!< 0x00002000 */
#define USB_OTG_DOEPMSK_NAKM         USB_OTG_DOEPMSK_NAKM_Msk /*!< OUT Packet NAK interrupt mask               */
#define USB_OTG_DOEPMSK_NYETM_Pos    (14U)
#define USB_OTG_DOEPMSK_NYETM_Msk    (0x1UL << USB_OTG_DOEPMSK_NYETM_Pos) /*!< 0x00004000 */
#define USB_OTG_DOEPMSK_NYETM        USB_OTG_DOEPMSK_NYETM_Msk            /*!< NYET interrupt mask                */

/********************  Bit definition forUSB_OTG_GINTSTS register  ********************/
#define USB_OTG_GINTSTS_CMOD_Pos              (0U)
#define USB_OTG_GINTSTS_CMOD_Msk              (0x1UL << USB_OTG_GINTSTS_CMOD_Pos) /*!< 0x00000001 */
#define USB_OTG_GINTSTS_CMOD                  USB_OTG_GINTSTS_CMOD_Msk /*!< Current mode of operation                      */
#define USB_OTG_GINTSTS_MMIS_Pos              (1U)
#define USB_OTG_GINTSTS_MMIS_Msk              (0x1UL << USB_OTG_GINTSTS_MMIS_Pos) /*!< 0x00000002 */
#define USB_OTG_GINTSTS_MMIS                  USB_OTG_GINTSTS_MMIS_Msk /*!< Mode mismatch interrupt                        */
#define USB_OTG_GINTSTS_OTGINT_Pos            (2U)
#define USB_OTG_GINTSTS_OTGINT_Msk            (0x1UL << USB_OTG_GINTSTS_OTGINT_Pos) /*!< 0x00000004 */
#define USB_OTG_GINTSTS_OTGINT                USB_OTG_GINTSTS_OTGINT_Msk /*!< OTG interrupt                                  */
#define USB_OTG_GINTSTS_SOF_Pos               (3U)
#define USB_OTG_GINTSTS_SOF_Msk               (0x1UL << USB_OTG_GINTSTS_SOF_Pos) /*!< 0x00000008 */
#define USB_OTG_GINTSTS_SOF                   USB_OTG_GINTSTS_SOF_Msk /*!< Start of frame                                 */
#define USB_OTG_GINTSTS_RXFLVL_Pos            (4U)
#define USB_OTG_GINTSTS_RXFLVL_Msk            (0x1UL << USB_OTG_GINTSTS_RXFLVL_Pos) /*!< 0x00000010 */
#define USB_OTG_GINTSTS_RXFLVL                USB_OTG_GINTSTS_RXFLVL_Msk /*!< RxFIFO nonempty                                */
#define USB_OTG_GINTSTS_NPTXFE_Pos            (5U)
#define USB_OTG_GINTSTS_NPTXFE_Msk            (0x1UL << USB_OTG_GINTSTS_NPTXFE_Pos) /*!< 0x00000020 */
#define USB_OTG_GINTSTS_NPTXFE                USB_OTG_GINTSTS_NPTXFE_Msk /*!< Nonperiodic TxFIFO empty                       */
#define USB_OTG_GINTSTS_GINAKEFF_Pos          (6U)
#define USB_OTG_GINTSTS_GINAKEFF_Msk          (0x1UL << USB_OTG_GINTSTS_GINAKEFF_Pos) /*!< 0x00000040 */
#define USB_OTG_GINTSTS_GINAKEFF              USB_OTG_GINTSTS_GINAKEFF_Msk /*!< Global IN nonperiodic NAK effective            */
#define USB_OTG_GINTSTS_BOUTNAKEFF_Pos        (7U)
#define USB_OTG_GINTSTS_BOUTNAKEFF_Msk        (0x1UL << USB_OTG_GINTSTS_BOUTNAKEFF_Pos) /*!< 0x00000080 */
#define USB_OTG_GINTSTS_BOUTNAKEFF            USB_OTG_GINTSTS_BOUTNAKEFF_Msk /*!< Global OUT NAK effective            */
#define USB_OTG_GINTSTS_ESUSP_Pos             (10U)
#define USB_OTG_GINTSTS_ESUSP_Msk             (0x1UL << USB_OTG_GINTSTS_ESUSP_Pos) /*!< 0x00000400 */
#define USB_OTG_GINTSTS_ESUSP                 USB_OTG_GINTSTS_ESUSP_Msk /*!< Early suspend                                  */
#define USB_OTG_GINTSTS_USBSUSP_Pos           (11U)
#define USB_OTG_GINTSTS_USBSUSP_Msk           (0x1UL << USB_OTG_GINTSTS_USBSUSP_Pos) /*!< 0x00000800 */
#define USB_OTG_GINTSTS_USBSUSP               USB_OTG_GINTSTS_USBSUSP_Msk /*!< USB suspend                                    */
#define USB_OTG_GINTSTS_USBRST_Pos            (12U)
#define USB_OTG_GINTSTS_USBRST_Msk            (0x1UL << USB_OTG_GINTSTS_USBRST_Pos) /*!< 0x00001000 */
#define USB_OTG_GINTSTS_USBRST                USB_OTG_GINTSTS_USBRST_Msk /*!< USB reset                                      */
#define USB_OTG_GINTSTS_ENUMDNE_Pos           (13U)
#define USB_OTG_GINTSTS_ENUMDNE_Msk           (0x1UL << USB_OTG_GINTSTS_ENUMDNE_Pos) /*!< 0x00002000 */
#define USB_OTG_GINTSTS_ENUMDNE               USB_OTG_GINTSTS_ENUMDNE_Msk /*!< Enumeration done                               */
#define USB_OTG_GINTSTS_ISOODRP_Pos           (14U)
#define USB_OTG_GINTSTS_ISOODRP_Msk           (0x1UL << USB_OTG_GINTSTS_ISOODRP_Pos) /*!< 0x00004000 */
#define USB_OTG_GINTSTS_ISOODRP               USB_OTG_GINTSTS_ISOODRP_Msk /*!< Isochronous OUT packet dropped interrupt       */
#define USB_OTG_GINTSTS_EOPF_Pos              (15U)
#define USB_OTG_GINTSTS_EOPF_Msk              (0x1UL << USB_OTG_GINTSTS_EOPF_Pos) /*!< 0x00008000 */
#define USB_OTG_GINTSTS_EOPF                  USB_OTG_GINTSTS_EOPF_Msk /*!< End of periodic frame interrupt                */
#define USB_OTG_GINTSTS_IEPINT_Pos            (18U)
#define USB_OTG_GINTSTS_IEPINT_Msk            (0x1UL << USB_OTG_GINTSTS_IEPINT_Pos) /*!< 0x00040000 */
#define USB_OTG_GINTSTS_IEPINT                USB_OTG_GINTSTS_IEPINT_Msk /*!< IN endpoint interrupt                          */
#define USB_OTG_GINTSTS_OEPINT_Pos            (19U)
#define USB_OTG_GINTSTS_OEPINT_Msk            (0x1UL << USB_OTG_GINTSTS_OEPINT_Pos) /*!< 0x00080000 */
#define USB_OTG_GINTSTS_OEPINT                USB_OTG_GINTSTS_OEPINT_Msk /*!< OUT endpoint interrupt                         */
#define USB_OTG_GINTSTS_IISOIXFR_Pos          (20U)
#define USB_OTG_GINTSTS_IISOIXFR_Msk          (0x1UL << USB_OTG_GINTSTS_IISOIXFR_Pos) /*!< 0x00100000 */
#define USB_OTG_GINTSTS_IISOIXFR              USB_OTG_GINTSTS_IISOIXFR_Msk /*!< Incomplete isochronous IN transfer             */
#define USB_OTG_GINTSTS_PXFR_INCOMPISOOUT_Pos (21U)
#define USB_OTG_GINTSTS_PXFR_INCOMPISOOUT_Msk (0x1UL << USB_OTG_GINTSTS_PXFR_INCOMPISOOUT_Pos) /*!< 0x00200000 */
#define USB_OTG_GINTSTS_PXFR_INCOMPISOOUT                                                                              \
  USB_OTG_GINTSTS_PXFR_INCOMPISOOUT_Msk /*!< Incomplete periodic transfer                   */
#define USB_OTG_GINTSTS_DATAFSUSP_Pos (22U)
#define USB_OTG_GINTSTS_DATAFSUSP_Msk (0x1UL << USB_OTG_GINTSTS_DATAFSUSP_Pos) /*!< 0x00400000 */
#define USB_OTG_GINTSTS_DATAFSUSP     USB_OTG_GINTSTS_DATAFSUSP_Msk /*!< Data fetch suspended                           */
#define USB_OTG_GINTSTS_RSTDET_Pos    (23U)
#define USB_OTG_GINTSTS_RSTDET_Msk    (0x1UL << USB_OTG_GINTSTS_RSTDET_Pos) /*!< 0x00800000 */
#define USB_OTG_GINTSTS_RSTDET        USB_OTG_GINTSTS_RSTDET_Msk /*!< Reset detected interrupt                       */
#define USB_OTG_GINTSTS_HPRTINT_Pos   (24U)
#define USB_OTG_GINTSTS_HPRTINT_Msk   (0x1UL << USB_OTG_GINTSTS_HPRTINT_Pos) /*!< 0x01000000 */
#define USB_OTG_GINTSTS_HPRTINT       USB_OTG_GINTSTS_HPRTINT_Msk /*!< Host port interrupt                            */
#define USB_OTG_GINTSTS_HCINT_Pos     (25U)
#define USB_OTG_GINTSTS_HCINT_Msk     (0x1UL << USB_OTG_GINTSTS_HCINT_Pos) /*!< 0x02000000 */
#define USB_OTG_GINTSTS_HCINT         USB_OTG_GINTSTS_HCINT_Msk /*!< Host channels interrupt                        */
#define USB_OTG_GINTSTS_PTXFE_Pos     (26U)
#define USB_OTG_GINTSTS_PTXFE_Msk     (0x1UL << USB_OTG_GINTSTS_PTXFE_Pos) /*!< 0x04000000 */
#define USB_OTG_GINTSTS_PTXFE         USB_OTG_GINTSTS_PTXFE_Msk /*!< Periodic TxFIFO empty                          */
#define USB_OTG_GINTSTS_LPMINT_Pos    (27U)
#define USB_OTG_GINTSTS_LPMINT_Msk    (0x1UL << USB_OTG_GINTSTS_LPMINT_Pos) /*!< 0x08000000 */
#define USB_OTG_GINTSTS_LPMINT        USB_OTG_GINTSTS_LPMINT_Msk /*!< LPM interrupt                                  */
#define USB_OTG_GINTSTS_CIDSCHG_Pos   (28U)
#define USB_OTG_GINTSTS_CIDSCHG_Msk   (0x1UL << USB_OTG_GINTSTS_CIDSCHG_Pos) /*!< 0x10000000 */
#define USB_OTG_GINTSTS_CIDSCHG       USB_OTG_GINTSTS_CIDSCHG_Msk /*!< Connector ID status change                     */
#define USB_OTG_GINTSTS_DISCINT_Pos   (29U)
#define USB_OTG_GINTSTS_DISCINT_Msk   (0x1UL << USB_OTG_GINTSTS_DISCINT_Pos) /*!< 0x20000000 */
#define USB_OTG_GINTSTS_DISCINT       USB_OTG_GINTSTS_DISCINT_Msk /*!< Disconnect detected interrupt                  */
#define USB_OTG_GINTSTS_SRQINT_Pos    (30U)
#define USB_OTG_GINTSTS_SRQINT_Msk    (0x1UL << USB_OTG_GINTSTS_SRQINT_Pos) /*!< 0x40000000 */
#define USB_OTG_GINTSTS_SRQINT        USB_OTG_GINTSTS_SRQINT_Msk /*!< Session request/new session detected interrupt */
#define USB_OTG_GINTSTS_WKUINT_Pos    (31U)
#define USB_OTG_GINTSTS_WKUINT_Msk    (0x1UL << USB_OTG_GINTSTS_WKUINT_Pos) /*!< 0x80000000 */
#define USB_OTG_GINTSTS_WKUINT        USB_OTG_GINTSTS_WKUINT_Msk /*!< Resume/remote wakeup detected interrupt        */

/********************  Bit definition forUSB_OTG_GINTMSK register  ********************/
#define USB_OTG_GINTMSK_MMISM_Pos     (1U)
#define USB_OTG_GINTMSK_MMISM_Msk     (0x1UL << USB_OTG_GINTMSK_MMISM_Pos) /*!< 0x00000002 */
#define USB_OTG_GINTMSK_MMISM         USB_OTG_GINTMSK_MMISM_Msk /*!< Mode mismatch interrupt mask                        */
#define USB_OTG_GINTMSK_OTGINT_Pos    (2U)
#define USB_OTG_GINTMSK_OTGINT_Msk    (0x1UL << USB_OTG_GINTMSK_OTGINT_Pos) /*!< 0x00000004 */
#define USB_OTG_GINTMSK_OTGINT        USB_OTG_GINTMSK_OTGINT_Msk /*!< OTG interrupt mask                                  */
#define USB_OTG_GINTMSK_SOFM_Pos      (3U)
#define USB_OTG_GINTMSK_SOFM_Msk      (0x1UL << USB_OTG_GINTMSK_SOFM_Pos) /*!< 0x00000008 */
#define USB_OTG_GINTMSK_SOFM          USB_OTG_GINTMSK_SOFM_Msk /*!< Start of frame mask                                 */
#define USB_OTG_GINTMSK_RXFLVLM_Pos   (4U)
#define USB_OTG_GINTMSK_RXFLVLM_Msk   (0x1UL << USB_OTG_GINTMSK_RXFLVLM_Pos) /*!< 0x00000010 */
#define USB_OTG_GINTMSK_RXFLVLM       USB_OTG_GINTMSK_RXFLVLM_Msk /*!< Receive FIFO nonempty mask            */
#define USB_OTG_GINTMSK_NPTXFEM_Pos   (5U)
#define USB_OTG_GINTMSK_NPTXFEM_Msk   (0x1UL << USB_OTG_GINTMSK_NPTXFEM_Pos) /*!< 0x00000020 */
#define USB_OTG_GINTMSK_NPTXFEM       USB_OTG_GINTMSK_NPTXFEM_Msk /*!< Nonperiodic TxFIFO empty mask            */
#define USB_OTG_GINTMSK_GINAKEFFM_Pos (6U)
#define USB_OTG_GINTMSK_GINAKEFFM_Msk (0x1UL << USB_OTG_GINTMSK_GINAKEFFM_Pos) /*!< 0x00000040 */
#define USB_OTG_GINTMSK_GINAKEFFM                                                                                      \
  USB_OTG_GINTMSK_GINAKEFFM_Msk /*!< Global nonperiodic IN NAK effective mask            */
#define USB_OTG_GINTMSK_GONAKEFFM_Pos (7U)
#define USB_OTG_GINTMSK_GONAKEFFM_Msk (0x1UL << USB_OTG_GINTMSK_GONAKEFFM_Pos) /*!< 0x00000080 */
#define USB_OTG_GINTMSK_GONAKEFFM                                                                                      \
  USB_OTG_GINTMSK_GONAKEFFM_Msk /*!< Global OUT NAK effective mask                       */
#define USB_OTG_GINTMSK_ESUSPM_Pos   (10U)
#define USB_OTG_GINTMSK_ESUSPM_Msk   (0x1UL << USB_OTG_GINTMSK_ESUSPM_Pos) /*!< 0x00000400 */
#define USB_OTG_GINTMSK_ESUSPM       USB_OTG_GINTMSK_ESUSPM_Msk /*!< Early suspend mask                                  */
#define USB_OTG_GINTMSK_USBSUSPM_Pos (11U)
#define USB_OTG_GINTMSK_USBSUSPM_Msk (0x1UL << USB_OTG_GINTMSK_USBSUSPM_Pos) /*!< 0x00000800 */
#define USB_OTG_GINTMSK_USBSUSPM                                                                                       \
  USB_OTG_GINTMSK_USBSUSPM_Msk /*!< USB suspend mask                                    */
#define USB_OTG_GINTMSK_USBRST_Pos   (12U)
#define USB_OTG_GINTMSK_USBRST_Msk   (0x1UL << USB_OTG_GINTMSK_USBRST_Pos) /*!< 0x00001000 */
#define USB_OTG_GINTMSK_USBRST       USB_OTG_GINTMSK_USBRST_Msk /*!< USB reset mask                                      */
#define USB_OTG_GINTMSK_ENUMDNEM_Pos (13U)
#define USB_OTG_GINTMSK_ENUMDNEM_Msk (0x1UL << USB_OTG_GINTMSK_ENUMDNEM_Pos) /*!< 0x00002000 */
#define USB_OTG_GINTMSK_ENUMDNEM                                                                                       \
  USB_OTG_GINTMSK_ENUMDNEM_Msk /*!< Enumeration done mask                               */
#define USB_OTG_GINTMSK_ISOODRPM_Pos (14U)
#define USB_OTG_GINTMSK_ISOODRPM_Msk (0x1UL << USB_OTG_GINTMSK_ISOODRPM_Pos) /*!< 0x00004000 */
#define USB_OTG_GINTMSK_ISOODRPM                                                                                       \
  USB_OTG_GINTMSK_ISOODRPM_Msk /*!< Isochronous OUT packet dropped interrupt mask       */
#define USB_OTG_GINTMSK_EOPFM_Pos     (15U)
#define USB_OTG_GINTMSK_EOPFM_Msk     (0x1UL << USB_OTG_GINTMSK_EOPFM_Pos) /*!< 0x00008000 */
#define USB_OTG_GINTMSK_EOPFM         USB_OTG_GINTMSK_EOPFM_Msk /*!< End of periodic frame interrupt mask                */
#define USB_OTG_GINTMSK_EPMISM_Pos    (17U)
#define USB_OTG_GINTMSK_EPMISM_Msk    (0x1UL << USB_OTG_GINTMSK_EPMISM_Pos) /*!< 0x00020000 */
#define USB_OTG_GINTMSK_EPMISM        USB_OTG_GINTMSK_EPMISM_Msk /*!< Endpoint mismatch interrupt mask                    */
#define USB_OTG_GINTMSK_IEPINT_Pos    (18U)
#define USB_OTG_GINTMSK_IEPINT_Msk    (0x1UL << USB_OTG_GINTMSK_IEPINT_Pos) /*!< 0x00040000 */
#define USB_OTG_GINTMSK_IEPINT        USB_OTG_GINTMSK_IEPINT_Msk /*!< IN endpoints interrupt mask                         */
#define USB_OTG_GINTMSK_OEPINT_Pos    (19U)
#define USB_OTG_GINTMSK_OEPINT_Msk    (0x1UL << USB_OTG_GINTMSK_OEPINT_Pos) /*!< 0x00080000 */
#define USB_OTG_GINTMSK_OEPINT        USB_OTG_GINTMSK_OEPINT_Msk /*!< OUT endpoints interrupt mask                        */
#define USB_OTG_GINTMSK_IISOIXFRM_Pos (20U)
#define USB_OTG_GINTMSK_IISOIXFRM_Msk (0x1UL << USB_OTG_GINTMSK_IISOIXFRM_Pos) /*!< 0x00100000 */
#define USB_OTG_GINTMSK_IISOIXFRM                                                                                      \
  USB_OTG_GINTMSK_IISOIXFRM_Msk /*!< Incomplete isochronous IN transfer mask             */
#define USB_OTG_GINTMSK_PXFRM_IISOOXFRM_Pos (21U)
#define USB_OTG_GINTMSK_PXFRM_IISOOXFRM_Msk (0x1UL << USB_OTG_GINTMSK_PXFRM_IISOOXFRM_Pos) /*!< 0x00200000 */
#define USB_OTG_GINTMSK_PXFRM_IISOOXFRM                                                                                \
  USB_OTG_GINTMSK_PXFRM_IISOOXFRM_Msk /*!< Incomplete periodic transfer mask                   */
#define USB_OTG_GINTMSK_FSUSPM_Pos   (22U)
#define USB_OTG_GINTMSK_FSUSPM_Msk   (0x1UL << USB_OTG_GINTMSK_FSUSPM_Pos) /*!< 0x00400000 */
#define USB_OTG_GINTMSK_FSUSPM       USB_OTG_GINTMSK_FSUSPM_Msk /*!< Data fetch suspended mask                           */
#define USB_OTG_GINTMSK_RSTDEM_Pos   (23U)
#define USB_OTG_GINTMSK_RSTDEM_Msk   (0x1UL << USB_OTG_GINTMSK_RSTDEM_Pos) /*!< 0x00800000 */
#define USB_OTG_GINTMSK_RSTDEM       USB_OTG_GINTMSK_RSTDEM_Msk /*!< Reset detected interrupt mask                      */
#define USB_OTG_GINTMSK_PRTIM_Pos    (24U)
#define USB_OTG_GINTMSK_PRTIM_Msk    (0x1UL << USB_OTG_GINTMSK_PRTIM_Pos) /*!< 0x01000000 */
#define USB_OTG_GINTMSK_PRTIM        USB_OTG_GINTMSK_PRTIM_Msk /*!< Host port interrupt mask                            */
#define USB_OTG_GINTMSK_HCIM_Pos     (25U)
#define USB_OTG_GINTMSK_HCIM_Msk     (0x1UL << USB_OTG_GINTMSK_HCIM_Pos) /*!< 0x02000000 */
#define USB_OTG_GINTMSK_HCIM         USB_OTG_GINTMSK_HCIM_Msk /*!< Host channels interrupt mask                        */
#define USB_OTG_GINTMSK_PTXFEM_Pos   (26U)
#define USB_OTG_GINTMSK_PTXFEM_Msk   (0x1UL << USB_OTG_GINTMSK_PTXFEM_Pos) /*!< 0x04000000 */
#define USB_OTG_GINTMSK_PTXFEM       USB_OTG_GINTMSK_PTXFEM_Msk /*!< Periodic TxFIFO empty mask                          */
#define USB_OTG_GINTMSK_LPMINTM_Pos  (27U)
#define USB_OTG_GINTMSK_LPMINTM_Msk  (0x1UL << USB_OTG_GINTMSK_LPMINTM_Pos) /*!< 0x08000000 */
#define USB_OTG_GINTMSK_LPMINTM      USB_OTG_GINTMSK_LPMINTM_Msk            /*!< LPM interrupt Mask            */
#define USB_OTG_GINTMSK_CIDSCHGM_Pos (28U)
#define USB_OTG_GINTMSK_CIDSCHGM_Msk (0x1UL << USB_OTG_GINTMSK_CIDSCHGM_Pos) /*!< 0x10000000 */
#define USB_OTG_GINTMSK_CIDSCHGM                                                                                       \
  USB_OTG_GINTMSK_CIDSCHGM_Msk /*!< Connector ID status change mask                     */
#define USB_OTG_GINTMSK_DISCINT_Pos (29U)
#define USB_OTG_GINTMSK_DISCINT_Msk (0x1UL << USB_OTG_GINTMSK_DISCINT_Pos) /*!< 0x20000000 */
#define USB_OTG_GINTMSK_DISCINT     USB_OTG_GINTMSK_DISCINT_Msk /*!< Disconnect detected interrupt mask            */
#define USB_OTG_GINTMSK_SRQIM_Pos   (30U)
#define USB_OTG_GINTMSK_SRQIM_Msk   (0x1UL << USB_OTG_GINTMSK_SRQIM_Pos) /*!< 0x40000000 */
#define USB_OTG_GINTMSK_SRQIM       USB_OTG_GINTMSK_SRQIM_Msk /*!< Session request/new session detected interrupt mask */
#define USB_OTG_GINTMSK_WUIM_Pos    (31U)
#define USB_OTG_GINTMSK_WUIM_Msk    (0x1UL << USB_OTG_GINTMSK_WUIM_Pos) /*!< 0x80000000 */
#define USB_OTG_GINTMSK_WUIM        USB_OTG_GINTMSK_WUIM_Msk /*!< Resume/remote wakeup detected interrupt mask        */

/********************  Bit definition forUSB_OTG_DAINT register  ********************/
#define USB_OTG_DAINT_IEPINT_Pos (0U)
#define USB_OTG_DAINT_IEPINT_Msk (0xFFFFUL << USB_OTG_DAINT_IEPINT_Pos) /*!< 0x0000FFFF */
#define USB_OTG_DAINT_IEPINT     USB_OTG_DAINT_IEPINT_Msk               /*!< IN endpoint interrupt bits  */
#define USB_OTG_DAINT_OEPINT_Pos (16U)
#define USB_OTG_DAINT_OEPINT_Msk (0xFFFFUL << USB_OTG_DAINT_OEPINT_Pos) /*!< 0xFFFF0000 */
#define USB_OTG_DAINT_OEPINT     USB_OTG_DAINT_OEPINT_Msk               /*!< OUT endpoint interrupt bits */

/********************  Bit definition forUSB_OTG_HAINTMSK register  ********************/
#define USB_OTG_HAINTMSK_HAINTM_Pos (0U)
#define USB_OTG_HAINTMSK_HAINTM_Msk (0xFFFFUL << USB_OTG_HAINTMSK_HAINTM_Pos) /*!< 0x0000FFFF */
#define USB_OTG_HAINTMSK_HAINTM     USB_OTG_HAINTMSK_HAINTM_Msk               /*!< Channel interrupt mask */

