Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define USB_OTG_HPRT_PLSTS_Pos   (10U)
#define USB_OTG_HPRT_PLSTS_Msk   (0x3UL << USB_OTG_HPRT_PLSTS_Pos) /*!< 0x00000C00 */
#define USB_OTG_HPRT_PLSTS       USB_OTG_HPRT_PLSTS_Msk            /*!< Port line status */
#define USB_OTG_HPRT_PLSTS_0     (0x1UL << USB_OTG_HPRT_PLSTS_Pos) /*!< 0x00000400 */
#define USB_OTG_HPRT_PLSTS_1     (0x2UL << USB_OTG_HPRT_PLSTS_Pos) /*!< 0x00000800 */
#define USB_OTG_HPRT_PPWR_Pos    (12U)
#define USB_OTG_HPRT_PPWR_Msk    (0x1UL << USB_OTG_HPRT_PPWR_Pos) /*!< 0x00001000 */
#define USB_OTG_HPRT_PPWR        USB_OTG_HPRT_PPWR_Msk            /*!< Port power */

#define USB_OTG_HPRT_PTCTL_Pos   (13U)
#define USB_OTG_HPRT_PTCTL_Msk   (0xFUL << USB_OTG_HPRT_PTCTL_Pos) /*!< 0x0001E000 */
#define USB_OTG_HPRT_PTCTL       USB_OTG_HPRT_PTCTL_Msk            /*!< Port test control */
#define USB_OTG_HPRT_PTCTL_0     (0x1UL << USB_OTG_HPRT_PTCTL_Pos) /*!< 0x00002000 */
#define USB_OTG_HPRT_PTCTL_1     (0x2UL << USB_OTG_HPRT_PTCTL_Pos) /*!< 0x00004000 */
#define USB_OTG_HPRT_PTCTL_2     (0x4UL << USB_OTG_HPRT_PTCTL_Pos) /*!< 0x00008000 */
#define USB_OTG_HPRT_PTCTL_3     (0x8UL << USB_OTG_HPRT_PTCTL_Pos) /*!< 0x00010000 */

#define USB_OTG_HPRT_PSPD_Pos    (17U)
#define USB_OTG_HPRT_PSPD_Msk    (0x3UL << USB_OTG_HPRT_PSPD_Pos) /*!< 0x00060000 */
#define USB_OTG_HPRT_PSPD        USB_OTG_HPRT_PSPD_Msk            /*!< Port speed */
#define USB_OTG_HPRT_PSPD_0      (0x1UL << USB_OTG_HPRT_PSPD_Pos) /*!< 0x00020000 */
#define USB_OTG_HPRT_PSPD_1      (0x2UL << USB_OTG_HPRT_PSPD_Pos) /*!< 0x00040000 */

/********************  Bit definition forUSB_OTG_DOEPEACHMSK1 register  ********************/
#define USB_OTG_DOEPEACHMSK1_XFRCM_Pos     (0U)
#define USB_OTG_DOEPEACHMSK1_XFRCM_Msk     (0x1UL << USB_OTG_DOEPEACHMSK1_XFRCM_Pos) /*!< 0x00000001 */
#define USB_OTG_DOEPEACHMSK1_XFRCM         USB_OTG_DOEPEACHMSK1_XFRCM_Msk /*!< Transfer completed interrupt mask */
#define USB_OTG_DOEPEACHMSK1_EPDM_Pos      (1U)
#define USB_OTG_DOEPEACHMSK1_EPDM_Msk      (0x1UL << USB_OTG_DOEPEACHMSK1_EPDM_Pos) /*!< 0x00000002 */
#define USB_OTG_DOEPEACHMSK1_EPDM          USB_OTG_DOEPEACHMSK1_EPDM_Msk /*!< Endpoint disabled interrupt mask */
#define USB_OTG_DOEPEACHMSK1_TOM_Pos       (3U)
#define USB_OTG_DOEPEACHMSK1_TOM_Msk       (0x1UL << USB_OTG_DOEPEACHMSK1_TOM_Pos) /*!< 0x00000008 */
#define USB_OTG_DOEPEACHMSK1_TOM           USB_OTG_DOEPEACHMSK1_TOM_Msk            /*!< Timeout condition mask */
#define USB_OTG_DOEPEACHMSK1_ITTXFEMSK_Pos (4U)
#define USB_OTG_DOEPEACHMSK1_ITTXFEMSK_Msk (0x1UL << USB_OTG_DOEPEACHMSK1_ITTXFEMSK_Pos) /*!< 0x00000010 */
#define USB_OTG_DOEPEACHMSK1_ITTXFEMSK                                                                                 \
  USB_OTG_DOEPEACHMSK1_ITTXFEMSK_Msk /*!< IN token received when TxFIFO empty mask */
#define USB_OTG_DOEPEACHMSK1_INEPNMM_Pos (5U)
#define USB_OTG_DOEPEACHMSK1_INEPNMM_Msk (0x1UL << USB_OTG_DOEPEACHMSK1_INEPNMM_Pos) /*!< 0x00000020 */
#define USB_OTG_DOEPEACHMSK1_INEPNMM     USB_OTG_DOEPEACHMSK1_INEPNMM_Msk /*!< IN token received with EP mismatch mask */
#define USB_OTG_DOEPEACHMSK1_INEPNEM_Pos (6U)
#define USB_OTG_DOEPEACHMSK1_INEPNEM_Msk (0x1UL << USB_OTG_DOEPEACHMSK1_INEPNEM_Pos) /*!< 0x00000040 */
#define USB_OTG_DOEPEACHMSK1_INEPNEM     USB_OTG_DOEPEACHMSK1_INEPNEM_Msk /*!< IN endpoint NAK effective mask */
#define USB_OTG_DOEPEACHMSK1_TXFURM_Pos  (8U)
#define USB_OTG_DOEPEACHMSK1_TXFURM_Msk  (0x1UL << USB_OTG_DOEPEACHMSK1_TXFURM_Pos) /*!< 0x00000100 */
#define USB_OTG_DOEPEACHMSK1_TXFURM      USB_OTG_DOEPEACHMSK1_TXFURM_Msk            /*!< OUT packet error mask */
#define USB_OTG_DOEPEACHMSK1_BIM_Pos     (9U)
#define USB_OTG_DOEPEACHMSK1_BIM_Msk     (0x1UL << USB_OTG_DOEPEACHMSK1_BIM_Pos) /*!< 0x00000200 */
#define USB_OTG_DOEPEACHMSK1_BIM         USB_OTG_DOEPEACHMSK1_BIM_Msk            /*!< BNA interrupt mask */
#define USB_OTG_DOEPEACHMSK1_BERRM_Pos   (12U)
#define USB_OTG_DOEPEACHMSK1_BERRM_Msk   (0x1UL << USB_OTG_DOEPEACHMSK1_BERRM_Pos) /*!< 0x00001000 */
#define USB_OTG_DOEPEACHMSK1_BERRM       USB_OTG_DOEPEACHMSK1_BERRM_Msk            /*!< Bubble error interrupt mask */
#define USB_OTG_DOEPEACHMSK1_NAKM_Pos    (13U)
#define USB_OTG_DOEPEACHMSK1_NAKM_Msk    (0x1UL << USB_OTG_DOEPEACHMSK1_NAKM_Pos) /*!< 0x00002000 */
#define USB_OTG_DOEPEACHMSK1_NAKM        USB_OTG_DOEPEACHMSK1_NAKM_Msk            /*!< NAK interrupt mask */
#define USB_OTG_DOEPEACHMSK1_NYETM_Pos   (14U)
#define USB_OTG_DOEPEACHMSK1_NYETM_Msk   (0x1UL << USB_OTG_DOEPEACHMSK1_NYETM_Pos) /*!< 0x00004000 */
#define USB_OTG_DOEPEACHMSK1_NYETM       USB_OTG_DOEPEACHMSK1_NYETM_Msk            /*!< NYET interrupt mask */

/********************  Bit definition forUSB_OTG_HPTXFSIZ register  ********************/
#define USB_OTG_HPTXFSIZ_PTXSA_Pos (0U)
#define USB_OTG_HPTXFSIZ_PTXSA_Msk (0xFFFFUL << USB_OTG_HPTXFSIZ_PTXSA_Pos) /*!< 0x0000FFFF */
#define USB_OTG_HPTXFSIZ_PTXSA     USB_OTG_HPTXFSIZ_PTXSA_Msk               /*!< Host periodic TxFIFO start address */
#define USB_OTG_HPTXFSIZ_PTXFD_Pos (16U)
#define USB_OTG_HPTXFSIZ_PTXFD_Msk (0xFFFFUL << USB_OTG_HPTXFSIZ_PTXFD_Pos) /*!< 0xFFFF0000 */
#define USB_OTG_HPTXFSIZ_PTXFD     USB_OTG_HPTXFSIZ_PTXFD_Msk               /*!< Host periodic TxFIFO depth */

/********************  Bit definition forUSB_OTG_DIEPCTL register  ********************/
#define USB_OTG_DIEPCTL_MPSIZ_Pos          (0U)
#define USB_OTG_DIEPCTL_MPSIZ_Msk          (0x7FFUL << USB_OTG_DIEPCTL_MPSIZ_Pos) /*!< 0x000007FF */
#define USB_OTG_DIEPCTL_MPSIZ              USB_OTG_DIEPCTL_MPSIZ_Msk              /*!< Maximum packet size */
#define USB_OTG_DIEPCTL_USBAEP_Pos         (15U)
#define USB_OTG_DIEPCTL_USBAEP_Msk         (0x1UL << USB_OTG_DIEPCTL_USBAEP_Pos) /*!< 0x00008000 */
#define USB_OTG_DIEPCTL_USBAEP             USB_OTG_DIEPCTL_USBAEP_Msk            /*!< USB active endpoint */
#define USB_OTG_DIEPCTL_EONUM_DPID_Pos     (16U)
#define USB_OTG_DIEPCTL_EONUM_DPID_Msk     (0x1UL << USB_OTG_DIEPCTL_EONUM_DPID_Pos) /*!< 0x00010000 */
#define USB_OTG_DIEPCTL_EONUM_DPID         USB_OTG_DIEPCTL_EONUM_DPID_Msk            /*!< Even/odd frame */
#define USB_OTG_DIEPCTL_NAKSTS_Pos         (17U)
#define USB_OTG_DIEPCTL_NAKSTS_Msk         (0x1UL << USB_OTG_DIEPCTL_NAKSTS_Pos) /*!< 0x00020000 */
#define USB_OTG_DIEPCTL_NAKSTS             USB_OTG_DIEPCTL_NAKSTS_Msk            /*!< NAK status */

#define USB_OTG_DIEPCTL_EPTYP_Pos          (18U)
#define USB_OTG_DIEPCTL_EPTYP_Msk          (0x3UL << USB_OTG_DIEPCTL_EPTYP_Pos) /*!< 0x000C0000 */
#define USB_OTG_DIEPCTL_EPTYP              USB_OTG_DIEPCTL_EPTYP_Msk            /*!< Endpoint type */
#define USB_OTG_DIEPCTL_EPTYP_0            (0x1UL << USB_OTG_DIEPCTL_EPTYP_Pos) /*!< 0x00040000 */
#define USB_OTG_DIEPCTL_EPTYP_1            (0x2UL << USB_OTG_DIEPCTL_EPTYP_Pos) /*!< 0x00080000 */
#define USB_OTG_DIEPCTL_STALL_Pos          (21U)
#define USB_OTG_DIEPCTL_STALL_Msk          (0x1UL << USB_OTG_DIEPCTL_STALL_Pos) /*!< 0x00200000 */
#define USB_OTG_DIEPCTL_STALL              USB_OTG_DIEPCTL_STALL_Msk            /*!< STALL handshake */

#define USB_OTG_DIEPCTL_TXFNUM_Pos         (22U)
#define USB_OTG_DIEPCTL_TXFNUM_Msk         (0xFUL << USB_OTG_DIEPCTL_TXFNUM_Pos) /*!< 0x03C00000 */
#define USB_OTG_DIEPCTL_TXFNUM             USB_OTG_DIEPCTL_TXFNUM_Msk            /*!< TxFIFO number */
#define USB_OTG_DIEPCTL_TXFNUM_0           (0x1UL << USB_OTG_DIEPCTL_TXFNUM_Pos) /*!< 0x00400000 */
#define USB_OTG_DIEPCTL_TXFNUM_1           (0x2UL << USB_OTG_DIEPCTL_TXFNUM_Pos) /*!< 0x00800000 */
#define USB_OTG_DIEPCTL_TXFNUM_2           (0x4UL << USB_OTG_DIEPCTL_TXFNUM_Pos) /*!< 0x01000000 */
#define USB_OTG_DIEPCTL_TXFNUM_3           (0x8UL << USB_OTG_DIEPCTL_TXFNUM_Pos) /*!< 0x02000000 */
#define USB_OTG_DIEPCTL_CNAK_Pos           (26U)
#define USB_OTG_DIEPCTL_CNAK_Msk           (0x1UL << USB_OTG_DIEPCTL_CNAK_Pos) /*!< 0x04000000 */
#define USB_OTG_DIEPCTL_CNAK               USB_OTG_DIEPCTL_CNAK_Msk            /*!< Clear NAK */
#define USB_OTG_DIEPCTL_SNAK_Pos           (27U)
#define USB_OTG_DIEPCTL_SNAK_Msk           (0x1UL << USB_OTG_DIEPCTL_SNAK_Pos) /*!< 0x08000000 */
#define USB_OTG_DIEPCTL_SNAK               USB_OTG_DIEPCTL_SNAK_Msk            /*!< Set NAK */
#define USB_OTG_DIEPCTL_SD0PID_SEVNFRM_Pos (28U)
#define USB_OTG_DIEPCTL_SD0PID_SEVNFRM_Msk (0x1UL << USB_OTG_DIEPCTL_SD0PID_SEVNFRM_Pos) /*!< 0x10000000 */
#define USB_OTG_DIEPCTL_SD0PID_SEVNFRM     USB_OTG_DIEPCTL_SD0PID_SEVNFRM_Msk            /*!< Set DATA0 PID */
#define USB_OTG_DIEPCTL_SODDFRM_Pos        (29U)
#define USB_OTG_DIEPCTL_SODDFRM_Msk        (0x1UL << USB_OTG_DIEPCTL_SODDFRM_Pos) /*!< 0x20000000 */
#define USB_OTG_DIEPCTL_SODDFRM            USB_OTG_DIEPCTL_SODDFRM_Msk            /*!< Set odd frame */
#define USB_OTG_DIEPCTL_EPDIS_Pos          (30U)
#define USB_OTG_DIEPCTL_EPDIS_Msk          (0x1UL << USB_OTG_DIEPCTL_EPDIS_Pos) /*!< 0x40000000 */
#define USB_OTG_DIEPCTL_EPDIS              USB_OTG_DIEPCTL_EPDIS_Msk            /*!< Endpoint disable */
#define USB_OTG_DIEPCTL_EPENA_Pos          (31U)
#define USB_OTG_DIEPCTL_EPENA_Msk          (0x1UL << USB_OTG_DIEPCTL_EPENA_Pos) /*!< 0x80000000 */
#define USB_OTG_DIEPCTL_EPENA              USB_OTG_DIEPCTL_EPENA_Msk            /*!< Endpoint enable */

/********************  Bit definition forUSB_OTG_HCCHAR register  ********************/
#define USB_OTG_HCCHAR_MPSIZ_Pos  (0U)
#define USB_OTG_HCCHAR_MPSIZ_Msk  (0x7FFUL << USB_OTG_HCCHAR_MPSIZ_Pos) /*!< 0x000007FF */
#define USB_OTG_HCCHAR_MPSIZ      USB_OTG_HCCHAR_MPSIZ_Msk              /*!< Maximum packet size */

#define USB_OTG_HCCHAR_EPNUM_Pos  (11U)
#define USB_OTG_HCCHAR_EPNUM_Msk  (0xFUL << USB_OTG_HCCHAR_EPNUM_Pos) /*!< 0x00007800 */
#define USB_OTG_HCCHAR_EPNUM      USB_OTG_HCCHAR_EPNUM_Msk            /*!< Endpoint number */
#define USB_OTG_HCCHAR_EPNUM_0    (0x1UL << USB_OTG_HCCHAR_EPNUM_Pos) /*!< 0x00000800 */
#define USB_OTG_HCCHAR_EPNUM_1    (0x2UL << USB_OTG_HCCHAR_EPNUM_Pos) /*!< 0x00001000 */
#define USB_OTG_HCCHAR_EPNUM_2    (0x4UL << USB_OTG_HCCHAR_EPNUM_Pos) /*!< 0x00002000 */
#define USB_OTG_HCCHAR_EPNUM_3    (0x8UL << USB_OTG_HCCHAR_EPNUM_Pos) /*!< 0x00004000 */
#define USB_OTG_HCCHAR_EPDIR_Pos  (15U)
#define USB_OTG_HCCHAR_EPDIR_Msk  (0x1UL << USB_OTG_HCCHAR_EPDIR_Pos) /*!< 0x00008000 */
#define USB_OTG_HCCHAR_EPDIR      USB_OTG_HCCHAR_EPDIR_Msk            /*!< Endpoint direction */
#define USB_OTG_HCCHAR_LSDEV_Pos  (17U)
#define USB_OTG_HCCHAR_LSDEV_Msk  (0x1UL << USB_OTG_HCCHAR_LSDEV_Pos) /*!< 0x00020000 */
#define USB_OTG_HCCHAR_LSDEV      USB_OTG_HCCHAR_LSDEV_Msk            /*!< Low-speed device */

