Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
#define USB_OTG_HCCHAR_EPTYP_Pos  (18U)
#define USB_OTG_HCCHAR_EPTYP_Msk  (0x3UL << USB_OTG_HCCHAR_EPTYP_Pos) /*!< 0x000C0000 */
#define USB_OTG_HCCHAR_EPTYP      USB_OTG_HCCHAR_EPTYP_Msk            /*!< Endpoint type */
#define USB_OTG_HCCHAR_EPTYP_0    (0x1UL << USB_OTG_HCCHAR_EPTYP_Pos) /*!< 0x00040000 */
#define USB_OTG_HCCHAR_EPTYP_1    (0x2UL << USB_OTG_HCCHAR_EPTYP_Pos) /*!< 0x00080000 */

#define USB_OTG_HCCHAR_MC_Pos     (20U)
#define USB_OTG_HCCHAR_MC_Msk     (0x3UL << USB_OTG_HCCHAR_MC_Pos) /*!< 0x00300000 */
#define USB_OTG_HCCHAR_MC         USB_OTG_HCCHAR_MC_Msk            /*!< Multi Count (MC) / Error Count (EC) */
#define USB_OTG_HCCHAR_MC_0       (0x1UL << USB_OTG_HCCHAR_MC_Pos) /*!< 0x00100000 */
#define USB_OTG_HCCHAR_MC_1       (0x2UL << USB_OTG_HCCHAR_MC_Pos) /*!< 0x00200000 */

#define USB_OTG_HCCHAR_DAD_Pos    (22U)
#define USB_OTG_HCCHAR_DAD_Msk    (0x7FUL << USB_OTG_HCCHAR_DAD_Pos) /*!< 0x1FC00000 */
#define USB_OTG_HCCHAR_DAD        USB_OTG_HCCHAR_DAD_Msk             /*!< Device address */
#define USB_OTG_HCCHAR_DAD_0      (0x01UL << USB_OTG_HCCHAR_DAD_Pos) /*!< 0x00400000 */
#define USB_OTG_HCCHAR_DAD_1      (0x02UL << USB_OTG_HCCHAR_DAD_Pos) /*!< 0x00800000 */
#define USB_OTG_HCCHAR_DAD_2      (0x04UL << USB_OTG_HCCHAR_DAD_Pos) /*!< 0x01000000 */
#define USB_OTG_HCCHAR_DAD_3      (0x08UL << USB_OTG_HCCHAR_DAD_Pos) /*!< 0x02000000 */
#define USB_OTG_HCCHAR_DAD_4      (0x10UL << USB_OTG_HCCHAR_DAD_Pos) /*!< 0x04000000 */
#define USB_OTG_HCCHAR_DAD_5      (0x20UL << USB_OTG_HCCHAR_DAD_Pos) /*!< 0x08000000 */
#define USB_OTG_HCCHAR_DAD_6      (0x40UL << USB_OTG_HCCHAR_DAD_Pos) /*!< 0x10000000 */
#define USB_OTG_HCCHAR_ODDFRM_Pos (29U)
#define USB_OTG_HCCHAR_ODDFRM_Msk (0x1UL << USB_OTG_HCCHAR_ODDFRM_Pos) /*!< 0x20000000 */
#define USB_OTG_HCCHAR_ODDFRM     USB_OTG_HCCHAR_ODDFRM_Msk            /*!< Odd frame */
#define USB_OTG_HCCHAR_CHDIS_Pos  (30U)
#define USB_OTG_HCCHAR_CHDIS_Msk  (0x1UL << USB_OTG_HCCHAR_CHDIS_Pos) /*!< 0x40000000 */
#define USB_OTG_HCCHAR_CHDIS      USB_OTG_HCCHAR_CHDIS_Msk            /*!< Channel disable */
#define USB_OTG_HCCHAR_CHENA_Pos  (31U)
#define USB_OTG_HCCHAR_CHENA_Msk  (0x1UL << USB_OTG_HCCHAR_CHENA_Pos) /*!< 0x80000000 */
#define USB_OTG_HCCHAR_CHENA      USB_OTG_HCCHAR_CHENA_Msk            /*!< Channel enable */

/********************  Bit definition forUSB_OTG_HCSPLT register  ********************/

#define USB_OTG_HCSPLT_PRTADDR_Pos   (0U)
#define USB_OTG_HCSPLT_PRTADDR_Msk   (0x7FUL << USB_OTG_HCSPLT_PRTADDR_Pos) /*!< 0x0000007F */
#define USB_OTG_HCSPLT_PRTADDR       USB_OTG_HCSPLT_PRTADDR_Msk             /*!< Port address */
#define USB_OTG_HCSPLT_PRTADDR_0     (0x01UL << USB_OTG_HCSPLT_PRTADDR_Pos) /*!< 0x00000001 */
#define USB_OTG_HCSPLT_PRTADDR_1     (0x02UL << USB_OTG_HCSPLT_PRTADDR_Pos) /*!< 0x00000002 */
#define USB_OTG_HCSPLT_PRTADDR_2     (0x04UL << USB_OTG_HCSPLT_PRTADDR_Pos) /*!< 0x00000004 */
#define USB_OTG_HCSPLT_PRTADDR_3     (0x08UL << USB_OTG_HCSPLT_PRTADDR_Pos) /*!< 0x00000008 */
#define USB_OTG_HCSPLT_PRTADDR_4     (0x10UL << USB_OTG_HCSPLT_PRTADDR_Pos) /*!< 0x00000010 */
#define USB_OTG_HCSPLT_PRTADDR_5     (0x20UL << USB_OTG_HCSPLT_PRTADDR_Pos) /*!< 0x00000020 */
#define USB_OTG_HCSPLT_PRTADDR_6     (0x40UL << USB_OTG_HCSPLT_PRTADDR_Pos) /*!< 0x00000040 */

#define USB_OTG_HCSPLT_HUBADDR_Pos   (7U)
#define USB_OTG_HCSPLT_HUBADDR_Msk   (0x7FUL << USB_OTG_HCSPLT_HUBADDR_Pos) /*!< 0x00003F80 */
#define USB_OTG_HCSPLT_HUBADDR       USB_OTG_HCSPLT_HUBADDR_Msk             /*!< Hub address */
#define USB_OTG_HCSPLT_HUBADDR_0     (0x01UL << USB_OTG_HCSPLT_HUBADDR_Pos) /*!< 0x00000080 */
#define USB_OTG_HCSPLT_HUBADDR_1     (0x02UL << USB_OTG_HCSPLT_HUBADDR_Pos) /*!< 0x00000100 */
#define USB_OTG_HCSPLT_HUBADDR_2     (0x04UL << USB_OTG_HCSPLT_HUBADDR_Pos) /*!< 0x00000200 */
#define USB_OTG_HCSPLT_HUBADDR_3     (0x08UL << USB_OTG_HCSPLT_HUBADDR_Pos) /*!< 0x00000400 */
#define USB_OTG_HCSPLT_HUBADDR_4     (0x10UL << USB_OTG_HCSPLT_HUBADDR_Pos) /*!< 0x00000800 */
#define USB_OTG_HCSPLT_HUBADDR_5     (0x20UL << USB_OTG_HCSPLT_HUBADDR_Pos) /*!< 0x00001000 */
#define USB_OTG_HCSPLT_HUBADDR_6     (0x40UL << USB_OTG_HCSPLT_HUBADDR_Pos) /*!< 0x00002000 */

#define USB_OTG_HCSPLT_XACTPOS_Pos   (14U)
#define USB_OTG_HCSPLT_XACTPOS_Msk   (0x3UL << USB_OTG_HCSPLT_XACTPOS_Pos) /*!< 0x0000C000 */
#define USB_OTG_HCSPLT_XACTPOS       USB_OTG_HCSPLT_XACTPOS_Msk            /*!< XACTPOS */
#define USB_OTG_HCSPLT_XACTPOS_0     (0x1UL << USB_OTG_HCSPLT_XACTPOS_Pos) /*!< 0x00004000 */
#define USB_OTG_HCSPLT_XACTPOS_1     (0x2UL << USB_OTG_HCSPLT_XACTPOS_Pos) /*!< 0x00008000 */
#define USB_OTG_HCSPLT_COMPLSPLT_Pos (16U)
#define USB_OTG_HCSPLT_COMPLSPLT_Msk (0x1UL << USB_OTG_HCSPLT_COMPLSPLT_Pos) /*!< 0x00010000 */
#define USB_OTG_HCSPLT_COMPLSPLT     USB_OTG_HCSPLT_COMPLSPLT_Msk            /*!< Do complete split */
#define USB_OTG_HCSPLT_SPLITEN_Pos   (31U)
#define USB_OTG_HCSPLT_SPLITEN_Msk   (0x1UL << USB_OTG_HCSPLT_SPLITEN_Pos) /*!< 0x80000000 */
#define USB_OTG_HCSPLT_SPLITEN       USB_OTG_HCSPLT_SPLITEN_Msk            /*!< Split enable */

/********************  Bit definition forUSB_OTG_HCINT register  ********************/
#define USB_OTG_HCINT_XFRC_Pos   (0U)
#define USB_OTG_HCINT_XFRC_Msk   (0x1UL << USB_OTG_HCINT_XFRC_Pos) /*!< 0x00000001 */
#define USB_OTG_HCINT_XFRC       USB_OTG_HCINT_XFRC_Msk            /*!< Transfer completed */
#define USB_OTG_HCINT_CHH_Pos    (1U)
#define USB_OTG_HCINT_CHH_Msk    (0x1UL << USB_OTG_HCINT_CHH_Pos) /*!< 0x00000002 */
#define USB_OTG_HCINT_CHH        USB_OTG_HCINT_CHH_Msk            /*!< Channel halted */
#define USB_OTG_HCINT_AHBERR_Pos (2U)
#define USB_OTG_HCINT_AHBERR_Msk (0x1UL << USB_OTG_HCINT_AHBERR_Pos) /*!< 0x00000004 */
#define USB_OTG_HCINT_AHBERR     USB_OTG_HCINT_AHBERR_Msk            /*!< AHB error */
#define USB_OTG_HCINT_STALL_Pos  (3U)
#define USB_OTG_HCINT_STALL_Msk  (0x1UL << USB_OTG_HCINT_STALL_Pos) /*!< 0x00000008 */
#define USB_OTG_HCINT_STALL      USB_OTG_HCINT_STALL_Msk            /*!< STALL response received interrupt */
#define USB_OTG_HCINT_NAK_Pos    (4U)
#define USB_OTG_HCINT_NAK_Msk    (0x1UL << USB_OTG_HCINT_NAK_Pos) /*!< 0x00000010 */
#define USB_OTG_HCINT_NAK        USB_OTG_HCINT_NAK_Msk            /*!< NAK response received interrupt */
#define USB_OTG_HCINT_ACK_Pos    (5U)
#define USB_OTG_HCINT_ACK_Msk    (0x1UL << USB_OTG_HCINT_ACK_Pos) /*!< 0x00000020 */
#define USB_OTG_HCINT_ACK        USB_OTG_HCINT_ACK_Msk            /*!< ACK response received/transmitted interrupt */
#define USB_OTG_HCINT_NYET_Pos   (6U)
#define USB_OTG_HCINT_NYET_Msk   (0x1UL << USB_OTG_HCINT_NYET_Pos) /*!< 0x00000040 */
#define USB_OTG_HCINT_NYET       USB_OTG_HCINT_NYET_Msk            /*!< Response received interrupt */
#define USB_OTG_HCINT_TXERR_Pos  (7U)
#define USB_OTG_HCINT_TXERR_Msk  (0x1UL << USB_OTG_HCINT_TXERR_Pos) /*!< 0x00000080 */
#define USB_OTG_HCINT_TXERR      USB_OTG_HCINT_TXERR_Msk            /*!< Transaction error */
#define USB_OTG_HCINT_BBERR_Pos  (8U)
#define USB_OTG_HCINT_BBERR_Msk  (0x1UL << USB_OTG_HCINT_BBERR_Pos) /*!< 0x00000100 */
#define USB_OTG_HCINT_BBERR      USB_OTG_HCINT_BBERR_Msk            /*!< Babble error */
#define USB_OTG_HCINT_FRMOR_Pos  (9U)
#define USB_OTG_HCINT_FRMOR_Msk  (0x1UL << USB_OTG_HCINT_FRMOR_Pos) /*!< 0x00000200 */
#define USB_OTG_HCINT_FRMOR      USB_OTG_HCINT_FRMOR_Msk            /*!< Frame overrun */
#define USB_OTG_HCINT_DTERR_Pos  (10U)
#define USB_OTG_HCINT_DTERR_Msk  (0x1UL << USB_OTG_HCINT_DTERR_Pos) /*!< 0x00000400 */
#define USB_OTG_HCINT_DTERR      USB_OTG_HCINT_DTERR_Msk            /*!< Data toggle error */

/********************  Bit definition forUSB_OTG_DIEPINT register  ********************/
#define USB_OTG_DIEPINT_XFRC_Pos       (0U)
#define USB_OTG_DIEPINT_XFRC_Msk       (0x1UL << USB_OTG_DIEPINT_XFRC_Pos) /*!< 0x00000001 */
#define USB_OTG_DIEPINT_XFRC           USB_OTG_DIEPINT_XFRC_Msk            /*!< Transfer completed interrupt */
#define USB_OTG_DIEPINT_EPDISD_Pos     (1U)
#define USB_OTG_DIEPINT_EPDISD_Msk     (0x1UL << USB_OTG_DIEPINT_EPDISD_Pos) /*!< 0x00000002 */
#define USB_OTG_DIEPINT_EPDISD         USB_OTG_DIEPINT_EPDISD_Msk            /*!< Endpoint disabled interrupt */
#define USB_OTG_DIEPINT_AHBERR_Pos     (2U)
#define USB_OTG_DIEPINT_AHBERR_Msk     (0x1UL << USB_OTG_DIEPINT_AHBERR_Pos) /*!< 0x00000004 */
#define USB_OTG_DIEPINT_AHBERR         USB_OTG_DIEPINT_AHBERR_Msk /*!< AHB Error (AHBErr) during an IN transaction */
#define USB_OTG_DIEPINT_TOC_Pos        (3U)
#define USB_OTG_DIEPINT_TOC_Msk        (0x1UL << USB_OTG_DIEPINT_TOC_Pos) /*!< 0x00000008 */
#define USB_OTG_DIEPINT_TOC            USB_OTG_DIEPINT_TOC_Msk            /*!< Timeout condition */
#define USB_OTG_DIEPINT_ITTXFE_Pos     (4U)
#define USB_OTG_DIEPINT_ITTXFE_Msk     (0x1UL << USB_OTG_DIEPINT_ITTXFE_Pos) /*!< 0x00000010 */
#define USB_OTG_DIEPINT_ITTXFE         USB_OTG_DIEPINT_ITTXFE_Msk /*!< IN token received when TxFIFO is empty */
#define USB_OTG_DIEPINT_INEPNM_Pos     (5U)
#define USB_OTG_DIEPINT_INEPNM_Msk     (0x1UL << USB_OTG_DIEPINT_INEPNM_Pos) /*!< 0x00000020 */
#define USB_OTG_DIEPINT_INEPNM         USB_OTG_DIEPINT_INEPNM_Msk            /*!< IN token received with EP mismatch */
#define USB_OTG_DIEPINT_INEPNE_Pos     (6U)
#define USB_OTG_DIEPINT_INEPNE_Msk     (0x1UL << USB_OTG_DIEPINT_INEPNE_Pos) /*!< 0x00000040 */
#define USB_OTG_DIEPINT_INEPNE         USB_OTG_DIEPINT_INEPNE_Msk            /*!< IN endpoint NAK effective */
#define USB_OTG_DIEPINT_TXFE_Pos       (7U)
#define USB_OTG_DIEPINT_TXFE_Msk       (0x1UL << USB_OTG_DIEPINT_TXFE_Pos) /*!< 0x00000080 */
#define USB_OTG_DIEPINT_TXFE           USB_OTG_DIEPINT_TXFE_Msk            /*!< Transmit FIFO empty */
#define USB_OTG_DIEPINT_TXFIFOUDRN_Pos (8U)
#define USB_OTG_DIEPINT_TXFIFOUDRN_Msk (0x1UL << USB_OTG_DIEPINT_TXFIFOUDRN_Pos) /*!< 0x00000100 */
#define USB_OTG_DIEPINT_TXFIFOUDRN     USB_OTG_DIEPINT_TXFIFOUDRN_Msk            /*!< Transmit Fifo Underrun */
#define USB_OTG_DIEPINT_BNA_Pos        (9U)
#define USB_OTG_DIEPINT_BNA_Msk        (0x1UL << USB_OTG_DIEPINT_BNA_Pos) /*!< 0x00000200 */
#define USB_OTG_DIEPINT_BNA            USB_OTG_DIEPINT_BNA_Msk            /*!< Buffer not available interrupt */
#define USB_OTG_DIEPINT_PKTDRPSTS_Pos  (11U)
#define USB_OTG_DIEPINT_PKTDRPSTS_Msk  (0x1UL << USB_OTG_DIEPINT_PKTDRPSTS_Pos) /*!< 0x00000800 */
#define USB_OTG_DIEPINT_PKTDRPSTS      USB_OTG_DIEPINT_PKTDRPSTS_Msk            /*!< Packet dropped status */
#define USB_OTG_DIEPINT_BERR_Pos       (12U)
#define USB_OTG_DIEPINT_BERR_Msk       (0x1UL << USB_OTG_DIEPINT_BERR_Pos) /*!< 0x00001000 */
#define USB_OTG_DIEPINT_BERR           USB_OTG_DIEPINT_BERR_Msk            /*!< Babble error interrupt */
#define USB_OTG_DIEPINT_NAK_Pos        (13U)
#define USB_OTG_DIEPINT_NAK_Msk        (0x1UL << USB_OTG_DIEPINT_NAK_Pos) /*!< 0x00002000 */
#define USB_OTG_DIEPINT_NAK            USB_OTG_DIEPINT_NAK_Msk            /*!< NAK interrupt */

/********************  Bit definition forUSB_OTG_HCINTMSK register  ********************/
#define USB_OTG_HCINTMSK_XFRCM_Pos  (0U)
#define USB_OTG_HCINTMSK_XFRCM_Msk  (0x1UL << USB_OTG_HCINTMSK_XFRCM_Pos) /*!< 0x00000001 */
#define USB_OTG_HCINTMSK_XFRCM      USB_OTG_HCINTMSK_XFRCM_Msk            /*!< Transfer completed mask */
#define USB_OTG_HCINTMSK_CHHM_Pos   (1U)
#define USB_OTG_HCINTMSK_CHHM_Msk   (0x1UL << USB_OTG_HCINTMSK_CHHM_Pos) /*!< 0x00000002 */
#define USB_OTG_HCINTMSK_CHHM       USB_OTG_HCINTMSK_CHHM_Msk            /*!< Channel halted mask */
#define USB_OTG_HCINTMSK_AHBERR_Pos (2U)
#define USB_OTG_HCINTMSK_AHBERR_Msk (0x1UL << USB_OTG_HCINTMSK_AHBERR_Pos) /*!< 0x00000004 */
#define USB_OTG_HCINTMSK_AHBERR     USB_OTG_HCINTMSK_AHBERR_Msk            /*!< AHB error */
#define USB_OTG_HCINTMSK_STALLM_Pos (3U)
#define USB_OTG_HCINTMSK_STALLM_Msk (0x1UL << USB_OTG_HCINTMSK_STALLM_Pos) /*!< 0x00000008 */
#define USB_OTG_HCINTMSK_STALLM     USB_OTG_HCINTMSK_STALLM_Msk /*!< STALL response received interrupt mask */
#define USB_OTG_HCINTMSK_NAKM_Pos   (4U)
#define USB_OTG_HCINTMSK_NAKM_Msk   (0x1UL << USB_OTG_HCINTMSK_NAKM_Pos) /*!< 0x00000010 */
#define USB_OTG_HCINTMSK_NAKM       USB_OTG_HCINTMSK_NAKM_Msk            /*!< NAK response received interrupt mask */
#define USB_OTG_HCINTMSK_ACKM_Pos   (5U)
#define USB_OTG_HCINTMSK_ACKM_Msk   (0x1UL << USB_OTG_HCINTMSK_ACKM_Pos) /*!< 0x00000020 */
#define USB_OTG_HCINTMSK_ACKM       USB_OTG_HCINTMSK_ACKM_Msk /*!< ACK response received/transmitted interrupt mask */
#define USB_OTG_HCINTMSK_NYET_Pos   (6U)
#define USB_OTG_HCINTMSK_NYET_Msk   (0x1UL << USB_OTG_HCINTMSK_NYET_Pos) /*!< 0x00000040 */
#define USB_OTG_HCINTMSK_NYET       USB_OTG_HCINTMSK_NYET_Msk            /*!< response received interrupt mask */
#define USB_OTG_HCINTMSK_TXERRM_Pos (7U)
#define USB_OTG_HCINTMSK_TXERRM_Msk (0x1UL << USB_OTG_HCINTMSK_TXERRM_Pos) /*!< 0x00000080 */
#define USB_OTG_HCINTMSK_TXERRM     USB_OTG_HCINTMSK_TXERRM_Msk            /*!< Transaction error mask */
#define USB_OTG_HCINTMSK_BBERRM_Pos (8U)
#define USB_OTG_HCINTMSK_BBERRM_Msk (0x1UL << USB_OTG_HCINTMSK_BBERRM_Pos) /*!< 0x00000100 */
#define USB_OTG_HCINTMSK_BBERRM     USB_OTG_HCINTMSK_BBERRM_Msk            /*!< Babble error mask */
#define USB_OTG_HCINTMSK_FRMORM_Pos (9U)
#define USB_OTG_HCINTMSK_FRMORM_Msk (0x1UL << USB_OTG_HCINTMSK_FRMORM_Pos) /*!< 0x00000200 */
#define USB_OTG_HCINTMSK_FRMORM     USB_OTG_HCINTMSK_FRMORM_Msk            /*!< Frame overrun mask */
#define USB_OTG_HCINTMSK_DTERRM_Pos (10U)
#define USB_OTG_HCINTMSK_DTERRM_Msk (0x1UL << USB_OTG_HCINTMSK_DTERRM_Pos) /*!< 0x00000400 */
#define USB_OTG_HCINTMSK_DTERRM     USB_OTG_HCINTMSK_DTERRM_Msk            /*!< Data toggle error mask */

