Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/********************  Bit definition for USB_OTG_DIEPTSIZ register  ********************/

#define USB_OTG_DIEPTSIZ_XFRSIZ_Pos (0U)
#define USB_OTG_DIEPTSIZ_XFRSIZ_Msk (0x7FFFFUL << USB_OTG_DIEPTSIZ_XFRSIZ_Pos) /*!< 0x0007FFFF */
#define USB_OTG_DIEPTSIZ_XFRSIZ     USB_OTG_DIEPTSIZ_XFRSIZ_Msk                /*!< Transfer size */
#define USB_OTG_DIEPTSIZ_PKTCNT_Pos (19U)
#define USB_OTG_DIEPTSIZ_PKTCNT_Msk (0x3FFUL << USB_OTG_DIEPTSIZ_PKTCNT_Pos) /*!< 0x1FF80000 */
#define USB_OTG_DIEPTSIZ_PKTCNT     USB_OTG_DIEPTSIZ_PKTCNT_Msk              /*!< Packet count */
#define USB_OTG_DIEPTSIZ_MULCNT_Pos (29U)
#define USB_OTG_DIEPTSIZ_MULCNT_Msk (0x3UL << USB_OTG_DIEPTSIZ_MULCNT_Pos) /*!< 0x60000000 */
#define USB_OTG_DIEPTSIZ_MULCNT     USB_OTG_DIEPTSIZ_MULCNT_Msk            /*!< Packet count */
/********************  Bit definition forUSB_OTG_HCTSIZ register  ********************/
#define USB_OTG_HCTSIZ_XFRSIZ_Pos (0U)
#define USB_OTG_HCTSIZ_XFRSIZ_Msk (0x7FFFFUL << USB_OTG_HCTSIZ_XFRSIZ_Pos) /*!< 0x0007FFFF */
#define USB_OTG_HCTSIZ_XFRSIZ     USB_OTG_HCTSIZ_XFRSIZ_Msk                /*!< Transfer size */
#define USB_OTG_HCTSIZ_PKTCNT_Pos (19U)
#define USB_OTG_HCTSIZ_PKTCNT_Msk (0x3FFUL << USB_OTG_HCTSIZ_PKTCNT_Pos) /*!< 0x1FF80000 */
#define USB_OTG_HCTSIZ_PKTCNT     USB_OTG_HCTSIZ_PKTCNT_Msk              /*!< Packet count */
#define USB_OTG_HCTSIZ_DOPING_Pos (31U)
#define USB_OTG_HCTSIZ_DOPING_Msk (0x1UL << USB_OTG_HCTSIZ_DOPING_Pos) /*!< 0x80000000 */
#define USB_OTG_HCTSIZ_DOPING     USB_OTG_HCTSIZ_DOPING_Msk            /*!< Do PING */
#define USB_OTG_HCTSIZ_DPID_Pos   (29U)
#define USB_OTG_HCTSIZ_DPID_Msk   (0x3UL << USB_OTG_HCTSIZ_DPID_Pos) /*!< 0x60000000 */
#define USB_OTG_HCTSIZ_DPID       USB_OTG_HCTSIZ_DPID_Msk            /*!< Data PID */
#define USB_OTG_HCTSIZ_DPID_0     (0x1UL << USB_OTG_HCTSIZ_DPID_Pos) /*!< 0x20000000 */
#define USB_OTG_HCTSIZ_DPID_1     (0x2UL << USB_OTG_HCTSIZ_DPID_Pos) /*!< 0x40000000 */

/********************  Bit definition forUSB_OTG_DIEPDMA register  ********************/
#define USB_OTG_DIEPDMA_DMAADDR_Pos (0U)
#define USB_OTG_DIEPDMA_DMAADDR_Msk (0xFFFFFFFFUL << USB_OTG_DIEPDMA_DMAADDR_Pos) /*!< 0xFFFFFFFF */
#define USB_OTG_DIEPDMA_DMAADDR     USB_OTG_DIEPDMA_DMAADDR_Msk                   /*!< DMA address */

/********************  Bit definition forUSB_OTG_HCDMA register  ********************/
#define USB_OTG_HCDMA_DMAADDR_Pos (0U)
#define USB_OTG_HCDMA_DMAADDR_Msk (0xFFFFFFFFUL << USB_OTG_HCDMA_DMAADDR_Pos) /*!< 0xFFFFFFFF */
#define USB_OTG_HCDMA_DMAADDR     USB_OTG_HCDMA_DMAADDR_Msk                   /*!< DMA address */

/********************  Bit definition forUSB_OTG_DTXFSTS register  ********************/
#define USB_OTG_DTXFSTS_INEPTFSAV_Pos (0U)
#define USB_OTG_DTXFSTS_INEPTFSAV_Msk (0xFFFFUL << USB_OTG_DTXFSTS_INEPTFSAV_Pos) /*!< 0x0000FFFF */
#define USB_OTG_DTXFSTS_INEPTFSAV     USB_OTG_DTXFSTS_INEPTFSAV_Msk /*!< IN endpoint TxFIFO space available */

/********************  Bit definition forUSB_OTG_DIEPTXF register  ********************/
#define USB_OTG_DIEPTXF_INEPTXSA_Pos (0U)
#define USB_OTG_DIEPTXF_INEPTXSA_Msk (0xFFFFUL << USB_OTG_DIEPTXF_INEPTXSA_Pos) /*!< 0x0000FFFF */
#define USB_OTG_DIEPTXF_INEPTXSA     USB_OTG_DIEPTXF_INEPTXSA_Msk /*!< IN endpoint FIFOx transmit RAM start address */
#define USB_OTG_DIEPTXF_INEPTXFD_Pos (16U)
#define USB_OTG_DIEPTXF_INEPTXFD_Msk (0xFFFFUL << USB_OTG_DIEPTXF_INEPTXFD_Pos) /*!< 0xFFFF0000 */
#define USB_OTG_DIEPTXF_INEPTXFD     USB_OTG_DIEPTXF_INEPTXFD_Msk               /*!< IN endpoint TxFIFO depth */

/********************  Bit definition forUSB_OTG_DOEPCTL register  ********************/

#define USB_OTG_DOEPCTL_MPSIZ_Pos          (0U)
#define USB_OTG_DOEPCTL_MPSIZ_Msk          (0x7FFUL << USB_OTG_DOEPCTL_MPSIZ_Pos)                /*!< 0x000007FF */
#define USB_OTG_DOEPCTL_MPSIZ              USB_OTG_DOEPCTL_MPSIZ_Msk /*!< Maximum packet size */ /*!<Bit 1 */
#define USB_OTG_DOEPCTL_USBAEP_Pos         (15U)
#define USB_OTG_DOEPCTL_USBAEP_Msk         (0x1UL << USB_OTG_DOEPCTL_USBAEP_Pos) /*!< 0x00008000 */
#define USB_OTG_DOEPCTL_USBAEP             USB_OTG_DOEPCTL_USBAEP_Msk            /*!< USB active endpoint */
#define USB_OTG_DOEPCTL_NAKSTS_Pos         (17U)
#define USB_OTG_DOEPCTL_NAKSTS_Msk         (0x1UL << USB_OTG_DOEPCTL_NAKSTS_Pos) /*!< 0x00020000 */
#define USB_OTG_DOEPCTL_NAKSTS             USB_OTG_DOEPCTL_NAKSTS_Msk            /*!< NAK status */
#define USB_OTG_DOEPCTL_SD0PID_SEVNFRM_Pos (28U)
#define USB_OTG_DOEPCTL_SD0PID_SEVNFRM_Msk (0x1UL << USB_OTG_DOEPCTL_SD0PID_SEVNFRM_Pos) /*!< 0x10000000 */
#define USB_OTG_DOEPCTL_SD0PID_SEVNFRM     USB_OTG_DOEPCTL_SD0PID_SEVNFRM_Msk            /*!< Set DATA0 PID */
#define USB_OTG_DOEPCTL_SODDFRM_Pos        (29U)
#define USB_OTG_DOEPCTL_SODDFRM_Msk        (0x1UL << USB_OTG_DOEPCTL_SODDFRM_Pos) /*!< 0x20000000 */
#define USB_OTG_DOEPCTL_SODDFRM            USB_OTG_DOEPCTL_SODDFRM_Msk            /*!< Set odd frame */
#define USB_OTG_DOEPCTL_EPTYP_Pos          (18U)
#define USB_OTG_DOEPCTL_EPTYP_Msk          (0x3UL << USB_OTG_DOEPCTL_EPTYP_Pos) /*!< 0x000C0000 */
#define USB_OTG_DOEPCTL_EPTYP              USB_OTG_DOEPCTL_EPTYP_Msk            /*!< Endpoint type */
#define USB_OTG_DOEPCTL_EPTYP_0            (0x1UL << USB_OTG_DOEPCTL_EPTYP_Pos) /*!< 0x00040000 */
#define USB_OTG_DOEPCTL_EPTYP_1            (0x2UL << USB_OTG_DOEPCTL_EPTYP_Pos) /*!< 0x00080000 */
#define USB_OTG_DOEPCTL_SNPM_Pos           (20U)
#define USB_OTG_DOEPCTL_SNPM_Msk           (0x1UL << USB_OTG_DOEPCTL_SNPM_Pos) /*!< 0x00100000 */
#define USB_OTG_DOEPCTL_SNPM               USB_OTG_DOEPCTL_SNPM_Msk            /*!< Snoop mode */
#define USB_OTG_DOEPCTL_STALL_Pos          (21U)
#define USB_OTG_DOEPCTL_STALL_Msk          (0x1UL << USB_OTG_DOEPCTL_STALL_Pos) /*!< 0x00200000 */
#define USB_OTG_DOEPCTL_STALL              USB_OTG_DOEPCTL_STALL_Msk            /*!< STALL handshake */
#define USB_OTG_DOEPCTL_CNAK_Pos           (26U)
#define USB_OTG_DOEPCTL_CNAK_Msk           (0x1UL << USB_OTG_DOEPCTL_CNAK_Pos) /*!< 0x04000000 */
#define USB_OTG_DOEPCTL_CNAK               USB_OTG_DOEPCTL_CNAK_Msk            /*!< Clear NAK */
#define USB_OTG_DOEPCTL_SNAK_Pos           (27U)
#define USB_OTG_DOEPCTL_SNAK_Msk           (0x1UL << USB_OTG_DOEPCTL_SNAK_Pos) /*!< 0x08000000 */
#define USB_OTG_DOEPCTL_SNAK               USB_OTG_DOEPCTL_SNAK_Msk            /*!< Set NAK */
#define USB_OTG_DOEPCTL_EPDIS_Pos          (30U)
#define USB_OTG_DOEPCTL_EPDIS_Msk          (0x1UL << USB_OTG_DOEPCTL_EPDIS_Pos) /*!< 0x40000000 */
#define USB_OTG_DOEPCTL_EPDIS              USB_OTG_DOEPCTL_EPDIS_Msk            /*!< Endpoint disable */
#define USB_OTG_DOEPCTL_EPENA_Pos          (31U)
#define USB_OTG_DOEPCTL_EPENA_Msk          (0x1UL << USB_OTG_DOEPCTL_EPENA_Pos) /*!< 0x80000000 */
#define USB_OTG_DOEPCTL_EPENA              USB_OTG_DOEPCTL_EPENA_Msk            /*!< Endpoint enable */

/********************  Bit definition forUSB_OTG_DOEPINT register  ********************/
#define USB_OTG_DOEPINT_XFRC_Pos      (0U)
#define USB_OTG_DOEPINT_XFRC_Msk      (0x1UL << USB_OTG_DOEPINT_XFRC_Pos) /*!< 0x00000001 */
#define USB_OTG_DOEPINT_XFRC          USB_OTG_DOEPINT_XFRC_Msk            /*!< Transfer completed interrupt */
#define USB_OTG_DOEPINT_EPDISD_Pos    (1U)
#define USB_OTG_DOEPINT_EPDISD_Msk    (0x1UL << USB_OTG_DOEPINT_EPDISD_Pos) /*!< 0x00000002 */
#define USB_OTG_DOEPINT_EPDISD        USB_OTG_DOEPINT_EPDISD_Msk            /*!< Endpoint disabled interrupt */
#define USB_OTG_DOEPINT_AHBERR_Pos    (2U)
#define USB_OTG_DOEPINT_AHBERR_Msk    (0x1UL << USB_OTG_DOEPINT_AHBERR_Pos) /*!< 0x00000004 */
#define USB_OTG_DOEPINT_AHBERR        USB_OTG_DOEPINT_AHBERR_Msk /*!< AHB Error (AHBErr) during an OUT transaction */
#define USB_OTG_DOEPINT_STUP_Pos      (3U)
#define USB_OTG_DOEPINT_STUP_Msk      (0x1UL << USB_OTG_DOEPINT_STUP_Pos) /*!< 0x00000008 */
#define USB_OTG_DOEPINT_STUP          USB_OTG_DOEPINT_STUP_Msk            /*!< SETUP phase done */
#define USB_OTG_DOEPINT_OTEPDIS_Pos   (4U)
#define USB_OTG_DOEPINT_OTEPDIS_Msk   (0x1UL << USB_OTG_DOEPINT_OTEPDIS_Pos) /*!< 0x00000010 */
#define USB_OTG_DOEPINT_OTEPDIS       USB_OTG_DOEPINT_OTEPDIS_Msk /*!< OUT token received when endpoint disabled */
#define USB_OTG_DOEPINT_OTEPSPR_Pos   (5U)
#define USB_OTG_DOEPINT_OTEPSPR_Msk   (0x1UL << USB_OTG_DOEPINT_OTEPSPR_Pos) /*!< 0x00000020 */
#define USB_OTG_DOEPINT_OTEPSPR       USB_OTG_DOEPINT_OTEPSPR_Msk            /*!< OUT Status Phase Received interrupt */
#define USB_OTG_DOEPINT_B2BSTUP_Pos   (6U)
#define USB_OTG_DOEPINT_B2BSTUP_Msk   (0x1UL << USB_OTG_DOEPINT_B2BSTUP_Pos) /*!< 0x00000040 */
#define USB_OTG_DOEPINT_B2BSTUP       USB_OTG_DOEPINT_B2BSTUP_Msk            /*!< Back-to-back SETUP packets received */
#define USB_OTG_DOEPINT_OUTPKTERR_Pos (8U)
#define USB_OTG_DOEPINT_OUTPKTERR_Msk (0x1UL << USB_OTG_DOEPINT_OUTPKTERR_Pos) /*!< 0x00000100 */
#define USB_OTG_DOEPINT_OUTPKTERR     USB_OTG_DOEPINT_OUTPKTERR_Msk            /*!< OUT packet error */
#define USB_OTG_DOEPINT_BNA_Pos       (9U)
#define USB_OTG_DOEPINT_BNA_Msk       (0x1UL << USB_OTG_DOEPINT_BNA_Pos) /*!< 0x00000200 */
#define USB_OTG_DOEPINT_BNA           USB_OTG_DOEPINT_BNA_Msk            /*!< Buffer not available interrupt */
#define USB_OTG_DOEPINT_BERR_Pos      (12U)
#define USB_OTG_DOEPINT_BERR_Msk      (0x1UL << USB_OTG_DOEPINT_BERR_Pos) /*!< 0x00001000 */
#define USB_OTG_DOEPINT_BERR          USB_OTG_DOEPINT_BERR_Msk            /*!< Babble error interrupt */
#define USB_OTG_DOEPINT_NAK_Pos       (13U)
#define USB_OTG_DOEPINT_NAK_Msk       (0x1UL << USB_OTG_DOEPINT_NAK_Pos) /*!< 0x00002000 */
#define USB_OTG_DOEPINT_NAK           USB_OTG_DOEPINT_NAK_Msk            /*!< NAK Packet is transmitted by the device */
#define USB_OTG_DOEPINT_NYET_Pos      (14U)
#define USB_OTG_DOEPINT_NYET_Msk      (0x1UL << USB_OTG_DOEPINT_NYET_Pos) /*!< 0x00004000 */
#define USB_OTG_DOEPINT_NYET          USB_OTG_DOEPINT_NYET_Msk            /*!< NYET interrupt */
#define USB_OTG_DOEPINT_STPKTRX_Pos   (15U)
#define USB_OTG_DOEPINT_STPKTRX_Msk   (0x1UL << USB_OTG_DOEPINT_STPKTRX_Pos) /*!< 0x00008000 */
#define USB_OTG_DOEPINT_STPKTRX       USB_OTG_DOEPINT_STPKTRX_Msk            /*!< Setup Packet Received */

/********************  Bit definition forUSB_OTG_DOEPTSIZ register  ********************/

#define USB_OTG_DOEPTSIZ_XFRSIZ_Pos  (0U)
#define USB_OTG_DOEPTSIZ_XFRSIZ_Msk  (0x7FFFFUL << USB_OTG_DOEPTSIZ_XFRSIZ_Pos) /*!< 0x0007FFFF */
#define USB_OTG_DOEPTSIZ_XFRSIZ      USB_OTG_DOEPTSIZ_XFRSIZ_Msk                /*!< Transfer size */
#define USB_OTG_DOEPTSIZ_PKTCNT_Pos  (19U)
#define USB_OTG_DOEPTSIZ_PKTCNT_Msk  (0x3FFUL << USB_OTG_DOEPTSIZ_PKTCNT_Pos) /*!< 0x1FF80000 */
#define USB_OTG_DOEPTSIZ_PKTCNT      USB_OTG_DOEPTSIZ_PKTCNT_Msk              /*!< Packet count */

#define USB_OTG_DOEPTSIZ_STUPCNT_Pos (29U)
#define USB_OTG_DOEPTSIZ_STUPCNT_Msk (0x3UL << USB_OTG_DOEPTSIZ_STUPCNT_Pos) /*!< 0x60000000 */
#define USB_OTG_DOEPTSIZ_STUPCNT     USB_OTG_DOEPTSIZ_STUPCNT_Msk            /*!< SETUP packet count */
#define USB_OTG_DOEPTSIZ_STUPCNT_0   (0x1UL << USB_OTG_DOEPTSIZ_STUPCNT_Pos) /*!< 0x20000000 */
#define USB_OTG_DOEPTSIZ_STUPCNT_1   (0x2UL << USB_OTG_DOEPTSIZ_STUPCNT_Pos) /*!< 0x40000000 */

/********************  Bit definition for PCGCCTL register  ********************/
#define USB_OTG_PCGCCTL_STOPCLK_Pos (0U)
#define USB_OTG_PCGCCTL_STOPCLK_Msk (0x1UL << USB_OTG_PCGCCTL_STOPCLK_Pos) /*!< 0x00000001 */
#define USB_OTG_PCGCCTL_STOPCLK     USB_OTG_PCGCCTL_STOPCLK_Msk            /*!< SETUP packet count */
#define USB_OTG_PCGCCTL_GATECLK_Pos (1U)
#define USB_OTG_PCGCCTL_GATECLK_Msk (0x1UL << USB_OTG_PCGCCTL_GATECLK_Pos) /*!< 0x00000002 */
#define USB_OTG_PCGCCTL_GATECLK     USB_OTG_PCGCCTL_GATECLK_Msk            /*!<Bit 0 */
#define USB_OTG_PCGCCTL_PHYSUSP_Pos (4U)
#define USB_OTG_PCGCCTL_PHYSUSP_Msk (0x1UL << USB_OTG_PCGCCTL_PHYSUSP_Pos) /*!< 0x00000010 */
#define USB_OTG_PCGCCTL_PHYSUSP     USB_OTG_PCGCCTL_PHYSUSP_Msk            /*!<Bit 1 */

/**
 * @}
 */

/**
 * @}
 */

/** @addtogroup Exported_macros
 * @{
 */

