Hitthesurf/music_player/firmware/tests/mocks/device/targets/stm32h7xx/stm32h7a3xxq_st.h
/******************************* ADC Instances ********************************/
#define IS_ADC_ALL_INSTANCE(INSTANCE)              (((INSTANCE) == ADC1) || ((INSTANCE) == ADC2))

#define IS_ADC_MULTIMODE_MASTER_INSTANCE(INSTANCE) ((INSTANCE) == ADC1)

#define IS_ADC_COMMON_INSTANCE(INSTANCE)           ((INSTANCE) == ADC12_COMMON)

/******************************** COMP Instances ******************************/
#define IS_COMP_ALL_INSTANCE(INSTANCE)    (((INSTANCE) == COMP1) || ((INSTANCE) == COMP2))

#define IS_COMP_COMMON_INSTANCE(INSTANCE) ((INSTANCE) == COMP12_COMMON)
/******************** COMP Instances with window mode capability **************/
#define IS_COMP_WINDOWMODE_INSTANCE(INSTANCE) ((INSTANCE) == COMP2)

/******************************** DTS Instances ******************************/
#define IS_DTS_ALL_INSTANCE(INSTANCE) ((INSTANCE) == DTS)

/******************************* CRC Instances ********************************/
#define IS_CRC_ALL_INSTANCE(INSTANCE) ((INSTANCE) == CRC)

/******************************* DAC Instances ********************************/
#define IS_DAC_ALL_INSTANCE(INSTANCE) (((INSTANCE) == DAC1) || ((INSTANCE) == DAC2))
/******************************* DCMI Instances *******************************/
#define IS_DCMI_ALL_INSTANCE(__INSTANCE__) ((__INSTANCE__) == DCMI)

/******************************* DELAYBLOCK Instances *******************************/
#define IS_DLYB_ALL_INSTANCE(INSTANCE)                                                                                 \
  (((INSTANCE) == DLYB_SDMMC1) || ((INSTANCE) == DLYB_SDMMC2) || ((INSTANCE) == DLYB_OCTOSPI1)                         \
    || ((INSTANCE) == DLYB_OCTOSPI2))
/****************************** DFSDM Instances *******************************/
#define IS_DFSDM_FILTER_ALL_INSTANCE(INSTANCE)                                                                         \
  (((INSTANCE) == DFSDM1_Filter0) || ((INSTANCE) == DFSDM1_Filter1) || ((INSTANCE) == DFSDM1_Filter2)                  \
    || ((INSTANCE) == DFSDM1_Filter3) || ((INSTANCE) == DFSDM1_Filter4) || ((INSTANCE) == DFSDM1_Filter5)              \
    || ((INSTANCE) == DFSDM1_Filter6) || ((INSTANCE) == DFSDM1_Filter7) || ((INSTANCE) == DFSDM2_Filter0))
#define IS_DFSDM_CHANNEL_ALL_INSTANCE(INSTANCE)                                                                        \
  (((INSTANCE) == DFSDM1_Channel0) || ((INSTANCE) == DFSDM1_Channel1) || ((INSTANCE) == DFSDM1_Channel2)               \
    || ((INSTANCE) == DFSDM1_Channel3) || ((INSTANCE) == DFSDM1_Channel4) || ((INSTANCE) == DFSDM1_Channel5)           \
    || ((INSTANCE) == DFSDM1_Channel6) || ((INSTANCE) == DFSDM1_Channel7) || ((INSTANCE) == DFSDM2_Channel0)           \
    || ((INSTANCE) == DFSDM2_Channel1))
/****************************** RAMECC Instances ******************************/
#define IS_RAMECC_MONITOR_ALL_INSTANCE(INSTANCE)                                                                       \
  (((INSTANCE) == RAMECC_Monitor1) || ((INSTANCE) == RAMECC_Monitor2) || ((INSTANCE) == RAMECC_Monitor3))

/******************************** DMA Instances *******************************/
#define IS_DMA_ALL_INSTANCE(INSTANCE)                                                                                  \
  (((INSTANCE) == DMA1_Stream0) || ((INSTANCE) == DMA1_Stream1) || ((INSTANCE) == DMA1_Stream2)                        \
    || ((INSTANCE) == DMA1_Stream3) || ((INSTANCE) == DMA1_Stream4) || ((INSTANCE) == DMA1_Stream5)                    \
    || ((INSTANCE) == DMA1_Stream6) || ((INSTANCE) == DMA1_Stream7) || ((INSTANCE) == DMA2_Stream0)                    \
    || ((INSTANCE) == DMA2_Stream1) || ((INSTANCE) == DMA2_Stream2) || ((INSTANCE) == DMA2_Stream3)                    \
    || ((INSTANCE) == DMA2_Stream4) || ((INSTANCE) == DMA2_Stream5) || ((INSTANCE) == DMA2_Stream6)                    \
    || ((INSTANCE) == DMA2_Stream7) || ((INSTANCE) == BDMA1_Channel0) || ((INSTANCE) == BDMA1_Channel1)                \
    || ((INSTANCE) == BDMA1_Channel2) || ((INSTANCE) == BDMA1_Channel3) || ((INSTANCE) == BDMA1_Channel4)              \
    || ((INSTANCE) == BDMA1_Channel5) || ((INSTANCE) == BDMA1_Channel6) || ((INSTANCE) == BDMA1_Channel7)              \
    || ((INSTANCE) == BDMA2_Channel0) || ((INSTANCE) == BDMA2_Channel1) || ((INSTANCE) == BDMA2_Channel2)              \
    || ((INSTANCE) == BDMA2_Channel3) || ((INSTANCE) == BDMA2_Channel4) || ((INSTANCE) == BDMA2_Channel5)              \
    || ((INSTANCE) == BDMA2_Channel6) || ((INSTANCE) == BDMA2_Channel7))

/****************************** BDMA CHANNEL Instances ***************************/
#define IS_BDMA_CHANNEL_INSTANCE(INSTANCE)                                                                             \
  (((INSTANCE) == BDMA1_Channel0) || ((INSTANCE) == BDMA1_Channel1) || ((INSTANCE) == BDMA1_Channel2)                  \
    || ((INSTANCE) == BDMA1_Channel3) || ((INSTANCE) == BDMA1_Channel4) || ((INSTANCE) == BDMA1_Channel5)              \
    || ((INSTANCE) == BDMA1_Channel6) || ((INSTANCE) == BDMA1_Channel7) || ((INSTANCE) == BDMA2_Channel0)              \
    || ((INSTANCE) == BDMA2_Channel1) || ((INSTANCE) == BDMA2_Channel2) || ((INSTANCE) == BDMA2_Channel3)              \
    || ((INSTANCE) == BDMA2_Channel4) || ((INSTANCE) == BDMA2_Channel5) || ((INSTANCE) == BDMA2_Channel6)              \
    || ((INSTANCE) == BDMA2_Channel7))

/****************************** DMA DMAMUX ALL Instances ***************************/
#define IS_DMA_DMAMUX_ALL_INSTANCE(INSTANCE)                                                                           \
  (((INSTANCE) == DMA1_Stream0) || ((INSTANCE) == DMA1_Stream1) || ((INSTANCE) == DMA1_Stream2)                        \
    || ((INSTANCE) == DMA1_Stream3) || ((INSTANCE) == DMA1_Stream4) || ((INSTANCE) == DMA1_Stream5)                    \
    || ((INSTANCE) == DMA1_Stream6) || ((INSTANCE) == DMA1_Stream7) || ((INSTANCE) == DMA2_Stream0)                    \
    || ((INSTANCE) == DMA2_Stream1) || ((INSTANCE) == DMA2_Stream2) || ((INSTANCE) == DMA2_Stream3)                    \
    || ((INSTANCE) == DMA2_Stream4) || ((INSTANCE) == DMA2_Stream5) || ((INSTANCE) == DMA2_Stream6)                    \
    || ((INSTANCE) == DMA2_Stream7) || ((INSTANCE) == BDMA2_Channel0) || ((INSTANCE) == BDMA2_Channel1)                \
    || ((INSTANCE) == BDMA2_Channel2) || ((INSTANCE) == BDMA2_Channel3) || ((INSTANCE) == BDMA2_Channel4)              \
    || ((INSTANCE) == BDMA2_Channel5) || ((INSTANCE) == BDMA2_Channel6) || ((INSTANCE) == BDMA2_Channel7))

/****************************** BDMA DMAMUX Instances ***************************/
#define IS_BDMA_CHANNEL_DMAMUX_INSTANCE(INSTANCE)                                                                      \
  (((INSTANCE) == BDMA2_Channel0) || ((INSTANCE) == BDMA2_Channel1) || ((INSTANCE) == BDMA2_Channel2)                  \
    || ((INSTANCE) == BDMA2_Channel3) || ((INSTANCE) == BDMA2_Channel4) || ((INSTANCE) == BDMA2_Channel5)              \
    || ((INSTANCE) == BDMA2_Channel6) || ((INSTANCE) == BDMA2_Channel7))

/****************************** DMA STREAM Instances ***************************/
#define IS_DMA_STREAM_INSTANCE(INSTANCE)                                                                               \
  (((INSTANCE) == DMA1_Stream0) || ((INSTANCE) == DMA1_Stream1) || ((INSTANCE) == DMA1_Stream2)                        \
    || ((INSTANCE) == DMA1_Stream3) || ((INSTANCE) == DMA1_Stream4) || ((INSTANCE) == DMA1_Stream5)                    \
    || ((INSTANCE) == DMA1_Stream6) || ((INSTANCE) == DMA1_Stream7) || ((INSTANCE) == DMA2_Stream0)                    \
    || ((INSTANCE) == DMA2_Stream1) || ((INSTANCE) == DMA2_Stream2) || ((INSTANCE) == DMA2_Stream3)                    \
    || ((INSTANCE) == DMA2_Stream4) || ((INSTANCE) == DMA2_Stream5) || ((INSTANCE) == DMA2_Stream6)                    \
    || ((INSTANCE) == DMA2_Stream7))

/****************************** DMA DMAMUX Instances ***************************/
#define IS_DMA_STREAM_DMAMUX_INSTANCE(INSTANCE)                                                                        \
  (((INSTANCE) == DMA1_Stream0) || ((INSTANCE) == DMA1_Stream1) || ((INSTANCE) == DMA1_Stream2)                        \
    || ((INSTANCE) == DMA1_Stream3) || ((INSTANCE) == DMA1_Stream4) || ((INSTANCE) == DMA1_Stream5)                    \
    || ((INSTANCE) == DMA1_Stream6) || ((INSTANCE) == DMA1_Stream7) || ((INSTANCE) == DMA2_Stream0)                    \
    || ((INSTANCE) == DMA2_Stream1) || ((INSTANCE) == DMA2_Stream2) || ((INSTANCE) == DMA2_Stream3)                    \
    || ((INSTANCE) == DMA2_Stream4) || ((INSTANCE) == DMA2_Stream5) || ((INSTANCE) == DMA2_Stream6)                    \
    || ((INSTANCE) == DMA2_Stream7))

/******************************** DMA Request Generator Instances **************/
#define IS_DMA_REQUEST_GEN_ALL_INSTANCE(INSTANCE)                                                                      \
  (((INSTANCE) == DMAMUX1_RequestGenerator0) || ((INSTANCE) == DMAMUX1_RequestGenerator1)                              \
    || ((INSTANCE) == DMAMUX1_RequestGenerator2) || ((INSTANCE) == DMAMUX1_RequestGenerator3)                          \
    || ((INSTANCE) == DMAMUX1_RequestGenerator4) || ((INSTANCE) == DMAMUX1_RequestGenerator5)                          \
    || ((INSTANCE) == DMAMUX1_RequestGenerator6) || ((INSTANCE) == DMAMUX1_RequestGenerator7)                          \
    || ((INSTANCE) == DMAMUX2_RequestGenerator0) || ((INSTANCE) == DMAMUX2_RequestGenerator1)                          \
    || ((INSTANCE) == DMAMUX2_RequestGenerator2) || ((INSTANCE) == DMAMUX2_RequestGenerator3)                          \
    || ((INSTANCE) == DMAMUX2_RequestGenerator4) || ((INSTANCE) == DMAMUX2_RequestGenerator5)                          \
    || ((INSTANCE) == DMAMUX2_RequestGenerator6) || ((INSTANCE) == DMAMUX2_RequestGenerator7))

/******************************* DMA2D Instances *******************************/
#define IS_DMA2D_ALL_INSTANCE(__INSTANCE__) ((__INSTANCE__) == DMA2D)

/****************************** PSSI Instance *********************************/
#define IS_PSSI_ALL_INSTANCE(INSTANCE) ((INSTANCE) == PSSI)

/******************************** MDMA Request Generator Instances **************/
#define IS_MDMA_STREAM_ALL_INSTANCE(INSTANCE)                                                                          \
  (((INSTANCE) == MDMA_Channel0) || ((INSTANCE) == MDMA_Channel1) || ((INSTANCE) == MDMA_Channel2)                     \
    || ((INSTANCE) == MDMA_Channel3) || ((INSTANCE) == MDMA_Channel4) || ((INSTANCE) == MDMA_Channel5)                 \
    || ((INSTANCE) == MDMA_Channel6) || ((INSTANCE) == MDMA_Channel7) || ((INSTANCE) == MDMA_Channel8)                 \
    || ((INSTANCE) == MDMA_Channel9) || ((INSTANCE) == MDMA_Channel10) || ((INSTANCE) == MDMA_Channel11)               \
    || ((INSTANCE) == MDMA_Channel12) || ((INSTANCE) == MDMA_Channel13) || ((INSTANCE) == MDMA_Channel14)              \
    || ((INSTANCE) == MDMA_Channel15))

/******************************* FDCAN Instances ******************************/
#define IS_FDCAN_ALL_INSTANCE(__INSTANCE__) (((__INSTANCE__) == FDCAN1) || ((__INSTANCE__) == FDCAN2))

#define IS_FDCAN_TT_INSTANCE(__INSTANCE__)  ((__INSTANCE__) == FDCAN1)

